[
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "content": "In a rare occurence, three soldiers were handed jail terms for killings in the troubled Anglophone region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-21T01:29:37.311Z",
    "image": "https://image.pollinations.ai/prompt/Rare%20prison%20sentences%20handed%20to%20Cameroon%20soldiers%20after%20killing%20of%2021%20civilians%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rare-prison-sentences-handed-to-cameroon-soldiers-after-killing-of-21-civilians",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "Oh No! Farm Animals Feeling Sick in Sunny South Africa!",
    "content": "<h3>Hello Friends! A Sad Story from South Africa</h3>\nHello everyone! Your friendly news reporter from Africa is here. Today, we have a story about some very special animals and the kind people who look after them. It’s a bit of a sad story right now, but many people are working hard to make things better!\n\nImagine big, beautiful cows, fluffy sheep, and happy pigs. They live on farms in a lovely country called South Africa. But lately, some of these animals have been feeling very, very sick. This has made the farmers, who are their caretakers, feel very worried and sad.\n\nThis sickness has a long name: Foot-and-Mouth Disease. Let's call it FMD for short. It's like a bad cold for animals, but much worse. It makes them feel poorly and can stop them from growing strong.\n\n<h3>What is Foot-and-Mouth Disease (FMD)?</h3>\nFMD is a sickness that mostly affects animals like cows, sheep, goats, and pigs. It's caused by a tiny, tiny germ that you cannot see without a special microscope. When animals get this germ, they start to feel really unwell.\n\nThey can get little sores, like small hurt spots, inside their mouths. These sores make it hard for them to eat their yummy grass or hay. Imagine having a sore mouth – it's hard to eat your favourite snack, right?\n\nThey also get these sores on their feet, especially between their toes. This makes it painful for them to walk around. So, they might just want to lie down and not move much. This is very sad because healthy farm animals love to walk and graze.\n\nDid you know? Even though FMD makes animals very sick, it almost never makes people sick. So, you don't have to worry about catching it from your food!\n\n<h3>Who are the Farmers and Why are They Worried?</h3>\nFarmers are very special people. They are like parents to thousands of animals! They work very hard every day to look after their cows, sheep, and pigs. They feed them, give them water, and make sure they are safe and happy.\n\nFarmers also help us by making sure we have food to eat! Cows give us milk for our breakfast cereal and cheese. Sheep give us wool to make warm clothes and meat for food. Pigs also give us meat. So, farmers are super important!\n\nWhen their animals get FMD, farmers become very worried. If their cows are sick, they might not make enough milk. If their sheep are sick, they might not grow well. This means farmers can't sell their animal products, and it's hard for them to earn money to take care of their families and their farms.\n\nDid you know? A single cow can drink as much as a bathtub full of water every day! Farmers need to make sure they have plenty of fresh water for their animals.\n\n<h3>Where is This Happening in Africa?</h3>\nThis sad story is happening in South Africa. South Africa is a big and beautiful country right at the bottom of Africa. It has sunny skies, amazing animals like lions and elephants, and many wonderful people.\n\nFarms are all over South Africa, from green valleys to wide-open plains. These farms are home to millions of cows, sheep, and pigs. So, when FMD starts spreading, it can affect many, many animals in different parts of the country.\n\nDid you know? South Africa has 11 different official languages! That means many people speak different languages there.\n\n<h3>How Are People Trying to Help?</h3>\nWhen something bad happens to many animals, special helpers called the government try to find solutions. The government is like a big team of people who work together to help run the country and keep everyone safe and healthy – including the animals!\n\nOne big way they are helping is with something called a **vaccination programme**. Do you know what a vaccine is? It’s like a special tiny shield given as a shot. This shield helps animals fight off the FMD germ and stops them from getting too sick. It makes their bodies strong against the disease.\n\nSo, people from the government are going to the farms and giving these special vaccine shots to the cows, sheep, and pigs. This is a very big job because there are so many animals to vaccinate! It's like giving all the kids in your school a special health shot to keep them from getting the flu.\n\nDid you know? The very first vaccine was made over 200 years ago to help protect people from a disease called smallpox!\n\n<h3>Why is This Such a Big Problem?</h3>\nWhen FMD spreads, it can be a really big problem, like a super difficult puzzle. It's not just about the animals getting sick. It's about how it affects the farmers and even other countries.\n\nIf animals are sick, they might not grow well, or they might even die. This makes farmers very, very sad. It also means there might be less milk or less meat available, which can be hard for everyone.\n\nAlso, when a country has FMD, other countries might say, \"Oh no! We cannot buy animals or meat from them right now.\" This is because they don't want the FMD germ to spread to their own animals. This means farmers can't sell their products, and the country loses money.\n\nDid you know? Animals that are affected by FMD are sometimes called \"cloven-hoofed animals\" because their feet look like they are split in two!\n\n<h3>Working Together to Make Animals Better</h3>\nSome people felt that the helpers from the government were a little bit slow to start the vaccination programme. It's like when you need help quickly, but your friend takes a little while to come. But now, they are working very, very hard to catch up.\n\nEveryone wants the animals to be healthy and happy again. The farmers, the government helpers, and many other people are all working together as a big team. They are trying their best to give all the animals their special shield shots.\n\nWe hope that very soon, all the lovely cows, sheep, and pigs in South Africa will be strong and healthy once more. Then, the farmers can smile again, and everyone can be happy that the animals are safe.\n\nDid you know? It's important for farmers to wash their hands and clean their boots when moving between different groups of animals to help stop germs from spreading!\n\n<h3>Let's Send Our Best Wishes!</h3>\nSo, let’s send our best wishes to the farmers and their animals in South Africa. We hope the vaccination programme works super fast and that all the farm animals get well soon! It's a team effort to keep our animal friends healthy.",
    "summary": "Farm animals like cows, sheep, and pigs in South Africa are getting very sick with Foot-and-Mouth Disease, making farmers worried, but the government is now giving special shots (vaccines) to help them get better.",
    "whyMatters": "This is important because sick animals make farmers sad and can't give us milk or meat, and it makes it hard for farmers to earn money, so everyone is working hard to help the animals get well and keep our food healthy.",
    "category": "world",
    "date": "2026-02-21T01:29:56.524Z",
    "image": "https://image.pollinations.ai/prompt/Oh%20No!%20Farm%20Animals%20Feeling%20Sick%20in%20Sunny%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oh-no-farm-animals-feeling-sick-in-sunny-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tunisian MP jailed for eight months over posts mocking president",
    "title": "Tunisian MP jailed for eight months over posts mocking president",
    "content": "The MP was arrested this month after mocking the president's handling of the recent floods in the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:30:01.672Z",
    "image": "https://image.pollinations.ai/prompt/Tunisian%20MP%20jailed%20for%20eight%20months%20over%20posts%20mocking%20president%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tunisian-mp-jailed-for-eight-months-over-posts-mocking-president",
    "originalLink": "https://www.bbc.com/news/articles/c3v75lvgy36o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US military says it attacked vessel in Pacific Ocean, killing three people",
    "title": "US military says it attacked vessel in Pacific Ocean, killing three people",
    "content": "US military's Southern Command (SOUTHCOM) claimed the vessel was involved in drug trafficking without providing proof.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-21T01:30:06.918Z",
    "image": "https://image.pollinations.ai/prompt/US%20military%20says%20it%20attacked%20vessel%20in%20Pacific%20Ocean%2C%20killing%20three%20people%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-military-says-it-attacked-vessel-in-pacific-ocean-killing-three-people",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/us-military-says-it-attacked-vessel-in-pacific-ocean-killing-three-people?traffic_source=rss"
  },
  {
    "originalTitle": "US envoy suggests it would be ‘fine’ if Israel expands across Middle East",
    "title": "US envoy suggests it would be ‘fine’ if Israel expands across Middle East",
    "content": "'It would be fine if they took it all,' Mike Huckabee says when asked about expanding Israel from Nile to Euphrates.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:30:12.048Z",
    "image": "https://image.pollinations.ai/prompt/US%20envoy%20suggests%20it%20would%20be%20%E2%80%98fine%E2%80%99%20if%20Israel%20expands%20across%20Middle%20East%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-envoy-suggests-it-would-be-fine-if-israel-expands-across-middle-east",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/us-envoy-suggests-it-would-be-fine-if-israel-expands-across-middle-east?traffic_source=rss"
  },
  {
    "originalTitle": "Twelve Palestine Action activists granted bail",
    "title": "Good News! Kind Friends Who Care Get to Go Home!",
    "content": "<h3>Hello, Friends! From Your African News Reporter!</h3>\nHello, hello, my wonderful friends! It's your friendly news reporter here, bringing you some exciting news from across the world. We live on a big, big planet, and sometimes we hear stories about people who care a lot. Today, we have a story about some special grown-ups who really want to help others.\n\n<h3>People Who Care a Lot</h3>\nImagine you see someone sad, and you want to make them happy. That's a bit like these people! They are grown-ups who care so much about other people. They want to make sure everyone in the world is safe and has a good life. They think about people who live very far away, in a place called Palestine.\n\nDid you know? Caring for others makes your heart feel very warm and happy! It's a bit like sharing your favourite snack with a friend.\n\n<h3>Wanting to Help Far Away</h3>\nThese people, about twelve of them, wanted to tell everyone how much they care. They wanted to show that they hope for peace and happiness for people in Palestine. They believe that everyone, no matter where they live, deserves to be safe. It's like when you want your little brother or sister to be safe on the playground.\n\nSometimes, when grown-ups want to tell a very important message, they do special things. These twelve friends were trying to share their message about caring for people far away.\n\n<h3>Why They Were Away From Home</h3>\nFor a little while, these friends were not at their own homes. Grown-ups sometimes need to talk a lot when important things happen. So, these people were in a place where grown-ups go to talk about big decisions. It’s like when you have a big meeting at school with your teacher and headmaster, but for grown-ups.\n\nThey were waiting for the big grown-ups to finish talking about everything. It wasn't like they were in trouble for being naughty. No, no! They were there because they cared so much and wanted to help.\n\nDid you know? Talking about things helps us understand each other better!\n\n<h3>The Good News: Time to Go Home!</h3>\nNow, for the really good news! Twelve of these caring friends have been told they can go back to their homes! Hooray! This means they get to see their families again. They can hug their mums and dads, their brothers and sisters. They can sleep in their own beds! Isn't that wonderful?\n\nImagine how happy they must be to be home. They can play with their pets, eat yummy home-cooked food, and just relax. It’s a very happy time for them and their families. This makes many people happy too!\n\nDid you know? Home is a very special place where you feel safe and loved! Many people all over the world wish for a safe home.\n\n<h3>What 'Going Home' Means For Now</h3>\nWhen we say they can go home, it means they have made a promise. It's a special promise to the grown-ups who are making the big decisions. They promised that they would come back later to talk more about everything.\n\nIt's a bit like when you promise your mum you will clean your room after you play. You get to play first, but you know you have to come back and do your cleaning. These friends promised to come back later to help talk about making things better for people. Promises are very important!\n\n<h3>Meet Some of These Caring Friends</h3>\nSome of these friends have names, just like you and me! Four of them are named Teuta Hoxha, Kamran Ahmed, Qesser Zuhrah, and Heba Muraisi. Can you say those names? Teuta, Kamran, Qesser, Heba. They are all very kind people who want to make a difference.\n\nThey believe in a world where everyone is treated kindly. They want to spread love and care. And now, they get to go home and rest before they come back to talk again. We hope they get lots of rest!\n\nDid you know? Learning names from different parts of the world is super interesting! It helps us learn about new cultures.\n\n<h3>Why This Matters So Much</h3>\nThis news is important because it shows us that people can care for others, even if they live far away. It shows us that when you care a lot, you can tell your message to many people. And it shows that promises are very important for grown-ups too. Trusting people is a big part of being grown-up.\n\nWhen these friends get to go home, it's a sign that the big grown-ups are listening. They are trying to understand what these caring people want to say. And that's a good step towards making the world a kinder place for everyone. It shows that talking can help solve problems.\n\nDid you know? Africa is a huge continent with many kind people who care about others all over the world!\n\n<h3>Let's All Be Kind!</h3>\nSo, my dear friends, remember this story. Remember the twelve people who care so much about others. Remember Teuta, Kamran, Qesser, and Heba. They remind us that it’s good to care. It’s good to wish for everyone to be safe and happy.\n\nWe can all be caring people, right here in Africa! We can be kind to our friends, our family, and even people we don't know. We can learn about other places and wish them well. Every little act of kindness makes our big world a brighter place. So, let’s try to be kind every single day!\n\nThat’s all for today from your friendly African news reporter! Keep being kind and keep shining bright!",
    "summary": "Twelve kind people who care about others have been allowed to go home to their families after promising to come back later to talk more.",
    "whyMatters": "This matters because it shows that grown-ups are listening to people who want to make the world a kinder place for everyone, and it reminds us that promises are very important.",
    "category": "world",
    "date": "2026-02-21T01:30:35.057Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Kind%20Friends%20Who%20Care%20Get%20to%20Go%20Home!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-kind-friends-who-care-get-to-go-home",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/heads-held-high-12-palestine-action-action-prisoners-granted-bail?traffic_source=rss"
  },
  {
    "originalTitle": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
    "title": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
    "content": "The Supreme Court decision striking down some of Trump's most sweeping tariffs injects new uncertainty into global trade.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:30:40.530Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20brings%20in%20new%2010%25%20tariff%20as%20Supreme%20Court%20rejects%20his%20global%20import%20taxes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-brings-in-new-10percent-tariff-as-supreme-court-rejects-his-global-import-taxes",
    "originalLink": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump lashes out at Supreme Court justices over tariffs ruling ",
    "title": "Trump lashes out at Supreme Court justices over tariffs ruling ",
    "content": "The six justices who voted against the tariffs, dealing a major blow to his signature economic policy, should be \"absolutely ashamed\", Trump said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-21T01:30:45.667Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20lashes%20out%20at%20Supreme%20Court%20justices%20over%20tariffs%20ruling%20%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-lashes-out-at-supreme-court-justices-over-tariffs-ruling",
    "originalLink": "https://www.bbc.com/news/articles/cd9g0e7zd8wo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump says he is considering limited military strike on Iran",
    "title": "Trump says he is considering limited military strike on Iran",
    "content": "Trump's new threat came a day after he appeared to give Iran about 10 days to agree to a deal to curb its nuclear programme.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:30:50.798Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20he%20is%20considering%20limited%20military%20strike%20on%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-he-is-considering-limited-military-strike-on-iran",
    "originalLink": "https://www.bbc.com/news/articles/cdxzk4gvzp0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mourinho made 'unacceptable, huge mistake' - Kompany",
    "title": "Mourinho made 'unacceptable, huge mistake' - Kompany",
    "content": "Bayern Munich boss Vincent Kompany says Jose Mourinho made a \"huge mistake\" with his \"unacceptable\" post-match comments after the alleged racial abuse of Real Madrid winger Vinicius Jr.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:30:56.364Z",
    "image": "https://image.pollinations.ai/prompt/Mourinho%20made%20'unacceptable%2C%20huge%20mistake'%20-%20Kompany%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mourinho-made-unacceptable-huge-mistake-kompany",
    "originalLink": "https://www.bbc.com/sport/football/articles/crl4jx0jw11o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ratcliffe avoids FA charge over immigration comments",
    "title": "Ratcliffe avoids FA charge over immigration comments",
    "content": "Manchester United co-owner Sir Jim Ratcliffe's claims the UK has been \"colonised by immigrants\" will not lead to any sanction by the Football Association.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T01:31:01.508Z",
    "image": "https://image.pollinations.ai/prompt/Ratcliffe%20avoids%20FA%20charge%20over%20immigration%20comments%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ratcliffe-avoids-fa-charge-over-immigration-comments",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce3gvv3eweko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Relegated in February? Why Sheff Wed are on brink of history",
    "title": "Relegated in February? Why Sheff Wed are on brink of history",
    "content": "Sheffield Wednesday are on the brink of becoming the first team in English Football League history to be relegated in February.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-21T01:31:06.645Z",
    "image": "https://image.pollinations.ai/prompt/Relegated%20in%20February%3F%20Why%20Sheff%20Wed%20are%20on%20brink%20of%20history%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "relegated-in-february-why-sheff-wed-are-on-brink-of-history",
    "originalLink": "https://www.bbc.com/sport/football/articles/cp81l0krk3wo?at_medium=RSS&at_campaign=rss"
  }
]