[
  {
    "originalTitle": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "title": "A Leader's Big Journey: What Happened?",
    "content": "<h3>Hello, Super Reporters!</h3>\n<p>Hi everyone! It's your kid-friendly news reporter from Africa here. We have a story today about a leader named Mr. Paul-Henri Sandaogo Damiba. He used to be a very important leader in a country called Burkina Faso. Burkina Faso is a lovely country in West Africa, with many kind people.</p>\n<p>Sometimes, leaders have to move around. Mr. Damiba has been on a journey. First, he was in Burkina Faso, then he went to a neighbor country called Togo. And now, he has moved back to Burkina Faso. It's like moving from your house to your friend's house next door, and then back home again!</p>\n<p>But this move is very important because people are saying some big things about why he had to go on this journey. Let's learn about it together!</p>\n\n<h3>Who is a President?</h3>\n<p>First, let's talk about what a president or a leader does. Imagine your school. You have a principal, right? The principal helps everyone follow the rules and keeps the school safe and happy. A president is like the principal for a whole country!</p>\n<p>A president helps make rules for the country. They work hard to keep all the people safe. They want everyone to be happy and live in peace. It's a very big and important job! Mr. Damiba used to have this big job in Burkina Faso.</p>\n<p><b>Did you know?</b> Many countries in Africa have presidents! They all work hard to make their countries great places to live.</p>\n\n<h3>Countries That Are Neighbors</h3>\n<p>Our story takes us to two countries: Burkina Faso and Togo. Look at a map! You will see they are very close. They are like two houses right next to each other on the same street.</p>\n<p>Burkina Faso is a country that doesn't have a beach. But it has beautiful lands and wonderful people. Togo is a country right by the ocean! It has pretty beaches where you can see the big blue sea.</p>\n<p>Countries that are neighbors often help each other. They share things and are usually good friends. This makes it special when a leader from one country goes to stay in a neighbor country.</p>\n\n<h3>What Does 'Accused' Mean?</h3>\n<p>Now, let's talk about why Mr. Damiba has been moving. People in Burkina Faso are saying some things about him. This is called 'accused'.</p>\n<p>What does 'accused' mean? It means people are saying someone did something wrong. It's like when your friend says, 'Hey, I think you took my blue crayon!' Your friend is 'accusing' you of taking the crayon. It doesn't mean it's true, but someone is saying it.</p>\n<p>In Mr. Damiba's case, people in Burkina Faso are saying he planned something very, very bad against other people. They are saying he planned some dangerous things. These are very serious words.</p>\n<p><b>Did you know?</b> It's very important to listen to both sides of a story. Like if someone says you took a crayon, you get to say if you did or didn't!</p>\n\n<h3>What Does 'Expelled' Mean?</h3>\n<p>So, Mr. Damiba was staying in Togo. But because of these serious things people were saying, the leaders in Togo made a decision. They asked Mr. Damiba to leave Togo. This is called 'expelled'.</p>\n<p>Imagine if someone was staying at your house, but they weren't following the rules, or maybe they caused a big problem. Your parents might ask them to leave. That's a bit like being 'expelled' from a country.</p>\n<p>So, Mr. Damiba had to leave Togo. He then went back to Burkina Faso. It was a long journey for him.</p>\n<p><b>Did you know?</b> Countries have rules, just like your home and school. Everyone, even leaders, must follow these rules to keep peace and order.</p>\n\n<h3>A Special Journey</h3>\n<p>Mr. Damiba's journey was not just a fun trip. It was a very special journey because it involved countries and their leaders. When a leader has to leave one country and go to another, it's big news. It means important things are happening.</p>\n<p>He travelled by a special plane, all the way back to Burkina Faso. It's important for countries to manage these kinds of situations peacefully, so everyone stays safe and calm.</p>\n<p><b>Did you know?</b> Airplanes help people travel across countries very fast! It makes our big world feel a bit smaller.</p>\n\n<h3>What Happens Now?</h3>\n<p>Right now, Mr. Damiba has not said anything about these big things people are saying. He has not shared his side of the story yet. This means we are still waiting to hear from him.</p>\n<p>The leaders and people in Burkina Faso will be watching closely to see what happens next. Everyone hopes that things will be peaceful and safe for all the people in Burkina Faso.</p>\n<p>It's important for all leaders to work for peace and to keep their people safe and happy. We hope that everything will be sorted out fairly and safely for everyone involved.</p>\n<p>Let's always wish for peace and happiness for all our friends in Africa!</p>",
    "summary": "A former leader from Burkina Faso, Mr. Damiba, was accused of planning bad things and asked to leave Togo, so he moved back to Burkina Faso, and he has not commented on the accusations yet.",
    "whyMatters": "This story is important because it shows how leaders have big jobs to keep people safe and follow rules, and when leaders move like this, it can affect peace and safety for everyone in a country.",
    "category": "world",
    "date": "2026-01-21T01:21:23.360Z",
    "image": "https://image.pollinations.ai/prompt/A%20Leader's%20Big%20Journey%3A%20What%20Happened%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-leaders-big-journey-what-happened",
    "originalLink": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Malawi raises fuel prices by more than 40%",
    "title": "Malawi's Fuel Story: Cars Need More Money Food!",
    "content": "<h3>Hello from Malawi!</h3>\n\nHi everyone! It's your friendly news reporter for Africa, ready to tell you an important story from a lovely country called Malawi. Malawi is in Africa, and it's famous for its big, beautiful lake and its kind, friendly people. They call it the 'Warm Heart of Africa'! Today, we're going to talk about something that helps cars, buses, and trucks move: fuel!\n\n<h3>What is Fuel, Anyway?</h3>\n\nImagine your favourite toy car. To make it go 'vroom, vroom!', you might need batteries, right? Well, big cars, huge buses, and strong trucks also need something special to make them move. This special thing is called **fuel**. Fuel is like their yummy food or powerful energy drink!\n\nThere are different kinds of fuel. Cars often use something called **petrol**, and bigger vehicles like buses and trucks often use **diesel**. This fuel is super important because it helps people travel to work, takes kids to school, carries doctors to help sick people, and brings delicious food from farms to your local market. Without fuel, things would stop moving, and that would be a big problem!\n\nDid you know? Lake Malawi is one of the biggest lakes in Africa, and it has more different kinds of fish than any other lake in the world! It's like a giant aquarium!\n\n<h3>Oh No! Fuel Costs More Money!</h3>\n\nNow, here's the news from Malawi. The grown-ups who manage the fuel, like the shopkeepers for car food, said that fuel will now cost more money. Imagine if your favourite snack suddenly cost more coins to buy. That's a bit like what happened with fuel in Malawi.\n\nWhen we say 'costs more money,' it means that moms and dads, and all the grown-ups who drive cars or ride buses, will have to pay more coins or banknotes to fill up their vehicles. It means that to get the same amount of 'car food,' they need a bigger pile of money from their wallets.\n\nThis can make grown-ups a little bit sad or worried, because they have to be extra careful with their money to make sure they can still buy everything the family needs.\n\n<h3>Why Did This Happen?</h3>\n\nThe people who help run the whole country, we call them the **government**, said they had to make this change. They had two big reasons. The first reason was that sometimes there wasn't enough fuel. Imagine if the shops ran out of your favourite biscuits! That's how it felt when petrol stations sometimes had no fuel for cars and buses. The government wants to make sure there's always enough 'car food' for everyone.\n\nThe second big reason is about the country's **money box**. Imagine the whole country has a big piggy bank. The government needs money in this piggy bank to buy important things like medicines for hospitals, books for schools, and to build new roads. Sometimes, the money box wasn't full enough. So, by making fuel cost a little more, they hope to put more money into the country's piggy bank to help everyone.\n\nDid you know? In Malawi, like many parts of Africa, many children walk to school, sometimes for a long time! Buses powered by fuel help many others get there faster.\n\n<h3>What Does This Mean for Families?</h3>\n\nWhen fuel costs more, it's not just about filling up cars. It can also mean that other things might become a little more expensive too. Let me explain!\n\nThink about the yummy fruits and vegetables that come from farms. Big trucks use fuel to carry them to the markets in towns. If the fuel for these trucks costs more, then the people selling the fruits and vegetables might have to ask for a little more money for them too. It's like a chain reaction!\n\nThe same goes for bus rides. If the bus needs more money for its fuel, then the bus ticket might cost a little more for people to travel. So, things like food, transport, and even some goods in shops might see their prices go up a tiny bit. This means families might have to think extra carefully about how they spend their money.\n\nDid you know? Malawi grows a lot of tea and tobacco. Trucks need fuel to take these crops to different places, even other countries!\n\n<h3>Looking Ahead</h3>\n\nWe know this is a big change, and it can make some grown-ups feel a bit worried. But the government says they are working very hard to make things better for all the wonderful people in Malawi. They want to make sure everyone has enough fuel and that the country has enough money to grow strong and happy.\n\nWe hope that with these changes, Malawi will have more fuel for everyone, and that families will find it easier to buy everything they need very soon. Stay tuned for more news from Africa! Keep smiling!",
    "summary": "In Malawi, the price of fuel, which makes cars and buses go, has gone up, making things a bit harder for families as the government tries to fix problems and get more money for the country.",
    "whyMatters": "This is important because when fuel costs more, it can make things like food and bus rides more expensive for families, but the government hopes it will help make the country stronger and ensure there's enough fuel for everyone.",
    "category": "government",
    "date": "2026-01-21T01:21:47.808Z",
    "image": "https://image.pollinations.ai/prompt/Malawi's%20Fuel%20Story%3A%20Cars%20Need%20More%20Money%20Food!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "malawis-fuel-story-cars-need-more-money-food",
    "originalLink": "https://www.bbc.com/news/articles/c5yxdgvd9pwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Jubilant Senegal fans join the Afcon champions parade",
    "title": "Jubilant Senegal fans join the Afcon champions parade",
    "content": "Thousands of Senegal fans join the parade to celebrate Afcon champions on their return home.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T01:21:52.972Z",
    "image": "https://image.pollinations.ai/prompt/Jubilant%20Senegal%20fans%20join%20the%20Afcon%20champions%20parade%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "jubilant-senegal-fans-join-the-afcon-champions-parade",
    "originalLink": "https://www.bbc.com/news/videos/cgm4nj23jy8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US seizes a seventh Venezuela-linked oil tanker",
    "title": "US seizes a seventh Venezuela-linked oil tanker",
    "content": "US has moved to assert strict control over production and sale of Venezuelan oil since attacking the country this month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T01:21:58.281Z",
    "image": "https://image.pollinations.ai/prompt/US%20seizes%20a%20seventh%20Venezuela-linked%20oil%20tanker%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-seizes-a-seventh-venezuela-linked-oil-tanker",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/us-seizes-a-seventh-venezuela-linked-oil-tanker?traffic_source=rss"
  },
  {
    "originalTitle": "Vinicius defies boos with star turn in Real Madrid’s 6-1 UCL rout of Monaco",
    "title": "Vinicius defies boos with star turn in Real Madrid’s 6-1 UCL rout of Monaco",
    "content": "Real Madrid beat Monaco 6-1 in the league phase of the Champions League, as forward Vinicius defies boos from home fans.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-21T01:22:03.430Z",
    "image": "https://image.pollinations.ai/prompt/Vinicius%20defies%20boos%20with%20star%20turn%20in%20Real%20Madrid%E2%80%99s%206-1%20UCL%20rout%20of%20Monaco%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "vinicius-defies-boos-with-star-turn-in-real-madrids-6-1-ucl-rout-of-monaco",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/20/vinicius-defies-boos-with-star-turn-in-real-madrids-6-1-ucl-rout-of-monaco?traffic_source=rss"
  },
  {
    "originalTitle": "Jesus brace helps Arsenal down Inter to seal Champions League qualification",
    "title": "Jesus brace helps Arsenal down Inter to seal Champions League qualification",
    "content": "Arsenal win 3-1 at Inter Milan in the league phase of the UEFA Champions League to seal their place in the last 16.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-21T01:22:08.587Z",
    "image": "https://image.pollinations.ai/prompt/Jesus%20brace%20helps%20Arsenal%20down%20Inter%20to%20seal%20Champions%20League%20qualification%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "jesus-brace-helps-arsenal-down-inter-to-seal-champions-league-qualification",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/20/jesus-brace-helps-arsenal-down-inter-to-seal-champions-league-qualification?traffic_source=rss"
  },
  {
    "originalTitle": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "content": "Trump's demands over Greenland are a rude awakening in a moment fraught with risk.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T01:22:14.568Z",
    "image": "https://image.pollinations.ai/prompt/Lyse%20Doucet%3A%20Trump%20is%20shaking%20the%20world%20order%20more%20than%20any%20president%20since%20WW2%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lyse-doucet-trump-is-shaking-the-world-order-more-than-any-president-since-ww2",
    "originalLink": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Driver killed and 37 people injured in Barcelona train crash",
    "title": "Driver killed and 37 people injured in Barcelona train crash",
    "content": "At least 37 people have been injured, five seriously, in a crash just days after a fatal high-speed rail collision in Andalusia.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T01:22:19.736Z",
    "image": "https://image.pollinations.ai/prompt/Driver%20killed%20and%2037%20people%20injured%20in%20Barcelona%20train%20crash%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "driver-killed-and-37-people-injured-in-barcelona-train-crash",
    "originalLink": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
    "title": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
    "content": "The US president says it is \"another in a very long line of National Security reasons why Greenland has to be acquired\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-21T01:22:24.894Z",
    "image": "https://image.pollinations.ai/prompt/UK%20defends%20Chagos%20deal%20after%20Trump%20calls%20it%20'act%20of%20great%20stupidity'%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-defends-chagos-deal-after-trump-calls-it-act-of-great-stupidity",
    "originalLink": "https://www.bbc.com/news/articles/c0mkp021rvro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Good signs' or just buying time? Spurs remain divided on Frank future",
    "title": "'Good signs' or just buying time? Spurs remain divided on Frank future",
    "content": "Many Tottenham fans have already lost faith in Thomas Frank - but did Tuesday's 2-0 win over Borussia Dortmund give cause for optimism?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T01:22:30.678Z",
    "image": "https://image.pollinations.ai/prompt/'Good%20signs'%20or%20just%20buying%20time%3F%20Spurs%20remain%20divided%20on%20Frank%20future%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-signs-or-just-buying-time-spurs-remain-divided-on-frank-future",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj4lqy2np2zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "title": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "content": "Manchester City suffered their very own \"hell of a beating\" moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T01:22:35.829Z",
    "image": "https://image.pollinations.ai/prompt/'Battered%20in%20Bodo'%20-%20is%20this%20more%20than%20just%20a%20blip%20for%20Man%20City%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "battered-in-bodo-is-this-more-than-just-a-blip-for-man-city",
    "originalLink": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Tears in my eyes' - Jesus enjoys 'dream night' in San Siro",
    "title": "'Tears in my eyes' - Jesus enjoys 'dream night' in San Siro",
    "content": "Gabriel Jesus says he had \"tears in my eyes\" after scoring twice to help Arsenal win 3-1 at Inter Milan for a seventh successive win in the Champions League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-21T01:22:40.977Z",
    "image": "https://image.pollinations.ai/prompt/'Tears%20in%20my%20eyes'%20-%20Jesus%20enjoys%20'dream%20night'%20in%20San%20Siro%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tears-in-my-eyes-jesus-enjoys-dream-night-in-san-siro",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwy1wr2xryxo?at_medium=RSS&at_campaign=rss"
  }
]