[
  {
    "originalTitle": "At least 21 dead after boat sinks on Sudan's River Nile ",
    "title": "Sad News from the Big River Nile in Sudan",
    "content": "<h3>Hello, Friends! From Your African News Reporter!</h3>\nHello, my wonderful friends all across Africa! It’s your friend here, bringing you some news. Sometimes news can be happy, and sometimes it can be a little bit sad. Today, I have some sad news to share with you from a country called Sudan. Sudan is a big country right here in Africa, just like where you live.\n\n\nWe heard a story about a boat. A boat is like a bus, but it travels on water instead of on roads. This boat was on a very famous and very long river. This river is called the River Nile. It's a river many people in Africa know and love.\n\n\n<h3>What Happened on The Big River Nile?</h3>\nSomething very sad happened on the River Nile in Sudan. A boat was carrying many people. It was going from one place to another, just like when you travel with your family. But sadly, this boat had an accident. The boat sank into the water. This means it went down under the water.\n\n\nWhen the boat sank, many people were in the water. It was a very scary time for them. Many people got hurt. And sadly, some people did not make it out of the water safely. This made many, many families very sad.\n\n\nWe heard that about 21 people, which is quite a lot, sadly lost their lives. This is a very big number of people. It means many families are feeling very, very sad right now. They are missing their loved ones.\n\n\n<h3>Who Was On The Boat?</h3>\nThis boat was full of different people. There were grown-ups, like mothers, fathers, aunties, and uncles. And guess what? There were also children on the boat. Just like you!\n\n\nThese children and grown-ups were traveling for different reasons. Maybe they were going to visit family. Maybe they were going to school or to the market. We don't know exactly, but they were all just trying to get somewhere.\n\n\nAfter the boat sank, some people were still missing. This means that people could not find them yet. Search teams, which are groups of brave people, are still looking very hard for these missing passengers. They are using special boats and looking carefully in the river.\n\n\n<h3>Where is Sudan? And the River Nile?</h3>\nSudan is a very big country in Africa. It's in the northeastern part of our continent. It has deserts, mountains, and of course, the famous River Nile flowing right through it. People in Sudan are just like us; they have homes, families, and dreams.\n\n\n**Did you know?** The River Nile is one of the longest rivers in the whole world! It starts very far away and flows through many different countries in Africa before it reaches the sea. It brings water to many people and helps plants grow. Many animals also live in and around the Nile. It's a very important river for life in Africa.\n\n\nThe River Nile is a source of life and joy for many, but sometimes, like in this sad story, it can also be very powerful and dangerous. That's why we always need to be careful when we are near big rivers or any water.\n\n\n<h3>Helping Hands Are Working Hard</h3>\nWhen something sad like this happens, many people come to help. There are brave rescue workers. These are people who are trained to help others in danger. They use special boats and equipment to search for the missing people in the water.\n\n\nLocal people, the kind neighbours and friends in Sudan, are also helping. They are comforting the families who are sad. They are bringing food and water to the people who are helping with the search. This shows us how strong and kind people in Africa are when someone needs help.\n\n\nIt's very important to help each other when times are tough. This is what community means. It means we look out for one another and lend a helping hand. Everyone in Sudan is trying their best to help the families affected by this accident.\n\n\n<h3>Let's Talk About Being Safe on Water</h3>\nBoats are very useful! They help us travel, carry things, and sometimes even fish. But it's very important to be safe when we use boats or when we are near any deep water.\n\n\n**Did you know?** Many boats have something called life jackets! A life jacket is a special vest that you wear. If you fall into the water, the life jacket helps you float so you don't sink. It's like a special helper that keeps your head above the water. Always ask for a life jacket if you are on a boat!\n\n\nSometimes, boats can become too full with too many people or too many heavy things. This can make the boat unbalanced and cause it to sink. It's important for boats not to carry too much.\n\n\nAlso, the weather can change quickly. Strong winds or big waves can make it very hard for a boat to stay safe. Boat drivers need to be very careful and check the weather before they travel.\n\n\n<h3>Thinking of Everyone in Sudan</h3>\nOur hearts go out to all the children and grown-ups in Sudan who are feeling sad right now. We are thinking of the families who lost someone they love. It's okay to feel sad when sad things happen. It shows that we care.\n\n\nWe hope that the search teams find everyone who is missing soon. We also hope that everyone who got hurt feels better very quickly. And we send big hugs to all the people helping the families and searching for the missing.\n\n\nLet this sad news remind us to always be careful, especially near water. And always remember to be kind and help others, just like the wonderful people in Sudan are doing right now. Stay safe, my friends!\n",
    "summary": "A boat carrying people, including children, sank on the River Nile in Sudan, causing sadness and prompting ongoing search efforts for missing passengers.",
    "whyMatters": "This sad story reminds us to be very careful when we are on or near water, like big rivers, and to always help each other when someone is in trouble or feeling sad.",
    "category": "world",
    "date": "2026-02-12T15:45:59.275Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20the%20Big%20River%20Nile%20in%20Sudan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-the-big-river-nile-in-sudan",
    "originalLink": "https://www.bbc.com/news/articles/cp851zp41m5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Port city in ruins as storm rips through Madagascar and on towards Mozambique",
    "title": "A Big Storm Visits Our Friends in Madagascar!",
    "content": "Hello, super curious kids! It's your friendly news reporter for Africa here, ready to share something important. We have some news from a beautiful island not too far away, called Madagascar. Something big and very strong came to visit our friends there, and then it started moving towards Mozambique. It was a very big storm!\n\n<h3>Oh No! A Big Storm!</h3>\nImagine a giant, spinning cloud with super strong wind and lots and lots of rain. That’s what a big storm is like! This storm was so big and strong that it traveled across the ocean. It brought powerful winds that could blow things over and heavy rain that could make rivers flood. It visited a city called Toamasina in Madagascar first.\n\n<h3>What is a Storm, Really?</h3>\nA storm is like nature's way of having a really, really windy and rainy day! Sometimes the wind can be gentle, like when it blows your hair. But in a big storm, the wind is super strong, strong enough to push over trees! And the rain comes down so hard, like a giant shower that never stops. This kind of storm can be called a cyclone or a hurricane in other parts of the world. It’s like a giant spinning top of wind and rain.\n\nDid you know? Storms get names, just like people! This helps people talk about them and track where they are going. Sometimes they have boys' names, and sometimes girls' names!\n\n<h3>Meeting Toamasina: A Special City</h3>\nToamasina is a very important city in Madagascar. It's like the main door for ships! Ships come to Toamasina from all over the world, bringing things we need like food, clothes, and toys. And ships leave Toamasina taking things from Madagascar to other countries. This special place where ships load and unload is called a 'port'. So, Toamasina is a 'port city'. It's usually a very busy and happy place.\n\nDid you know? Madagascar is a very special island. It has many animals and plants that you can't find anywhere else in the world! Like lemurs, with their big eyes and long tails. Isn't that amazing?\n\n<h3>What Happened in Toamasina?</h3>\nWhen the big storm came to Toamasina, it was very strong. More than half the people in the city were 'affected'. What does 'affected' mean? It means the storm made life very difficult for them. Maybe their homes got damaged, or they lost their food, or they couldn't go to school. Imagine if your roof blew off, or your garden was full of water. That’s how many people felt. It was a very sad time for them.\n\nMany families had to leave their homes because they were not safe anymore. They went to stay with relatives or in safe shelters, which are like big halls where people can sleep together and be safe from the wind and rain. The helpers tried their best to get food and water to everyone.\n\n<h3>Homes, Roads, and Schools Broken</h3>\nIn Toamasina, many important things were 'destroyed'. 'Destroyed' means they were broken or smashed by the strong winds and rain. Things like roads, which we use to drive cars and buses, were broken. Bridges, which help us cross rivers, were also damaged. Many houses where families lived were broken, and even schools were hurt by the storm. This is called 'infrastructure'. Infrastructure is all the important things a city needs to work, like roads, electricity poles, and buildings.\n\nImagine if the roads were broken, it would be hard for cars carrying food to get into the city, wouldn't it? And if the electricity poles were broken, there would be no lights at night. These broken things make it hard for people to go back to their normal lives quickly. It takes a lot of time and effort to fix everything.\n\n<h3>Our Island Friend: Madagascar</h3>\nMadagascar is a huge island off the coast of Africa. It's known for its beautiful beaches and unique animals. The people there are very friendly. When a big storm like this hits, it not only affects the city where it lands but can also affect other parts of the island because the storm brings so much rain. Farmers might lose their crops, which means less food for everyone.\n\nDid you know? Madagascar is the fourth largest island in the whole wide world! That's a lot of land and a lot of beautiful places to explore.\n\n<h3>The Storm Keeps Going! To Mozambique!</h3>\nAfter hitting Madagascar, the storm did not stop there. It kept moving across the big blue ocean, heading towards another country we know, Mozambique! When a storm moves like this, it can still be very strong, bringing more wind and rain to new places. So, people in Mozambique also had to get ready.\n\nThey had to make sure their homes were safe, and some people had to move to safer places, just like in Madagascar. Our friends in Mozambique are very brave and helpful, and they work together to stay safe when a storm is coming. They listen to the news to know what to do.\n\n<h3>How People Are Helping</h3>\nEven though the storm was very strong and caused a lot of trouble, there are always super helpers! People from Madagascar and from other countries are working hard to help. They are giving out food, clean water, and clothes to families who lost everything. Doctors and nurses are helping people who got hurt.\n\nEngineers are working to fix the roads and electricity poles. Builders are helping to fix houses and schools. It's a big job, but when everyone works together, even the biggest problems can be fixed. They are showing great kindness and love.\n\n<h3>We Can Be Helpers Too!</h3>\nEven though we might be far away, we can still help in our hearts. We can think about the children in Madagascar and Mozambique. We can talk to our grown-ups about what happened. We can learn about being kind and helping others when they are sad or in trouble. Every little bit of kindness helps to make the world a better place.\n\nLet's send our kind thoughts to our friends in Madagascar and Mozambique as they bravely work to make their cities strong and bright again!\n\nDid you know? When many people help each other after a big storm, it's called 'community spirit'! It shows how strong and caring people can be when they work together.",
    "summary": "A very big storm brought strong winds and lots of rain to Toamasina, a port city in Madagascar, damaging many homes and roads, and then kept moving towards Mozambique.",
    "whyMatters": "This is important because many families in Madagascar had their homes and schools broken, and now people in Mozambique also need to be ready to stay safe from the storm, showing us how we can help each other.",
    "category": "technology",
    "date": "2026-02-12T15:46:18.559Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Storm%20Visits%20Our%20Friends%20in%20Madagascar!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-storm-visits-our-friends-in-madagascar",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "title": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "content": "Juliette Bryant has called on the Palace to \"act\" on revelations about Andrew's relationship with Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:46:23.673Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20Epstein%20survivor%20calls%20on%20UK%20Royal%20Family%20to%20search%20Andrew's%20files%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-epstein-survivor-calls-on-uk-royal-family-to-search-andrews-files",
    "originalLink": "https://www.bbc.com/news/articles/cvg5ww8lq9zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tom Homan announces end of ‘Operation Metro Surge’ in Minnesota",
    "title": "Tom Homan announces end of ‘Operation Metro Surge’ in Minnesota",
    "content": "US border chief announces the conclusion of a federal operation with 700 immigration agents set to leave Minnesota.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:46:28.971Z",
    "image": "https://image.pollinations.ai/prompt/Tom%20Homan%20announces%20end%20of%20%E2%80%98Operation%20Metro%20Surge%E2%80%99%20in%20Minnesota%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tom-homan-announces-end-of-operation-metro-surge-in-minnesota",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/tom-homan-announces-end-of-ice-operation-metro-surge-in-minnesota?traffic_source=rss"
  },
  {
    "originalTitle": "How Israel used discriminatory laws to strip Palestinians of citizenship",
    "title": "How Israel used discriminatory laws to strip Palestinians of citizenship",
    "content": "Critics say Israel's move to revoke the citizenship of two Palestinian citizens sets an 'alarming precedent'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-12T15:46:34.124Z",
    "image": "https://image.pollinations.ai/prompt/How%20Israel%20used%20discriminatory%20laws%20to%20strip%20Palestinians%20of%20citizenship%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-israel-used-discriminatory-laws-to-strip-palestinians-of-citizenship",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/how-israel-used-discriminatory-laws-to-strip-palestinians-of-citizenship?traffic_source=rss"
  },
  {
    "originalTitle": "‘Like Eid’: Bangladeshis hail landmark election, many vote after 17 years",
    "title": "‘Like Eid’: Bangladeshis hail landmark election, many vote after 17 years",
    "content": "Festive enthusiasm marks the day as millions turn out to vote for parliament and a referendum on constitutional reforms.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-12T15:46:39.231Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Like%20Eid%E2%80%99%3A%20Bangladeshis%20hail%20landmark%20election%2C%20many%20vote%20after%2017%20years%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "like-eid-bangladeshis-hail-landmark-election-many-vote-after-17-years",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/like-eid-bangladeshis-hail-landmark-election-many-vote-after-17-years?traffic_source=rss"
  },
  {
    "originalTitle": "Minnesota immigration enforcement surge is ending, Trump border tsar says",
    "title": "Minnesota immigration enforcement surge is ending, Trump border tsar says",
    "content": "Two US citizens were killed in Minneapolis during the crackdown dubbed \"Operation Metro Surge\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:46:44.888Z",
    "image": "https://image.pollinations.ai/prompt/Minnesota%20immigration%20enforcement%20surge%20is%20ending%2C%20Trump%20border%20tsar%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "minnesota-immigration-enforcement-surge-is-ending-trump-border-tsar-says",
    "originalLink": "https://www.bbc.com/news/articles/c2lr9w29zwyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kim Jong Un chooses teen daughter as heir, says Seoul ",
    "title": "Kim Jong Un chooses teen daughter as heir, says Seoul ",
    "content": "South Korea's spy agency says Ki Ju Ae's prominent public presence indicates she is the chosen heir.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:46:49.992Z",
    "image": "https://image.pollinations.ai/prompt/Kim%20Jong%20Un%20chooses%20teen%20daughter%20as%20heir%2C%20says%20Seoul%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kim-jong-un-chooses-teen-daughter-as-heir-says-seoul",
    "originalLink": "https://www.bbc.com/news/articles/cn0e1g7kwglo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Polls close in first election since Gen Z protests ousted Bangladesh leader",
    "title": "Polls close in first election since Gen Z protests ousted Bangladesh leader",
    "content": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:46:55.095Z",
    "image": "https://image.pollinations.ai/prompt/Polls%20close%20in%20first%20election%20since%20Gen%20Z%20protests%20ousted%20Bangladesh%20leader%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "polls-close-in-first-election-since-gen-z-protests-ousted-bangladesh-leader",
    "originalLink": "https://www.bbc.com/news/articles/cy7jdmvn3l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I didn't hesitate' - Tuchel extends stay in England 'dream job'",
    "title": "'I didn't hesitate' - Tuchel extends stay in England 'dream job'",
    "content": "Thomas Tuchel commits to two more years as England manager, which will take him through to Euro 2028.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-12T15:47:00.451Z",
    "image": "https://image.pollinations.ai/prompt/'I%20didn't%20hesitate'%20-%20Tuchel%20extends%20stay%20in%20England%20'dream%20job'%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-didnt-hesitate-tuchel-extends-stay-in-england-dream-job",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dnl94750zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nottingham Forest close in on Pereira appointment",
    "title": "Nottingham Forest close in on Pereira appointment",
    "content": "Nottingham Forest close to appointing former Wolves boss Vitor Pereira as their new head coach.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:47:05.554Z",
    "image": "https://image.pollinations.ai/prompt/Nottingham%20Forest%20close%20in%20on%20Pereira%20appointment%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nottingham-forest-close-in-on-pereira-appointment",
    "originalLink": "https://www.bbc.com/sport/football/articles/czd857v5mm3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham are 'not a big club' - Postecoglou",
    "title": "Tottenham are 'not a big club' - Postecoglou",
    "content": "Former head coach Ange Postecoglou criticises Tottenham's transfer strategy in the wake of Thomas Frank's sacking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T15:47:10.655Z",
    "image": "https://image.pollinations.ai/prompt/Tottenham%20are%20'not%20a%20big%20club'%20-%20Postecoglou%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tottenham-are-not-a-big-club-postecoglou",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwyx18287k9o?at_medium=RSS&at_campaign=rss"
  }
]