[
  {
    "originalTitle": "New video game sees Africans fantasise about taking back looted treasures",
    "title": "Our African Heroes Get Back Treasures in a Cool New Game!",
    "content": "<h3>Hello, Super Stars of Africa!</h3>\nHi everyone! It's your friendly news reporter, here to share some super exciting news from our amazing continent, Africa! We live in such a special place, full of sunshine, stories, and awesome people like you. Today, we are going to talk about a very special kind of game. It's a game that makes us think about our history and our future! Are you ready for an adventure? Let's go!\n\n<h3>What's This New Game About?</h3>\nImagine a brand new video game! A video game is a fun game you play on a screen, like a computer, phone, or TV. In this game, YOU are a hero from Africa! You get to go on a super cool mission. What is the mission? It's about bringing back special treasures to Africa. Yes, treasures! Not gold or jewels, but very old and important things. These things tell us about our history and where we come from. This game lets you be a brave adventurer.\n\n<h3>Our Special Treasures</h3>\nWhat are these treasures? They are called \"artefacts.\" That's a big word, right? Artefacts are like old, old toys, tools, statues, or beautiful art that people made a very long time ago. They tell us stories about our grand-grand-grandparents! Imagine a mask carved from wood, or a pot made from clay, or a special piece of cloth with amazing patterns. These things are part of our African family story. They show how clever and artistic our people have always been. They are very important to us, and they belong to our land.\nDid you know? Africa is a huge continent with many different countries and cultures! Each country has its own special treasures and amazing stories to tell.\n\n<h3>Where Did Our Treasures Go?</h3>\nA very long time ago, some people came to Africa and took some of these special treasures away. They took them to faraway lands, to other countries across the big oceans. Now, many of these beautiful artefacts are kept in big, important museums in those faraway places. A museum is like a big house where old and important things are kept safe for people to see. It's nice for people to see them, but wouldn't it be even better if they were back home in Africa? So that we can see them and learn from them here? Yes! These treasures are part of our identity.\nDid you know? There are over 50 countries in Africa! Each one has a unique history and wonderful cultural heritage.\n\n<h3>Imagine the Future!</h3>\nNow, let's go back to our video game! The game takes us to a time far, far away in the future. It's the year 2099! Wow, that's a long time from now, when you might be grown up. You, as an African hero, are living in this future. In this future, there was a big promise made. A promise that all the special treasures that were taken would come back to Africa. This promise is called a \"treaty.\" It's like a big agreement or a special handshake between many countries that says, \"These treasures will go home.\"\nBut oh no! In the game, this promise, this treaty, is not working very well. It's \"falling apart.\" This means the treasures are not coming back home as they should have. The promise isn't being kept.\n\n<h3>Your Mission in the Game!</h3>\nThis is where YOU, the player, become super important! In the game, you don't give up! You become a hero who fights in a fun and clever way to bring those treasures back. You go on amazing adventures, solve puzzles that make you think, and maybe even fly cool spaceships (because it's the future!). You make sure that Africa gets back its beautiful, historical, and important artefacts. It's a game about making things right and bringing our history back home to our people.\nDid you know? Many African cultures have amazing stories and legends about brave heroes who saved their communities with courage and smart ideas!\n\n<h3>Playing Together, Learning Together</h3>\nThis video game is not just for fun. It also helps us learn so many important things! It teaches us about our rich history and why our cultural items are so, so special. When we play, we can imagine what it would be like to have all our treasures back. We can think about the stories they tell and the lessons they hold. It makes us feel so proud to be African. It shows us that our history is important and worth celebrating every single day. It makes us feel strong and connected to our past and future!\nDid you know? Some of the oldest human tools and art have been found right here in Africa! This means our continent has a very ancient and incredibly rich history, older than many other places in the world.\n\n<h3>Why This Game Makes Us Happy</h3>\nThis game is a big deal because it lets us dream big dreams. It lets us imagine a time when all our precious history is safe and sound, right here in Africa, where it truly belongs. It shows that even if things are difficult, we can always imagine a better future where our culture is honored. It reminds us that our culture is strong, beautiful, and full of wonderful things to discover. It's a game that makes us feel proud and hopeful for Africa's future! We can be heroes in real life too, by learning about our history, sharing our stories, and taking care of our beautiful continent. Let's celebrate our amazing Africa!",
    "summary": "A new video game lets kids imagine being African heroes in the future, bringing back special old treasures that belong to Africa when a big promise falls apart.",
    "whyMatters": "This game is important because it helps us learn about our history, feel proud of Africa, and imagine a future where all our special old things are back home for everyone to see and enjoy.",
    "category": "world",
    "date": "2026-02-10T04:36:47.521Z",
    "image": "https://image.pollinations.ai/prompt/Our%20African%20Heroes%20Get%20Back%20Treasures%20in%20a%20Cool%20New%20Game!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-african-heroes-get-back-treasures-in-a-cool-new-game",
    "originalLink": "https://www.bbc.com/news/articles/clyg4lgm1d2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Migrant boat capsizes off Libya leaving 53 dead",
    "title": "Sad News from the Big Sea: Helping Our Neighbours",
    "content": "Jambo, my amazing friends! It's your kid-friendly news reporter here, ready to share some important news from our wonderful continent, Africa. Sometimes, the news can be a little sad, but it's important to understand what's happening so we can learn to be kind and helpful.\n\n<h3>Sad News from the Sea</h3>\nWe have some very sad news from a country in Africa called Libya. Libya is a country that sits right next to the big blue sea. Recently, a boat carrying many people had a very big problem. The boat turned over and sank into the water. This is what we call 'capsizing'. It's very, very sad because many people lost their lives, about 53 people.\n\n<h3>What Happened?</h3>\nImagine you are in a small boat, and the water starts to get rough. Sometimes, the boat can get too full, or the waves can be too big. When a boat 'capsizes', it means it flips upside down or tips right over. Everyone falls into the water. This happened off the coast of Libya, which means it happened in the sea near the land.\n\nSadly, not everyone could be saved. It makes our hearts heavy to hear this. These people were on a very difficult journey, trying to find a better and safer place to live.\n\n<h3>Who Are These Brave People?</h3>\nThese people are called 'migrants'. This is a big word, but it just means people who move from one place to another. They might move from one town to another, or even from one country to another. They are often looking for a new home because their old home is not safe or happy anymore.\n\nThey are just like us! They are mothers, fathers, grandmothers, grandfathers, and even children, just like you. They have dreams and hopes, just like we do. They want to be safe, have food to eat, and send their children to school.\n\n<h3>Why Do People Go on Such a Long Journey?</h3>\nThink about why someone might want to move. Maybe their village has no water, and the crops can't grow. Maybe there are no jobs for their parents to earn money for food and clothes. Sometimes, their homes are not safe because of fighting or problems. These people leave their homes hoping to find a place where they can be safe, find food, and maybe even find a good school for their children.\n\nThey hope for a chance to start a new, happy life. The journey they take can be very long and very, very hard, often crossing deserts and then the big sea. They are looking for 'hope', which means they believe good things can still happen.\n\n<h3>The Big, Scary Sea Journey</h3>\nTo get to safer places, many people try to cross the big sea from Libya. They often travel in boats that are not very strong or safe. These boats might be too old or too small for all the people trying to travel in them. Imagine a small school bus trying to carry everyone in your whole town! It would be too full and not safe.\n\nThe sea can be very rough and dangerous. Sometimes, there are big waves or bad weather with strong winds. These journeys are very risky, and that's why it's so sad when accidents happen, like a boat capsizing. It's a very scary thing to happen.\n\n<h3>Who Helps When Things Go Wrong?</h3>\nThere are special people and groups who try to help. One of these groups is called the IOM. This stands for the International Organization for Migration. They are like superheroes who help people who are moving. They try to count how many people are travelling and sadly, how many get lost or hurt.\n\nThey also try to help rescue people who are in trouble in the sea. They work with others to make sure people are safe and get the help they need. So far this year, the IOM says that nearly 500 people have been reported lost or missing in the sea near Libya. That's a very big number, and it tells us how dangerous these journeys are.\n\n<h3>Looking for Hope and a New Home</h3>\nAll these people are looking for a better life. They want to live in a place where they are not afraid, where they can have enough food, and where their children can play and learn safely. They are looking for a new home, a place where they can feel welcome and loved.\n\n<h3>Did You Know?</h3>\n*   Did you know that Africa is a very big continent, home to many different countries and cultures? Libya is one of them!\n*   Did you know that people have been moving from one place to another for thousands of years? It's part of human history!\n*   Did you know that the Mediterranean Sea, which these boats cross, is connected to the Atlantic Ocean and is very deep in some places?\n*   Did you know that even small acts of kindness, like sharing a smile, can make a big difference to someone who feels lost?\n\n<h3>What Can We Do?</h3>\nEven though we are children, we can still help. We can learn to be kind to everyone, no matter where they come from. We can think about people who might be sad or need help and send them good thoughts. We can also ask our parents questions and learn more about the world. Understanding makes us better friends and neighbours to everyone, everywhere. Let's always remember to be kind and caring, like true African heroes!",
    "summary": "A boat carrying many people capsized off the coast of Libya, causing the sad loss of 53 lives, as many people try to cross the sea from Africa looking for a safer home.",
    "whyMatters": "This matters because it reminds us that many people in Africa are looking for a safe place to live and a better future, and sometimes their journeys are very dangerous; it teaches us to be kind and understand why people move.",
    "category": "world",
    "date": "2026-02-10T04:37:06.082Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20the%20Big%20Sea%3A%20Helping%20Our%20Neighbours%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-the-big-sea-helping-our-neighbours",
    "originalLink": "https://www.bbc.com/news/articles/cy9ge3844q0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "title": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "content": "Insurgents have carried out a wave of drone strikes on military positions in the region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:11.211Z",
    "image": "https://image.pollinations.ai/prompt/How%20off-the-shelf%20drones%20are%20changing%20jihadist%20warfare%20in%20West%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-off-the-shelf-drones-are-changing-jihadist-warfare-in-west-africa",
    "originalLink": "https://www.bbc.com/news/articles/cew8vldpzdyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US kills two people in attack on boat in eastern Pacific, one survivor",
    "title": "US kills two people in attack on boat in eastern Pacific, one survivor",
    "content": "The US military says one person survived the strike on the vessel and that the coastguard has been notified.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:16.428Z",
    "image": "https://image.pollinations.ai/prompt/US%20kills%20two%20people%20in%20attack%20on%20boat%20in%20eastern%20Pacific%2C%20one%20survivor%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-kills-two-people-in-attack-on-boat-in-eastern-pacific-one-survivor",
    "originalLink": "https://www.aljazeera.com/news/2026/2/10/us-kills-two-people-in-attack-on-boat-in-eastern-pacific-one-survivor?traffic_source=rss"
  },
  {
    "originalTitle": "Five employees of Canadian mine found dead in Mexico, authorities say",
    "title": "Five employees of Canadian mine found dead in Mexico, authorities say",
    "content": "Mexican authorities say they are working to identify five other bodies after 10 workers were kidnapped last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:21.573Z",
    "image": "https://image.pollinations.ai/prompt/Five%20employees%20of%20Canadian%20mine%20found%20dead%20in%20Mexico%2C%20authorities%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "five-employees-of-canadian-mine-found-dead-in-mexico-authorities-say",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/10/five-employees-of-canadian-mine-found-dead-in-mexico-authorities-say?traffic_source=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,447",
    "title": "Russia-Ukraine war: List of key events, day 1,447",
    "content": "These are the key developments from day 1,447 of Russia’s war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:26.716Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C447%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1447",
    "originalLink": "https://www.aljazeera.com/news/2026/2/10/russia-ukraine-war-list-of-key-events-day-1447?traffic_source=rss"
  },
  {
    "originalTitle": "Hong Kong court jails media tycoon and British citizen Jimmy Lai for 20 years",
    "title": "Hong Kong court jails media tycoon and British citizen Jimmy Lai for 20 years",
    "content": "Lai's supporters say this amounts to a death sentence, but authorities say it demonstrates the rule of law.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:32.463Z",
    "image": "https://image.pollinations.ai/prompt/Hong%20Kong%20court%20jails%20media%20tycoon%20and%20British%20citizen%20Jimmy%20Lai%20for%2020%20years%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hong-kong-court-jails-media-tycoon-and-british-citizen-jimmy-lai-for-20-years",
    "originalLink": "https://www.bbc.com/news/articles/c8d5pl34vv0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Maxwell refuses to answer questions about Epstein in congressional hearing",
    "title": "Maxwell refuses to answer questions about Epstein in congressional hearing",
    "content": "A video released by members of Congress shows Maxwell, the jailed associate of Jeffrey Epstein, refusing to answer questions about the late sex offender.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-10T04:37:37.593Z",
    "image": "https://image.pollinations.ai/prompt/Maxwell%20refuses%20to%20answer%20questions%20about%20Epstein%20in%20congressional%20hearing%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "maxwell-refuses-to-answer-questions-about-epstein-in-congressional-hearing",
    "originalLink": "https://www.bbc.com/news/articles/cvgv5yre39zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein survivors call for full release of files in video",
    "title": "Epstein survivors call for full release of files in video",
    "content": "Millions of files relating to the late sex offender Jeffrey Epstein have been released by the DOJ but many have redactions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:42.723Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20survivors%20call%20for%20full%20release%20of%20files%20in%20video%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-survivors-call-for-full-release-of-files-in-video",
    "originalLink": "https://www.bbc.com/news/articles/clyz9pvwlw9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Didn't want the season to end like this' - Grealish has surgery",
    "title": "'Didn't want the season to end like this' - Grealish has surgery",
    "content": "Jack Grealish says he \"didn't want the season to end like this\" after confirming he has had surgery on a foot stress fracture.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:48.354Z",
    "image": "https://image.pollinations.ai/prompt/'Didn't%20want%20the%20season%20to%20end%20like%20this'%20-%20Grealish%20has%20surgery%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "didnt-want-the-season-to-end-like-this-grealish-has-surgery",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxg991qzldo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late goals are destroying Liverpool's season and solution isn't obvious",
    "title": "Late goals are destroying Liverpool's season and solution isn't obvious",
    "content": "Why have Liverpool gone from mentality monsters to a side there for the taking?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:53.485Z",
    "image": "https://image.pollinations.ai/prompt/Late%20goals%20are%20destroying%20Liverpool's%20season%20and%20solution%20isn't%20obvious%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-goals-are-destroying-liverpools-season-and-solution-isnt-obvious",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5y4de19xlwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rosenior 'not bothered' by David Brent and Inbetweeners comparisons",
    "title": "Rosenior 'not bothered' by David Brent and Inbetweeners comparisons",
    "content": "Chelsea manager Liam Rosenior says he is not \"bothered at all\" by memes comparing him to tongue-in-cheek television characters.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T04:37:58.614Z",
    "image": "https://image.pollinations.ai/prompt/Rosenior%20'not%20bothered'%20by%20David%20Brent%20and%20Inbetweeners%20comparisons%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rosenior-not-bothered-by-david-brent-and-inbetweeners-comparisons",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dnyyd49p6o?at_medium=RSS&at_campaign=rss"
  }
]