[
  {
    "originalTitle": "Sudan atrocities are 'hallmarks of genocide', UN says",
    "title": "Big Helpers are Watching Over Kids and Families in Sudan!",
    "content": "<h3>Hello, Friends! Let's Talk About Sudan!</h3>\nHi everyone! It's me, your kid-friendly news reporter for Africa! Today, we're going to talk about a very special country called Sudan. Sudan is a big country in Africa, with lots of beautiful places and friendly people. It's home to amazing animals and a very long river called the Nile! Think of it like a really big playground with lots of different adventures.\n\n<h3>What's Happening Far Away?</h3>\nSometimes, in different places around the world, grown-ups have big disagreements. And sometimes, these disagreements can turn into fighting. That's what has been happening in parts of Sudan. When there is fighting, it can make people very sad and scared. Families might have to leave their homes to find a safe place. This is a very difficult time for many children and their families in Sudan. It's like when friends argue, but much, much bigger and more serious.\n\n<h3>Who Are the Big Helpers?</h3>\nBut guess what? There are amazing helpers in the world! One very important group of helpers is called the United Nations, or the UN for short. The UN is like a big team of countries from all over the world. They work together to help people, make sure everyone is treated fairly, and try to bring peace. They want all children to be safe and happy, no matter where they live, just like your teachers want you to be safe at school.\n\nDid you know? The UN helps children by making sure they have food, clean water, and schools to go to, even in tough times! They are like super problem-solvers for the world.\n\n<h3>A Special Trip to El-Fasher</h3>\nThe UN sent some of their special helpers on a trip. This trip was like sending super detectives! They went to a city in Sudan called el-Fasher. El-Fasher is a very important city there, like the biggest town in your area. The helpers went to look and listen very carefully to what was happening. They wanted to understand everything so they could help people better. This kind of trip is called a \"fact-finding mission.\" It means they go to find out all the true facts, just like when you try to find out who ate the last cookie!\n\nDid you know? Sudan is the third-largest country in Africa! That's bigger than many other countries, like a giant puzzle piece on the map!\n\n<h3>What Did the Detectives Find?</h3>\nWhen the UN helpers visited el-Fasher, they saw some things that made them very worried. They saw that a group called the Rapid Support Forces had taken control of the city. These are grown-up groups who are part of the fighting. The helpers heard sad stories about how people were treated. They saw that many things were happening that were not fair, and were hurting families. It's like seeing someone being very unkind to others, but on a much bigger scale.\n\n<h3>Why Are They Worried?</h3>\nThe UN helpers wrote a special report, which is like a big letter, to tell everyone what they found. They said that the things happening in el-Fasher were \"very, very serious.\" They used big words that mean they are extremely worried for the people there. They are worried that many people are being hurt, and not just a few. They believe that these bad things are happening to lots of people, and that is why the UN is speaking up very loudly. They want the whole world to know that these unfair things must stop. It’s like when your parents get very serious about something that is not right.\n\nDid you know? The River Nile, which flows through Sudan, is the longest river in the world! It brings water and life to many places, just like a very long, watery road.\n\n<h3>What Happens Next?</h3>\nNow that the UN has told everyone what they saw, it's very important. It means more people around the world will pay attention. More people will want to help the families in Sudan. The UN wants to make sure that the people who are causing harm are stopped, and that everyone in Sudan can live in peace and safety again. They are working hard to make sure justice is found, which means making things fair for everyone. They want to help fix the big problems.\n\nDid you know? Many countries work together in the UN. They all want to help each other and solve problems peacefully, like a giant global team!\n\n<h3>Wishing for Peace</h3>\nIt's important for us to remember that even when there's fighting, there are always people working for peace. The UN is one of these amazing groups. They never give up on trying to make the world a better, safer place for all children. Their job is to remind everyone to be kind and fair.\n\nDid you know? In Sudan, people speak many different languages, but Arabic is one of the main ones! Imagine learning so many ways to say hello!\n\n<h3>How Can We Help?</h3>\nEven though we are far away, we can still help! We can think good thoughts for the children and families in Sudan. We can learn about kindness and peace in our own lives. When we are kind to our friends and family, we are helping to make the world a more peaceful place, one little step at a time! Every little act of kindness makes a difference, just like adding one more building block to a strong tower.",
    "summary": "Big helpers from the United Nations went to Sudan to see what was happening and found very serious problems that are making many families sad and scared, and now they are telling the world to help bring peace.",
    "whyMatters": "This matters because it tells us that important helpers are watching out for people in Sudan who are having a very hard time, and they want to make sure everyone is safe and can live in peace.",
    "category": "world",
    "date": "2026-02-19T14:07:07.504Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Helpers%20are%20Watching%20Over%20Kids%20and%20Families%20in%20Sudan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-helpers-are-watching-over-kids-and-families-in-sudan",
    "originalLink": "https://www.bbc.com/news/articles/cpqw74d81jqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Son of Robert Mugabe detained in South Africa after reported shooting",
    "title": "Son of Robert Mugabe detained in South Africa after reported shooting",
    "content": "Bellarmine Mugabe is in custody after he allegedly shot a security guard at a property in Johannesburg.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-19T14:07:30.187Z",
    "image": "https://image.pollinations.ai/prompt/Son%20of%20Robert%20Mugabe%20detained%20in%20South%20Africa%20after%20reported%20shooting%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "son-of-robert-mugabe-detained-in-south-africa-after-reported-shooting",
    "originalLink": "https://www.bbc.com/news/articles/c1jkx2pkyyro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Over 1,000 Kenyans enlisted to fight in Russia-Ukraine war, report says",
    "title": "Over 1,000 Kenyans enlisted to fight in Russia-Ukraine war, report says",
    "content": "Investigators call the recruitment a well-organised trafficking ring involving immigration staff and security agencies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:07:50.581Z",
    "image": "https://image.pollinations.ai/prompt/Over%201%2C000%20Kenyans%20enlisted%20to%20fight%20in%20Russia-Ukraine%20war%2C%20report%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "over-1000-kenyans-enlisted-to-fight-in-russia-ukraine-war-report-says",
    "originalLink": "https://www.bbc.com/news/articles/ce8w266769go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Amid tensions, Ukraine’s Chernobyl site remains part of a war zone",
    "title": "Amid tensions, Ukraine’s Chernobyl site remains part of a war zone",
    "content": "Al Jazeera's Nils Adler has seen how the site of the world’s worst nuclear disaster is affected by the war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:07:55.850Z",
    "image": "https://image.pollinations.ai/prompt/Amid%20tensions%2C%20Ukraine%E2%80%99s%20Chernobyl%20site%20remains%20part%20of%20a%20war%20zone%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "amid-tensions-ukraines-chernobyl-site-remains-part-of-a-war-zone",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/19/amid-tensions-ukraines-chernobyl-site-remains-part-of-a-war-zone?traffic_source=rss"
  },
  {
    "originalTitle": "Bangladesh referendum: The big post-election flashpoint?",
    "title": "Bangladesh referendum: The big post-election flashpoint?",
    "content": "The referendum based on the July National Charter in Bangladesh has revealed divisions between the BNP and Jamaat.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-19T14:08:17.900Z",
    "image": "https://image.pollinations.ai/prompt/Bangladesh%20referendum%3A%20The%20big%20post-election%20flashpoint%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladesh-referendum-the-big-post-election-flashpoint",
    "originalLink": "https://www.aljazeera.com/news/2026/2/19/bangladesh-referendum-the-big-post-election-flashpoint?traffic_source=rss"
  },
  {
    "originalTitle": "Trump’s Board of Peace live: Representatives converge for inaugural meeting",
    "title": "Trump’s Board of Peace live: Representatives converge for inaugural meeting",
    "content": "US President Trump will host the inaugural meeting of his so-called 'Board of Peace' in Washington, DC today.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-19T14:08:23.073Z",
    "image": "https://image.pollinations.ai/prompt/Trump%E2%80%99s%20Board%20of%20Peace%20live%3A%20Representatives%20converge%20for%20inaugural%20meeting%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-board-of-peace-live-representatives-converge-for-inaugural-meeting",
    "originalLink": "https://www.aljazeera.com/news/liveblog/2026/2/19/trumps-board-of-peace-live-representatives-converge-for-inaugural-meeting?traffic_source=rss"
  },
  {
    "originalTitle": "South Korea's ex-president jailed for life over martial law attempt",
    "title": "South Korea's ex-president jailed for life over martial law attempt",
    "content": "Yoon Suk Yeol's December 2024 martial law bid fundamentally damaged South Korea's democracy, a judge told the court.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:08:28.910Z",
    "image": "https://image.pollinations.ai/prompt/South%20Korea's%20ex-president%20jailed%20for%20life%20over%20martial%20law%20attempt%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-koreas-ex-president-jailed-for-life-over-martial-law-attempt",
    "originalLink": "https://www.bbc.com/news/articles/cx28y8xd1vjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudan atrocities are 'hallmarks of genocide', UN says",
    "title": "Helpers Look After Kids in Sudan!",
    "content": "<h3>Hello from Africa!</h3>\nWelcome, little news explorers! Today, we're going on an adventure to a big, beautiful country in Africa called Sudan. It's a place with lots of sunshine and friendly people, but sometimes, grown-ups there have big disagreements. When grown-ups fight, it can make people, especially children, very sad and scared. But guess what? There are amazing helpers in the world who want to make sure everyone is safe and happy. These helpers are part of a big, big team called the United Nations, or UN for short.\n\n<h3>What is the United Nations?</h3>\nThe United Nations is like a super-duper team of kind grown-ups from almost every country in the world! Imagine if all your friends from different schools came together to solve a problem – that's a bit like the UN. Their main job is to help countries be friends, keep peace, and make sure everyone has what they need, like food, medicine, and safe places to live. When things get tough in a country, the UN sends its helpers to find out what's going on and figure out the best way to help.\n\n<h3>Finding Out the Truth</h3>\nRecently, some very brave UN helpers went on a special trip to Sudan. It was like they were super detectives! They wanted to find out what was truly happening in a city called el-Fasher. This city is a place where many people live, and it used to be a safe spot for families who had to leave their homes because of fighting in other areas. But sadly, the fighting reached el-Fasher too. The UN helpers talked to people, looked at places, and gathered lots of information. This is called a 'fact-finding mission' – they were finding all the facts!\n\n<h3>Very Sad Things Are Happening</h3>\nThe UN helpers found out that some groups of grown-ups are doing very, very bad things to many people in Sudan. These bad things are hurting lots of families. Imagine if someone tried to hurt many people just because of who they are, or tried to make them leave their homes forever. The UN says that what is happening is so serious, it's like a big warning sign. They said these things are 'hallmarks', which means signs, of very serious crimes against people. They want the world to know so that everyone can try to make it stop.\n\n<h3>Did You Know?</h3>\nSudan is one of the largest countries in Africa! It has a famous, very long river called the Nile, which brings water to many people and animals. Many different people live in Sudan, and they speak many different languages and have beautiful traditions.\n\n<h3>How Fighting Hurts Children</h3>\nWhen there is fighting, children are often the ones who suffer the most. They might not be able to go to school, which means they miss out on learning and playing with friends. Their homes might get broken, and they might not have enough yummy food or clean water to drink. Sometimes, families have to leave everything behind and run away to find a safe place, which is very scary and sad. It's very important that children feel safe, loved, and can go to school every day.\n\n<h3>Why is it Important to Know?</h3>\nKnowing what happens in places like Sudan is super important because it helps the grown-ups of the world understand. When they know the truth, they can work together to try and stop the fighting. They can send food, medicine, and blankets to help the families who need them. They can also try to talk to the groups who are fighting and ask them to stop, so that everyone can live in peace. The UN report is like a loud alarm bell, telling everyone that something very wrong is happening and help is needed now.\n\n<h3>Did You Know?</h3>\nThe UN has a special group just for children, called UNICEF! They work all around the world to make sure children have food, clean water, healthcare, and can go to school. They are like superheroes for kids!\n\n<h3>Hoping for Peace and Safety</h3>\nThe UN helpers want to make sure that the children of Sudan can go back to school, play safely with their friends, and have plenty of food and clean water. They want all the grown-ups to stop fighting and start building a happy future for everyone. It's a big job, but the UN team works very hard because they believe every child deserves to be safe and happy, no matter where they live.\n\n<h3>What Can We Do?</h3>\nEven though we are far away, we can still help in our hearts! We can think about the children in Sudan and wish for peace for them. We can be extra kind to our friends and family, and remember that being friendly and helping each other makes the world a better place. You can tell your grown-ups about what you learned today. Every little bit of kindness and caring makes a difference!\n\n<h3>Let's Wish for Peace!</h3>\nLet's all hope that the fighting stops very soon in Sudan, and that all the children can grow up safe, happy, and strong. The UN and many other kind people are working hard to make that happen. Together, we can hope for a world where every child can laugh, learn, and play in peace.",
    "category": "world",
    "date": "2026-02-19T14:08:49.937Z",
    "image": "https://image.pollinations.ai/prompt/Helpers%20Look%20After%20Kids%20in%20Sudan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helpers-look-after-kids-in-sudan",
    "originalLink": "https://www.bbc.com/news/articles/cpqw74d81jqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "White House presses Iran to make deal, while ramping up military presence",
    "title": "White House presses Iran to make deal, while ramping up military presence",
    "content": "US media reports that Trump has discussed attack options with advisers, and a  strike could happen as early as Saturday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:08:55.126Z",
    "image": "https://image.pollinations.ai/prompt/White%20House%20presses%20Iran%20to%20make%20deal%2C%20while%20ramping%20up%20military%20presence%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "white-house-presses-iran-to-make-deal-while-ramping-up-military-presence",
    "originalLink": "https://www.bbc.com/news/articles/c204zpz0lyro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "The 20-year-old newspaper column that gave a hint to Man City's new tactics",
    "title": "The 20-year-old newspaper column that gave a hint to Man City's new tactics",
    "content": "Pep Guardiola is using new tactics this season by making Manchester City's attack more narrow, but did he hint at the idea 20 years ago?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:09:01.150Z",
    "image": "https://image.pollinations.ai/prompt/The%2020-year-old%20newspaper%20column%20that%20gave%20a%20hint%20to%20Man%20City's%20new%20tactics%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-20-year-old-newspaper-column-that-gave-a-hint-to-man-citys-new-tactics",
    "originalLink": "https://www.bbc.com/sport/football/articles/cr7323v131lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Leicester appeal against six-point deduction",
    "title": "Leicester appeal against six-point deduction",
    "content": "Leicester City appeal against a decision to deduct them six points for breaching English Football League financial rules.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T14:09:06.314Z",
    "image": "https://image.pollinations.ai/prompt/Leicester%20appeal%20against%20six-point%20deduction%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "leicester-appeal-against-six-point-deduction",
    "originalLink": "https://www.bbc.com/sport/football/articles/c875pw205glo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How Szoboszlai became Liverpool's key man",
    "title": "How Szoboszlai became Liverpool's key man",
    "content": "Inside the Hungarian midfielder's season as the main character at Liverpool, his friendship with Mohamed Salah and why the Reds are keen to extend his contract.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T14:09:11.497Z",
    "image": "https://image.pollinations.ai/prompt/How%20Szoboszlai%20became%20Liverpool's%20key%20man%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-szoboszlai-became-liverpools-key-man",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjrq74ryrx7o?at_medium=RSS&at_campaign=rss"
  }
]