[
  {
    "originalTitle": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
    "title": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
    "content": "Kizza Besigye’s party says his condition is critical, but authorities say he was taken to hospital for a routine check-up.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T09:28:20.746Z",
    "image": "https://image.pollinations.ai/prompt/Detained%20veteran%20Ugandan%20opposition%20figure%20critically%20ill%20in%20hospital%2C%20his%20party%20says%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "detained-veteran-ugandan-opposition-figure-critically-ill-in-hospital-his-party-says",
    "originalLink": "https://www.bbc.com/news/articles/c5y2q5j71pqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "title": "A Big Trip for Mr. Damiba: From One Country to Another!",
    "content": "Hello, amazing explorers and curious kids! I'm your friendly news reporter for Africa, ready to tell you a super interesting story from our wonderful continent. Today, we're going to learn about a leader who used to be in charge of a country called Burkina Faso. His name is Mr. Paul-Henri Sandaogo Damiba. He's been on a bit of a journey, moving from one country to another, and people are talking about it!\n\n<h3>Meet Mr. Damiba</h3>\n\nImagine your school has a very important person who helps everyone. Maybe it's the head teacher or the school captain. Well, a country has a very important leader too, often called a president! Mr. Damiba used to be like the head leader for a country in Africa called Burkina Faso. He was in charge of helping to make big decisions for the people there. Being a leader is a very big job, just like being a captain of a football team or the leader of a school project.\n\n<h3>Where is Burkina Faso?</h3>\n\nBurkina Faso is a beautiful country right here in West Africa! It's a landlocked country, which means it doesn't have a big ocean next to it. It has many friendly people who live there, and they speak French, among other local languages. It's a place with lots of sunshine and interesting traditions. Imagine a big, beautiful playground with lots of different games and friends. That's a bit like a country, and Burkina Faso is one of those special places.\n\nDid you know? Africa is the second-largest continent in the world! It has 54 different countries, each with its own special stories and people. Burkina Faso is one of these amazing places.\n\n<h3>A Special Visit to Togo</h3>\n\nFor a little while, Mr. Damiba went to stay in another country called Togo. Togo is also in West Africa, and it's right next to the big, beautiful Atlantic Ocean! Imagine you go to visit a friend's house in a different neighborhood. That's kind of what Mr. Damiba did when he went to Togo. He stayed there for some time, and it was a peaceful place for him.\n\n<h3>People Are Saying Things</h3>\n\nNow, here's where the story gets a little bit tricky, but don't worry, we'll explain it simply. Sometimes, when important people are leaders, other people might not agree with everything they do, or they might say things about them. People in Burkina Faso are saying something serious about Mr. Damiba. They are saying that he was planning something very, very bad. They say he wanted to cause trouble and hurt important people in Burkina Faso. This is what we call an 'accusation' – it means people are saying he did something wrong. Mr. Damiba has not said anything about what the people in Burkina Faso are saying. So, we don't know his side of the story yet, but it's important to know that these things are being said.\n\n<h3>A Trip Back Home</h3>\n\nBecause of what people in Burkina Faso were saying, the leaders in Togo decided that it was best for Mr. Damiba to leave their country. It's like when you're at a friend's house, but then your parents say it's time for you to go back home. So, Mr. Damiba left Togo and went back to Burkina Faso. This is what we call being 'expelled' – it means you are asked to leave one place and go to another.\n\nDid you know? Countries often have rules about who can stay there and for how long, especially for people who used to be leaders in other countries. These rules help keep things safe and orderly for everyone.\n\n<h3>Togo, Another Lovely Country!</h3>\n\nLet's talk a little more about Togo! It's another fantastic country in West Africa. Togo is known for its beautiful palm-lined beaches along the Atlantic coast. Imagine building sandcastles and playing by the waves! It's a smaller country compared to some of its neighbours, but it's full of vibrant culture and friendly faces. Just like Burkina Faso, people in Togo also speak French, along with many local languages. Countries in Africa often share a lot of history and culture, making them very special.\n\n<h3>Why Do Leaders Move Around?</h3>\n\nSometimes, leaders have to move from one place to another for different reasons. It might be because of big changes in their own country, or because other countries ask them to. It's always a big story when a former leader makes a journey like this. The most important thing for all countries is to try and have peace and quiet, so everyone can live happily and safely. Leaders work very hard to try and make sure this happens, even when there are disagreements.\n\nDid you know? Even though leaders have big jobs, they are still people, just like us! They have families and friends, and they try their best to do what they think is right for their country, even if not everyone always agrees.\n\n<h3>What Does This Mean For Everyone?</h3>\n\nSo, Mr. Damiba, who used to be a big leader in Burkina Faso, went to stay in Togo for a while. Now, because people in Burkina Faso are saying he planned some bad things (which he hasn't commented on), he has been asked to leave Togo and go back to Burkina Faso. It's a big journey for him and a big story for us! This news reminds us how important it is for countries to work together and for everyone to try and keep the peace. We hope that all countries in Africa can be peaceful and happy places for every child and every family.\n\nThat's all for our news from Africa today! Keep being curious and learning about the world around you!",
    "category": "world",
    "date": "2026-01-21T09:28:46.267Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Trip%20for%20Mr.%20Damiba%3A%20From%20One%20Country%20to%20Another!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-trip-for-mr-damiba-from-one-country-to-another",
    "originalLink": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Malawi raises fuel prices by more than 40%",
    "title": "Big News from Malawi: Fuel Prices Go Up!",
    "content": "Hello, my amazing friends! It's your friendly news reporter for Africa, coming to you with some important news from a beautiful country called Malawi. Malawi is a sunny place in Africa, known for its friendly people and a very big, sparkling lake called Lake Malawi!\n\n<h3>What is Fuel?</h3>\nImagine your parents' car, or a bus, or even a motorbike. How do they move? They need special energy to go! This energy comes from something called \"fuel.\" Most cars use a type of fuel called \"petrol\" or \"diesel.\" It's like the food cars eat to make them run! Just like you need food to play and learn, cars need fuel to go from one place to another.\n\n<h3>Fuel Prices are Going Up in Malawi!</h3>\nGuess what? In Malawi, the price of fuel has gone up. This means that if you want to buy fuel for a car, you now need to pay more money than before. It's like if your favorite candy bar suddenly cost more coins to buy. The price has gone up by a lot, more than 40%! That's a really big jump!\n\n<h3>Why Did the Price Go Up?</h3>\nYou might be wondering, \"Why did this happen?\" Well, there are two main reasons.\n\nFirst, sometimes there isn't enough fuel. Imagine if everyone wanted to buy the same toy, but there were only a few left. The shop owner might make the toy cost more because it's so special and hard to find. This is a bit like what happens with fuel. Sometimes, it's hard to get enough fuel to Malawi, so there are \"fuel shortages.\" This means there's not enough for everyone who needs it.\n\nSecond, the government of Malawi needs money to do good things for all the people in the country. What does a government do? It builds schools so kids like you can learn. It builds hospitals so people can get better when they are sick. It builds roads so cars and buses can travel safely. It also pays teachers and doctors. All these important things cost money.\n\nThe government thought that if fuel costs a little more, they would get more money to help build and fix these important things for everyone. They call this \"strengthening the budget.\" It's like getting more money in your piggy bank so you can buy something bigger and better for your family.\n\n<h3>What Does This Mean for People in Malawi?</h3>\nWhen fuel prices go up, it can make things a bit tricky for families.\n\n*   **Driving Costs More:** If your parents use a car or a motorbike, it will cost them more money to fill up the tank. This means they might have less money left for other things, like food or new clothes.\n*   **Bus Rides Might Cost More:** Many people in Malawi travel by bus. If the bus company has to pay more for fuel, they might have to ask passengers to pay a little more for their bus ticket too.\n*   **Food Prices Could Go Up:** This is important! How does food get to the market or the shop? Big trucks bring it from the farms. These trucks need fuel to move. If the fuel for the trucks costs more, then the food they are carrying might also cost a little more when you buy it.\n\nThis is why some people in Malawi are not very happy about the price increase. It can make life a bit harder for many families.\n\n<h3>What is the Government Doing About It?</h3>\nThe new government in Malawi knows that this is a tough situation for many people. They are trying their best to solve the problem of not having enough fuel. They are working hard to make sure there is enough fuel for everyone in Malawi. They also want to use the money they get from the higher fuel prices to make Malawi a better place for everyone. They want to make sure schools are good, hospitals have what they need, and roads are safe.\n\n<h3>Did You Know? Fun Facts!</h3>\n*   **Did you know?** Fuel comes from deep under the ground! It's called \"crude oil\" and it has to be cleaned and made special before it can go into cars.\n*   **Did you know?** There are other ways to travel without fuel! You can ride a bicycle, walk, or even use a scooter! These are also good for our planet because they don't make smoky air.\n*   **Did you know?** Lake Malawi is one of the biggest lakes in Africa! It has lots of colourful fish that you can only find there.\n*   **Did you know?** Not all cars use petrol or diesel! Some cars use electricity, which comes from power stations. These are called electric cars!\n\n<h3>What Can We Learn?</h3>\nEven though this news might sound a bit serious, it's important to understand how things work in our world. When fuel prices change, it can affect many parts of our lives, from how we travel to how much our food costs.\n\nWe can all learn to be careful with energy. Maybe you can remind your parents to switch off lights when they leave a room, or to not leave the car running when it's stopped for a long time. Every little bit helps!\n\nThe government is trying its best to make things better for Malawi. It's like when you have a tricky puzzle to solve – it takes time and hard work, but you keep trying until you find the solution!\n\nSo, that's the news from Malawi today. We hope that things will get better soon and that everyone in Malawi can continue to travel and live happily! See you next time for more news from our amazing continent!",
    "summary": "Malawi made fuel much more expensive so the government can get more money to build schools and fix roads, even though some people are not happy about it.",
    "whyMatters": "This matters because when fuel costs more, it can make everything else, like food and bus rides, cost more too, affecting many families in Malawi.",
    "category": "government",
    "date": "2026-01-21T09:29:10.463Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Malawi%3A%20Fuel%20Prices%20Go%20Up!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-malawi-fuel-prices-go-up",
    "originalLink": "https://www.bbc.com/news/articles/c5yxdgvd9pwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Japan to restart world’s biggest nuclear plant after 15-year shutdown",
    "title": "Japan to restart world’s biggest nuclear plant after 15-year shutdown",
    "content": "Petition signed by 40,000 relays concerns over risk of seismic activity in vicinity of Kashiwazaki-Kariwa plant.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:29:16.100Z",
    "image": "https://image.pollinations.ai/prompt/Japan%20to%20restart%20world%E2%80%99s%20biggest%20nuclear%20plant%20after%2015-year%20shutdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "japan-to-restart-worlds-biggest-nuclear-plant-after-15-year-shutdown",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/japan-to-restart-worlds-biggest-nuclear-plant-after-15-year-shutdown?traffic_source=rss"
  },
  {
    "originalTitle": "Syrian government and SDF agree on four-day ceasefire",
    "title": "Syrian government and SDF agree on four-day ceasefire",
    "content": "The Syrian government has announced a four-day ceasefire with the Kurdish-led Syrian Democratic Forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:29:21.462Z",
    "image": "https://image.pollinations.ai/prompt/Syrian%20government%20and%20SDF%20agree%20on%20four-day%20ceasefire%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "syrian-government-and-sdf-agree-on-four-day-ceasefire",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/21/syrian-government-sdf-agree-on-four-day-ceasefire?traffic_source=rss"
  },
  {
    "originalTitle": "Luka Doncic records triple-double as Lakers rally past Nuggets",
    "title": "Luka Doncic's Super Star Game for the Lakers!",
    "content": "Hello, amazing friends in Africa! Your friendly news reporter is here with some super exciting sports news all the way from America! We're talking about a fantastic basketball player named Luka Doncic, and how he had a really, really special game. It was so exciting, like watching your favorite animal run super fast! Let's jump into the fun!\n\n<h3>A Basketball Star Shines Bright!</h3>\n\nThere is a very famous basketball player named Luka Doncic. He plays for a team called the LA Lakers. Imagine a big team, like a football team you know, but they play basketball! Luka is one of the best players in the whole world. He is from a country called Slovenia, which is far away in Europe. But he plays his exciting games in America.\n\n\nWhat happened was super cool. Luka played a game against another team called the Denver Nuggets. It was a tough game, meaning it was hard to win. But Luka played so well that he helped his team win! He was like a superhero on the basketball court, making sure his team tried their best.\n\n<h3>What is Basketball?</h3>\n\nSome of you might know basketball, but let's explain it simply! Basketball is a game where two teams try to throw a big, round ball into a hoop. The hoop is very high up, like a tall tree branch! Players bounce the ball (dribble it) as they run. They pass the ball to their teammates. When you throw the ball into the hoop, your team gets points.\n\n\nIt's a very fast game, full of jumping and running. Imagine playing catch with your friends, but instead of just catching, you're trying to score points into a hoop! It's played all over the world, even in many places here in Africa. Lots of children love to play basketball in their backyards or at school.\n\n\nDid you know? Basketball was invented more than 100 years ago in America! A teacher wanted a fun new game for his students to play indoors when it was cold outside.\n\n<h3>Meet the Teams: Lakers and Nuggets!</h3>\n\nLuka Doncic plays for the LA Lakers. \"LA\" means Los Angeles, a very big city in America. The Lakers wear purple and gold colors, like royal colors! They are one of the most famous basketball teams. Many, many people cheer for them.\n\n\nOn the other side, there was the Denver Nuggets team. They are also a very good team, and they come from a city called Denver. Their colors are blue and yellow. When these two strong teams play, it's always an exciting match! It's like when two of the best football teams in your country play – everyone wants to watch!\n\n<h3>Luka's Super Duper Game!</h3>\n\nIn this special game, Luka did something amazing. He played so well, it was like he had magic shoes and hands! He scored a lot of points. He also grabbed the ball many times after someone missed a shot. This is called a 'rebound'. And he helped his teammates score by passing the ball to them at just the right time. This is called an 'assist'.\n\n\nBecause he did so many good things – scoring, rebounding, and assisting – his team felt stronger. When one player plays so incredibly well, it makes everyone else on the team feel excited and want to play even better too! Luka was the main reason the Lakers were able to win.\n\n<h3>What is a Triple-Double? (It's Super Special!)</h3>\n\nNow, here's the super cool part that makes Luka's game extra special! He got something called a \"triple-double.\" What does that mean? It means he did three important things at least 10 times each in one game!\n\n\n1.  **Points:** He scored 10 or more points by throwing the ball into the hoop. Scoring is how you win the game, so this is very important!\n2.  **Rebounds:** He got 10 or more rebounds. Remember, a rebound is when you grab the ball after someone misses a shot. It's like catching a falling fruit! This helps your team get the ball back.\n3.  **Assists:** He made 10 or more assists. An assist is when you pass the ball to a teammate, and then that teammate scores a point right after your pass. It's like setting up your friend to kick the winning goal!\n\n\nDid you know? Getting a triple-double is very, very hard to do! It shows that a player is good at many different things in basketball, not just one. Only the very best players can do this often. It makes the game extra exciting for the fans watching.\n\n<h3>The Big Comeback Win!</h3>\n\nAt the start of the game, the Lakers were not winning. They were behind, like a runner who is a little bit slower at the beginning of a race. But Luka and his team did not give up! They kept trying their best, running, jumping, and shooting. Bit by bit, they started to catch up to the Denver Nuggets.\n\n\nThen, guess what? They started to win! They went from losing to winning. This is called a \"comeback win.\" It feels extra good because they had to work really, really hard to catch up and then go ahead. Everyone watching cheered very loudly because it was so exciting to see them win after being behind.\n\n<h3>Why Luka is an Inspiration!</h3>\n\nLuka Doncic shows us that if you work hard and never give up, you can do amazing things. Even when his team was losing, he kept playing his best. He helps his teammates and makes the game fun to watch. He is a great example for all children, whether you play sports or study in school.\n\n\nHe reminds us to try our very best, even when things are tough. And to help our friends and teammates, just like he helps his Lakers team. His amazing game made people all over the world talk about basketball.\n\n<h3>Basketball Fun in Africa!</h3>\n\nMany kids in Africa love basketball too! From big cities to small villages, you can see children playing with a ball and a hoop, sometimes even a pretend hoop made from old tires or baskets. We have many talented basketball players in Africa, and some even go to play in big leagues like Luka! Keep practicing, because maybe one day you could be a basketball star too!\n\n<h3>Keep Dreaming Big!</h3>\n\nSo, Luka Doncic had a fantastic game, showing everyone his great skills. He helped his team, the LA Lakers, win a big game with his super special \"triple-double.\" It was a day to remember for basketball fans everywhere. Keep playing, keep learning, and keep cheering for your favorite sports stars!\n",
    "summary": "Basketball star Luka Doncic played an amazing game for the LA Lakers, getting a special \"triple-double\" by scoring many points, getting many rebounds, and making many assists, which helped his team win after they were losing.",
    "whyMatters": "This is important because it shows how one player's hard work and amazing skills can help his whole team win, making sports exciting and inspiring children to try their best and never give up.",
    "category": "technology",
    "date": "2026-01-21T09:29:46.904Z",
    "image": "https://image.pollinations.ai/prompt/Luka%20Doncic's%20Super%20Star%20Game%20for%20the%20Lakers!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "luka-doncics-super-star-game-for-the-lakers",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/21/luka-doncic-records-triple-double-as-lakers-rally-past-nuggets?traffic_source=rss"
  },
  {
    "originalTitle": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "content": "Trump's demands over Greenland are a rude awakening in a moment fraught with risk.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:30:03.381Z",
    "image": "https://image.pollinations.ai/prompt/Lyse%20Doucet%3A%20Trump%20is%20shaking%20the%20world%20order%20more%20than%20any%20president%20since%20WW2%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lyse-doucet-trump-is-shaking-the-world-order-more-than-any-president-since-ww2",
    "originalLink": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Train driver killed in second deadly Spain rail crash in days",
    "title": "Train driver killed in second deadly Spain rail crash in days",
    "content": "At least 37 people have been injured, five seriously, in a second crash, after Sunday's two-train collision in Andalusia.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:30:10.252Z",
    "image": "https://image.pollinations.ai/prompt/Train%20driver%20killed%20in%20second%20deadly%20Spain%20rail%20crash%20in%20days%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "train-driver-killed-in-second-deadly-spain-rail-crash-in-days",
    "originalLink": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Locked exits, panic and desperate calls for help: Survivors tell of mall fire horror",
    "title": "Locked exits, panic and desperate calls for help: Survivors tell of mall fire horror",
    "content": "The BBC speaks to eyewitnesses and survivors of the fire that ripped through a busy Pakistan shopping centre.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:30:34.347Z",
    "image": "https://image.pollinations.ai/prompt/Locked%20exits%2C%20panic%20and%20desperate%20calls%20for%20help%3A%20Survivors%20tell%20of%20mall%20fire%20horror%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "locked-exits-panic-and-desperate-calls-for-help-survivors-tell-of-mall-fire-horror",
    "originalLink": "https://www.bbc.com/news/articles/c1ev4z4n5dzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Good signs' or just buying time? Spurs remain divided on Frank future",
    "title": "'Good signs' or just buying time? Spurs remain divided on Frank future",
    "content": "Many Tottenham fans have already lost faith in Thomas Frank - but did Tuesday's 2-0 win over Borussia Dortmund give cause for optimism?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:30:40.226Z",
    "image": "https://image.pollinations.ai/prompt/'Good%20signs'%20or%20just%20buying%20time%3F%20Spurs%20remain%20divided%20on%20Frank%20future%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-signs-or-just-buying-time-spurs-remain-divided-on-frank-future",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj4lqy2np2zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "title": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "content": "Manchester City suffered their very own \"hell of a beating\" moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T09:30:45.363Z",
    "image": "https://image.pollinations.ai/prompt/'Battered%20in%20Bodo'%20-%20is%20this%20more%20than%20just%20a%20blip%20for%20Man%20City%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "battered-in-bodo-is-this-more-than-just-a-blip-for-man-city",
    "originalLink": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Tears in my eyes' - Jesus enjoys 'dream night' in San Siro",
    "title": "'Tears in my eyes' - Jesus enjoys 'dream night' in San Siro",
    "content": "Gabriel Jesus says he had \"tears in my eyes\" after scoring twice to help Arsenal win 3-1 at Inter Milan for a seventh successive win in the Champions League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-21T09:30:50.501Z",
    "image": "https://image.pollinations.ai/prompt/'Tears%20in%20my%20eyes'%20-%20Jesus%20enjoys%20'dream%20night'%20in%20San%20Siro%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tears-in-my-eyes-jesus-enjoys-dream-night-in-san-siro",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwy1wr2xryxo?at_medium=RSS&at_campaign=rss"
  }
]