[
  {
    "originalTitle": "Flights to northern Ethiopia cancelled as fears mount of renewed conflict",
    "title": "Flights to northern Ethiopia cancelled as fears mount of renewed conflict",
    "content": "Passengers received a text message about the cancellation of flights, citing \"unforeseen circumstances\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:37:33.161Z",
    "image": "https://image.pollinations.ai/prompt/Flights%20to%20northern%20Ethiopia%20cancelled%20as%20fears%20mount%20of%20renewed%20conflict%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "flights-to-northern-ethiopia-cancelled-as-fears-mount-of-renewed-conflict",
    "originalLink": "https://www.bbc.com/news/articles/cn40r3v770lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Melania Trump documentary not showing in South African cinemas",
    "title": "Melania Trump documentary not showing in South African cinemas",
    "content": "No reason has been given but the decision follows a huge fall-out between South Africa and the US.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:37:38.320Z",
    "image": "https://image.pollinations.ai/prompt/Melania%20Trump%20documentary%20not%20showing%20in%20South%20African%20cinemas%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "melania-trump-documentary-not-showing-in-south-african-cinemas",
    "originalLink": "https://www.bbc.com/news/articles/c89q287qxelo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Heavy gunfire and blasts heard near airport in Niger's capital",
    "title": "Heavy gunfire and blasts heard near airport in Niger's capital",
    "content": "The airport houses an air force base and is about 10km (six miles) from the presidential place.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:37:43.453Z",
    "image": "https://image.pollinations.ai/prompt/Heavy%20gunfire%20and%20blasts%20heard%20near%20airport%20in%20Niger's%20capital%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "heavy-gunfire-and-blasts-heard-near-airport-in-nigers-capital",
    "originalLink": "https://www.bbc.com/news/articles/cvgp47neze4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hakan Fidan on Iran and Turkiye’s role in global security",
    "title": "Hakan Fidan on Iran and Turkiye’s role in global security",
    "content": "Turkish foreign minister warns against escalation with Iran, explaining how Ankara sees the future of regional security.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:37:48.766Z",
    "image": "https://image.pollinations.ai/prompt/Hakan%20Fidan%20on%20Iran%20and%20Turkiye%E2%80%99s%20role%20in%20global%20security%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hakan-fidan-on-iran-and-turkiyes-role-in-global-security",
    "originalLink": "https://www.aljazeera.com/video/talk-to-al-jazeera/2026/1/29/hakan-fidan-on-iran-and-turkiyes-role-in-global-security?traffic_source=rss"
  },
  {
    "originalTitle": "Will killings by immigration agents cause another US government shutdown?",
    "title": "Big News: Why Helpers in America Might Stop Working!",
    "content": "<h3>Hello, Super Reporters!</h3>\n\nHello, my wonderful friends in Africa! It's your kid-friendly news reporter here, bringing you a very important story from far, far away, in a country called America. Sometimes, grown-ups in charge have big talks and sometimes, things get a little tricky. Today, we're talking about something important that is happening there.\n\nImagine you have a big team project at school, and everyone needs to agree on how to do it. If people can't agree, the project might slow down or even stop for a bit! Something a bit like that is happening with the government in America.\n\n<h3>A Sad Story in America</h3>\n\nThere was a sad thing that happened recently in America. A person named Alex Pretti died. This happened when some special helpers, called 'border helpers' or 'immigration agents', were doing their job. These border helpers have a very important job, which we will talk about soon. But when Alex died, many people, especially some of the leaders in America, became very sad and worried.\n\nThey started thinking, \"How can we make sure this doesn't happen again? How can we make things safer for everyone?\"\n\n<h3>Who Are Border Helpers?</h3>\n\nSo, who are these 'border helpers' or 'immigration agents'? Imagine your country has a front door, and only certain people are allowed to come in, like your family or invited friends. Countries have 'borders', which are like big invisible lines that show where one country ends and another begins.\n\nBorder helpers work at these lines. Their job is to check who is coming into the country and to make sure everyone follows the rules. They help keep the country safe, just like a gatekeeper helps keep your home safe. It's a very big responsibility!\n\nDid you know? America is a very big country with many different states, like different parts of a big puzzle! It has borders with two other countries, Canada and Mexico, and also borders that are ocean.\n\n<h3>What is a Government Stop?</h3>\n\nNow, let's talk about something called a \"government shutdown.\" This sounds a bit scary, but let's make it simple. Imagine your school. It has teachers, a principal, cleaners, and cooks. They all work together to make sure school runs smoothly. This is a bit like a government.\n\nIn America, the government is like a big team of helpers. They help run parks, send out letters, make sure roads are safe, and do many other important things for the people. A \"government shutdown\" means that some parts of this big team stop working because the leaders can't agree on important decisions, especially about money or new rules.\n\nIt's like if your teachers and principal couldn't agree on something, and then some of the classes had to stop for a little while. Not all parts of the government stop, but many important services do. Some helpers might even have to go home and not work, which means they don't get paid.\n\nDid you know? The American government has many thousands of people working for it! They help with everything from weather forecasts to making sure food is safe to eat.\n\n<h3>Why Are Leaders Worried?</h3>\n\nRemember Alex Pretti, who sadly passed away? Because of this sad event, many leaders in America, especially a group called \"Democratic senators,\" are very worried. They want to make sure that border helpers do their job safely and fairly for everyone. They believe that what happened to Alex shows that some of the old rules or ways of doing things need to change.\n\nThese leaders are like the people in your community who want to make sure everyone is treated kindly and safely. They think, \"We must make things better so this kind of sadness doesn't happen again.\"\n\nDid you know? A 'senator' is like a very important leader who is chosen by the people to help make big decisions for the country. America has 100 senators!\n\n<h3>What are 'New Rules' (Reforms)?</h3>\n\nWhen the leaders talk about \"reforms,\" it just means they want to make things better or safer by creating \"new rules.\" Imagine if a game you play has a rule that sometimes makes it unfair. You and your friends might decide to make a \"reform\" – a new, better rule – to make the game fair and fun for everyone!\n\nIn this case, the leaders want to make new rules for how border helpers do their jobs. They want to make sure everyone is treated with respect and that safety is the most important thing. They want to prevent sad events like what happened to Alex from ever happening again.\n\nDid you know? Making new rules, or 'laws', is a very important job of the government. These laws help keep everyone safe and ensure the country runs smoothly.\n\n<h3>Playing for Change</h3>\n\nSo, here's the tricky part: these leaders, the Democratic senators, are saying they might let the government stop working – they might \"risk a shutdown\" – if they don't get to make these new, better rules. It's like saying, \"We care so much about making things safer, that we are willing to stop some government work until we can agree on these new rules.\"\n\nThey hope that by saying this, other leaders will listen to them and agree to make the changes. It's a very big and serious way to show how important this issue is to them.\n\nDid you know? Sometimes, leaders have to negotiate, which means they talk and talk to try and find a way that everyone can agree. It's like when you and your friends try to decide what game to play and you need to find one everyone likes!\n\n<h3>What Happens if the Government Stops?</h3>\n\nIf the government in America does stop, what happens? Well, some national parks might close, so people can't visit them. Some government offices might not open. Some helpers who do important jobs might have to stay home. This can make things difficult for many people in America.\n\nIt's a big deal because it affects how the country runs and how people live their daily lives. That's why leaders really try hard to agree so a shutdown doesn't happen.\n\nDid you know? The last time the US government shut down for a long time was in 2018-2019, and it lasted for 35 days! It meant many people were not working.\n\n<h3>Why This Matters to Everyone</h3>\n\nThis story from America reminds us that it's very important for leaders everywhere to listen to each other and work together. It's about making sure that all people are treated fairly and safely, no matter where they are from or what their job is.\n\nWe hope that the leaders in America can find a way to agree, to make good rules, and to keep their government working for everyone. It shows us that even far away, people care deeply about being fair and safe.\n\n<h3>Let's Hope for Good News!</h3>\n\nSo, that's the big news from America today, my super reporters! Let's hope the leaders there can work things out quickly and make things better for everyone. Until next time, keep being curious and kind!",
    "summary": "Some leaders in America are worried because a person named Alex died when 'border helpers' were working, and they want new rules to make things safer, even if it means some parts of the government might stop working for a bit.",
    "whyMatters": "This is important because leaders want to make sure everyone is safe and treated fairly, and they are trying to change rules so sad things don't happen again. If they can't agree, some important government services might stop, which can cause problems for many people in America.",
    "category": "government",
    "date": "2026-01-29T16:38:12.754Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%3A%20Why%20Helpers%20in%20America%20Might%20Stop%20Working!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-why-helpers-in-america-might-stop-working",
    "originalLink": "https://www.aljazeera.com/news/2026/1/29/will-killings-by-immigration-agents-cause-another-us-government-shutdown?traffic_source=rss"
  },
  {
    "originalTitle": "Spain launches probe as expired vaccines given to 253 children",
    "title": "Spain launches probe as expired vaccines given to 253 children",
    "content": "Basque health minister apologises, says expired vaccines pose no risk to 253 patients affected, mostly children.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:38:18.420Z",
    "image": "https://image.pollinations.ai/prompt/Spain%20launches%20probe%20as%20expired%20vaccines%20given%20to%20253%20children%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spain-launches-probe-as-expired-vaccines-given-to-253-children",
    "originalLink": "https://www.aljazeera.com/news/2026/1/29/spain-launches-probe-as-expired-vaccines-given-to-253-children?traffic_source=rss"
  },
  {
    "originalTitle": "EU adds Iran's Revolutionary Guards to terrorist list",
    "title": "EU adds Iran's Revolutionary Guards to terrorist list",
    "content": "EU foreign policy chief Kaja Kallas says the move is a response to Tehran's deadly crackdown on protesters.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-29T16:38:24.089Z",
    "image": "https://image.pollinations.ai/prompt/EU%20adds%20Iran's%20Revolutionary%20Guards%20to%20terrorist%20list%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eu-adds-irans-revolutionary-guards-to-terrorist-list",
    "originalLink": "https://www.bbc.com/news/articles/c20gypw8enjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What could happen if the US strikes Iran? Here are seven scenarios",
    "title": "What could happen if the US strikes Iran? Here are seven scenarios",
    "content": "From regime change to retaliation, the BBC's Frank Gardner outlines possible outcomes of US strikes on Iran.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:38:29.232Z",
    "image": "https://image.pollinations.ai/prompt/What%20could%20happen%20if%20the%20US%20strikes%20Iran%3F%20Here%20are%20seven%20scenarios%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-could-happen-if-the-us-strikes-iran-here-are-seven-scenarios",
    "originalLink": "https://www.bbc.com/news/articles/ce3kenge1k9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nicki Minaj calls herself Trump's 'number one fan' and shows off gold card visa",
    "title": "Nicki Minaj calls herself Trump's 'number one fan' and shows off gold card visa",
    "content": "The rapper, born in Trinidad and Tobago, praises the US president while Bruce Springsteen protests aboout ICE.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-29T16:38:34.378Z",
    "image": "https://image.pollinations.ai/prompt/Nicki%20Minaj%20calls%20herself%20Trump's%20'number%20one%20fan'%20and%20shows%20off%20gold%20card%20visa%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nicki-minaj-calls-herself-trumps-number-one-fan-and-shows-off-gold-card-visa",
    "originalLink": "https://www.bbc.com/news/articles/cp87l604nx8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palace agree £50m Strand Larsen deal as Forest chase Mateta",
    "title": "Palace agree £50m Strand Larsen deal as Forest chase Mateta",
    "content": "Crystal Palace agree a deal in principle worth in the region of £50m to sign Wolves striker Jorgen Strand Larsen.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:38:40.022Z",
    "image": "https://image.pollinations.ai/prompt/Palace%20agree%20%C2%A350m%20Strand%20Larsen%20deal%20as%20Forest%20chase%20Mateta%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palace-agree-pound50m-strand-larsen-deal-as-forest-chase-mateta",
    "originalLink": "https://www.bbc.com/sport/football/articles/cr7jx97j8jjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Steve Holland could be key to Man Utd's revival under Carrick",
    "title": "Why Steve Holland could be key to Man Utd's revival under Carrick",
    "content": "Why former England and Chelsea coach Steve Holland could be the key appointment in new boss Michael Carrick's coaching team at Manchester United.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-29T16:38:45.175Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Steve%20Holland%20could%20be%20key%20to%20Man%20Utd's%20revival%20under%20Carrick%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-steve-holland-could-be-key-to-man-utds-revival-under-carrick",
    "originalLink": "https://www.bbc.com/sport/football/articles/c75x9234gy3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Senegal boss Thiaw banned after Afcon final chaos",
    "title": "Senegal boss Thiaw banned after Afcon final chaos",
    "content": "Senegal manager Pape Thiaw his banned for five games after the chaotic scenes during the Africa Cup of Nations final against Morocco.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-29T16:38:50.327Z",
    "image": "https://image.pollinations.ai/prompt/Senegal%20boss%20Thiaw%20banned%20after%20Afcon%20final%20chaos%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "senegal-boss-thiaw-banned-after-afcon-final-chaos",
    "originalLink": "https://www.bbc.com/sport/football/articles/c24gy9d52vno?at_medium=RSS&at_campaign=rss"
  }
]