[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "content": "Days of competition culminate in a fishing contest rooted in efforts to cement local peace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T21:18:03.606Z",
    "image": "https://image.pollinations.ai/prompt/Catch%20of%20the%20day%3A%20Pictures%20from%20spectacular%20Nigerian%20fishing%20festival%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "catch-of-the-day-pictures-from-spectacular-nigerian-fishing-festival",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "content": "In a rare occurence, three soldiers were handed jail terms for killings in the troubled Anglophone region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-21T21:18:08.714Z",
    "image": "https://image.pollinations.ai/prompt/Rare%20prison%20sentences%20handed%20to%20Cameroon%20soldiers%20after%20killing%20of%2021%20civilians%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rare-prison-sentences-handed-to-cameroon-soldiers-after-killing-of-21-civilians",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T21:18:13.812Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Slovakia threatens to cut electricity to Ukraine over Russian oil spat",
    "title": "Slovakia threatens to cut electricity to Ukraine over Russian oil spat",
    "content": "Slovakia and Hungary vexed after Russian oil flows via Ukraine halted by alleged Russian drone strike last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T21:18:19.090Z",
    "image": "https://image.pollinations.ai/prompt/Slovakia%20threatens%20to%20cut%20electricity%20to%20Ukraine%20over%20Russian%20oil%20spat%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "slovakia-threatens-to-cut-electricity-to-ukraine-over-russian-oil-spat",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/slovakia-threatens-to-cut-electricity-to-ukraine-over-russian-oil-spat?traffic_source=rss"
  },
  {
    "originalTitle": "NASA rules out March launch for manned moon mission over technical issues",
    "title": "Moon Mission to Wait a Little Longer!",
    "content": "<h3>Hello, Young Explorers of Africa!</h3>\n\nHello, amazing kids! It's your friend, the kid-friendly news reporter, here to tell you something super cool about space! We often look up at the night sky, don't we? We see the beautiful Moon shining bright. Well, some very clever people want to visit our Moon again! This is very exciting news for everyone, even for us here in Africa, because we all share the same sky!\n\n<h3>What is NASA?</h3>\n\nThere's a big, clever team called NASA. NASA stands for National Aeronautics and Space Administration. That's a mouthful, isn't it? Let's just call them NASA for short! They are like super-scientists and engineers who build big rockets and spaceships. Their job is to explore space. They help us learn more about our Earth, the Moon, and even faraway planets like Mars. They are from a country called America, but their discoveries help everyone on Earth.\n\n<h3>Our Friend, The Moon</h3>\n\nDid you know the Moon is Earth's only natural friend in space? It's much smaller than Earth. It doesn't have air like we do, so no one can breathe there without a special suit. It also doesn't have water on its surface like our oceans. But it's still a very important place. Scientists want to learn more about how the Moon was made and if it can help us travel even further into space one day.\n\nDid you know? The Moon is about 384,400 kilometres away from Earth! If you drove a car there, it would take you more than 150 days without stopping!\n\n<h3>The Big Plan: Project Artemis</h3>\n\nNASA has a very big and important plan called Project Artemis. 'Artemis' is a special name from old stories, like a brave explorer! This project is all about sending people back to the Moon. Not just any people, but special space explorers called astronauts. The last time people walked on the Moon was a very long time ago, even before your parents were born! Project Artemis wants to send the first woman and the first person of colour to walk on the Moon. How amazing is that?\n\n<h3>Artemis 2: A Trip Around the Moon</h3>\n\nThe first step for this big plan is called Artemis 2. It's like a practice run! The Artemis 2 mission will send astronauts into space, around the Moon, and then back to Earth. But they won't land on the Moon. They will just fly around it. This trip is to make sure the spaceship, called Orion, is super safe and ready for the astronauts who will actually land on the Moon later.\n\nThis mission is very important because it tests everything. It tests the big rocket, the spaceship, and all the special tools. It's like when you practice for a big sports game or a play at school. You need to practice to make sure everything goes perfectly on the big day.\n\n<h3>Who Are the Moon Explorers?</h3>\n\nFor Artemis 2, there will be four very brave astronauts. Their names are Reid Wiseman, Victor Glover, Christina Koch, and Jeremy Hansen. Victor Glover is the first African American astronaut to go on a Moon mission, and Christina Koch is one of the first women to go. They are super smart and super brave! They have trained for a very long time to get ready for this amazing journey around the Moon. They are like real-life superheroes!\n\n<h3>Why a Little Wait?</h3>\n\nNow, here's the news! NASA said that the Artemis 2 mission, the one going around the Moon, will not fly in March of this year. They have decided to wait a little longer. Why? Well, they found some small things that need more checking. Think of it like a very big toy car. Before you drive it, you check the wheels, the engine, and everything else to make sure it's safe. NASA is doing the same thing with their super big spaceship and rocket.\n\nThey want to be extra, extra sure that everything is perfect. They want to make sure the astronauts are super safe. So, they need more time to check all the special parts. This is called 'technical issues' – it just means parts of the rocket or spaceship need more looking at and maybe fixing.\n\nDid you know? Rockets are made of millions of parts! Each part must work perfectly for the mission to be safe and successful.\n\n<h3>Safety First, Always!</h3>\n\nIt's very important that space travel is super safe. Going to space is not like riding a bicycle! It's a huge adventure, but it can also be dangerous if things are not perfect. So, NASA decided it's better to wait and check everything again. They want to make sure our brave astronauts come back home safely after their amazing trip around the Moon.\n\nSo, instead of flying around the Moon this March, the Artemis 2 mission will now fly in September next year, in 2025. It's a bit of a wait, but it's for a very good reason!\n\n<h3>What Happens Next?</h3>\n\nAfter Artemis 2 flies around the Moon and everything works perfectly, then comes the even bigger mission! It's called Artemis 3. This is the mission where astronauts will actually land on the Moon. They will walk on the Moon, explore it, and set up little science experiments. This mission is planned for the year 2028. That's a few years away, but it will be so exciting to watch!\n\nThis will be a huge step for everyone. They will be learning new things about space that can help all of us on Earth. Imagine seeing the first woman and the first person of colour making footprints on the Moon! It will be a historic moment for the whole world.\n\nDid you know? Astronauts wear very thick spacesuits to protect them from the harsh conditions in space and on the Moon!\n\n<h3>Looking Up From Africa</h3>\n\nEven though these missions are planned by NASA, we here in Africa can also look up at the same Moon and dream big! Who knows, maybe one day, some of you amazing kids will become astronauts or rocket scientists, helping to explore space from Africa! Many African countries are also looking to the stars and launching their own satellites. Space exploration truly unites us all.\n\n<h3>Keep Dreaming Big!</h3>\n\nSo, remember, even though the trip around the Moon will wait a little, it's all for a good reason – safety and success! Keep looking up at the sky, keep asking questions, and keep dreaming big. The future of space exploration is waiting for all of us!",
    "summary": "NASA has decided to delay its Artemis 2 mission, which will fly astronauts around the Moon without landing, to ensure everything is perfectly safe before the flight.",
    "whyMatters": "This matters because it shows how important safety is when going to space, and it's a big step for future missions that will send the first woman and person of colour to walk on the Moon.",
    "category": "world",
    "date": "2026-02-21T21:18:37.736Z",
    "image": "https://image.pollinations.ai/prompt/Moon%20Mission%20to%20Wait%20a%20Little%20Longer!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "moon-mission-to-wait-a-little-longer",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/nasa-rules-out-march-launch-for-manned-moon-mission-over-technical-issues?traffic_source=rss"
  },
  {
    "originalTitle": "Far-right anti-Islam march sparks counterprotests in Manchester",
    "title": "Far-right anti-Islam march sparks counterprotests in Manchester",
    "content": "Hundreds of Britain First protesters faced larger antifascist crowds in a tense Manchester city centre standoff.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T21:18:42.886Z",
    "image": "https://image.pollinations.ai/prompt/Far-right%20anti-Islam%20march%20sparks%20counterprotests%20in%20Manchester%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "far-right-anti-islam-march-sparks-counterprotests-in-manchester",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/far-right-anti-islam-march-sparks-counter-protests-in-manchester?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first anti-government protests since deadly crackdown",
    "title": "News from Far Away: Students in Iran Remember!",
    "content": "<h3>Hello, Little News Superstars!</h3>\n\nHello, my amazing little news buddies! It's your friendly reporter here, coming to you from beautiful Africa, with some important news from a land very, very far away. Today, we're going to talk about some brave young people called students in a country called Iran. It's a story about remembering and hope, even when things are a bit sad.\n\nImagine a country with mountains, deserts, and ancient buildings that have stood for thousands of years. That's a little bit like Iran! It's a place with its own special stories, animals, and lots of wonderful people, just like our homes here in Africa.\n\n<h3>Meet the Students!</h3>\n\nDo you have big brothers or sisters who go to a bigger school? Or maybe you know someone who is studying to be a teacher or a doctor? Well, these young people are called students. They go to a special, big school called a university.\n\nAt the university, students learn many, many new things. They learn to be smart and strong, ready to help their communities when they grow up. Just like you learn to read, write, and count in your school, university students learn even more amazing things.\n\nStudents are very important in every country! They are the young minds who will help make the world a better place in the future. They have big ideas and kind hearts.\n\n<h3>Where is Iran?</h3>\n\nIran is a country that is very, very far from us. If you looked at a big map of the world, you would see it past big oceans and many other countries. It's in a part of the world called Asia.\n\nIran is a big country with different kinds of weather. It has tall mountains, wide open deserts, and even some green places. People there speak a language called Farsi, and they have many beautiful traditions.\n\nDid you know? Iran is home to some amazing ancient buildings and gardens that were built a very, very long time ago! These places tell stories of history and beauty. It's like another big home for many people, just like our countries are home to us.\n\n<h3>Why Were They Sad?</h3>\n\nSometimes, grown-ups and young people in a country might feel very sad or unhappy about how things are going. Maybe they wish that things could be fairer for everyone. They might want people to be treated with more kindness and respect.\n\nIt's a bit like when you feel sad because something isn't right, and you wish you could make it better. In Iran, many people, including these students, felt that some things were not fair in their country.\n\nThey wanted to show everyone that they wished for changes. They hoped that these changes would help everyone live happily and safely. People want to feel safe and cared for, everywhere in the world.\n\n<h3>What Happened Before?</h3>\n\nA little while ago, something very sad happened in Iran. Many, many people, grown-ups and young people too, came together to show that they were unhappy. They gathered to say what they believed was wrong. This is sometimes called a 'protest'.\n\nSadly, during these gatherings, some difficult things happened. Many people got hurt. And some people even lost their lives. This made everyone very, very sad and worried. It was a very hard time for many families.\n\nIt's a very difficult thing to talk about, but it's important to know that people sometimes face very hard times. It reminds us that everyone deserves to be safe and heard. We always hope for peace and safety for everyone.\n\n<h3>Remembering Together</h3>\n\nNow, let's talk about what the students did this week. These brave students at the big schools in Iran decided they wanted to remember. They wanted to remember all the people who were hurt or who sadly lost their lives during those difficult times.\n\nRemembering is a very special way of showing love and respect. It's how we keep important people and important moments in our hearts, even if they are no longer with us. It shows that we care deeply.\n\nThe students gathered together. They were not there to be angry, but to be quiet and thoughtful. They wanted to make sure that no one forgets what happened. They wanted to make sure that those who suffered are remembered.\n\nIt's like when we remember a special person on their birthday, or when we share happy stories about our grandparents. The students stood together, probably holding signs, or just standing quietly to show their deep respect and care. It was a peaceful way to show they remember.\n\n<h3>Why is Remembering Important?</h3>\n\nYou might ask, 'Why is it so important to remember these sad things, even if they are far away?' Well, my little friends, remembering helps us learn important lessons. It helps us understand that everyone, everywhere, wants peace and happiness.\n\nWhen we remember, we also show that we care about each other, no matter where we live. These students are showing that even when things are difficult, it's good to stand up for what you believe is right. It's good to remember those who have suffered.\n\nDid you know? When people remember difficult times, it helps them hope for a much better future. They hope for a future where everyone is safe, happy, and treated fairly. It helps them try to make sure sad things don't happen again.\n\nIt shows great courage to stand up for your friends, your neighbours, and even people you don't know, even if they are very far away. It shows that you have a big, kind heart.\n\n<h3>Hope for a Brighter Day</h3>\n\nEven though this news can sound a bit sad, it also has a message of hope. The students are showing that young people care a lot about their country and all the people in it. They want to make sure that everyone can live safely and happily in Iran.\n\nJust like we try to be kind to our friends and family every day, these students want kindness and fairness for everyone in their country. It's a reminder that all over the world, people want good things for their communities and for each other.\n\nWe hope that one day, everyone in Iran and everywhere else can live in peace and safety, with smiles on their faces. Let's all send our good wishes to the students and people of Iran. Thank you for listening, and that's all for today from your friendly news reporter! See you next time!",
    "summary": "Students in Iran gathered peacefully at their big schools to remember the many people who were hurt or sadly lost their lives in earlier difficult times, showing they want peace and fairness for their country.",
    "whyMatters": "This story matters because it shows that young people everywhere care about what is fair and right, and they want everyone to be safe and happy, even when they are very sad about bad things that happened.",
    "category": "world",
    "date": "2026-02-21T21:19:09.071Z",
    "image": "https://image.pollinations.ai/prompt/News%20from%20Far%20Away%3A%20Students%20in%20Iran%20Remember!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-from-far-away-students-in-iran-remember",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "title": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "content": "Far-left militants are suspected of being behind Quentin Deranque's death and the party of Jean-Luc Mélenchon is being widely condemned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-21T21:19:14.184Z",
    "image": "https://image.pollinations.ai/prompt/Killing%20of%20nationalist%20student%20leaves%20French%20far%20left%20in%20deep%20trouble%20as%20elections%20loom%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killing-of-nationalist-student-leaves-french-far-left-in-deep-trouble-as-elections-loom",
    "originalLink": "https://www.bbc.com/news/articles/cnv61zv534eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nasa astronauts' moon mission delayed due to rocket issue",
    "title": "Nasa astronauts' moon mission delayed due to rocket issue",
    "content": "The mission to the far side of the Moon and back will be postponed after problems with were spotted with its rocket, a Nasa official said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-21T21:19:19.281Z",
    "image": "https://image.pollinations.ai/prompt/Nasa%20astronauts'%20moon%20mission%20delayed%20due%20to%20rocket%20issue%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nasa-astronauts-moon-mission-delayed-due-to-rocket-issue",
    "originalLink": "https://www.bbc.com/news/articles/c626v265zqlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Red cards and poor home form - Chelsea 'set fire to points'",
    "title": "Red cards and poor home form - Chelsea 'set fire to points'",
    "content": "Chelsea have more red cards than any side in the Premier League this season, and boss Liam Rosenior says they have \"set fire\" to points.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-21T21:19:24.550Z",
    "image": "https://image.pollinations.ai/prompt/Red%20cards%20and%20poor%20home%20form%20-%20Chelsea%20'set%20fire%20to%20points'%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "red-cards-and-poor-home-form-chelsea-set-fire-to-points",
    "originalLink": "https://www.bbc.com/sport/football/articles/c05v6j380nmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Drive and hunger' take Milner to Premier League appearance record",
    "title": "'Drive and hunger' take Milner to Premier League appearance record",
    "content": "Brighton's James Milner starts against Brentford to break the all-time Premier League appearance record in his 654th match.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T21:19:29.651Z",
    "image": "https://image.pollinations.ai/prompt/'Drive%20and%20hunger'%20take%20Milner%20to%20Premier%20League%20appearance%20record%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "drive-and-hunger-take-milner-to-premier-league-appearance-record",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjrqdnj2199o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Like a dream' - Abraham relishing Villa return",
    "title": "'Like a dream' - Abraham relishing Villa return",
    "content": "Seven years since firing them into the Premier League, Tammy Abraham is back scoring goals at Aston Villa to keep their fans and players dreaming of glory.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-21T21:19:34.748Z",
    "image": "https://image.pollinations.ai/prompt/'Like%20a%20dream'%20-%20Abraham%20relishing%20Villa%20return%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "like-a-dream-abraham-relishing-villa-return",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj0dm8p8049o?at_medium=RSS&at_campaign=rss"
  }
]