[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Super Special Money Gifts in Kenya!",
    "content": "Hello, Super Kids from all over Africa! I'm your friendly news reporter, and I have a really interesting story for you today from Kenya, a beautiful country in East Africa. Imagine getting a gift that looks like a big bunch of flowers, but guess what? It's not flowers at all! It's made of money! Yes, real money, folded and arranged like a pretty bouquet. Isn't that amazing? \n\n<h3>What Are These Money Gifts?</h3>\n\nAround special times, like when grown-ups want to show love or celebrate someone important, people in Kenya have started giving gifts that are a bit different. Instead of colourful flowers from a garden, they make a bouquet out of money notes!\n\nImagine crisp, clean banknotes, maybe 50 shillings, 100 shillings, or even 1000 shillings, carefully folded into shapes that look like flowers or stars. Then, they are put together on sticks, just like real flowers, to make a beautiful big bunch.\n\nThese special gifts are called 'cash bouquets' or 'money bouquets.' They are super popular right now!\n\nThey look so pretty and shiny. People love to take pictures with them and show them off. It's a very creative way to give money as a present.\n\nDid you know? The word 'bouquet' usually means a bunch of flowers. But in Kenya, it can now mean a bunch of money too!\n\n<h3>Why Do People Love Money Gifts?</h3>\n\nSo, why do people like these money gifts so much? Well, there are many reasons!\n\nFirst, money is very useful! If someone gives you a money bouquet, you can use that money to buy exactly what you need or want. Maybe you need new school shoes, or your family needs food, or you want to save up for something big.\n\nFlowers are beautiful, but they don't last very long. Money, on the other hand, can buy things that last or help with important needs. So, it feels like a very practical gift.\n\nIt also feels very special. Imagine someone taking the time to fold all those notes and make such a unique gift just for you! It shows they really thought about giving you something memorable.\n\nPeople also feel happy because they can choose what to do with the gift. It's like getting many choices all in one present! That makes people feel grown-up and trusted.\n\nDid you know? In Kenya, the money is called 'shillings'. Just like in some other countries, they have coins and banknotes!\n\n<h3>A Special Day for Giving</h3>\n\nSometimes, people give these money bouquets for special days when people show extra love to each other. It's a day when grown-ups often give gifts to their loved ones to show how much they care.\n\nBefore, people usually gave real flowers, chocolates, or cards. But now, these money bouquets are a new and exciting way to say 'I love you' or 'I care about you'.\n\nIt's like a new tradition is starting! Everyone wants to see what kind of money bouquet they might get or give.\n\nIt makes gift-giving a bit more exciting and surprising because you don't know exactly how much money is in the bouquet until you count it!\n\nDid you know? Giving gifts is a way people all over the world show love, thanks, and friendship!\n\n<h3>Grown-Ups Have Some Wise Thoughts</h3>\n\nNow, here's an important part of our story. Some grown-ups, like very wise parents and teachers, have been thinking about these money bouquets.\n\nThey think these gifts are fun, but they also have some important ideas to share. They want everyone to be safe and to remember what is truly important when we give gifts.\n\nOne thing they think about is safety. If you walk around with a very big money bouquet, everyone can see you have a lot of money. Sometimes, it's safer to keep money private and not show it off too much.\n\nIt's like how your parents tell you not to flash your pocket money in crowded places. It's just to keep you safe and sound. So, if you get a money bouquet, it's a good idea to put the money away quickly and safely.\n\nAnother thought is about the true meaning of a gift. Is it only about how much money you give? Or is it more about the thought, love, and effort you put into choosing or making something for someone?\n\nSometimes, a handmade card or a small gift chosen just for that person can mean even more than a lot of money, because it shows you really know and care about them.\n\nDid you know? The most important part of a gift is often the love and thought behind it, not how much it costs!\n\n<h3>What's Important About Gifts?</h3>\n\nSo, what do our wise grown-ups want us to remember? They want us to think about how we give and receive gifts.\n\nThey say it's good to be thoughtful. Think about what the person really needs or would really love. Sometimes, that might be money, but other times, it could be a special toy, a book, or even just spending time together.\n\nThey also remind us to be grateful for any gift we receive, whether it's big or small, money or a drawing. Every gift shows someone cares about you.\n\nAnd remember, safety first! If you ever get a money gift, always show it to a trusted grown-up so they can help you keep it safe.\n\nIt's also important not to feel pressured. No one should feel like they *have* to give a super expensive gift. The best gifts come from the heart, not because you feel like you *must*.\n\nSo, while money bouquets are a really fun and popular idea in Kenya, it's also a good chance for us to remember what truly makes a gift special: the love, the thought, and the safety of everyone involved.\n\nKeep shining bright, Super Kids, and remember to always be kind and thoughtful with your gifts!\n",
    "summary": "People in Kenya are giving special gifts called 'cash bouquets' made of money instead of flowers, but grown-ups want everyone to remember to be safe and think about the true meaning of gifts.",
    "whyMatters": "It's important to learn about different ways people give gifts and why being safe with money and showing real care are always the most important things when giving or receiving presents.",
    "category": "world",
    "date": "2026-02-14T05:40:51.643Z",
    "image": "https://image.pollinations.ai/prompt/Super%20Special%20Money%20Gifts%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "super-special-money-gifts-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T05:40:56.757Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "South Africa to deploy troops to tackle crime gangs",
    "content": "President Cyril Ramaphosa says the army will work with the police to fight organised crime and illegal mining.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T05:41:01.861Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20to%20deploy%20troops%20to%20tackle%20crime%20gangs%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-to-deploy-troops-to-tackle-crime-gangs",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Could BNP’s landslide win open a new geopolitical chapter for Bangladesh?",
    "title": "Could BNP’s landslide win open a new geopolitical chapter for Bangladesh?",
    "content": "Tarique Rahman's decisive victory may redraw regional alignments after years of pro-India policy under ousted PM Hasina.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T05:41:26.284Z",
    "image": "https://image.pollinations.ai/prompt/Could%20BNP%E2%80%99s%20landslide%20win%20open%20a%20new%20geopolitical%20chapter%20for%20Bangladesh%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "could-bnps-landslide-win-open-a-new-geopolitical-chapter-for-bangladesh",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/could-bnps-landslide-win-open-a-new-geopolitical-chapter-for-bangladesh?traffic_source=rss"
  },
  {
    "originalTitle": "India vs Pakistan: T20 World Cup – teams, start time, lineups",
    "title": "Super Cricket Fun: India vs. Pakistan!",
    "content": "<h3>Hello, Super Sports Fans!</h3>\n\nHi everyone! It's your kid-friendly reporter here, bringing you big news from the world of sport! Guess what? There's a super exciting cricket game coming up. It's like a giant party where everyone watches two amazing teams play. Are you ready to hear about it?\n\nWe are talking about a game between two very good teams: India and Pakistan! They are going to play in something called the T20 World Cup. It's a really, really big deal!\n\n<h3>What is Cricket?</h3>\n\nFirst, let's talk about cricket! Have you ever seen cricket before? It's a super fun game played on a big green field. Two teams play against each other.\n\nOne team tries to hit a ball with a special bat. They run to score points, called 'runs'. It's like scoring goals in football, but you run back and forth!\n\nThe other team tries to catch the ball and get the players out. They throw the ball very fast at three wooden sticks called 'wickets'. If they hit the wickets, the player is out!\n\nDid you know? Cricket is played in many countries around the world! Lots of people in Africa love cricket too, like in South Africa, Zimbabwe, and Kenya!\n\n<h3>What is the T20 World Cup?</h3>\n\nNow, let's talk about the 'World Cup'. Imagine all the best cricket teams from different countries coming together to play. It's like the best of the best! They play many games, and the team that wins the most games gets a big trophy.\n\nAnd 'T20'? That just means the game is a little bit shorter and very exciting! Each team gets to bat for 20 overs. An 'over' is when a bowler throws the ball 6 times. So, it's a fast game with lots of big hits and super catches!\n\nDid you know? The T20 World Cup happens every few years. It's like waiting for a special birthday party that only comes every now and then!\n\n<h3>India vs. Pakistan: A Super Special Game!</h3>\n\nNow, for the main event! The big game is between India and Pakistan. These two countries are neighbours, and their cricket teams are super famous and very, very good!\n\nWhen India plays Pakistan in cricket, it's not just a game. It's like a giant festival! Everyone stops what they are doing to watch. Grown-ups, kids, grandmas, grandpas – everyone gets excited!\n\nThese two teams have a long history of playing each other. Every time they meet, it's like a friendly challenge to see who is the best on that day. Both teams want to win very much!\n\nDid you know? Some people say the India vs. Pakistan cricket match is one of the biggest sports rivalries in the whole world! Even bigger than some football games!\n\n<h3>Why is This Game So Big?</h3>\n\nThis game is special for many reasons. First, both teams have amazing players. They hit the ball very far, they throw it very fast, and they catch it very well. It's like watching superheroes play!\n\nSecond, it brings people together. Even if grown-ups from different countries sometimes have serious talks, sport helps everyone remember that we can still have fun together.\n\nWhen India plays Pakistan, people from both countries, and everywhere else, sit together, cheer together, and celebrate the game. It shows that sport can make people happy and bring smiles to many faces.\n\nDid you know? Many people will dress in their team's colours and paint their faces to support their favourite players! It's like a big fancy dress party for cricket!\n\n<h3>Cricket Around the World</h3>\n\nThis game is not just important for India and Pakistan. It's important for everyone who loves cricket, all over the world. It shows how much people love this sport.\n\nFrom the busy cities of Africa to the green fields of Asia, cricket makes people cheer and jump with joy. This game will be watched by billions of people. That's a super lot of people!\n\nWe love cricket in Africa too! It teaches us about teamwork, fair play, and never giving up. These are all good lessons for life.\n\nDid you know? Cricket bats are often made from a special kind of willow wood. It makes them strong enough to hit the ball very hard!\n\n<h3>Let's All Watch Together!</h3>\n\nSo, get ready! Find a comfy spot, maybe with your family or friends, and watch this super exciting game between India and Pakistan in the T20 World Cup. It's going to be full of big hits, amazing catches, and lots of cheers!\n\nNo matter who wins, we will all enjoy a wonderful game of cricket. It's a game that brings joy and excitement to so many hearts. Let's cheer for both teams and celebrate the spirit of sport!\n\nRemember, sport is about having fun, playing fair, and making friends. Enjoy the match, everyone!",
    "summary": "Get ready for a super exciting cricket game in the T20 World Cup where two amazing teams, India and Pakistan, will play each other, bringing joy and excitement to fans all around the world.",
    "whyMatters": "This game is very important because it brings millions of people together to watch a super fun sport, showing how cricket can make everyone happy and celebrate friendly competition, even between countries that are neighbours.",
    "category": "world",
    "date": "2026-02-14T05:41:43.603Z",
    "image": "https://image.pollinations.ai/prompt/Super%20Cricket%20Fun%3A%20India%20vs.%20Pakistan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "super-cricket-fun-india-vs-pakistan",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/india-vs-pakistan-t20-world-cup-teams-start-time-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "UK’s Mandelson asked to cooperate in Epstein probe by US Congress",
    "title": "UK’s Mandelson asked to cooperate in Epstein probe by US Congress",
    "content": "US lawmakers say Mandelson holds 'critical information' about Epstein’s operations and have requested cooperation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-14T05:41:48.722Z",
    "image": "https://image.pollinations.ai/prompt/UK%E2%80%99s%20Mandelson%20asked%20to%20cooperate%20in%20Epstein%20probe%20by%20US%20Congress%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uks-mandelson-asked-to-cooperate-in-epstein-probe-by-us-congress",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/uks-mandelson-asked-to-cooperate-in-epstein-probe-by-us-congress?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T05:41:54.211Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US homeland security shutdown could mean airport delays, travel groups say",
    "title": "US homeland security shutdown could mean airport delays, travel groups say",
    "content": "The shutdown won't affect air traffic controllers but some TSA workers may go without pay.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-14T05:41:59.321Z",
    "image": "https://image.pollinations.ai/prompt/US%20homeland%20security%20shutdown%20could%20mean%20airport%20delays%2C%20travel%20groups%20say%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-homeland-security-shutdown-could-mean-airport-delays-travel-groups-say",
    "originalLink": "https://www.bbc.com/news/articles/cwy8dw5zk7yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T05:42:04.429Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T05:42:09.791Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "title": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "content": "After Igor Tudor agrees to take charge of Tottenham for the remainder of the season, BBC Sport takes a look at what supporters can expect to see from his side.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-14T05:42:14.917Z",
    "image": "https://image.pollinations.ai/prompt/'Intense%2C%20aggressive%2C%20entertaining'%20-%20what%20will%20Tudor%20bring%20to%20Spurs%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "intense-aggressive-entertaining-what-will-tudor-bring-to-spurs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13nkvd2eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Marvellous' Man City set WSL standard in rampant win",
    "title": "'Marvellous' Man City set WSL standard in rampant win",
    "content": "'Marvellous' Manchester City set WSL standard in rampant 6-0 win over bottom side Leicester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T05:42:20.017Z",
    "image": "https://image.pollinations.ai/prompt/'Marvellous'%20Man%20City%20set%20WSL%20standard%20in%20rampant%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "marvellous-man-city-set-wsl-standard-in-rampant-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxwjjqrxeo?at_medium=RSS&at_campaign=rss"
  }
]