[
  {
    "originalTitle": "Leader of South Africa's second largest party will not seek re-election",
    "title": "Big News from Sunny South Africa!",
    "content": "Hello, my friends! It's your friendly news reporter here, bringing you super exciting news from our amazing continent, Africa! Today, we are going to learn about something very important happening in a beautiful country called South Africa. It's a country full of amazing animals and wonderful people. Let's find out what's new!\n\n<h3>A Special Leader in South Africa</h3>\n\nEvery country has special people who help run things. These people are like the captains of a sports team or the head student in a class. They help make big decisions for everyone.\n\nIn countries, groups of people who share ideas about how to make things better are called 'parties'. Imagine your school has different clubs, like a drawing club or a soccer club. Each club has its own ideas and its own leader.\n\nIn South Africa, there are many different parties. One very important party is called the Democratic Alliance. We can call it the DA for short, it's easier to say!\n\nThe DA is like one of the big teams in the country. It has many, many supporters. It is actually the second biggest party in South Africa, which means lots of people like their ideas!\n\nThis big party, the DA, has a special leader. This leader helps the party decide what to do and how to help the country. They speak for all the people in their team.\n\nThis leader has a very, very important job. They work hard every day to try and make South Africa a better place for all the children and grown-ups.\n\nDid you know? South Africa is sometimes called the 'Rainbow Nation' because it has so many different kinds of people and cultures living together happily!\n\n<h3>Saying Goodbye to a Big Job</h3>\n\nNow, for the big news that got everyone talking! The leader of the DA party has said something very surprising. They have decided they will not try to get their job again.\n\nThis means they will not ask the people to choose them to be the leader for another time. They are saying 'goodbye' to being the leader of the DA party and stepping down.\n\nWhen someone tries to get their important job again, we call it 'seeking re-election'. But this leader is choosing not to do that this time.\n\nIt was a big surprise for many people across South Africa. Usually, leaders want to stay in their important jobs for a long, long time. So, this news was very unexpected!\n\nImagine if your favourite teacher suddenly said they wouldn't be teaching your class next year. You might feel a little surprised, right? It's a bit like that for the people in South Africa.\n\nDid you know? In many countries, leaders are chosen by people voting! It's like choosing your favourite ice cream flavour, but for very important jobs that help everyone!\n\n<h3>How Countries Work Together</h3>\n\nNow, let's talk about how a country runs. All the parties and leaders work together to make a 'government'.\n\nThe government is like a super big team that helps everyone in the country. They make sure there are schools for children, hospitals for when we are sick, and safe places to live.\n\nSometimes, one party is so big and has so many supporters that it can run the government all by itself. But other times, different parties have to work together.\n\nWhen different parties work together to run the country, we call it a 'coalition government'. Think of it like a group of friends building a very big sandcastle on the beach.\n\nEach friend has different ideas, but they all put their hands together and work as one team to build the best, biggest sandcastle ever! That's what a coalition government does.\n\nThe DA party is a very, very important part of South Africa's coalition government. It's like a key player or a super important friend in the big sandcastle building team.\n\nDid you know? South Africa is home to many amazing animals, including lions, elephants, rhinos, leopards, and buffalos, often called the 'Big Five'!\n\n<h3>Keeping Things Strong and Steady</h3>\n\nWhen a country's government is working well and staying calm, without sudden big changes, we call that 'stability'. It means things are steady and strong, like a sturdy tree.\n\nImagine a strong table with four steady legs. That table is stable and safe! If one leg suddenly wiggles or goes away, the table might wobble a little bit, right?\n\nBecause the DA leader is leaving, and they were a very important 'leg' of the government, some people are wondering if the 'table' of the government might wobble a little bit. This is what 'threaten stability' means.\n\nIt doesn't mean something bad will definitely happen! It just means that when a big change like this happens, everyone needs to work extra, extra hard to keep things steady and calm.\n\nThe DA leader was a very important person in the team. So, finding a new leader means the whole team has to adjust and get used to a new way of working. It's like when a star player leaves a sports team and the other players need to adapt.\n\nBut don't worry, my friends! People in South Africa are very good at working together. The other leaders and members of the government will work super hard to keep everything stable and calm for everyone.\n\nDid you know? South Africa has 11 official languages! That's a lot of different ways to say hello, like 'Sawubona' in Zulu or 'Molo' in Xhosa!\n\n<h3>What Happens Next?</h3>\n\nSo, what will happen now that the DA leader is saying goodbye to their big and important job?\n\nThe DA party will choose a new leader very soon! It will be like choosing a new captain for a team. They will look for someone strong, smart, and ready to lead.\n\nThis new leader will then join the big team of the government. They will work with all the other parties to keep South Africa strong, happy, and growing.\n\nEveryone wants the best for South Africa. All the leaders and parties will try their very best to keep helping the country grow and shine brightly for all its people.\n\nIt's an important time, but also an exciting time! New beginnings can be wonderful. We will keep watching and telling you what happens next right here on our news show!\n\nDid you know? Table Mountain in Cape Town, South Africa, is one of the oldest mountains in the world and has many unique plants and animals that live only there!",
    "summary": "The leader of a big political team in South Africa, called the DA, has decided not to try for their job again, which is a surprise and means other teams in the government will work extra hard to keep things steady and calm for the country.",
    "whyMatters": "This matters because the leader leaving is a big change for South Africa's government team, which is made of different groups working together. Everyone will need to work very hard to make sure the country stays strong and peaceful for all its people.",
    "category": "politics",
    "date": "2026-02-04T11:30:21.542Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Sunny%20South%20Africa!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-sunny-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/c5yvneqg1xxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saif al-Islam Gaddafi, son of ex-Libyan leader, reportedly shot dead",
    "title": "Sad News from Our African Family in Libya",
    "content": "<h3>Hello, Young Friends!</h3>\n\nHello, amazing young explorers and learners! Your friendly African news reporter is here again. We always like to share happy news, but sometimes, there is also sad news from around our big continent, Africa. Today, we have some news from a country far away, but still part of our African family, called Libya.\n\n<h3>A Man Named Saif</h3>\n\nWe heard some news about a man named Saif. His full name was Saif al-Islam Gaddafi. He was a grown-up, 53 years old. The news reports tell us that he is no longer with us. It is always sad when someone passes away, especially someone who was important in their country. We send our thoughts to the people in Libya who are hearing this news.\n\n<h3>Who Was Saif?</h3>\n\nSaif was the son of a man who used to be a very important leader in Libya a long time ago. Imagine your mum or dad being a very important person who helps run your whole town or country! That's a bit like what his father was. Because his father was a leader, Saif was also a well-known person in Libya. He was once seen as one of the most important people there.\n\n<h3>What is a Leader?</h3>\n\nDid you know? A leader is someone who helps guide a country. They make important decisions to try and make life good and safe for all the people living there. They help make rules, build schools, and ensure that everyone has what they need. It's a big job! Every country has a leader or a group of leaders.\n\n<h3>Where is Libya?</h3>\n\nLibya is a beautiful country in North Africa. If you look at a map of Africa, it's right at the top, touching the big, blue Mediterranean Sea. Imagine a place with lots of sunshine and wide, sandy deserts. That's a big part of Libya! But it also has lovely coastlines with beaches where people can play. The main city in Libya, where many people live and important things happen, is called Tripoli. It’s a busy city with lots of homes and markets.\n\nDid you know? Africa is a very big continent! It has 54 different countries, and Libya is one of them. Each country has its own special stories, songs, and food!\n\n<h3>Why Do We Share This News?</h3>\n\nWe share this news because it's important to know what happens in other countries, especially in our big African family. When someone who was important passes away, people in their country, and even in other countries, talk about it. It helps us understand the world around us a little better.\n\n<h3>Learning About Our World</h3>\n\nIt's good to learn about different countries and the people who live in them. We can learn about their homes, their delicious food, their languages, and their unique stories. Learning about other places helps us become smart and understanding global citizens. Even when we hear sad news, we remember to be kind and respectful.\n\nDid you know? The desert in Libya is part of the Sahara Desert, which is the biggest hot desert in the world! It's so big that it covers many countries in Africa.\n\n<h3>Wishing for Peace and Kindness</h3>\n\nWhen we hear news like this, it makes us think about peace. Peace means everyone is happy, safe, and friendly with each other. We wish for peace and happiness for all the people in Libya and in every country in Africa and around the world. It’s always good to be kind to our friends, our family, and everyone we meet. We can all help make the world a more peaceful place by being good listeners and good friends.\n\n<h3>Stay Curious!</h3>\n\nSo, remember, even when news is a little sad, it helps us learn more about our amazing world and the people in it. Keep being curious, keep asking questions, and always be kind. We will be back with more news and fun facts from our wonderful continent, Africa!\n\nDid you know? In Libya, some people love to eat a dish called 'Bazeen,' which is a special bread made from barley flour! It's often served with a tomato sauce and meat. Sounds yummy, right?\n\n<h3>A Special Message</h3>\n\nLet’s all remember to be good neighbours, not just in our homes, but also as countries. We all live on the same big planet, and it's best when everyone gets along and helps each other. This news from Libya reminds us that life is precious and we should always try to spread love and understanding. Always remember to listen to your parents and teachers, they help you understand the world even better and keep you safe. Until next time, stay happy and keep learning!\n",
    "summary": "Sad news has come from Libya, an African country, about a man named Saif al-Islam Gaddafi, who was the son of a past leader, passing away at 53 years old.",
    "whyMatters": "This news is important because Saif was a well-known person and his passing affects people in Libya, reminding us to learn about other countries and wish for peace everywhere in our big African family.",
    "category": "technology",
    "date": "2026-02-04T11:30:42.467Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Our%20African%20Family%20in%20Libya%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-our-african-family-in-libya",
    "originalLink": "https://www.bbc.com/news/articles/cp37g4xgkxdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why a beauty spot in South Africa could be about to run out of water",
    "title": "Our Water Story: Saving Every Precious Drop!",
    "content": "<h3>Hello, My Amazing Friends!</h3>\n\nHello, my amazing friends! It's your kid-friendly reporter from sunny Africa here! Today, we're going on an important adventure to talk about something super special: water! Water is life, and it's something we all need every single day.\n\nImagine a beautiful place in South Africa, maybe with green trees and happy animals. People live there, just like you! This place is called a 'beauty spot' because it's so lovely with its mountains and plants. But guess what? It's facing a little problem with its water. Don't worry, we're going to learn all about it together, and find out how we can all be water heroes!\n\n<h3>What's Happening to Our Water?</h3>\n\nThink about the water that comes out of your tap. It's clean and ready for you to drink, wash your hands, or help plants grow. This water travels a very long way, underground, through special tunnels called pipes.\n\nBut in this beautiful town in South Africa, a lot of this precious water is disappearing before it even reaches homes and schools! It's like having a juice box with a tiny hole. The juice drips out before you can drink it all. That's what's happening with the town's water.\n\nGrown-ups have looked closely, and they found that more than half of the clean drinking water is getting lost! Imagine if you had 10 sweets, and 5 of them just vanished! That's how much water is going away before people can even use it.\n\n<h3>Where Does the Water Go?</h3>\n\nSo, where does this water go? It's not magic! It's because of something called 'leaky pipes'. Pipes are like long tunnels that carry water from a big river or dam to your house. They are usually strong and buried deep under the ground.\n\nBut sometimes, these pipes get old, or maybe a tree root pushes on them, and they get tiny cracks or holes. When there's a crack, the water starts to drip out, little by little, into the ground. It's like when your water bottle has a small crack, and water slowly seeps out. You might not notice at first, but soon your bottle is half empty!\n\nEven a small drip can add up to a lot of water over time. Think about a tiny hole in a bucket – if you leave it long enough, the bucket will be empty. That's why leaky pipes are a big problem. They let lots of water escape before it gets to you.\n\nDid you know? Even a small drip from a tap can waste enough water to fill a bathtub in just one day!\n\nDid you know? Only a tiny part of all the water on Earth is fresh water that we can drink! Most of it is salty ocean water.\n\n<h3>Why Is This a Big Deal?</h3>\n\nWhen a lot of water leaks away, it means there's less water for everyone to use. This can make life a bit harder for the people in the town. Less water means sometimes taps might run dry, or the water might not always be there when you need it for a drink.\n\nIt means less water for brushing your teeth, for washing clothes, and for flushing the toilet. Imagine having no water for your morning routine! Plants and gardens also need water to grow strong and healthy. If there's less water, they might struggle and not grow as well.\n\nAnd animals, big and small, need water to survive too! Every living thing needs water, just like we need air to breathe. So, losing water from leaky pipes is a big problem because it affects everyone and everything in the town. We all depend on water.\n\nDid you know? Your body is mostly made of water! That's why drinking water every day is super important for you to be healthy and have lots of energy!\n\n<h3>What Are Grown-Ups Doing?</h3>\n\nThe good news is that grown-ups, like engineers and town helpers, know about this problem and are working hard to fix it! They are like water detectives, looking for all those hidden leaks underground.\n\nThey use special tools to listen for the sound of water leaking or to see where the ground is wetter than it should be. This helps them find the exact spot where a pipe is broken. Once they find a leaky pipe, they dig it up carefully and replace the old, broken part with a strong, new pipe.\n\nThis takes a lot of time and effort, but it's super important to make sure every drop of water gets where it needs to go. They are working hard to make sure our future is full of enough water for everyone to drink, play, and grow. They are doing their best to mend the leaks and make the water system strong again.\n\n<h3>What Can YOU Do to Help?</h3>\n\nEven though grown-ups are fixing the pipes, there's something super important that YOU, my amazing young heroes, can do to help! Every drop of water saved at home helps the whole town and our beautiful country. You can make a big difference!\n\nHere are some easy ways you can be a water saver:\n\n*   **Turn off the tap!** When you brush your teeth, don't let the water run. Turn it off and only turn it on when you need to rinse. Every minute counts!\n*   **Short showers!** Try to take quick showers instead of long ones. Maybe sing your favourite song once and then finish up!\n*   **Report leaks!** If you see a dripping tap at home, at school, or outside, tell a grown-up right away. You're like a leak detective!\n*   **Use a cup!** When you wash your face, use a cup of water instead of letting the tap run. It saves so much water!\n*   **Collect rainwater!** If it rains, you can collect some water in a bucket to water plants or wash things outside. It's free water!\n*   **Don't play with water!** It's fun, but playing with hosepipes or letting taps run just for fun wastes a lot of water that others might need.\n\nDid you know? Turning off the tap while brushing your teeth can save about 8 cups of water every single time!\n\nDid you know? A bath can use three times more water than a quick shower! So, quick showers are super water-friendly!\n\n<h3>Let's All Be Water Heroes!</h3>\n\nSee? Every little thing you do helps a lot! You are all part of the solution to keep our beautiful Africa full of water. By saving water, we're not just helping our town; we're helping all the plants, animals, and people around us.\n\nLet's work together, grown-ups and kids, to make sure our water stays safe and sound, flowing freely for many, many years to come. Remember, water is life, and every drop counts! Go forth and be amazing water heroes!",
    "summary": "A beautiful town in South Africa is losing more than half of its clean water because of leaky pipes underground, but grown-ups are fixing them, and kids can help by saving water every day.",
    "whyMatters": "It matters because water is super important for everyone to drink, wash, and for plants and animals to live, so we need to make sure we don't waste any precious drops.",
    "category": "world",
    "date": "2026-02-04T11:31:08.115Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Water%20Story%3A%20Saving%20Every%20Precious%20Drop!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-water-story-saving-every-precious-drop",
    "originalLink": "https://www.bbc.com/news/articles/cy8pleg24rvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gorton and Denton by-election tests Labour’s grip on heartland voters",
    "title": "Gorton and Denton by-election tests Labour’s grip on heartland voters",
    "content": "Internal rifts, growing support for smaller parties are challenging Labour's dominance in Greater Manchester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-04T11:31:13.409Z",
    "image": "https://image.pollinations.ai/prompt/Gorton%20and%20Denton%20by-election%20tests%20Labour%E2%80%99s%20grip%20on%20heartland%20voters%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gorton-and-denton-by-election-tests-labours-grip-on-heartland-voters",
    "originalLink": "https://www.aljazeera.com/news/2026/2/4/gorton-and-denton-by-election-tests-labours-grip-on-heartland-voters?traffic_source=rss"
  },
  {
    "originalTitle": "‘Health crime’: Aoun slams Israel over spraying chemicals in south Lebanon",
    "title": "‘Health crime’: Aoun slams Israel over spraying chemicals in south Lebanon",
    "content": "Lebanese president says latest 'aggression' represents an environmental crime and a violation of country's sovereignty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:18.575Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Health%20crime%E2%80%99%3A%20Aoun%20slams%20Israel%20over%20spraying%20chemicals%20in%20south%20Lebanon%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "health-crime-aoun-slams-israel-over-spraying-chemicals-in-south-lebanon",
    "originalLink": "https://www.aljazeera.com/news/2026/2/4/health-crime-aoun-slams-israel-over-spraying-chemicals-in-south-lebanon?traffic_source=rss"
  },
  {
    "originalTitle": "A simple guide to playing cricket",
    "title": "A simple guide to playing cricket",
    "content": "Cricket is among the most popular sports globally. Al Jazeera explains key terms to help you understand the game.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:23.745Z",
    "image": "https://image.pollinations.ai/prompt/A%20simple%20guide%20to%20playing%20cricket%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-simple-guide-to-playing-cricket",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/4/a-simple-guide-to-playing-cricket?traffic_source=rss"
  },
  {
    "originalTitle": "Russian attacks on Ukraine energy sites 'particularly depraved', UK PM Starmer says",
    "title": "Russian attacks on Ukraine energy sites 'particularly depraved', UK PM Starmer says",
    "content": "The UK leader's comments came after Russia renewed its attacks on power plants and critical infrastructure in Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:29.432Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20attacks%20on%20Ukraine%20energy%20sites%20'particularly%20depraved'%2C%20UK%20PM%20Starmer%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-attacks-on-ukraine-energy-sites-particularly-depraved-uk-pm-starmer-says",
    "originalLink": "https://www.bbc.com/news/articles/crley6x0dgzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli strikes kill 17 in Gaza, hospitals say, after soldier wounded by gunfire",
    "title": "Israeli strikes kill 17 in Gaza, hospitals say, after soldier wounded by gunfire",
    "content": "Hospitals say six children were among those killed in strikes that Israel's military says it launched after a gun attack on its troops.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:34.596Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20strikes%20kill%2017%20in%20Gaza%2C%20hospitals%20say%2C%20after%20soldier%20wounded%20by%20gunfire%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-strikes-kill-17-in-gaza-hospitals-say-after-soldier-wounded-by-gunfire",
    "originalLink": "https://www.bbc.com/news/articles/cpqyg0g5r0po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Painful times in my marriage' - Melinda French Gates reacts to ex-husband in Epstein files",
    "title": "'Painful times in my marriage' - Melinda French Gates reacts to ex-husband in Epstein files",
    "content": "She said her ex-husband and others named in the Epstein files need to answer whatever questions remain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-04T11:31:39.758Z",
    "image": "https://image.pollinations.ai/prompt/'Painful%20times%20in%20my%20marriage'%20-%20Melinda%20French%20Gates%20reacts%20to%20ex-husband%20in%20Epstein%20files%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "painful-times-in-my-marriage-melinda-french-gates-reacts-to-ex-husband-in-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cr4kyk9nv5lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Years in the making' - are Arsenal ready to shed 'nearly-men' tag?",
    "title": "'Years in the making' - are Arsenal ready to shed 'nearly-men' tag?",
    "content": "Arsenal have moved a step closer to winning their first major silverware since 2020 by beating Chelsea 4-2 on aggregate in the Carabao Cup semi-final.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:45.184Z",
    "image": "https://image.pollinations.ai/prompt/'Years%20in%20the%20making'%20-%20are%20Arsenal%20ready%20to%20shed%20'nearly-men'%20tag%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "years-in-the-making-are-arsenal-ready-to-shed-nearly-men-tag",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckgv072m7pro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chelsea adopt Match of the Day tactic to stop Arsenal set-piece threat",
    "title": "Chelsea adopt Match of the Day tactic to stop Arsenal set-piece threat",
    "content": "Despite losing their Carabao Cup semi-final, Chelsea attempted a new way of stopping Arsenal set-pieces - just days after a similar suggestion on Match of the Day.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:50.375Z",
    "image": "https://image.pollinations.ai/prompt/Chelsea%20adopt%20Match%20of%20the%20Day%20tactic%20to%20stop%20Arsenal%20set-piece%20threat%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chelsea-adopt-match-of-the-day-tactic-to-stop-arsenal-set-piece-threat",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgk8v88gjxno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Playing with fire' catches up with 10-man Hearts - McInnes",
    "title": "'Playing with fire' catches up with 10-man Hearts - McInnes",
    "content": "Head coach Derek McInnes concedes that Premiership leaders Hearts were punished for \"playing with fire\" as a third red card in five matches contributes to a 1-0 defeat at St Mirren.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-04T11:31:55.536Z",
    "image": "https://image.pollinations.ai/prompt/'Playing%20with%20fire'%20catches%20up%20with%2010-man%20Hearts%20-%20McInnes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "playing-with-fire-catches-up-with-10-man-hearts-mcinnes",
    "originalLink": "https://www.bbc.com/sport/football/articles/c2lg4r8r7qlo?at_medium=RSS&at_campaign=rss"
  }
]