[
  {
    "originalTitle": "Dozens of Muslims 'massacred' in Nigeria for refusing to join jihadists, says governor",
    "title": "Hearts Are Sad in Nigeria: A Story of Bravery and Hope",
    "content": "Hi everyone! It's your kid-friendly reporter here, bringing you news from our beautiful continent, Africa. Today, we need to talk about something sad that happened in a country called Nigeria.\n\nNigeria is a big, vibrant place, full of wonderful people, just like you! But sometimes, sad things happen, and it's important to talk about them, so we can understand and hope for a better future.\n\nA lot of people in Nigeria are feeling very, very sad right now. Some bad grown-ups did something not kind at all. They hurt many people who were simply living their lives and believing in peace.\n\nThis story is about those brave people and why we need to send them all our love and wishes for peace.\n\n<h3>What Happened in Nigeria?</h3>\nImagine a group of people living happily in their homes. These people are called Muslims. They follow a religion called Islam, which teaches them to be kind and peaceful.\n\nBut then, some other grown-ups, who are very different, came. We can call them 'troublemakers' because they caused a lot of problems.\n\nThese troublemakers wanted the good people to join their group and do bad things. But the good people, who loved peace, said, 'No, thank you! We want to live in peace and follow our own hearts.' They were very brave to say no!\n\nBecause the good people said no, the troublemakers got very angry. And sad to say, they hurt many, many of these kind people. It was a very sad day in their town. Many good people lost their lives because they stood up for what they believed in.\n\nDid you know? Nigeria is the most populous country in Africa! That means many, many people live there.\n\nThe grown-ups in charge, like the Governor who helps run the state, told everyone how sad this was. They said that many people lost their lives. We hear that around 78 people were buried, which means they said goodbye to their loved ones.\n\nAnd there are worries that even more people, maybe as many as 170 people, were hurt or lost their lives. That's like losing everyone in many, many classrooms at your school. It's a very big number, and it makes our hearts ache.\n\nThese were mothers, fathers, sisters, brothers, and friends. All of them just wanted to live in peace.\n\n<h3>Who Are These People?</h3>\nThe people who were hurt are kind, regular people. They are Muslims. Muslims believe in one God, Allah, and they pray for peace and love. Their religion teaches them to be good neighbours and to care for everyone.\n\nThe troublemakers who caused this harm do not represent what Islam truly teaches. True Islam is about peace, kindness, and helping others. It's like how a bad apple doesn't mean all apples are bad! These bad grown-ups are not following the true path of peace.\n\nMany families are now left without their loved ones. Children might be missing their parents, and parents might be missing their children. It's a time when everyone needs to hold hands and comfort each other.\n\nDid you know? Islam is a religion followed by people all over the world, not just in Africa! It teaches important values like charity, respect, and peace.\n\nThe Governor of the place where this happened is trying to help. A Governor is like a very important leader who tries to keep everyone safe and happy in their state. He is sad, too, and wants justice for the people who were hurt. He wants to make sure this kind of sadness doesn't happen again.\n\nIt’s important to remember that most people in Nigeria, and most Muslims everywhere, are kind, loving, and want peace. These sad events are caused by a very small group of people who choose to do bad things.\n\n<h3>Why Did This Sadness Happen?</h3>\nSometimes, bad people try to force others to think and act exactly like them. They don't like it when people are different or have different ideas. They might try to scare people into joining their groups.\n\nBut the good people in Nigeria were brave. They didn't want to be part of a group that hurts others. They chose to follow their own beliefs, which are about kindness and peace. And because they chose peace, the troublemakers got angry and did something very sad.\n\nIt shows us how important it is to always be brave when someone asks you to do something you know is wrong. Even grown-ups can be brave and stand up for what is right, just like these people did.\n\nDid you know? Standing up for what you believe in, even when it's hard, is called courage!\n\n<h3>What Can We Do and Hope For?</h3>\nWhen sad things happen, it's natural to feel a little worried or sad ourselves. But it's also important to remember that there is always hope. Hope for peace, hope for kindness, and hope that everyone can live safely in their homes.\n\nWe can send our good thoughts and prayers to the families in Nigeria who are hurting. We can think about them and wish for them to find comfort and strength.\n\nWe can also learn from this story. We can learn to always be kind to everyone, no matter what they look like, where they come from, or what religion they follow. We can choose to be friends with everyone and help make our world a peaceful place.\n\nLet's all hope that the troublemakers stop their bad ways and that peace comes back to Nigeria very, very soon. Our hearts are with all the people in Nigeria.\n\nDid you know? Sharing kindness can make a big difference! Even a smile or a kind word can brighten someone's day.\n\nAfrica is a continent of many beautiful stories and brave people. This sad news reminds us that we must always work towards a world where everyone is safe and happy. Let's promise to be little helpers of peace in our own lives, every single day.\n\nThank you for listening, and remember to always choose kindness!",
    "summary": "In Nigeria, many kind people were hurt and lost their lives because they bravely chose peace instead of joining troublemakers, making everyone sad but also hopeful for peace.",
    "whyMatters": "This is important because it shows us that we must always be kind, stand up for what is right, and help make sure everyone can live safely and peacefully, remembering that true peace comes from good choices.",
    "category": "world",
    "date": "2026-02-06T12:48:47.752Z",
    "image": "https://image.pollinations.ai/prompt/Hearts%20Are%20Sad%20in%20Nigeria%3A%20A%20Story%20of%20Bravery%20and%20Hope%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hearts-are-sad-in-nigeria-a-story-of-bravery-and-hope",
    "originalLink": "https://www.bbc.com/news/articles/ckgvllk3lx9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Fisherman fleeing elephants killed by crocodile in Zambia  ",
    "title": "Fisherman fleeing elephants killed by crocodile in Zambia  ",
    "content": "The fisherman ran into a stream near the river after he and two friends encountered a herd of elephants.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:48:52.898Z",
    "image": "https://image.pollinations.ai/prompt/Fisherman%20fleeing%20elephants%20killed%20by%20crocodile%20in%20Zambia%20%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fisherman-fleeing-elephants-killed-by-crocodile-in-zambia",
    "originalLink": "https://www.bbc.com/news/articles/czx1xl98qkpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At the scene: Muslims killed 'over rejection of extremist ideology' in Nigeria",
    "title": "At the scene: Muslims killed 'over rejection of extremist ideology' in Nigeria",
    "content": "At least 78 bodies have been buried, while it's feared that more than 170 people were killed altogether.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:48:58.017Z",
    "image": "https://image.pollinations.ai/prompt/At%20the%20scene%3A%20Muslims%20killed%20'over%20rejection%20of%20extremist%20ideology'%20in%20Nigeria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-the-scene-muslims-killed-over-rejection-of-extremist-ideology-in-nigeria",
    "originalLink": "https://www.bbc.com/news/videos/czej7xpx0x9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hundreds of thousands flee as fighting escalates in South Sudan",
    "title": "Hundreds of thousands flee as fighting escalates in South Sudan",
    "content": "A 2018 peace deal in South Sudan is unravelling, as government and opposition fighting escalates.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:49:03.275Z",
    "image": "https://image.pollinations.ai/prompt/Hundreds%20of%20thousands%20flee%20as%20fighting%20escalates%20in%20South%20Sudan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hundreds-of-thousands-flee-as-fighting-escalates-in-south-sudan",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/6/hundreds-of-thousands-flee-as-fighting-escalates-in-south-sudan?traffic_source=rss"
  },
  {
    "originalTitle": "Israel’s war on Gaza’s healthcare continues in full force under ‘ceasefire’",
    "title": "Brave Helpers in a Faraway Land: The Story of Gaza",
    "content": "Hello, my dear friends!\n\nToday, we are talking about a place far, far away.\n\nIt is called Gaza. Can you say Gaza? (Gah-zah)\n\nIt is a place where many children, just like you, live.\n\nAnd many grown-ups too.\n\nSometimes, we hear sad news from places far away.\n\nWe want to understand it simply.\n\nImagine you fall down and get a big boo-boo.\n\nWhere do you go? To a hospital, right?\n\nHospitals are special places.\n\nThey are places where super helpers work.\n\nThese helpers are called medics.\n\nMedics are doctors, nurses, and ambulance drivers.\n\nThey wear special clothes.\n\nThey have special tools to help you feel better.\n\nThey help when you are sick.\n\nThey help when you are hurt.\n\nThey want everyone to be healthy and strong.\n\n<h3>The Brave Helpers of Gaza</h3>\n\nIn Gaza, there are many brave medics.\n\nThey are like superheroes without capes.\n\nThey go to work every day.\n\nThey want to help people.\n\nEven when it is very hard.\n\nImagine being very brave.\n\nThat is what the medics in Gaza are.\n\nThey are doctors who help children.\n\nThey are nurses who give medicine.\n\nThey are ambulance drivers who take people to the hospital fast.\n\nThey work very, very hard.\n\nThey try to make everyone better.\n\nDid you know? Doctors and nurses train for many years to learn how to help people! They learn all about the human body. They learn how to make boo-boos go away. They learn how to make sick tummies feel better. It is a very important job.\n\n<h3>Hospitals Need Help Too</h3>\n\nHospitals need to be safe places.\n\nThey need to have lights.\n\nThey need to have water.\n\nThey need to have medicine.\n\nThey need to have clean beds.\n\nBut in Gaza, hospitals are having a very hard time.\n\nIt is very difficult for them to work.\n\nSometimes, they don't have enough electricity.\n\nImagine trying to read a book in the dark.\n\nIt is even harder for doctors to help people in the dark.\n\nSometimes, they don't have enough medicine.\n\nOr bandages for boo-boos.\n\nThis makes it very sad.\n\nIt makes it hard for the brave medics.\n\nThey want to help.\n\nBut sometimes they cannot.\n\nDid you know? The first hospitals were built a very, very long time ago! People have always wanted to help each other when they are sick or hurt. Many countries in Africa have hospitals too, where kind doctors and nurses help people every day.\n\n<h3>Many People Need Care</h3>\n\nMany children and grown-ups in Gaza are not feeling well.\n\nSome are sick with coughs or fevers.\n\nSome have big boo-boos from accidents.\n\nThey need to see a doctor.\n\nThey need medicine to feel better.\n\nBut it is hard for them to get help.\n\nThere are many, many people who need help.\n\nImagine a whole school full of children.\n\nNow imagine many, many schools full of children and grown-ups.\n\nThat is how many people need help.\n\nThey cannot easily go to the hospital.\n\nThey cannot easily find a doctor.\n\nThis is called being \"trapped without treatment.\"\n\nIt means they are stuck.\n\nThey cannot get the care they need.\n\nTheir boo-boos might not get better.\n\nThey might feel sick for a long time.\n\nDid you know? Your body is very clever! It tries to heal itself when you get a small cut or feel a little sick. But for bigger boo-boos or serious sickness, doctors and medicine are very important helpers. Eating healthy food and playing outside also helps you stay strong!\n\n<h3>What is a 'Ceasefire'?</h3>\n\nSometimes, grown-ups fight.\n\nWhen people fight in a place, it is called a war.\n\nWar makes many things broken.\n\nIt makes people sad.\n\nA \"ceasefire\" is when people agree to stop fighting.\n\nIt means they say, \"Let's stop hurting each other for a little while.\"\n\nIt is like saying, \"Time out!\" during a game.\n\nEveryone hopes a ceasefire will bring peace.\n\nBut in Gaza, even when there is a ceasefire, things are still very hard.\n\nHospitals are still having trouble.\n\nMedics are still trying their best.\n\nBut it is very hard to fix everything quickly.\n\nThe effects of fighting stay for a long time.\n\nSo, even with a promise to stop fighting, brave medics and sick people are still struggling.\n\nThey still need a lot of help.\n\nThey still need things to get better.\n\n<h3>Why This Matters So Much</h3>\n\nEvery child and every grown-up deserves to be healthy.\n\nEvery person deserves to feel safe.\n\nHospitals should always be safe places.\n\nDoctors and nurses should always be safe too.\n\nThey are there to help everyone.\n\nWhen hospitals cannot work, many people suffer.\n\nWhen doctors cannot help, many people stay sick.\n\nThis makes us feel sad.\n\nIt reminds us that peace is very important.\n\nIt reminds us that helping each other is very important.\n\nWe all want people in Gaza to be safe.\n\nWe all want them to get the help they need.\n\nJust like we would want for ourselves.\n\nOr for our friends and family.\n\nDid you know? Many wonderful people and groups around the world try to help places like Gaza. They send food, medicine, and blankets. They want to make sure everyone has what they need to live safely and healthily. It shows how caring people can be!\n\n<h3>Wishing for Peace and Care</h3>\n\nWe hope that soon, the brave medics in Gaza will have everything they need.\n\nWe hope that all the children and grown-ups there can get well.\n\nWe hope that hospitals will be strong and full of good things.\n\nWe hope for peace for everyone in Gaza.\n\nPeace means no more fighting.\n\nPeace means everyone can play and learn and live happily.\n\nWe can all wish for this.\n\nWe can all be kind to each other.\n\nAnd we can all appreciate our own doctors and nurses.\n\nThey are special helpers everywhere.\n\nSo, remember our friends in Gaza.\n\nThey are facing a tough time.\n\nBut there are brave helpers there.\n\nAnd we can send them our kind thoughts.\n\nWe can hope for a brighter, healthier future for them.\n\nThank you for listening, my friends.\n\nLet's always remember to be kind and helpful.",
    "summary": "Brave doctors and nurses in Gaza are working very hard to help many sick and hurt people, but their hospitals need more help and supplies to keep everyone safe and healthy.",
    "whyMatters": "It is important because everyone, especially children, deserves to be healthy and safe, and we should care about people in faraway places who are having a difficult time getting help.",
    "category": "world",
    "date": "2026-02-06T12:49:30.318Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Helpers%20in%20a%20Faraway%20Land%3A%20The%20Story%20of%20Gaza%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-helpers-in-a-faraway-land-the-story-of-gaza",
    "originalLink": "https://www.aljazeera.com/opinions/2026/2/6/israels-war-on-gazas-healthcare-continues-in-full-force-under-ceasefire?traffic_source=rss"
  },
  {
    "originalTitle": "Dozens killed in suicide bomb attack at Pakistan mosque",
    "title": "Dozens killed in suicide bomb attack at Pakistan mosque",
    "content": "A suicide bombing during Friday prayers at a Shia mosque in Pakistan’s capital Islamabad has killed dozens of people.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:49:35.440Z",
    "image": "https://image.pollinations.ai/prompt/Dozens%20killed%20in%20suicide%20bomb%20attack%20at%20Pakistan%20mosque%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "dozens-killed-in-suicide-bomb-attack-at-pakistan-mosque",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/6/dozens-killed-in-suicide-bomb-attack-at-pakistan-mosque?traffic_source=rss"
  },
  {
    "originalTitle": "US and Iran hold talks as fears of direct conflict continue",
    "title": "US and Iran hold talks as fears of direct conflict continue",
    "content": "The US has built up its military presence in the Middle East in response to Iran's violent crackdown on protests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:49:40.979Z",
    "image": "https://image.pollinations.ai/prompt/US%20and%20Iran%20hold%20talks%20as%20fears%20of%20direct%20conflict%20continue%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-and-iran-hold-talks-as-fears-of-direct-conflict-continue",
    "originalLink": "https://www.bbc.com/news/articles/cr57g1y8286o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 30 killed in blast at Pakistan mosque, officials say",
    "title": "More than 30 killed in blast at Pakistan mosque, officials say",
    "content": "The cause of the explosion was not immediately clear, however reports have suggested it was carried out by a suicide bomber.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:49:46.103Z",
    "image": "https://image.pollinations.ai/prompt/More%20than%2030%20killed%20in%20blast%20at%20Pakistan%20mosque%2C%20officials%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-than-30-killed-in-blast-at-pakistan-mosque-officials-say",
    "originalLink": "https://www.bbc.com/news/articles/cg7y7gz2835o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russian general shot several times in Moscow",
    "title": "Russian general shot several times in Moscow",
    "content": "Lt Gen Vladimir Alexeyev is a senior figure in the main directorate of Russia's military general staff.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-06T12:49:51.222Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20general%20shot%20several%20times%20in%20Moscow%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-general-shot-several-times-in-moscow",
    "originalLink": "https://www.bbc.com/news/articles/c3686nzexp3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "From £70 a week to brink of Premier League record 24 years later",
    "title": "From £70 a week to brink of Premier League record 24 years later",
    "content": "James Milner will equal the Premier League appearance record if he features for Brighton on Sunday, 24 years after making his debut as a 16-year-old.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:49:56.636Z",
    "image": "https://image.pollinations.ai/prompt/From%20%C2%A370%20a%20week%20to%20brink%20of%20Premier%20League%20record%2024%20years%20later%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "from-pound70-a-week-to-brink-of-premier-league-record-24-years-later",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvgvq6xqnl4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How Casemiro revived his Man Utd career",
    "title": "How Casemiro revived his Man Utd career",
    "content": "Casemiro's Manchester United career looked to be petering out, but the veteran midfielder has found a return to form this season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:50:01.766Z",
    "image": "https://image.pollinations.ai/prompt/How%20Casemiro%20revived%20his%20Man%20Utd%20career%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-casemiro-revived-his-man-utd-career",
    "originalLink": "https://www.bbc.com/sport/articles/cx2gwlymxego?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Why young British managers need lower league experience'",
    "title": "'Why young British managers need lower league experience'",
    "content": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains why he thinks there is a negative reaction to British managers when they get jobs in the Premier League - and the path young coaches should take.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-06T12:50:06.883Z",
    "image": "https://image.pollinations.ai/prompt/'Why%20young%20British%20managers%20need%20lower%20league%20experience'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-young-british-managers-need-lower-league-experience",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn7j0p61n80o?at_medium=RSS&at_campaign=rss"
  }
]