[
  {
    "originalTitle": "Nigeria police confirm mass church abductions after previous denial",
    "title": "Missing Friends: Police Are Helping in Nigeria",
    "content": "<h3>Hello from Kids News Africa!</h3>\nHello, super friends! Welcome to Kids News Africa! I'm your friendly reporter, ready to share important news with you.\n\nToday, we're talking about something that happened in a big, beautiful country called Nigeria. Nigeria is right here in Africa, just like many of our homes!\n\nSometimes, sad things happen, but it's good to learn about them. And it's even better to know that many people are working to help.\n\n<h3>What Happened in Nigeria?</h3>\nIn a place in Nigeria called Kaduna, something not-so-nice happened. Many grown-ups and some children were at their churches.\n\nA church is a special building where people go to pray. They sing happy songs and listen to good stories. It's a place where friends and families meet up.\n\nOne day, some people came and took over 160 people away from three churches. This means many moms, dads, grandmas, and even some kids were taken.\n\nThis made many people feel very sad and worried. It's okay to feel that way when something like this happens.\n\nThe people who were taken are called \"missing\" right now. Everyone wants them to come home safely.\n\n<h3>What is a Church?</h3>\nLet's talk a little more about churches. Imagine a big house where many people gather.\n\nThey go there on special days, often on Sundays. It's a time to be together and think about good things.\n\nPeople often dress up nicely to go to church. They share smiles and hugs with their friends there.\n\nChurches are usually places of peace and kindness. They are meant to make people feel safe and loved.\n\nSo, it was very unusual and upsetting that people were taken from these special places.\n\n<h3>Police are Helping!</h3>\nWhen something like this happens, brave people step up to help. Guess who? The police!\n\nThe police are like super helpers in our towns and cities. They wear special uniforms and drive special cars.\n\nTheir job is to keep everyone safe. They also help find people who are missing.\n\nIn Nigeria, the police heard about the people taken from the churches. They said, \"We will find them!\"\n\nThe police are working very hard, day and night. They are looking everywhere for the missing people.\n\nThey are talking to people and following clues. They want to bring all the moms, dads, and kids back home.\n\nIt's a big job, but police officers are very strong and dedicated.\n\nThey are telling everyone that they are trying their best. We hope they find everyone very soon.\n\n<h3>How We Stay Safe</h3>\nIt's normal to feel a little bit worried when you hear news like this. But remember, most places are safe.\n\nOur grown-ups, like our parents and teachers, work hard to keep us safe every day.\n\nIf you ever feel scared or worried, it's always good to talk to a trusted adult. They can help you understand.\n\nThey can give you a hug and tell you that everything will be okay. Talking helps us feel better.\n\nAlways remember to stay close to your grown-ups when you are out. And listen to what they say.\n\nOur communities also look out for each other. Neighbors help neighbors, and friends help friends.\n\nThat's a very important way we keep each other safe and happy.\n\n<h3>Did You Know?</h3>\nDid you know Nigeria is the most populated country in Africa? Many, many people live there!\n\nDid you know that police officers train very hard? They learn how to solve mysteries and help people in trouble.\n\nDid you know that churches are not just for praying? They also help people in need, like sharing food or clothes.\n\nDid you know Africa is the second-largest continent in the world? It has many different countries and cultures!\n\nDid you know that when people work together, they can do amazing things? Like finding missing people!\n\nThese facts remind us that we live in a big, busy world with lots of helpers.\n\n<h3>Working Together</h3>\nEven though this is a sad story, it shows us how important it is for people to work together.\n\nThe police are working. The government is working. And families and friends are all hoping.\n\nWhen a whole community comes together, their voices are very strong. They can ask for help.\n\nThey can share information and support each other during difficult times.\n\nPeople from all over the world are sending good thoughts to Nigeria.\n\nThey want the missing people to return home to their families and their churches.\n\nThis teamwork makes us stronger. It shows we care about each other.\n\n<h3>Sending Good Thoughts</h3>\nSo, let's all send our best wishes to the people of Nigeria.\n\nWe hope that the police find all the missing people very, very soon.\n\nWe hope they can go back to their homes and their special churches.\n\nRemember, even when sad things happen, there are always good people trying to help.\n\nKeep smiling, keep playing, and keep sharing kindness with everyone you meet.\n\nThat's all for today from Kids News Africa. See you next time, super friends!",
    "summary": "Many people went missing from churches in Nigeria, and police are working hard to bring them home.",
    "whyMatters": "This story is important because it shows how brave police and kind communities work together to help people who need them and to keep everyone safe.",
    "category": "world",
    "date": "2026-01-21T14:26:23.420Z",
    "image": "https://image.pollinations.ai/prompt/Missing%20Friends%3A%20Police%20Are%20Helping%20in%20Nigeria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "missing-friends-police-are-helping-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
    "title": "A Special Friend in Uganda Needs Care",
    "content": "Hello, my wonderful friends! I'm your Kid-Friendly News Reporter for Africa, and today we have some news from a beautiful country called Uganda. Have you heard of Uganda? It's a land of amazing animals and kind people! Today, we are talking about a very special person in Uganda named Dr. Kizza Besigye. He is like a big leader, someone who tries to help many people in his country.\n\nDr. Kizza Besigye is a grown-up who has helped Uganda for a very long time. He cares about everyone and works hard to make things better for families, for schools, and for the whole country. Think of him like a wise elder or a very helpful teacher, but for the whole country! He wants everyone in Uganda to have a good life. He speaks up for what he believes is right, just like you might speak up for your friend on the playground. Because he is a leader, many people listen to him and care about him very much.\n\n<h3>A Trip to the Hospital</h3>\nNow, something important happened recently. Dr. Kizza Besigye went to the hospital. Do you know what a hospital is? It's a very important building where special doctors and nurses work. They are like superheroes with stethoscopes! They help people when they are not feeling well or when they need to check if everything is okay inside their bodies.\n\nWhen you get a small cut, your mum or dad might put a bandage on it. But if you have a tummy ache that won't go away, or if you fall and hurt your leg, a doctor at the hospital can help you feel better. Hospitals are places of healing and care, where everyone can get help.\n\n<h3>Two Different Stories</h3>\nWhen Dr. Kizza Besigye went to the hospital, his friends shared a story. They said he was very, very sick. They used a big word, 'critical.' This means he needed a lot of help from the doctors and nurses right away. It means he was not feeling well at all, and they were very worried about him.\n\nBut then, the people who work for the government, we call them 'authorities,' told a different story. They said that Dr. Kizza Besigye was not very sick. They said he was just at the hospital for a 'routine check-up.' What does that mean?\n\nIt means going to the doctor even when you feel okay, just to make sure everything is fine. Like when you go to the dentist to check your teeth, even if they don't hurt! So, we have two stories: one saying he was very sick, and another saying it was just a regular visit.\n\n<h3>What is a 'Party'?</h3>\nYou might hear the word 'party' when we talk about Dr. Kizza Besigye. But wait, it's not a birthday party with cake and balloons! In countries, a 'party' can mean a group of people who all think the same about how to make the country better.\n\nThey work together, like a big team, to help people and solve problems. Dr. Kizza Besigye has a 'party' of friends who work with him to help Uganda. So when his 'party' talks, it means his team of friends is talking about what they believe is important for the country.\n\n<h3>What are 'Authorities'?</h3>\nAnd who are the 'authorities'? These are the people who help run the country. They are like the big grown-ups who make sure the rules are followed, and things work smoothly. Think of your school principal or your community leaders. They help keep things safe and organized.\n\nSo, when the 'authorities' speak, it's usually the government officials or police, who are in charge of certain things in Uganda. They have important jobs to do to keep everyone safe and everything running well.\n\n<h3>Did You Know? About Doctors and Hospitals!</h3>\nDid you know that doctors and nurses are super important? They spend many, many years studying to learn how to help our bodies stay healthy. They know all about your heart, your brain, your bones, and everything inside you! It takes a lot of hard work to become a doctor or a nurse.\n\nDid you know that hospitals in Africa, like in Uganda, have lots of amazing equipment? They have special machines that can look inside your body without even touching you, like taking a picture of your bones if you fall! And they have medicines to help you feel better when you are sick or when you have an infection.\n\nDid you know that it's important to drink clean water and eat healthy food to help your body stay strong? When you eat your vegetables and fruits, you are helping your body fight off sickness, so you might not need to visit the hospital as often! Stay healthy, my friends!\n\n<h3>Why is it Important to Be Healthy?</h3>\nBeing healthy is super important for everyone! When you are healthy, you can run and play with your friends, you can learn new things at school, and you can help your family at home. When leaders like Dr. Kizza Besigye are healthy, they can do their important work of helping the country. They need lots of energy!\n\nEveryone needs to take care of themselves, eat good food, and sometimes visit the doctor, even if it's just a check-up. Taking care of our bodies is like taking care of a very special car – it needs regular care to run well and stay strong for a long time.\n\n<h3>What is a 'Check-Up'?</h3>\nLet's talk a little more about a 'routine check-up.' Imagine your bicycle. Sometimes, you take it to a mechanic just to make sure the tires are good, the chain is not rusty, and the brakes work well, even if nothing feels broken. That's like a check-up for your body!\n\nA doctor looks at you, listens to your heart, checks your breathing, and asks how you are feeling. They do this to make sure you are growing well and that there are no tiny problems hiding that could become big problems later. It’s a very smart thing to do to stay strong and healthy for a long time!\n\n<h3>Taking Care of Our Leaders</h3>\nIt's important that leaders like Dr. Kizza Besigye are well taken care of, especially when they are older. Just like your grandparents or older relatives, they sometimes need a little extra help or more regular visits to the doctor. They have worked hard for many years!\n\nWhen our leaders are strong and healthy, they can continue to work hard for the people of Uganda. We want all our leaders to be happy and healthy so they can keep making good decisions for everyone in the country, especially for children and their future.\n\n<h3>Uganda, Our Beautiful Home</h3>\nUganda is a truly amazing country. It has big lakes, green mountains, and incredible wildlife like gorillas and elephants! The people of Uganda are known for being friendly and welcoming. It's a country full of hope and hard-working people.\n\nWhen we talk about Dr. Kizza Besigye, we remember that he loves Uganda very much, and he wants the best for all its people, especially the children. It's important to care for our country and the people who lead it.\n\n<h3>Let's Hope for the Best!</h3>\nSo, even though we heard two different stories about why Dr. Kizza Besigye was in the hospital, we all wish him well. Whether it was for a big sickness or just a simple check-up, we hope he is feeling strong and healthy very soon. Let's send positive thoughts to him and all the people in Uganda.\n\nTaking care of each other, and especially our leaders, is very important. Stay healthy, my friends, and remember to always be kind and look out for one another!",
    "summary": "A leader in Uganda named Dr. Kizza Besigye went to the hospital, and while some people say he was very sick, others say it was just for a regular check-up, but everyone hopes he gets well soon.",
    "whyMatters": "It matters because when our leaders are healthy, they can do their important work for the country, and it's good for everyone to know that they are being cared for so they can continue to help make things better.",
    "category": "technology",
    "date": "2026-01-21T14:26:51.743Z",
    "image": "https://image.pollinations.ai/prompt/A%20Special%20Friend%20in%20Uganda%20Needs%20Care%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-special-friend-in-uganda-needs-care",
    "originalLink": "https://www.bbc.com/news/articles/c5y2q5j71pqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "title": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "content": "Paul-Henri Sandaogo Damiba has not commented on the accusations from Burkina Faso.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:26:56.922Z",
    "image": "https://image.pollinations.ai/prompt/Ex-president%20accused%20of%20murder%20plot%20expelled%20from%20Togo%20to%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ex-president-accused-of-murder-plot-expelled-from-togo-to-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Greenland’s strategic position in seven maps: Why Trump wants the island",
    "title": "Greenland: The Giant Ice Island!",
    "content": "<h3>Hello, Friends from Africa!</h3>\nHi, amazing friends from all over Africa! It's your friendly news reporter here. Today, we're going on a super exciting adventure to a place very, very far from our warm homes.\n\nImagine a giant island, mostly covered in sparkling white ice! That's Greenland! Even though it's called 'Greenland,' it's mostly white with snow and ice, not green at all. Isn't that a funny trick? It's like calling a big red apple a 'blue apple'! Let's learn all about this fascinating place.\n\n<h3>Meet Greenland: The Giant Island!</h3>\nGreenland is not just any island. It is the BIGGEST island in the WHOLE wide world! Can you imagine something bigger than many countries put together? That's Greenland!\n\nIt's so enormous, it's bigger than many, many countries you might know. If you wanted to travel from one side of Greenland to the other, it would take you a very, very long time! It's like a super-duper large puzzle piece that makes up our amazing Earth.\n\nMost of this giant puzzle piece is white and icy, not green at all! What a funny name for such a cold place, don't you think?\n\nDid you know?\nGreenland is over 2 million square kilometres big! That's like putting together several large African countries like Kenya, Tanzania, and South Africa! It's truly massive!\n\n<h3>Where is Greenland?</h3>\nNow, where exactly is this giant island hiding? It's way, way up at the very top of our planet Earth! If you imagine a big globe, find the North Pole – that's the super cold top spot. Greenland is very close to it.\n\nThis chilly neighborhood is called the Arctic Circle. It's a special part of the world where it gets incredibly cold, much colder than our sunny African lands. Brrr!\n\nSo, it's not near the warm, sunny beaches of Africa. Oh no! It's where polar bears play and the sun can sometimes hide for many, many months in winter. Imagine dark days for weeks! But then, in summer, the sun shines for almost 24 hours a day!\n\nEven though it's super far away, it's a very important spot on our world map. Think of it like a special lookout tower in the middle of a big, cold sea.\n\n<h3>Ice, Ice Baby!</h3>\nImagine putting a giant, super-thick ice cube on top of a mountain. That's a bit like Greenland! Almost all of this giant island is covered by a massive ice sheet, sometimes called an ice cap.\n\nThis ice is not just a little bit thick; it's kilometres thick in some places! That's like stacking hundreds and hundreds of school buses on top of each other! It's a huge, frozen blanket covering most of the land.\n\nThis ice has been there for thousands and thousands of years. It holds secrets from ancient times, like tiny bubbles of air from long, long ago. Scientists love to study this ice because it helps them understand what the Earth was like in the past and how it's changing now.\n\nBecause of all this ice, Greenland is one of the coldest places you can find on our planet. But even in the cold, life finds a way! Polar bears, seals, and amazing arctic foxes call this icy land home.\n\nDid you know?\nIf all the ice on Greenland melted, the sea level around the whole world would rise by about 7 meters! That's taller than a giraffe! But don't worry, it's melting very, very slowly, so we have time to learn and help our planet.\n\n<h3>Who Lives There?</h3>\nEven with all that ice and cold, people do live in Greenland! The main people who live there are called the Inuit (say: ee-noo-it). They are very brave and clever, and they have been living happily in this snowy land for a super long time, like thousands of years!\n\nThe Inuit people are great at fishing in the icy waters and hunting animals like seals and whales. They use everything from the animals for food, warm clothes, and even tools. They are very careful to use only what they need and respect nature.\n\nTheir homes and villages are mostly found along the edges of the island, where the ice isn't quite so thick and it's easier to reach the sea for food. They have learned amazing ways to live in harmony with their icy environment.\n\nDid you know?\nIn winter, the sun can stay hidden for many weeks in Greenland because it's so far north! But then, in summer, the sun can stay up for almost 24 hours a day! Imagine playing outside all night long because the sun never sets!\n\n<h3>Why is Greenland So Special?</h3>\nSo, why do grown-ups and big countries around the world care so much about this distant, icy island? It's because Greenland is super special for a few very important reasons!\n\n<h4>Reason 1: Its Super Spot on the Map!</h4>\nImagine Greenland is like a giant, natural lighthouse or a very important checkpoint in the middle of a big ocean. Because it's located so high up in the Arctic Circle, it's a very important spot for ships and airplanes that travel across the northern parts of the world. It's like a secret shortcut or a useful stopping point.\n\nBig countries like America think this spot is very important for watching over the seas and making sure everything is safe. It's called being in a 'strategic' position – meaning it's in a smart and important place on the map!\n\n<h4>Reason 2: Hidden Treasures Under the Ice!</h4>\nUnderneath all that thick ice and rock, scientists believe there might be many valuable things! Imagine finding shiny metals like gold or rare rocks that are used to make special phones and computers. These are called 'minerals'.\n\nThere might also be oil and gas, which countries use to power cars, buses, and homes. These hidden riches are like treasures waiting to be discovered, and they can make a country very wealthy. That's why it's also 'economically valuable' – it has things that can make money!\n\n<h4>Reason 3: The Earth's Giant Thermometer!</h4>\nYou know how our planet is getting a little warmer? This is called 'climate change'. The ice in Greenland is melting faster because of this warming.\n\nScientists carefully watch how much ice is melting because it tells us a lot about what is happening to our whole Earth. If too much ice melts, the water in the oceans around the world can go up, which can affect everyone, even us here in Africa! This is why Greenland is like a giant natural thermometer or a big science experiment for the whole world to learn from.\n\n<h3>What About America and Greenland?</h3>\nOnce upon a time, not too long ago, the leader of America, who was President Trump, thought that Greenland was such an important place that America should try to buy it!\n\nCan you imagine buying an entire country, or a giant island like Greenland? It sounds like something from a fantasy story, right?\n\nBut big countries sometimes want to own important places to help them with their plans for safety or to get the valuable things they need. America saw Greenland's special spot on the map and its possible hidden treasures and thought it would be a very useful place to have.\n\nHowever, Greenland is not just a piece of land to be bought and sold. It belongs to the people who live there and is part of another country called Denmark, which is in Europe. So, the people of Greenland and Denmark said 'No, thank you!' Greenland is not for sale!\n\nThis story just shows how incredibly important and special Greenland is in the eyes of many powerful countries around our world. It's like having a special sweet that everyone wants a bite of, but it belongs to someone else!\n\n<h3>So Much to Learn!</h3>\nSo, my wonderful friends from Africa, isn't Greenland an amazing place? It's the biggest island on Earth, covered in ancient ice, home to hardy Inuit people, and full of hidden secrets and important locations that impact our whole planet.\n\nEven though it's far away and super cold, what happens there matters to all of us. The melting ice can affect the sea levels and weather patterns even here in our warm African homes!\n\nIt reminds us that every single part of our planet Earth, whether it's a hot desert, a sunny beach, or an icy island, is connected and incredibly special. We must always keep learning about and protecting our beautiful home.\n\nThat's all for today from your friendly news reporter for Africa! Keep exploring, keep learning, and keep asking questions about our amazing world!",
    "summary": "Greenland is the world's largest island, mostly covered in ice, located in the super cold Arctic Circle, and it's very important because of its special location, hidden treasures, and what its melting ice tells us about our changing Earth.",
    "whyMatters": "Greenland matters because its important spot on the map helps countries keep an eye on the world, it might have valuable things like shiny metals and oil, and its melting ice tells us if our planet is getting too warm, which can change sea levels everywhere.",
    "category": "world",
    "date": "2026-01-21T14:27:35.854Z",
    "image": "https://image.pollinations.ai/prompt/Greenland%3A%20The%20Giant%20Ice%20Island!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "greenland-the-giant-ice-island",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/greenlands-strategic-position-in-seven-maps-why-trump-wants-the-island?traffic_source=rss"
  },
  {
    "originalTitle": "EU parliament refers Mercosur free trade deal to bloc’s top court",
    "title": "EU parliament refers Mercosur free trade deal to bloc’s top court",
    "content": "Court of Justice of the EU will determine if accord with South American nations is compatible with the bloc's policy.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-21T14:27:41.048Z",
    "image": "https://image.pollinations.ai/prompt/EU%20parliament%20refers%20Mercosur%20free%20trade%20deal%20to%20bloc%E2%80%99s%20top%20court%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eu-parliament-refers-mercosur-free-trade-deal-to-blocs-top-court",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/eu-parliament-refers-mercosur-free-trade-deal-to-blocs-top-court?traffic_source=rss"
  },
  {
    "originalTitle": "Syrian army takes control of camp holding thousands linked to ISIL",
    "title": "Syrian army takes control of camp holding thousands linked to ISIL",
    "content": "SDF chief Abdi urged US-led coalition to 'bear responsibilities' for securing facilities coming under gov't control.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:27:46.213Z",
    "image": "https://image.pollinations.ai/prompt/Syrian%20army%20takes%20control%20of%20camp%20holding%20thousands%20linked%20to%20ISIL%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "syrian-army-takes-control-of-camp-holding-thousands-linked-to-isil",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/syria-takes-control-of-camp-holding-thousands-linked-to-isil?traffic_source=rss"
  },
  {
    "originalTitle": "Could US Congress stop Trump from taking over Greenland?",
    "title": "Could US Congress stop Trump from taking over Greenland?",
    "content": "Some of the president's fellow Republicans oppose him - but it's not clear if they would join Democrats to block a takeover of the island.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-21T14:27:51.863Z",
    "image": "https://image.pollinations.ai/prompt/Could%20US%20Congress%20stop%20Trump%20from%20taking%20over%20Greenland%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "could-us-congress-stop-trump-from-taking-over-greenland",
    "originalLink": "https://www.bbc.com/news/articles/c701rvrpjwko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli PM Netanyahu agrees to join Trump's Board of Peace",
    "title": "Israeli PM Netanyahu agrees to join Trump's Board of Peace",
    "content": "Israel is the latest country to publicly accept an invitation to a new international organisation that many fear may be designed to supplant the UN.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:27:57.044Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20PM%20Netanyahu%20agrees%20to%20join%20Trump's%20Board%20of%20Peace%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-pm-netanyahu-agrees-to-join-trumps-board-of-peace",
    "originalLink": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
    "title": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
    "content": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:28:02.211Z",
    "image": "https://image.pollinations.ai/prompt/Photos%20leaked%20to%20BBC%20show%20faces%20of%20hundreds%20killed%20in%20Iran's%20brutal%20protest%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "photos-leaked-to-bbc-show-faces-of-hundreds-killed-in-irans-brutal-protest-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palace striker Mateta tells club he wants to leave",
    "title": "Palace striker Mateta tells club he wants to leave",
    "content": "France striker Jean-Philippe Mateta has 18 months remaining on his current deal at Selhurst Park and as things stand he will not be signing an extension.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T14:28:07.821Z",
    "image": "https://image.pollinations.ai/prompt/Palace%20striker%20Mateta%20tells%20club%20he%20wants%20to%20leave%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palace-striker-mateta-tells-club-he-wants-to-leave",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62wn91w5geo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "title": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "content": "Manchester City suffered their very own \"hell of a beating\" moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:28:12.993Z",
    "image": "https://image.pollinations.ai/prompt/'Battered%20in%20Bodo'%20-%20is%20this%20more%20than%20just%20a%20blip%20for%20Man%20City%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "battered-in-bodo-is-this-more-than-just-a-blip-for-man-city",
    "originalLink": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Women's Club World Cup schedule could be 'catastrophic' for WSL",
    "title": "Women's Club World Cup schedule could be 'catastrophic' for WSL",
    "content": "English players and officials are shocked by the current scheduling for the inaugural Women's Club World Cup because of the impact it could have on the WSL.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T14:28:18.160Z",
    "image": "https://image.pollinations.ai/prompt/Women's%20Club%20World%20Cup%20schedule%20could%20be%20'catastrophic'%20for%20WSL%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "womens-club-world-cup-schedule-could-be-catastrophic-for-wsl",
    "originalLink": "https://www.bbc.com/sport/football/articles/czx1p5pvnxro?at_medium=RSS&at_campaign=rss"
  }
]