[
  {
    "originalTitle": "Strike deal reached after two days of chaos at Kenya's main airport",
    "title": "Yay! Our Big Airport is Back to Flying Fun!",
    "content": "Hello, my super friends! It's your friendly news reporter, Pendo, here to share some exciting news from our amazing continent, Africa!\n\nGuess what? We have a really big airport in a beautiful country called Kenya. It's like a giant bus station, but for planes!\n\nA little while ago, something tricky happened there. But now it's all fixed! Hooray!\n\n<h3>What Was the Big Trouble?</h3>\nImagine you love to draw, but suddenly your crayons are gone! That's a bit how it felt at our big airport for a little while.\n\nSome grown-ups who work at the airport were sad. They wanted to talk to their bosses about how to make things better for them.\n\nWhen workers want to talk to their bosses about important things, sometimes they decide to stop working for a little while. This is called a 'strike'.\n\nDid you know? A 'strike' is when people take a break from their jobs. They do this to show that they really want to talk about something important. They hope their bosses will listen and fix things.\n\nFor two whole days, many of the airport workers were not at their jobs. This meant that the big airplanes found it hard to fly!\n\nThink of it like trying to play football without a ball! It just doesn't work right.\n\n<h3>Lots of Waiting and Sad Faces</h3>\nBecause the workers were on strike, many people who wanted to fly couldn't. Their big metal birds, the airplanes, just sat on the ground.\n\nPeople waited for many, many hours. Some children were tired, and some grown-ups looked worried and confused.\n\nThis big airport is called Jomo Kenyatta International Airport. It is in Nairobi, which is the capital city of Kenya. It's a very busy and important place!\n\nDid you know? Jomo Kenyatta International Airport is one of the busiest airports in all of Africa! Lots of people and important packages fly in and out of there every single day.\n\nFor two days, it was a little bit messy and confusing. We call that 'chaos' – when everything is not in its usual happy place.\n\n<h3>Good News! The Problem is Solved!</h3>\nBut guess what? Good news travels fast, just like a super-fast airplane!\n\nThe grown-ups at the airport, the workers and their bosses, sat down and talked. They talked and talked, and they listened to each other very carefully.\n\nAnd then, they made a 'deal'! A deal is like a special promise where everyone agrees on what to do next.\n\nThey found a way to make things better and fairer for everyone! Isn't that wonderful?\n\nDid you know? Talking is a super important way to solve problems. When we talk and listen, we can make friends and fix even the trickiest situations!\n\n<h3>Planes Are Flying Again!</h3>\nThis means that the airport workers are now back at their jobs. We hope they have happy smiles on their faces!\n\nAnd the best part? The big airplanes can now take off and land safely again!\n\nThink of all the people who can now visit their families, or go on exciting holidays, or even bring important medicines to other places in Africa and the world.\n\nOur big African airport is back to its busy, buzzing self! It's full of happy sounds again.\n\n<h3>What Should Flyers Still Do?</h3>\nEven though the big problem is fixed, there's still one important thing for people to remember.\n\nIf someone is planning to fly, they should still ask about their plane before they leave home. We call this 'checking their flight status'.\n\nDid you know? 'Flight status' simply means asking if your plane is on time, if it's ready to go, or if there are any tiny changes. It's like checking if your school bus is on its way!\n\nIt's always smart to check so that no one waits too long or misses their flight. This helps everyone stay happy.\n\nThey can ask their grown-ups to call the airport or look on a special website. It's very easy to do!\n\n<h3>Why Our Airport is So Special</h3>\nThis big airport in Kenya is super important for our continent, Africa. It helps so many things happen.\n\nIt helps people from all over the world come to visit our beautiful countries. They come to see amazing animals like lions, elephants, and zebras!\n\nIt also helps our delicious fruits, fresh vegetables, and other good things travel to different places very quickly.\n\nDid you know? Airplanes can carry not just people, but also lots and lots of things! They carry flowers, books, special tools, and even other small cars!\n\nSo, when the airport is running smoothly, it helps everyone in Africa and beyond!\n\n<h3>A Happy Ending!</h3>\nSo there you have it, my curious friends! A big problem was solved with lots of talking and listening.\n\nOur big airport in Kenya is back to welcoming planes and people with open arms and big smiles.\n\nIt shows that even when things get tricky, if we work together and talk nicely, we can always find a happy solution!\n\nThat's all for now from your friend, Pendo! Keep smiling and keep exploring our amazing world!",
    "summary": "After a two-day problem at Kenya's main airport, workers and bosses talked and fixed everything, so now planes can fly again, but people should still check their flight times.",
    "whyMatters": "This is important because the airport helps many people travel, visit family, and brings important things to our homes. When it works well, everyone is happy and safe!",
    "category": "technology",
    "date": "2026-02-17T15:47:47.464Z",
    "image": "https://image.pollinations.ai/prompt/Yay!%20Our%20Big%20Airport%20is%20Back%20to%20Flying%20Fun!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "yay-our-big-airport-is-back-to-flying-fun",
    "originalLink": "https://www.bbc.com/news/articles/c363096kd5po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US soldiers arrive in Nigeria to aid its fight against Islamist militants",
    "title": "Friends from Far Away Come to Help Nigeria!",
    "content": "Hello, amazing kids of Africa! I have some exciting news for you today.\n\nDo you know about our big, beautiful country, Nigeria? It's full of happy people, yummy food, and awesome places.\n\nSometimes, even in the best places, there can be some problems. Today, we're talking about some friends who have come to help Nigeria with a special job.\n\nThese friends are soldiers from a country called the United States of America, or USA for short!\n\n<h3>Friends from Far Away!</h3>\nImagine you have a friend who lives very far away. Maybe across a big ocean! Well, soldiers from the USA are like those friends. They have traveled a long, long way to be here.\n\nThese soldiers are brave men and women. They wear special uniforms and work very hard to keep their own country safe. Now, they are here to help our brave Nigerian soldiers.\n\nDid you know? The USA is a very big country with many different people, just like Nigeria! They have big cities and beautiful nature, just like us.\n\n<h3>Where Did They Arrive?</h3>\nThese friendly soldiers landed in a special place in Nigeria. They arrived at an airfield in a state called Bauchi. Can you say \"Bauchi\"?\n\nBauchi State is in the northern part of Nigeria. It's a place with its own special stories and people. Imagine an airfield like a big parking lot for airplanes! That's where they landed safely.\n\nIt's important for them to arrive safely so they can start their helpful work. They came with big planes that flew for a very long time.\n\nDid you know? Nigeria has 36 different states, and each one is unique and wonderful! Bauchi is one of them.\n\n<h3>Helping, But Not Fighting!</h3>\nNow, this is a very important part, so listen carefully! The US soldiers are here to help Nigeria fight against some people who cause trouble. We call these troublemakers \"militants\" or just bad guys.\n\nThese bad guys try to make people scared and hurt others. We don't like that! But here's the special part: the soldiers from the USA will *not* be fighting themselves.\n\nThey are not going to be in the battles where there is shooting or direct fighting. Their job is different!\n\nThink of it like this: If your friend needs help building a tall LEGO tower, you might give them tips, or show them a cool trick, or give them some extra blocks. You wouldn't build the whole tower for them!\n\nThat's what the US soldiers are doing. They are helping Nigeria's soldiers in many clever and smart ways. They are like very helpful teachers and coaches.\n\n<h3>What Kind of Help Will They Give?</h3>\nSo, if they aren't fighting, what *will* they do? Great question! They will share their knowledge and ideas with the Nigerian soldiers. They will teach them new ways to be even better.\n\nThey might teach new ways to plan things. Like planning a special game, but for safety! This helps our soldiers think ahead and be ready for anything.\n\nThey can show how to use special tools or equipment that helps keep people safe. These tools might be very high-tech and clever, to help find bad guys or understand tricky situations.\n\nThey can help train Nigerian soldiers to be even stronger and smarter. They can practice together and learn new skills. It's all about sharing and learning from each other.\n\nDid you know? When soldiers train, they learn how to be super strong, super fast, and super smart! They practice a lot to be the best protectors.\n\n<h3>Why is This Help Important?</h3>\nWhen bad guys try to cause trouble, it makes everyone feel a little worried. By helping our Nigerian soldiers, the US soldiers are helping to make Nigeria safer for everyone.\n\nWhen countries work together, like Nigeria and the USA, they can solve big problems better. It's like having more hands to help with a big task.\n\nIt shows that we care about each other, even if we live far apart. Imagine if all your friends worked together on a big school project. It would be easier and better, right?\n\nThat's what's happening here – countries working together for a good cause! They are building a bridge of friendship and help.\n\nDid you know? Nigeria is often called the \"Giant of Africa\" because it has so many wonderful people and a big land!\n\n<h3>Working Together for a Brighter Tomorrow</h3>\nThis visit is about building strong friendships between countries. It's about making sure that Nigeria can be a peaceful and safe place for all children to grow up and play.\n\nWhen our soldiers are stronger and have more help, they can do an even better job of protecting everyone. This means more peace and more happiness for all of us.\n\nIt's a step towards a future where everyone feels safe and happy. This help makes our country's defense even more powerful.\n\nDid you know? The more we help each other, the stronger we all become! Friendship makes everything better.\n\n<h3>A Special Message for You</h3>\nSo, little reporters, remember this: people from all over the world can be friends. When friends help each other, amazing things happen.\n\nThese soldiers are here to help Nigeria grow even stronger and safer. You don't need to be worried. Our brave Nigerian soldiers are always working hard for us, and now they have friends from far away helping them too!\n\nLet's all hope for peace and safety in Nigeria and all of Africa!",
    "summary": "Soldiers from the USA have arrived in Nigeria to help Nigerian soldiers learn new ways to keep our country safe from bad guys, but they will not be fighting in battles themselves.",
    "whyMatters": "This is important because it means Nigeria is getting help from a friend far away to make our country even safer for everyone, especially for you, our wonderful children!",
    "category": "technology",
    "date": "2026-02-17T15:48:09.299Z",
    "image": "https://image.pollinations.ai/prompt/Friends%20from%20Far%20Away%20Come%20to%20Help%20Nigeria!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-from-far-away-come-to-help-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cj6d79gyrdro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Fake funeral suspects allegedly used hearse to smuggle charcoal in Malawi",
    "title": "Fake funeral suspects allegedly used hearse to smuggle charcoal in Malawi",
    "content": "Officials allege that an empty coffin was placed over concealed bags of charcoal in a hearse.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:48:14.429Z",
    "image": "https://image.pollinations.ai/prompt/Fake%20funeral%20suspects%20allegedly%20used%20hearse%20to%20smuggle%20charcoal%20in%20Malawi%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fake-funeral-suspects-allegedly-used-hearse-to-smuggle-charcoal-in-malawi",
    "originalLink": "https://www.bbc.com/news/articles/cwygdq11jwlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Jesse Jackson, civil rights icon, dies at age 84",
    "title": "Remembering a Big Helper: Jesse Jackson",
    "content": "Hello, my wonderful friends! Your kid-friendly news reporter from Africa is here with some news about a very special person. We have some sad news to share today, but it's also a chance to learn about a real hero.\n\n<h3>A Sad Goodbye to a Big Helper</h3>\nA kind and brave man named Jesse Jackson has passed away. He was 84 years old. That's a very long time! Jesse Jackson lived a life full of helping people. He wanted everyone to be treated fairly and with kindness. He was like a big brother or a super teacher who always stood up for what was right.\n\nHe worked very hard to make the world a better place. Even though he lived far away in a country called America, his actions helped people all over the world, even here in Africa. He taught us that everyone deserves respect and love.\n\n<h3>What is \"Fairness\" and \"Civil Rights\"?</h3>\nJesse Jackson was known as a 'civil rights' leader. That sounds like a big word, doesn't it? Let me explain! \"Civil rights\" just means that every single person, no matter their skin color, where they come from, or how much money they have, should be treated equally. They should have the same chances to go to good schools, ride the same buses, and live in any neighborhood they choose.\n\nLong ago, in America, things were not fair for Black people. They sometimes had different schools, different places to sit on the bus, and were not treated kindly because of their skin color. This was very, very wrong. Jesse Jackson wanted to change that. He wanted to make sure everyone was fair to each other.\n\nDid you know? Being fair means everyone gets a turn and everyone is respected, just like when you share your toys with a friend!\n\n<h3>Jesse's Younger Days</h3>\nJesse Jackson was born a long, long time ago. He grew up in a place where Black people were not always treated well. He saw this unfairness with his own eyes. This made him feel sad and angry, but it also made him strong and determined. He knew he had to do something to make things better.\n\nHe was very smart and worked hard in school. He also loved sports, especially American football! He was a good student and a good athlete. But what he really wanted was to help people. He wanted to use his voice to speak up for those who couldn't speak up for themselves.\n\nDid you know? Jesse Jackson was also a talented baseball player when he was young, but he chose to use his talents to fight for fairness instead of becoming a professional athlete!\n\n<h3>Walking with a Dreamer</h3>\nWhen Jesse Jackson was a young man, he met another very famous leader named Martin Luther King Jr. Dr. King had a big dream that one day, everyone would live together in peace and fairness. Jesse Jackson became a close friend and helper to Dr. King. They walked together in big marches, where many people gathered peacefully to show that they wanted things to change.\n\nThey did not use anger or fighting. They used their voices, their signs, and their peaceful walks to show the world that fairness was important. Jesse Jackson learned so much from Dr. King about leading with love and courage. He helped Dr. King teach people about making good changes without violence.\n\nDid you know? Martin Luther King Jr. won a very important award called the Nobel Peace Prize because he worked so hard for peace and fairness!\n\n<h3>Speaking Up for Everyone</h3>\nAfter Dr. King passed away, Jesse Jackson continued his important work. He kept speaking up for Black people and for all people who were not being treated fairly. He traveled all over America and even to other countries, telling people about his dream for fairness.\n\nHe helped many people to vote. Voting is when grown-ups choose their leaders. Jesse taught people that their vote was a very powerful tool to make changes. He made sure that everyone had the chance to choose who would lead their country.\n\nHe also helped bring people together when there were arguments or problems. He was like a peacemaker, helping people talk and understand each other, even if they were from different groups or had different ideas. He always believed that talking was better than fighting.\n\n<h3>Dreaming Big: Running for President</h3>\nJesse Jackson even tried to become the President of America! The President is the leader of a whole country. It was a very big and brave thing for a Black man to do back then. He did not win, but his actions showed many children, especially Black children, that they could dream big too. He showed them that they could aim for the highest jobs in the land.\n\nHis trying to be President was a huge step for America. It showed everyone that a person's skin color does not stop them from being a good leader. He opened doors for many other people who came after him.\n\nDid you know? Jesse Jackson was the first major African American candidate to run for President of the United States! That's a very big deal!\n\n<h3>Helping Friends Across the World</h3>\nJesse Jackson didn't just care about America. He cared about people everywhere! He traveled to many countries, including some here in Africa. He helped people who were having troubles, sometimes even helping to bring people home who were stuck in other countries.\n\nHe wanted to make sure that countries treated each other fairly, too. He was a friend to people in many places, helping them to find peace and understanding. He showed that helping others is a global mission, not just something you do in your own neighborhood. He brought messages of peace and hope from America to our continent and beyond.\n\n<h3>His Big Heart and Strong Voice</h3>\nJesse Jackson had a big heart and a very strong voice. He was not afraid to speak up when he saw something wrong. He believed that if everyone worked together, they could make great changes.\n\nHe taught us that it's important to keep trying, even when things are hard. He never gave up on his dream of a fair world. He inspired millions of people to stand up for themselves and for others.\n\nDid you know? Jesse Jackson often used the saying, \"Keep Hope Alive!\" He wanted everyone to remember that even in tough times, we must always have hope for a better tomorrow.\n\n<h3>What We Learn From Jesse</h3>\nFrom Jesse Jackson, we learn many important lessons. We learn that everyone deserves respect. We learn that we should always speak up for what is fair and right. We learn that we should never give up on our dreams, even if they seem very big.\n\nHe taught us the power of love over hate and the strength of working together. He showed us that one person with a kind heart and a strong voice can make a huge difference in the world. He helped make the world a place where children like you can grow up with more fairness.\n\n<h3>Remembering a Kind Hero</h3>\nEven though Jesse Jackson is no longer with us, his ideas and his kindness will live on. We will remember him as a brave leader, a peacemaker, and a true friend to all people. He helped plant seeds of fairness and equality that continue to grow stronger every day.\n\nLet's all try to be like Jesse Jackson in our own ways. Let's be kind to everyone, speak up for what's right, and always, always keep hope alive. That is the best way to remember such a wonderful hero. Thank you, Jesse Jackson, for everything you did to make our world a better and fairer place for all of us.\n",
    "summary": "Jesse Jackson, a very kind and brave leader who worked for fairness and equal rights for all people, especially Black people, has passed away at 84 years old.",
    "whyMatters": "Jesse Jackson was important because he taught us that everyone deserves to be treated fairly and with respect, no matter their skin color, and he worked his whole life to make the world a kinder and more equal place for everyone.",
    "category": "world",
    "date": "2026-02-17T15:48:35.637Z",
    "image": "https://image.pollinations.ai/prompt/Remembering%20a%20Big%20Helper%3A%20Jesse%20Jackson%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "remembering-a-big-helper-jesse-jackson",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/17/jesse-jackson-civil-rights-icon-dies-at-age-84?traffic_source=rss"
  },
  {
    "originalTitle": "Missiles fly as 3rd round of Russia-Ukraine peace talks kick off in Geneva",
    "title": "Missiles fly as 3rd round of Russia-Ukraine peace talks kick off in Geneva",
    "content": "Ukraine's lead negotiator says Kyiv will work 'constructively' but 'without excessive expectations'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:48:40.775Z",
    "image": "https://image.pollinations.ai/prompt/Missiles%20fly%20as%203rd%20round%20of%20Russia-Ukraine%20peace%20talks%20kick%20off%20in%20Geneva%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "missiles-fly-as-3rd-round-of-russia-ukraine-peace-talks-kick-off-in-geneva",
    "originalLink": "https://www.aljazeera.com/news/2026/2/17/missiles-fly-as-3rd-round-of-russia-ukraine-peace-talks-kick-off-in-geneva?traffic_source=rss"
  },
  {
    "originalTitle": "Ramadan Mubarak 2026: Hear greetings in different languages",
    "title": "Ramadan Mubarak 2026: Hear greetings in different languages",
    "content": "Here is how to convey wishes during the holy month of Ramadan in different languages around the world.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:48:45.900Z",
    "image": "https://image.pollinations.ai/prompt/Ramadan%20Mubarak%202026%3A%20Hear%20greetings%20in%20different%20languages%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ramadan-mubarak-2026-hear-greetings-in-different-languages",
    "originalLink": "https://www.aljazeera.com/news/2026/2/17/ramadan-mubarak-2026-hear-greetings-in-different-languages?traffic_source=rss"
  },
  {
    "originalTitle": "Hillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview",
    "title": "Hillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview",
    "content": "\"Get the files out. They are slow-walking it,\" the former US secretary of state says. The White House says it has done \"more for the victims than Democrats ever did\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:48:51.481Z",
    "image": "https://image.pollinations.ai/prompt/Hillary%20Clinton%20accuses%20Trump%20administration%20of%20Epstein%20files%20'cover-up'%20in%20BBC%20interview%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hillary-clinton-accuses-trump-administration-of-epstein-files-cover-up-in-bbc-interview",
    "originalLink": "https://www.bbc.com/news/articles/czx47k34yqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Third round of Russia-Ukraine talks starts in Geneva as strikes continue",
    "title": "Third round of Russia-Ukraine talks starts in Geneva as strikes continue",
    "content": "Expectations for a breakthrough are low as negotiators meet at a US-brokered talks to try end the war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:48:56.606Z",
    "image": "https://image.pollinations.ai/prompt/Third%20round%20of%20Russia-Ukraine%20talks%20starts%20in%20Geneva%20as%20strikes%20continue%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "third-round-of-russia-ukraine-talks-starts-in-geneva-as-strikes-continue",
    "originalLink": "https://www.bbc.com/news/articles/cge812y2549o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "France releases suspected Russian 'shadow fleet' tanker after fine paid",
    "title": "France releases suspected Russian 'shadow fleet' tanker after fine paid",
    "content": "French Foreign Minister Jean-Noël Barrot said the vessel was departing Marseille after a payment of \"several million euros\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-17T15:49:01.719Z",
    "image": "https://image.pollinations.ai/prompt/France%20releases%20suspected%20Russian%20'shadow%20fleet'%20tanker%20after%20fine%20paid%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "france-releases-suspected-russian-shadow-fleet-tanker-after-fine-paid",
    "originalLink": "https://www.bbc.com/news/articles/c8xy4dl2xwgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal make Saka best-paid player with new five-year deal",
    "title": "Arsenal make Saka best-paid player with new five-year deal",
    "content": "England winger Bukayo Saka commits his future to Premier League leaders Arsenal by signing a new five-year deal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T15:49:06.999Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20make%20Saka%20best-paid%20player%20with%20new%20five-year%20deal%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-make-saka-best-paid-player-with-new-five-year-deal",
    "originalLink": "https://www.bbc.com/sport/football/articles/c4gje501g51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We really messed up' - does European football need more balance?",
    "title": "'We really messed up' - does European football need more balance?",
    "content": "One set of clubs dominate the Champions League, another win their domestic title every year but cannot compete - does European football have a problem?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T15:49:12.116Z",
    "image": "https://image.pollinations.ai/prompt/'We%20really%20messed%20up'%20-%20does%20European%20football%20need%20more%20balance%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "we-really-messed-up-does-european-football-need-more-balance",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgmzylx4004o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We created fire' - Forest boss Pereira on Marinakis reunion",
    "title": "'We created fire' - Forest boss Pereira on Marinakis reunion",
    "content": "Nottingham Forest boss Vitor Pereira says \"he trusts my work, I trust his personality\" as he is reunited with Evangelos Marinakis.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T15:49:17.234Z",
    "image": "https://image.pollinations.ai/prompt/'We%20created%20fire'%20-%20Forest%20boss%20Pereira%20on%20Marinakis%20reunion%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "we-created-fire-forest-boss-pereira-on-marinakis-reunion",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgk2mzpknn3o?at_medium=RSS&at_campaign=rss"
  }
]