[
  {
    "originalTitle": "'Affront to humanity': Sudan slams Uganda for hosting RSF paramilitary boss",
    "title": "Big News: Friends and Rules in Africa!",
    "content": "<h3>Hello, Little News Explorers!</h3>\nHi everyone! It's your friendly news reporter here, bringing you super important news from our amazing continent, Africa. Today, we're going to talk about two of our big neighbours: Sudan and Uganda. Sometimes, even big countries have disagreements, just like you might with a friend. We're going to learn about what happened and why it's important to be kind and follow rules, even for countries! It's like a big puzzle we'll solve together.\n\nWe'll use simple words so everyone can understand. We want to know what's happening and why people are talking about it. So, let's put on our explorer hats and learn! We'll discover how countries work together, and sometimes, how they don't. It's all part of understanding our big, beautiful world in Africa.\n\n<h3>Meet Sudan and Uganda</h3>\nFirst, let's imagine our big continent, Africa. It has so many wonderful countries! Today, we are looking at two of them. One is called Sudan. It's a very big country in the northern part of Africa. It has lots of history and beautiful places. Imagine a country with huge open spaces and ancient stories.\n\nAnother country we are talking about is Uganda. Uganda is also a beautiful country, a bit smaller than Sudan, and it's found more in the middle of Africa. Think of them as two houses in a very big neighbourhood. They are neighbours in our big African family. They share the same continent and are part of the same big family of nations.\n\nDid you know? Sudan is home to many pyramids, just like Egypt, but perhaps not as famous! Uganda is known for its beautiful lakes and amazing gorillas. Both countries are special! They are both very important parts of Africa. People in Sudan and Uganda have different ways of living, but they are all part of the human family. They are like different children in a very large family, each with their own unique traits.\n\n<h3>What's Happening in Sudan?</h3>\nNow, let's talk about something happening in Sudan. For some time now, there has been some fighting there. It's like when friends argue, but much, much bigger and very sad. Two big groups of people in Sudan are not agreeing, and they are fighting. This fighting makes many people very sad. It makes it hard for kids to go to school.\n\nIt makes it hard for families to live in their homes safely. Imagine if your playground suddenly became unsafe and you couldn't play. That's how it feels for many children in Sudan. People want the fighting to stop so everyone can be safe and happy again. They wish for peace, where everyone can live without fear.\n\nThe fighting has made many people leave their homes. They have to go to other places to find safety. This is called being a refugee. It is a very difficult thing to experience. Imagine having to leave all your toys and your home to go somewhere new. That's what many families have had to do.\n\nEveryone hopes for peace to return to Sudan very soon. Peace means no fighting, just people living happily together. It means children can go back to school, play with their friends, and sleep safely in their beds. It's what every child deserves.\n\n<h3>Who are the Rapid Support Forces (RSF)?</h3>\nOne of the groups that is fighting in Sudan is called the Rapid Support Forces. That's a long name, so we can just call them RSF for short. The RSF has a leader. His name is Mohamed Hamdan Dagalo. Sometimes, people call him Hemedti, which is a shorter name. He is a very important person in the RSF group. He helps make decisions for his group.\n\nThis group is one of the two main groups that are not agreeing in Sudan right now. It is like two big teams on a playground, but instead of playing games, they are having a very serious argument. It's important to remember that not everyone in these groups wants to fight. Many people just want to live in peace. They want the disagreements to end so everyone can be safe.\n\nDid you know? There are many different groups of people in every country, and they all have different ideas. That's why it's so important to talk things out and be kind to each other! Talking is always better than fighting. When people talk, they can understand each other's feelings and find solutions together. It's like sharing your toys instead of arguing over them.\n\n<h3>A Special Visitor in Uganda</h3>\nNow, let's talk about Uganda. Recently, Mr. Mohamed Hamdan Dagalo, the leader of the RSF from Sudan, went to visit Uganda. He travelled there. He met with important people in Uganda. They sat down and talked. When leaders meet and talk, it's usually to discuss important things. Maybe they were talking about what is happening in Sudan. Or maybe they were talking about how to help people.\n\nUganda is a neighbour to Sudan, but not directly next door. It's like your friend from two streets away coming to visit your house. Important people from Uganda welcomed him. This meeting was a special event because of the fighting happening in Sudan. It made many people pay attention, wondering why this meeting was taking place now.\n\nDid you know? Leaders from different countries often meet to talk about things. It's called diplomacy. It's like grown-ups trying to solve problems by talking, just like your teachers ask you to do if you have a problem with a friend. Talking helps us understand each other better and can prevent bigger problems. It's about finding common ground and working together.\n\n<h3>Why is Sudan Unhappy?</h3>\nSo, here's the part where Sudan gets unhappy. Sudan found out that the leader of the RSF visited Uganda and met with people there. Sudan said, \"Hey! We are not happy about this!\" They are feeling very upset and even angry. They said that Uganda should not have met with Mr. Dagalo. They think that by meeting him, Uganda might be helping the RSF side in the fighting.\n\nSudan feels that Uganda should not pick sides in their disagreement. Imagine if you were arguing with a friend, and another friend came and played only with the other person, ignoring you. You might feel a bit left out or like they were not being fair. That's how Sudan feels. They want everyone to help stop the fighting, not to talk to just one side. They think this meeting was not fair and not helpful for peace.\n\nThey used some very strong words. They said it was \"an affront to humanity.\" That's a big phrase! It means they felt it was very, very wrong and bad for all people, especially the people suffering in Sudan. They believe it made things worse, not better, for the people who are hurting from the fighting. They felt like Uganda wasn't helping to heal the wounds.\n\n<h3>Rules for All Countries</h3>\nGuess what? Just like we have rules at home and at school, countries also have rules they try to follow! These are called \"international laws.\" International means \"between countries,\" and laws are rules. So, international laws are like big rules that all countries try to agree on. These rules are made to help countries live together peacefully and fairly. They are like the rules of a big game, where everyone tries to play fair.\n\nOne important rule is about respecting what's happening inside another country. Sometimes, countries shouldn't get involved in another country's internal problems too much. Sudan thinks that Uganda broke these rules by meeting with the RSF leader. They believe Uganda should have talked to *both* sides, or not just one. It's like when your teacher asks you not to take sides in an argument, but to help everyone be friends again. You should try to bring people together, not split them further apart.\n\nDid you know? The United Nations is like a super big club for almost all the countries in the world! They help make and keep these international laws. They try to make sure countries are fair to each other and help when there are big problems. They work hard for peace everywhere! The United Nations has a blue flag and they always try to find peaceful solutions for countries.\n\n<h3>Why Peace is So Important</h3>\nThe most important thing for everyone, especially for children, is peace. When there is peace, kids can go to school every day. They can play outside safely. Families can be together in their homes. People can work and grow food without fear. When there is fighting, all these good things stop. Children get scared, and they can't learn or play. It's a very sad situation. Imagine if you couldn't go to your favourite park or play with your friends because it wasn't safe. That's how it is for many children where there is fighting.\n\nThat's why when countries disagree, it's important for everyone to try to help bring peace. When Sudan feels upset about Uganda's meeting, it's because they want the fighting to stop. They want their people to be safe and happy again. Every child deserves to live in a peaceful place. We all want to see smiles on the faces of children in Sudan, just like we see them on children in Uganda and everywhere else.\n\nDid you know? Many songs and stories from Africa talk about the importance of community and living together in peace. Our culture teaches us to care for each other! We learn that sharing and helping others makes everyone happier. Peace is like a warm blanket that covers everyone, making them feel safe and loved.\n\n<h3>What We Hope For</h3>\nSo, what happens next? We hope that Sudan and Uganda can talk about their disagreements. We hope they can find a way to be good neighbours again. Just like you might make up with a friend after an argument, we hope these countries can make up too. Talking things out is always the best way to solve problems.\n\nAnd most of all, we hope that the fighting in Sudan stops very, very soon. We want peace for all the children and families in Sudan. We want them to be able to go to school, play, and live without fear. Peace means a chance for everyone to grow up strong and happy.\n\nNews can sometimes be a bit tricky, but it's good to know what's happening in our world. It helps us understand how important it is to be kind, to listen to each other, and to follow rules. Even big countries need to remember these things. Let's send our best wishes for peace to all the people in Sudan and for friendship between all our African countries! Thank you for being such great news explorers today! Keep shining bright!",
    "summary": "Sudan is upset because its neighbour, Uganda, met with a leader from a fighting group called the RSF, and Sudan believes this made things worse for peace in their country.",
    "whyMatters": "This is important because when countries disagree, it can make it harder to stop fighting and bring peace to people, especially kids who want to be safe and happy. It reminds us that countries should work together for everyone's safety and happiness.",
    "category": "government",
    "date": "2026-02-23T06:02:57.775Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%3A%20Friends%20and%20Rules%20in%20Africa!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-friends-and-rules-in-africa",
    "originalLink": "https://www.bbc.com/news/articles/c20lwznegk4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Nigeria's Super Happy Fishing Festival!",
    "content": "<h3>Hello, Super Friends!</h3>\nHello, super friends! Your friend Aisha the African News Kid is here with exciting news from Nigeria! Imagine a super sunny day, lots of happy people, and big, big fish! That's what happens at a very special festival in Nigeria. It's called a fishing festival! It's not just about catching fish. Oh no, it's much more! It’s a huge party for everyone, and it helps make friends too. This festival helps bring people together and makes sure everyone is happy and gets along.\n\n<h3>What is a Fishing Festival?</h3>\nSo, what happens at a fishing festival? Well, people from different villages come together. They get ready to catch fish from a big river or a beautiful lake. It's like a very big game for everyone! Everyone gets their fishing tools ready. Some use big nets, some use long sticks with lines called fishing rods. They all want to catch the biggest fish they can find!\n\nDid you know? Nigeria is a big country in Africa! It has many different types of people and lots of different traditions. This festival is one of them!\n\nThis fishing festival is a very old tradition. This means people have been doing it for many, many years. Maybe even for hundreds of years! Like how your great-grandma's great-grandma might have done it! It’s something special that people pass down from their parents to their children.\n\n<h3>The Big Fishing Contest Day!</h3>\nThe day of the big fishing contest is very exciting! Everyone wakes up super early, even before the sun is fully out. They put on their special clothes and get their fishing tools ready. Some people have big, beautiful nets that they made themselves. Others have long sticks, called fishing rods, with a line and a hook at the end.\n\nWhen it's time, all the people gather near the river or the big lake. You can feel the excitement in the air! People are talking, laughing, and getting ready. The leaders of the village say a few words, wishing everyone good luck and a fun day. It’s a very important moment before the big splash!\n\nDid you know? Rivers and lakes are super important for people in Nigeria. They give fish to eat and water to drink, which helps everyone stay healthy and happy!\n\nThen, a special signal is given! Maybe it's a drum beat, or a loud shout! WHOOSH! Everyone rushes to the water. Some jump into small wooden boats, called canoes. Others just walk right into the shallow water, holding their nets or fishing rods. They are all ready to find those clever fish!\n\nSplash! Splish! Swish! The water comes alive! People are trying their best to catch the biggest, strongest fish. Children on the bank cheer loudly, pointing when they see a big fish jump! It's like a big water dance with lots of happy faces. Imagine seeing a giant fish! Sometimes, it takes two or three people to pull a really big fish out of the water. Everyone claps and shouts with joy when a big one is caught. It's not just about winning; it's about sharing the excitement and fun!\n\n<h3>Who Caught the Biggest Fish?</h3>\nAt the end of the fishing time, everyone brings their fish to a special place. The judges carefully look at each fish. They measure it with a big ruler. They weigh it on a big scale. Who caught the longest fish of the day? Who caught the heaviest fish? The judges write down all the names and sizes.\n\nDid you know? The biggest fish caught at some festivals can sometimes be as long as a small child! Imagine that – a fish as big as you!\n\nThe winners get special prizes! It could be a new net, or a big basket of food, or even a shiny trophy! But even if you don't win a prize, everyone feels like a winner because they had so much fun and spent the day with friends and family. It's a day to remember for a very long time!\n\n<h3>Why is Peace So Important?</h3>\nNow, why is this festival so special? It's not just about fish and prizes. It's about something super important: peace. What is peace? Peace means being friends. It means people from different places can live happily together. No fighting, just smiles and sharing. It means everyone is kind to each other.\n\nSometimes, people in different villages might have small disagreements. But when they come to the festival, they forget those little troubles. They laugh together, they fish together, they eat together. They remember they are all part of one big family.\n\nThis festival helps to 'cement' peace. That's a grown-up word! It means it helps to make peace strong, like building a house with strong bricks. When bricks are cemented together, they stay together for a very long time, right? That's what the festival does for peace – it makes it strong and lasting. When they share this happy time, it helps them be kind to each other for a long, long time.\n\n<h3>More Fun for Everyone!</h3>\nBut wait, there's more! The festival is not just about fishing. There is music! People play drums and sing happy songs. There is dancing too! You can see colourful clothes and amazing traditional dances. It's like a big, joyful party with lots of smiles!\n\nDid you know? Sharing food at festivals is a very old way to show friendship and welcome people. It's a sign of kindness and happiness!\n\nThere are also yummy foods to eat. Local people cook special dishes for everyone to share. Imagine delicious stews, tasty snacks, and sweet treats! Children play games. They run around, they laugh, they tell stories. It's a day full of fun for every single person, young and old. It's a time for families to be together, for neighbours to talk, and for everyone to feel happy and connected.\n\n<h3>A Happy Ending!</h3>\nSo, you see? This fishing festival in Nigeria is more than just catching fish. It's a magical time where people come together, have fun, and make peace stronger. It reminds everyone that being kind and friendly is the best way to live. And it shows the world how wonderful the people of Nigeria are! That's all for today from your friend, Aisha! Keep smiling and making friends!",
    "summary": "A special fishing festival in Nigeria brings people together for fun, competition, and to make peace stronger among different villages.",
    "whyMatters": "This festival is important because it helps people from different places become friends, laugh together, and live happily without fighting, making their communities strong and peaceful.",
    "category": "world",
    "date": "2026-02-23T06:03:23.559Z",
    "image": "https://image.pollinations.ai/prompt/Nigeria's%20Super%20Happy%20Fishing%20Festival!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nigerias-super-happy-fishing-festival",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "A Big Lesson in Cameroon: Doing What's Right!",
    "content": "<h3>Hello from Africa!</h3>\n\nHi everyone! It's your friendly news reporter, bringing you a very important story from our amazing continent, Africa! Today, we're going to talk about a country called Cameroon. Cameroon is a beautiful place in West Africa, filled with lovely people, tasty food, and lots of different languages. Some people in Cameroon speak French, and some speak English. It's really cool how many different ways people can talk!\n\nDid you know? Africa is a huge continent with 54 different countries! Each one is special and has its own unique stories.\n\n<h3>What Do Soldiers Do?</h3>\n\nIn every country, there are brave people called soldiers. They wear uniforms and their job is to keep everyone safe. Soldiers are like protectors for their country and its people. They train very hard to make sure our homes, our families, and our lands are secure. They are supposed to be heroes who everyone can trust.\n\nDid you know? A uniform is a special set of clothes that people wear for their job, like soldiers, police officers, or even doctors! It helps you know what their important job is.\n\n<h3>A Sad Story in Cameroon</h3>\n\nSometimes, even people with very important jobs can make big mistakes. In a part of Cameroon where many people speak English, something very sad happened a while ago. Some soldiers, who were supposed to be protecting everyone, did something very, very wrong. They hurt some people who were just civilians. Civilians are regular people, like you and me, who are not soldiers.\n\nThis made many people feel very sad and scared. It was not what soldiers are supposed to do at all. Soldiers should always be kind and protect everyone, especially civilians. When someone does something so wrong, it breaks the trust that people have in them.\n\n<h3>Why Are Rules Important?</h3>\n\nEverywhere we go, we have rules, right? At home, at school, and even in our countries! Rules are super important because they help us know what is right and what is wrong. They keep us safe and make sure everyone is treated fairly. If there were no rules, things would be very messy and maybe even dangerous. Laws are like big rules for a whole country.\n\nWhen someone breaks a big rule, especially one that hurts others, there must be a consequence. A consequence is what happens after you do something, good or bad. For bad things, the consequence is usually a punishment, so people learn to follow the rules and to be good.\n\nDid you know? A judge is a very important person in a court. They listen to everyone's side of a story and decide if the rules were broken, and what the fair consequence should be.\n\n<h3>What Happens in a Court?</h3>\n\nWhen a big rule is broken, people go to a special place called a court. In the court, a judge listens carefully to everything that happened. They listen to the people who say something bad happened, and they listen to the people who are accused of doing the bad thing. It's like a big classroom where everyone tries to find out the truth.\n\nIn Cameroon, the soldiers who did the very wrong things had to go to court. The judge listened for a long, long time to all the stories and looked at all the evidence. Evidence is like clues that help the judge understand what really happened.\n\n<h3>Justice for Everyone!</h3>\n\nAfter listening to everything, the judge made a very important decision. The judge said that the soldiers had done something terribly wrong and that they had broken the country's big rules, its laws. So, the judge gave them a punishment: they have to go to jail for a long time.\n\nJail is a place where people go when they have done very serious bad things. It's a way for them to think about what they did and to learn that breaking rules has big consequences. It also helps to keep everyone else safe. This decision was important because it showed that everyone, no matter if they are a soldier or a regular person, must follow the rules.\n\nDid you know? Justice means making things fair and right for everyone! It's about making sure that if someone does something wrong, they are held responsible, and if someone is hurt, they get help.\n\n<h3>A Special Lesson</h3>\n\nThis story from Cameroon is very special because it doesn't always happen that soldiers who do bad things get punished in this way. This time, the country showed that it cares very much about justice and fairness. It showed that no one is allowed to hurt others and get away with it. This is good news because it makes people feel safer and trust that their country will protect them.\n\nIt teaches us all a big lesson: it doesn't matter who you are or what your job is, you must always follow the rules, be kind, and respect everyone. If someone does something wrong, they will be held accountable, which means they have to face the consequences.\n\n<h3>Always Choose Kindness</h3>\n\nSo, my friends, remember to always choose kindness and to do what is right. Listen to your parents and teachers, and follow the rules at home and at school. Because when we all do our part to be good and fair, our communities and our countries become stronger and happier places for everyone to live. This story from Cameroon reminds us that even when sad things happen, good people work hard to make things right again and ensure justice for all. Stay safe and keep shining brightly!",
    "summary": "In Cameroon, some soldiers who did very wrong things and hurt people were sent to jail by a judge, showing that everyone must follow the rules and that justice is important for all.",
    "whyMatters": "This story matters because it shows that no matter who you are, even brave soldiers, you must follow the rules and not hurt people, and if you do something wrong, there will be fair consequences to keep everyone safe and make sure things are right.",
    "category": "technology",
    "date": "2026-02-23T06:03:42.498Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Lesson%20in%20Cameroon%3A%20Doing%20What's%20Right!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-lesson-in-cameroon-doing-whats-right",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How Modi ‘broke down walls’ between India, Israel – at Palestine’s expense",
    "title": "How Modi ‘broke down walls’ between India, Israel – at Palestine’s expense",
    "content": "Under Modi, India, a long supporter of the Palestinian cause, has found a friend in Israel's Netanyahu despite genocide.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:03:47.842Z",
    "image": "https://image.pollinations.ai/prompt/How%20Modi%20%E2%80%98broke%20down%20walls%E2%80%99%20between%20India%2C%20Israel%20%E2%80%93%20at%20Palestine%E2%80%99s%20expense%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-modi-broke-down-walls-between-india-israel-at-palestines-expense",
    "originalLink": "https://www.aljazeera.com/features/2026/2/23/how-modi-broke-down-walls-between-india-israel-at-palestines?traffic_source=rss"
  },
  {
    "originalTitle": "Hong Kong court rejects appeal in landmark subversion case",
    "title": "Hong Kong court rejects appeal in landmark subversion case",
    "content": "Appellants were among 45 opposition figures sentenced to prison in 2024 for organising an unofficial primary election.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:03:52.957Z",
    "image": "https://image.pollinations.ai/prompt/Hong%20Kong%20court%20rejects%20appeal%20in%20landmark%20subversion%20case%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hong-kong-court-rejects-appeal-in-landmark-subversion-case",
    "originalLink": "https://www.aljazeera.com/news/2026/2/23/hong-kong-court-rejects-appeal-in-landmark-subversion-case?traffic_source=rss"
  },
  {
    "originalTitle": "One Battle After Another triumphs at UK’s BAFTA film awards",
    "title": "One Battle After Another triumphs at UK’s BAFTA film awards",
    "content": "The offbeat thriller has won six BAFTAs, including best film and best director for Paul Thomas Anderson.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:03:58.081Z",
    "image": "https://image.pollinations.ai/prompt/One%20Battle%20After%20Another%20triumphs%20at%20UK%E2%80%99s%20BAFTA%20film%20awards%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "one-battle-after-another-triumphs-at-uks-bafta-film-awards",
    "originalLink": "https://www.aljazeera.com/news/2026/2/23/one-battle-after-another-triumphs-at-uks-bafta-film-awards?traffic_source=rss"
  },
  {
    "originalTitle": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "title": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "content": "Ukraine's president sat down with the BBC's Jeremy Bowen in Kyiv days before the four-year anniversary of the war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:03.751Z",
    "image": "https://image.pollinations.ai/prompt/Zelensky%20tells%20BBC%20Putin%20has%20started%20WW3%20and%20must%20be%20stopped%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "zelensky-tells-bbc-putin-has-started-ww3-and-must-be-stopped",
    "originalLink": "https://www.bbc.com/news/articles/cvgj9p15y87o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Violence erupts in Mexico after drug lord El Mencho killed",
    "title": "Violence erupts in Mexico after drug lord El Mencho killed",
    "content": "The death of the most-wanted Jalisco cartel chief sparks retaliatory violence in at least a dozen states in Mexico.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:08.864Z",
    "image": "https://image.pollinations.ai/prompt/Violence%20erupts%20in%20Mexico%20after%20drug%20lord%20El%20Mencho%20killed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "violence-erupts-in-mexico-after-drug-lord-el-mencho-killed",
    "originalLink": "https://www.bbc.com/news/articles/c795qgejzpxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Armed man killed after entering secure perimeter of Trump's residence, Secret Service says",
    "title": "Armed man killed after entering secure perimeter of Trump's residence, Secret Service says",
    "content": "The suspect was carrying a shotgun and fuel can when he was killed, officers said. Trump was in Washington DC at the time.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:13.981Z",
    "image": "https://image.pollinations.ai/prompt/Armed%20man%20killed%20after%20entering%20secure%20perimeter%20of%20Trump's%20residence%2C%20Secret%20Service%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "armed-man-killed-after-entering-secure-perimeter-of-trumps-residence-secret-service-says",
    "originalLink": "https://www.bbc.com/news/articles/cp32l9w9pgyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'They were attacking from every angle in the end' - why Spurs couldn't keep Arsenal out",
    "title": "'They were attacking from every angle in the end' - why Spurs couldn't keep Arsenal out",
    "content": "MOTD pundit Danny Murphy explains why, as well as Arsenal's superior quality in Sunday's north London derby, they exploited Tottenham's tactical weakness too.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:19.377Z",
    "image": "https://image.pollinations.ai/prompt/'They%20were%20attacking%20from%20every%20angle%20in%20the%20end'%20-%20why%20Spurs%20couldn't%20keep%20Arsenal%20out%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "they-were-attacking-from-every-angle-in-the-end-why-spurs-couldnt-keep-arsenal-out",
    "originalLink": "https://www.bbc.com/sport/football/articles/c86yjp6037jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "title": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "content": "Wolves striker Tolu Arokodare and Sunderland winger Romaine Mundle have become the latest Premier League players to be sent racist abuse on social media this weekend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:24.496Z",
    "image": "https://image.pollinations.ai/prompt/'Appalling%20weekend'%20-%20Arokodare%20%26%20Mundle%20latest%20players%20to%20be%20racially%20abused%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "appalling-weekend-arokodare-and-mundle-latest-players-to-be-racially-abused",
    "originalLink": "https://www.bbc.com/sport/football/articles/cz6egezw1d3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Old Firm 'buckle under pressure' as incredible title race twists again",
    "title": "Old Firm 'buckle under pressure' as incredible title race twists again",
    "content": "After a defeat for Celtic and surprise draw for Rangers, where does the latest weekend of drama leave the Scottish Premiership title race?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T06:04:29.621Z",
    "image": "https://image.pollinations.ai/prompt/Old%20Firm%20'buckle%20under%20pressure'%20as%20incredible%20title%20race%20twists%20again%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "old-firm-buckle-under-pressure-as-incredible-title-race-twists-again",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx24kgz91wjo?at_medium=RSS&at_campaign=rss"
  }
]