[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Ghana's Brave Friends: Sad News from Far Away",
    "content": "<h3>Hello, Friends of Africa!</h3>\nHello, amazing explorers and future leaders of Africa! It's your friend, Kito the Reporter, bringing you important news from our wonderful continent and beyond! Today, we have some news that makes our hearts a little bit sad, but it's important to talk about it together, with kindness and hope for peace. We always want to share what's happening in the world with you in a way that helps you understand.\n\n<h3>Sad News from Far Away</h3>\nWe have some sad news to share with you today. It's about some wonderful people from Ghana, a country right here in Africa. A special leader, called a 'minister,' told us that 55 people from Ghana have sadly died very far away from home. They died in a place where there is a big fight, called a war, between two countries: Russia and Ukraine.\n\n<h3>What is a War?</h3>\nSometimes, countries have big arguments, and when these arguments get very, very bad, they start to fight. This fighting is called a war. A war is a very sad thing because people get hurt, and homes are broken. The war we are talking about is happening far, far away from Africa, in a place called Europe. It's important for us to know about it, even though it's not happening here.\n\nDid you know? The world has many, many countries, and sometimes they don't agree. We always hope they can talk and find a peaceful way to solve their problems, like good friends do!\n\n<h3>Friends from Ghana</h3>\nThe people who died were all from Ghana. Ghana is a beautiful country in West Africa, known for its friendly people, delicious food, and wonderful music. These people were in Russia and Ukraine for many reasons. Some were young students, just like you, but much older, studying in big schools called universities. They wanted to learn new things to help their families and their country when they came back home. Others were working there to earn money to send back to their loved ones.\n\n<h3>What Does 'Killed' Mean?</h3>\nWhen we say people were 'killed' in the war, it means they lost their lives because of the fighting. It's a very sad thing to happen to anyone. The news tells us that these 55 people were 'casualties.' 'Casualties' is a grown-up word that means people who got hurt or died in a war or a big accident. Our hearts go out to their families and friends.\n\n<h3>A Big Number for One Country</h3>\nImagine 55 of your friends standing together. That's a lot of people! The leader from Ghana said that 55 is the highest number of people who have died from any single country in Africa in this particular war. This means that more people from Ghana have sadly passed away in this war than from any other African country. It makes us all feel very sad for Ghana.\n\nDid you know? Ghana's capital city is Accra, and it's a very busy and exciting place! People there love to tell stories and sing songs.\n\n<h3>Why Were They So Far Away?</h3>\nPeople from Africa, just like people from other parts of the world, often travel to other countries. They go to study at big universities to become doctors, engineers, or teachers. They also go to find jobs that can help them earn money to take care of their families back home. It takes a lot of courage to leave your home and go somewhere new.\n\n<h3>What is a 'Minister'?</h3>\nA 'minister' is a very important person in a country's government. They are like a very important helper to the president or king, and they help make decisions for the country. The minister who shared this sad news is a leader from Ghana who takes care of the people of Ghana, especially those who are far away from home.\n\nDid you know? The continent of Africa is super big! It has 54 different countries, each with its own special stories and people!\n\n<h3>Africa Wants Peace</h3>\nWhen sad things like this happen, it reminds us how important peace is. Peace means that people and countries are friends, and they don't fight. Our leaders across Africa always try to work for peace, not just in our continent, but all over the world. They want everyone to be safe and happy.\n\n<h3>Our Wish for Peace</h3>\nSo, dear friends, while this news is sad, it's also a reminder for all of us to be kind to each other. Peace starts in our homes, in our schools, and in our playgrounds. When we are kind and share, we are helping to build a peaceful world. Let's send our love and thoughts to the families in Ghana, and always wish for peace for everyone, everywhere. Kito the Reporter, signing off for now, always hoping for a brighter, peaceful tomorrow!\n",
    "summary": "We learned about 55 people from Ghana who sadly died in a war far away between Russia and Ukraine, and this is the most from any single African country.",
    "whyMatters": "It's important to know about this because it shows how war can affect people from all over the world, even our friends from Africa, and it reminds us how much we need peace.",
    "category": "world",
    "date": "2026-03-01T12:37:42.758Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Brave%20Friends%3A%20Sad%20News%20from%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-brave-friends-sad-news-from-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "content": "He used the girls' mother's life-threatening illness as an opportunity to demand sex, said the US Office of Public Affairs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:37:47.952Z",
    "image": "https://image.pollinations.ai/prompt/Former%20US%20diplomat%20sentenced%20to%20life%20for%20abusing%20two%20girls%20in%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "former-us-diplomat-sentenced-to-life-for-abusing-two-girls-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "content": "The disgraced financier was in talks to buy luxury abode Bin Ennakhi - but the purchase was never completed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:37:53.137Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20tried%20to%20buy%20a%20palace%20in%20Morocco%20days%20before%20his%20arrest%20in%202019%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-tried-to-buy-a-palace-in-morocco-days-before-his-arrest-in-2019",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Video: Smoke rises above Tehran after latest US-Israeli attacks",
    "title": "Big Smoke Far Away: Let's Talk About What's Happening",
    "content": "<h3>Hello, Wonderful Friends!</h3>\nHello, wonderful friends from all over Africa! It's your friendly news reporter, here to tell you about something happening far, far away. Sometimes, things happen in the world that can make us feel a little bit curious or maybe even a little bit sad. But don't worry, we're going to talk about it simply, like a story. We will learn together about what's going on, and why it's important to hope for peace for everyone.\n\n<h3>What is Happening Far Away?</h3>\nImagine you are looking up at the sky. Sometimes you see fluffy white clouds, right? Well, far away in a very big city called Tehran, some people saw something different in the sky. They saw big clouds of smoke. This smoke was rising up, up, up into the air. When we see smoke, it usually means there was a fire, or that something big happened that caused it. It means things were not calm and quiet for a little while in that city.\n\n<h3>Where is Tehran?</h3>\nTehran is a very big and very old city. It's not in Africa, like where we live. Tehran is in a country called Iran. It's very far from us! Imagine getting on an airplane and flying for many, many hours, even a whole day. That's how far away it is! It's a place where many, many people live, with tall buildings and busy streets, just like some of our big cities here in Africa. There are kids there, just like you, who love to play, learn, and spend time with their families.\n\n**Did you know?** Did you know that Tehran is one of the biggest cities in a part of the world called the Middle East? It's been around for a very long time, with so much history!\n\n<h3>Why Was There Smoke?</h3>\nWell, sometimes, grown-ups and different countries have big disagreements. It's a bit like when you and your friend might not agree on which game to play, or which colour is best, but much, much bigger. These big disagreements can make things not very peaceful. In this faraway place, some things happened that caused loud noises and then the smoke appeared in the sky. These events were linked to two other countries, Israel and the United States. Israel is another country far away from us, and the United States is also a country far away, across a very big ocean.\n\n<h3>What Does Big Smoke Mean?</h3>\nWhen there is big smoke rising high in the sky, it means that something important and perhaps difficult has happened. Smoke tells us that there was a fire, or that something got broken or damaged. It can make people living nearby feel worried or scared. Imagine if you saw a lot of smoke in your town – you would wonder what was happening, wouldn't you? People in Tehran might have felt that way. They want to be safe and sound, just like all of us want to be safe and sound in our homes and communities.\n\n<h3>Who Are Israel and the United States?</h3>\nIsrael is a country that is not too far from Iran, but still a long way from us in Africa. It has its own people, its own languages, and its own special stories. The United States is a huge country, very far away across the big Atlantic Ocean. Both Israel and the United States are big countries with lots of people, and they sometimes work together on different things. They are trying to solve big problems in the world, just like our leaders in Africa try to solve problems for us, to make life better for everyone.\n\n**Did you know?** Did you know that the United States is so big, it has 50 different states, all with their own special things? And Israel is a very old land, mentioned in many history books!\n\n<h3>Why Do Countries Disagree?</h3>\nIt's a big question, and grown-ups are still trying to figure it out! But usually, countries disagree because they want different things for their people, or they have different ideas about how the world should work. Sometimes they don't trust each other, or they think someone else is not being fair. When big disagreements happen, grown-ups from many countries try to talk to each other to find a peaceful way forward. They know that everyone wants to live in peace and be happy and safe in their homes.\n\n<h3>What Can We Learn?</h3>\nEven though this happened far away from us, it reminds us that being kind and trying to understand each other is very, very important. When we have small disagreements with our friends or family, talking calmly and finding a way to share and play nicely makes everything better. The grown-ups in charge of countries are trying their best to make sure these big disagreements don't lead to more smoke and loud noises. They are working towards a world where everyone can live in peace, without fear.\n\n**Did you know?** Did you know that many leaders from countries all over the world meet together to talk about peace and how to help everyone get along? It's called the United Nations, and they work very hard for peace!\n\nSo, let's remember to be kind to everyone around us, no matter where they are from. Let's hope for peace for the people in Tehran and all over the world. Thank you for listening, my wonderful friends! Let's all be friends, and help make the world a happier place!",
    "summary": "Big smoke was seen rising in a faraway city called Tehran because countries Israel and the United States had some big disagreements causing loud noises, and now many grown-ups are hoping for peace for everyone.",
    "whyMatters": "This matters because when there is smoke and loud noises in a city, people can feel worried or sad, and we all want everyone in the world, no matter where they live, to be safe and live in peace and happiness.",
    "category": "world",
    "date": "2026-03-01T12:38:15.412Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Smoke%20Far%20Away%3A%20Let's%20Talk%20About%20What's%20Happening%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-smoke-far-away-lets-talk-about-whats-happening",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/video-smoke-rises-above-tehran-after-latest-us-israeli-attacks?traffic_source=rss"
  },
  {
    "originalTitle": "How US-Israel attacks on Iran threaten the Strait of Hormuz, oil markets",
    "title": "A Big Water Road and Our Energy!",
    "content": "<h3>Hello, Friends!</h3>\nHi everyone! I'm your friendly news reporter, here to share a story about something super important: the energy that helps us live our daily lives.\nYou know how we need sunshine to play outside? Well, we also need other kinds of energy to make our homes bright, cook our food, and even help our parents drive their cars or buses.\nThis energy comes from many places. Today, we're going to talk about a very special kind of energy called 'oil' and 'gas', and a very important water road far, far away.\n\n<h3>What is This Special Energy?</h3>\nImagine a special juice that makes things go! That's kind of like oil and gas.\nOil is a thick, dark liquid found deep under the ground and under the sea. Gas is like a special air, also found there.\nWhen we take this oil and gas out of the ground, we can turn it into many things.\nIt becomes the fuel for cars, trucks, and aeroplanes. It helps make electricity for our lights, TVs, and computers. It even helps cook our food!\nIt's like a superpower that makes our modern world work.\n\n<h3>Did You Know?</h3>\nDid you know that long, long ago, the energy from oil and gas actually came from tiny plants and animals that lived in the sea? They got squashed and heated over millions of years to become this special energy!\n\n<h3>A Super Busy Water Road</h3>\nNow, imagine a very, very busy highway, but instead of cars, it's full of giant ships! This highway is not on land; it's a water road, a very narrow passage of sea.\nIt's called the **Strait of Hormuz**. Can you say that? \"STRAIT of HOR-MOOZE.\"\nIt's a really important place in the world, far away from Africa, between two big pieces of land.\nThink of it as a super important shortcut that big ships use every single day.\n\n<h3>Why is This Water Road So Special?</h3>\nThis Strait of Hormuz is like a giant doorway for ships carrying the special energy juice – oil and gas.\nMany countries around the world need this energy. And a lot of it, guess what, has to travel through this narrow water road!\nIn fact, a super big amount – like if you imagined 10 friends, 2 or 3 of them would need to use this road for their energy! That's a huge share of the world's oil and gas.\nThese ships travel day and night, carrying their precious cargo to different countries.\n\n<h3>Did You Know?</h3>\nDid you know that some of the biggest ships in the world, called supertankers, are so long they can be taller than the biggest buildings you know? They carry millions of litres of oil!\n\n<h3>Why Are Grown-Ups Talking About It?</h3>\nSometimes, big grown-ups in different countries have big disagreements.\nIt's like when friends argue, but on a much, much bigger scale, between whole countries!\nThere are some disagreements happening between countries like the United States and Israel, and another country called Iran. These countries are all very far away from us here in Africa.\nWhen these big disagreements happen, people start to worry about important places like our special water road, the Strait of Hormuz.\nThey worry that if the disagreements get too big, it might become harder for the ships to travel safely through this narrow sea path.\n\n<h3>What Happens If Ships Can't Pass Easily?</h3>\nIf it becomes difficult or unsafe for ships to use the Strait of Hormuz, it means less of that special energy juice (oil and gas) can reach all the countries that need it.\nImagine if the road to your favourite shop was blocked. You couldn't get your favourite snack, right?\nIt's a bit like that. If less oil and gas can travel, then there won't be enough for everyone.\nWhen there's not enough of something important, like energy, it can make it more expensive.\nSo, the price of fuel for cars might go up. The cost of making electricity might go up too.\nThis can make things a little harder for families everywhere, even here in Africa.\n\n<h3>Did You Know?</h3>\nDid you know that some scientists are working really hard to find new ways to get energy? They are looking at sunshine (solar power) and wind (wind power) to help power our homes and cars in the future!\n\n<h3>What Does This Mean for Us in Africa?</h3>\nEven though these countries are far away, and the Strait of Hormuz is far away, what happens there can still affect us a little bit.\nMany countries in Africa also use oil and gas for their cars, buses, lights, and factories.\nIf the price of oil goes up because of worries about the Strait of Hormuz, then things might become more expensive here too.\nBut don't worry too much! Grown-ups are always working hard to make sure there's enough energy for everyone.\nThey are trying to find solutions and make sure all the big countries can agree to keep the peace and keep the important water roads safe.\n\n<h3>Keeping Our World Moving</h3>\nIt's a big, wide world, and everything is connected in some way.\nThe important thing is that people are trying to talk and find peaceful ways to solve their disagreements.\nWe all hope that the ships can keep sailing safely through the Strait of Hormuz, bringing all the energy juice our world needs.\nAnd we hope for peace everywhere, so everyone can have bright lights and happy homes!\nThank you for listening, young adventurers! Keep being curious about our amazing world!",
    "summary": "This story explains how a very important 'water road' called the Strait of Hormuz helps deliver special energy (oil and gas) to countries around the world, and why big disagreements far away might make grown-ups worry about keeping this road safe and open.",
    "whyMatters": "This matters because if the important water road (Strait of Hormuz) is not safe, less special energy (oil and gas) might reach us, which could make things like car fuel and electricity cost more for families, even here in Africa.",
    "category": "world",
    "date": "2026-03-01T12:38:37.286Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Water%20Road%20and%20Our%20Energy!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-water-road-and-our-energy",
    "originalLink": "https://www.aljazeera.com/news/2026/3/1/how-us-israel-attacks-on-iran-threaten-the-strait-of-hormuz-oil-markets?traffic_source=rss"
  },
  {
    "originalTitle": "The US-Israeli war on Iran could rewrite Gulf security calculations",
    "title": "Keeping Peace in a Busy Part of the World",
    "content": "Hello, my wonderful friends! Your kid-friendly reporter from Africa is here today. Let's talk about something important happening far away. It's about a special place called the Gulf region and why everyone hopes for peace there.\n\n<h3>What is the Gulf Region?</h3>\nThe Gulf region is a sunny place with lots of sand and a big blue sea. It has many countries like Saudi Arabia, the United Arab Emirates, and Qatar. Think of it like a neighbourhood where many different families live next to a beautiful big lake. These countries are like neighbours.\n\nDid you know? The Gulf region is famous for its very, very valuable oil! Oil is a thick, black liquid that comes from deep inside the Earth. It helps power cars, buses, and even makes electricity for our homes.\n\nFor a long time, these countries in the Gulf have worked hard to be good neighbours. They want to be friends and help each other. This helps everyone in their homes and schools to be safe and happy. They want to live in peace.\n\n<h3>Why is Peace So Important?</h3>\nWhen countries are peaceful, we call it 'regional stability'. Imagine your classroom. When everyone is kind, shares their toys, and plays nicely, your classroom is stable, right? Everyone feels safe, happy, and can learn better.\n\nPeace in the Gulf region means children can go to school without worry. It means parents can go to work safely. It means people can build new roads, hospitals, and homes. It makes life good for everyone.\n\nDid you know? When countries are stable, they can trade ideas and even invent new things that help everyone, everywhere in the world!\n\n<h3>What is 'Economic Prosperity'?</h3>\nWhen countries are peaceful and stable, they can also have 'economic prosperity'. This is a big word, but it just means having enough money for good things. It means families have enough food to eat and good clothes to wear.\n\nIt means there's money to build new schools for children and buy medicine for people who are sick. It means there's money to make life better for everyone in the country. Prosperity makes a country strong and its people happy.\n\n<h3>The Big Worry: A Possible Fight</h3>\nNow, let's talk about a worry that grown-ups are discussing. There are some very big and important countries: the United States of America, Israel, and Iran. These countries are far away from us, but what they do matters.\n\nSometimes, grown-ups in these countries have big disagreements. It's like when you and your friend want to play different games, and you just can't agree. But these disagreements are much, much bigger for countries.\n\nPeople are worried that these big disagreements could turn into something called a 'prolonged conflict'. A prolonged conflict is like a very long, sad fight that lasts for a very long time. Nobody wants a long fight.\n\n<h3>What Happens if There's a Long Fight?</h3>\nIf there is a long fight, many things could change. The peace, or 'stability', in the Gulf region could get 'disrupted'. Disrupted means broken or messed up. Imagine if your carefully built sandcastle was suddenly kicked over. That's disruptive.\n\nCountries that were friends might stop talking to each other. They might even get angry. This would make it harder for people living there to feel safe. Safety is one of the most important things for all of us.\n\nChildren might not be able to go to school every day. Parents might worry about going to work. It would not be a fun or safe situation for anyone living in that neighbourhood of countries. Everyone needs to feel secure in their homes and towns.\n\nDid you know? When there is a conflict, sometimes it means people have to leave their homes to find a safer place. This is very sad.\n\n<h3>How Does it Affect Money and Good Things?</h3>\nA big fight also makes it very hard for countries to have 'economic prosperity'. Remember, prosperity means having enough money for good things like food, clothes, and homes. It means being able to build schools and hospitals.\n\nIf there's a big fight, it might be hard for the Gulf countries to sell their oil to other countries. If they can't sell their oil, they don't get as much money. This money is what helps them buy food, medicine, and build important things for their people.\n\nIt's like if your parents couldn't go to work for a long time. It would be hard to buy food or new shoes, wouldn't it? That's why economic prosperity is so important for everyone. A big fight can make everything more expensive and harder to get.\n\n<h3>Why Should We Care, All the Way in Africa?</h3>\nYou might be thinking, 'But I live in Africa! Why does this matter to me?' That's a very good question, my clever friends!\n\nThe world is like one big, connected family. Even if some family members live far away, what happens to them can sometimes affect us too. If the price of oil goes up because of a fight, it might cost more for our parents to fill their cars with fuel here in Africa. Or it might cost more to make electricity for our homes and schools.\n\nWhen big countries fight, it can make the whole world a little bit more worried. We all want peace and happiness everywhere, don't we? We want all children to be safe, no matter where they live. That's why we hope for peace in the Gulf.\n\n<h3>Hoping for Peace and Friendship</h3>\nIt's important to remember that many grown-ups are working very hard for peace. They are talking to each other and trying to find ways for everyone to get along. They want to make sure there is no long fight.\n\nThey want to keep the Gulf region stable and prosperous. They want all countries to be friends and work together, just like we try to do in our schools and communities. Because peace is the best way for all of us to grow and shine!\n\nLet's hope that these big countries can solve their disagreements. Let's hope they can choose to be friends and keep everyone safe and happy. We all wish for a world where everyone plays nicely and helps each other.",
    "category": "world",
    "date": "2026-03-01T12:39:03.080Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Peace%20in%20a%20Busy%20Part%20of%20the%20World%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-peace-in-a-busy-part-of-the-world",
    "originalLink": "https://www.aljazeera.com/opinions/2026/3/1/the-us-israeli-war-on-iran-could-rewrite-gulf-security-calculations?traffic_source=rss"
  },
  {
    "originalTitle": "At least 148 dead after reported strike on school, Iran says",
    "title": "At least 148 dead after reported strike on school, Iran says",
    "content": "Iran has blamed the US and Israel for the strike; the US is looking into reports of the incident, while the IDF says it is \"not aware\" of operations in the area.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:39:08.728Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%20148%20dead%20after%20reported%20strike%20on%20school%2C%20Iran%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-148-dead-after-reported-strike-on-school-iran-says",
    "originalLink": "https://www.bbc.com/news/articles/c1l7rvqq51eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "One killed and 11 injured at Dubai and Abu Dhabi airports as Iran strikes region",
    "title": "One killed and 11 injured at Dubai and Abu Dhabi airports as Iran strikes region",
    "content": "Falling debris from intercepted Iranian drones and missiles cause widespread damage across the Gulf.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T12:39:13.933Z",
    "image": "https://image.pollinations.ai/prompt/One%20killed%20and%2011%20injured%20at%20Dubai%20and%20Abu%20Dhabi%20airports%20as%20Iran%20strikes%20region%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "one-killed-and-11-injured-at-dubai-and-abu-dhabi-airports-as-iran-strikes-region",
    "originalLink": "https://www.bbc.com/news/articles/c363zkp1pgxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know so far about the US-Israel attacks and Iran's retaliation",
    "title": "What we know so far about the US-Israel attacks and Iran's retaliation",
    "content": "Iran responds by launching missiles and drones towards Israel and four Gulf Arab countries that host US military bases.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:39:19.123Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20so%20far%20about%20the%20US-Israel%20attacks%20and%20Iran's%20retaliation%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-so-far-about-the-us-israel-attacks-and-irans-retaliation",
    "originalLink": "https://www.bbc.com/news/articles/cx2dyz6p3weo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Not fair to fans' - how VAR denied Burnley one of greatest comebacks",
    "title": "'Not fair to fans' - how VAR denied Burnley one of greatest comebacks",
    "content": "Burnley were set to complete one of the greatest Premier League comebacks - until VAR intervened. BBC Sport takes a look at whether the decisions were correct.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:39:24.729Z",
    "image": "https://image.pollinations.ai/prompt/'Not%20fair%20to%20fans'%20-%20how%20VAR%20denied%20Burnley%20one%20of%20greatest%20comebacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "not-fair-to-fans-how-var-denied-burnley-one-of-greatest-comebacks",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdjm83ljpmno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Free-scoring Semenyo takes burden off Haaland",
    "title": "Free-scoring Semenyo takes burden off Haaland",
    "content": "Manchester City have often been accused of being too reliant on Erling Haaland this season. There are signs that could be changing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T12:39:29.909Z",
    "image": "https://image.pollinations.ai/prompt/Free-scoring%20Semenyo%20takes%20burden%20off%20Haaland%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "free-scoring-semenyo-takes-burden-off-haaland",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg5nm2n9zzpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal set to celebrate St Totteringham's Day earlier than ever",
    "title": "Arsenal set to celebrate St Totteringham's Day earlier than ever",
    "content": "The day it becomes impossible for Spurs to finish above Arsenal in the Premier League, St Totteringham's Day is set to arrive earlier than ever.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-03-01T12:39:35.090Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20set%20to%20celebrate%20St%20Totteringham's%20Day%20earlier%20than%20ever%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-set-to-celebrate-st-totteringhams-day-earlier-than-ever",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwygre5geq2o?at_medium=RSS&at_campaign=rss"
  }
]