[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News from Far Away: Friends from Ghana in a Big War",
    "content": "<h3>Hello, My Wonderful Friends Across Africa!</h3>\nWelcome, welcome to our special news report! My name is Reporter Pendo, and I'm here to share important stories with you, our amazing kids of Africa. Today, we have some news that makes our hearts a little sad, but it's important to understand what is happening in our big world.\n\nToday, we are talking about our friends from a beautiful country called Ghana. Ghana is a lovely place in West Africa, just like many of your homes. It's famous for delicious cocoa, which makes yummy chocolate!\n\n<h3>What is News?</h3>\nNews is how we learn about things happening far away and close to home. It helps us understand the world around us. Sometimes, the news tells us happy things, like when a new school opens or a baby animal is born. And sometimes, the news tells us sad things, which also helps us learn and think about how we can make things better.\n\n<h3>Sad News from Far Away</h3>\nWe have heard some sad news from a place very, very far from Ghana and all of us here in Africa. This news is about a big war happening between two countries. A war is when countries fight with each other, and it makes many people very sad and unsafe. It's like when friends have a big, big argument and don't want to play together anymore, but much more serious.\n\nDid you know? Peace is when everyone is happy and safe, and there is no fighting. It's like when all your friends play together nicely!\n\n<h3>Our Home, Ghana!</h3>\nLet's talk a little more about Ghana. Ghana is a very special country in Africa. It has lovely beaches, beautiful forests, and kind, friendly people. Many children just like you live in Ghana, play games, and go to school every day. They love their families and their country very much.\n\nDid you know? Ghana was the first country in Africa south of the Sahara Desert to become independent. That means they were the first to make their own rules and govern themselves!\n\n<h3>Countries Far, Far Away: Russia and Ukraine</h3>\nNow, let's talk about the countries where this sad news comes from. These countries are called Russia and Ukraine. They are very far away from Africa, on another big part of the world map. Imagine flying in an aeroplane for many, many hours – that's how far they are!\n\nFor a long time, Russia and Ukraine have been having a very big fight, a war. This war has caused a lot of trouble and sadness for many people who live there, and even for people from other parts of the world, like some of our friends from Ghana.\n\n<h3>Why Were Ghanaians There?</h3>\nYou might be wondering why people from Ghana would be so far away in a place where there is a war. Well, many people from Ghana, both young and old, travel to different countries for many reasons. Some go to study in big universities, to learn new things and get good jobs. Others go to work and send money back home to their families. Some simply live there with their families.\n\nSo, when the big fight, the war, started between Russia and Ukraine, there were many people from Ghana living, studying, and working in those countries. They were just like you and me, trying to live their lives, go to school, or do their jobs.\n\n<h3>What Happened to Our Friends?</h3>\nNow for the saddest part of our news. Our leaders in Ghana have told us that some people from Ghana who were in Russia and Ukraine have sadly lost their lives because of this war. They are called 'casualties' which means people who got hurt very badly or died because of the fighting. This means they will not be coming home to their families in Ghana.\n\nIt is very, very sad news when anyone gets hurt or dies because of a war. And it is even sadder when it happens to people from our own African family. We all feel very sad for their families and friends back home in Ghana.\n\n<h3>How Many Friends?</h3>\nThe news tells us that at least 55 people from Ghana have sadly died in this far-away war. That is a big number of people. Imagine if 55 of your classmates or friends from your neighbourhood were suddenly gone. It would make everyone very, very sad.\n\nThis is the biggest number of people from one African country who have been lost in this war. It reminds us that even when wars happen far away, they can still touch our lives and our continent.\n\n<h3>Why is This Important for Us?</h3>\nThis news is important because it reminds us that we are all connected in this big world. Even if Ghana is far from where you live, and Russia and Ukraine are even further, we are all part of the same human family. When someone from our African family is sad, we all feel a little sad too.\n\nIt makes us think about how precious peace is. Peace means everyone is safe, happy, and living together without fighting. We all want peace for our homes, for Africa, and for the whole world.\n\nDid you know? Africa is a giant continent, and it is made up of 54 different countries! We are all neighbours on this amazing land.\n\n<h3>Wishing for Peace</h3>\nWhen we hear sad news like this, it makes us want to wish for peace even more. We wish that the fighting in Russia and Ukraine will stop, and that everyone can live safely again. We also think about the families in Ghana who are missing their loved ones.\n\nDid you know? When you show kindness to a friend, you are helping to make peace in your own small world!\n\n<h3>What Can We Do?</h3>\nEven though we are children, we can still do important things. We can be kind to our friends and family every day. We can share our toys and listen to each other. We can learn about different countries and cultures, so we understand each other better. These are all small steps towards a more peaceful world.\n\nWe can also send good thoughts to the families in Ghana who are hurting. We can wish for peace and safety for everyone, everywhere. Every little bit of kindness helps make the world a better place.\n\n<h3>Let's Remember</h3>\nSo, my dear friends, remember to be kind, to value peace, and to always care for each other. We might be small, but our hearts are big. And together, we can hope for a world where everyone is safe and happy. Thank you for listening, and until next time, keep shining bright! Reporter Pendo, signing off!",
    "summary": "Sad news has come from far away: at least 55 people from Ghana, a country in Africa, have sadly died in a big war happening between two countries called Russia and Ukraine.",
    "whyMatters": "This is important because these people were part of our big African family, and it reminds us how precious peace is and how we should all care for each other to keep everyone safe and happy, even when wars happen far away.",
    "category": "world",
    "date": "2026-03-01T07:29:34.283Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Far%20Away%3A%20Friends%20from%20Ghana%20in%20a%20Big%20War%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-far-away-friends-from-ghana-in-a-big-war",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "content": "He used the girls' mother's life-threatening illness as an opportunity to demand sex, said the US Office of Public Affairs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:29:39.473Z",
    "image": "https://image.pollinations.ai/prompt/Former%20US%20diplomat%20sentenced%20to%20life%20for%20abusing%20two%20girls%20in%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "former-us-diplomat-sentenced-to-life-for-abusing-two-girls-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "A Big, Beautiful Palace in Morocco! What Happened When a Man Tried to Buy It?",
    "content": "Hello, Super Reporters! Welcome to our special news report from Africa! Today, we have a story about a very big and very beautiful house in a lovely country. Let's imagine together!\n\n<h3>A Wonderful Palace in Morocco</h3>\nImagine a country with lots of sunshine and colourful markets. This country is in Africa, and it's called Morocco! Morocco is famous for its amazing buildings and friendly people. Some of these buildings are so big and fancy, we call them palaces.\n\n\nDid you know? Morocco is a country in North Africa, and it has beautiful coastlines along the Atlantic Ocean and the Mediterranean Sea!\n\n<h3>What is a Palace?</h3>\nA palace is like a super-duper big house. It's often built for kings, queens, or very important people. Palaces usually have many, many rooms, big gardens, and sometimes even swimming pools! They are decorated with amazing designs and bright colours.\n\n\nThe palace in our story was very special. It was called Bin Ennakhi. Sounds like a magical name, right? It was a very luxurious place, which means it was super fancy and beautiful.\n\nDid you know? Some palaces have hundreds of rooms! Imagine trying to count them all!\n\n<h3>A Man Wanted This Palace</h3>\nOnce upon a time, not long ago, in the year 2019, a man named Mr. Epstein was very interested in this amazing palace. He saw how beautiful it was and wanted to make it his own. He started talking to the people who owned the palace.\n\n\nHe wanted to 'buy' it. Buying something means you give money to someone, and then that thing becomes yours. For a palace, you need a LOT of money!\n\nDid you know? When you buy a big house, it's called 'real estate'! It's like buying a piece of land and the house on it.\n\n<h3>Almost Bought It!</h3>\nMr. Epstein was very close to buying the Bin Ennakhi palace. He was having many important talks, and it looked like the palace would soon have a new owner. He probably dreamt of walking through its big gardens and swimming in its pool.\n\n\nHe was making all the plans to get this beautiful home in Morocco. Everything was going ahead, and the papers were almost ready to be signed. It was an exciting time for those who owned the palace, thinking it would find a new family.\n\nDid you know? It takes many steps to buy a house, especially a very big one like a palace! There are lots of papers to read and sign.\n\n<h3>But Then... Something Happened!</h3>\nJust when Mr. Epstein was about to finish buying the palace, something big happened. It was a surprise for everyone. Days before he could complete the purchase, he was 'arrested'.\n\n\nWhen someone is arrested, it means the police come and take them away because they believe something wrong might have happened. This means Mr. Epstein could not continue with his plan to buy the palace.\n\n\nBecause he was arrested, he couldn't finish the important talks or sign the last papers. So, the purchase was never completed. The palace did not become his.\n\nDid you know? The police are there to help keep everyone safe and make sure people follow the rules. It's their job to look after us!\n\n<h3>The Palace Did Not Get a New Owner</h3>\nSo, even though Mr. Epstein wanted the palace very much and was very close to buying it, he never did. The beautiful Bin Ennakhi palace in Morocco stayed with its original owners.\n\n\nIt continued to stand tall and grand in lovely Morocco. This story shows how sometimes, even when you really want something, things can change very quickly. It was a big surprise for everyone involved!\n\nDid you know? This happened in the summer of 2019, just a few years ago! Time flies by quickly!\n\n<h3>More About Beautiful Morocco</h3>\nMorocco is a truly special place. Besides big palaces, it has bustling cities with ancient walls, and huge deserts where you can see camels! People often drink delicious mint tea there, and the air smells of spices.\n\n\nThe art and crafts from Morocco are also very famous. They make colourful carpets, beautiful pottery, and lovely lamps. It's a country full of wonders and happy vibes.\n\nDid you know? Camels are sometimes called 'ships of the desert' because they can travel for a long time without water, helping people cross big, sandy areas!\n\n<h3>Big Houses Around the World</h3>\nWhile not everyone lives in a palace, it's fun to imagine! All over the world, there are many different kinds of homes. Some are tall buildings, some are small huts, and some are like regular houses. The most important thing is that a home is a safe and happy place.\n\n\nThis story reminds us that life is full of surprises. Sometimes plans don't work out the way we expect them to. But the beautiful palace in Morocco remains, a grand building in a wonderful land.\n\nDid you know? Some people live in homes that float on water, called houseboats! And others live in houses built high up in trees!\n\n<h3>A Story About Choices</h3>\nSo, that's our story about the man who wanted a palace but couldn't get it. It teaches us that actions have consequences and that sometimes, important things stop plans from happening. It’s always good to be fair and follow the rules!\n\n\nWe hope you enjoyed learning about this big house in lovely Morocco. Until next time, keep exploring and learning, Super Reporters!",
    "summary": "A man named Mr. Epstein tried to buy a very big and beautiful palace called Bin Ennakhi in Morocco in 2019, but he couldn't finish buying it because he was arrested days before the purchase was complete.",
    "whyMatters": "This story matters because it shows how even very important plans can change quickly when something unexpected happens, like the police getting involved. It also tells us about beautiful palaces in Africa!",
    "category": "world",
    "date": "2026-03-01T07:30:01.449Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%2C%20Beautiful%20Palace%20in%20Morocco!%20What%20Happened%20When%20a%20Man%20Tried%20to%20Buy%20It%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-beautiful-palace-in-morocco-what-happened-when-a-man-tried-to-buy-it",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Thousands in Iran mourn Khamenei’s killing",
    "title": "A Sad Day in Iran: People Miss Their Big Leader",
    "content": "<h3>Hello from Your News Friend!</h3>\nHello, my little news adventurers! It’s your friendly reporter here, sharing news from all over our big, wonderful world. Today, we have some news from a place far, far away from our beautiful Africa. It’s a country called Iran. Sometimes, news can be a bit sad, but it’s important to understand what’s happening in other parts of our global village. We always try to tell you things in a way that is kind and easy to understand.\n\n<h3>A Sad Day in a Faraway Land Called Iran</h3>\nImagine a country that is very, very far from where you live. It's called Iran. It's a land with its own special mountains, deserts, and cities, just like our countries in Africa have amazing places too! Right now, in Iran, many people are feeling very, very sad. It’s like when someone important in your family goes away, and everyone feels a big ache in their hearts. People are crying and remembering someone very special.\n\n**Did you know?** Iran is a country in Asia, a very big continent! It has a long history and beautiful ancient buildings.\n\n<h3>Who Was the Big Leader?</h3>\nEvery country has people who help run it, like a principal runs a school, or your parents run your home. In Iran, there was a very, very important leader. He was called the \"Supreme Leader.\" Imagine someone who is like the main boss, the most important person who helps make big decisions for the whole country. His name was Ayatollah Ali Khamenei. He was very old and had been the leader for many, many years. For many people in Iran, he was like a father figure or a very wise elder.\n\n**Did you know?** A \"Supreme Leader\" is like the head coach for a whole country's team! They guide the country on its path.\n\n<h3>Why Are People So Sad?</h3>\nThe news that made everyone sad is that their big leader, Ayatollah Ali Khamenei, is not with them anymore. He was killed. This happened because of some \"strikes.\" What are strikes? Imagine someone sending a very fast, very powerful message from far away, and that message hits something. In this case, it was a very big, powerful hit. These hits came from two other countries, the United States (which is often called the US) and Israel. These countries are also very far away. When this happened, it made a lot of people in Iran feel very angry and very, very sad all at once. It’s a bit like when friends have a big disagreement, but this was a disagreement between countries, which can be very serious.\n\n**Did you know?** The United States is a huge country across the ocean, and Israel is another country in the Middle East, near Iran.\n\n<h3>Many People Gather to Show Sadness</h3>\nWhen something very sad happens, people often come together to comfort each other and remember the person who is gone. In Iran, thousands and thousands of people gathered. Imagine a whole football stadium filled with people, and then imagine many, many more! They walked together in big crowds, wearing sad clothes, and many were crying. This is called \"mourning.\" When you mourn, you show that you are very sad and that you miss someone a lot. They held pictures of their leader and shared their feelings of sorrow. It was a very quiet and serious day for many, many families in Iran.\n\n**Did you know?** In many cultures around the world, people wear special clothes or have ceremonies when someone important passes away. It's a way to show respect and sadness.\n\n<h3>Strong Words from Special Soldiers</h3>\nNow, when something like this happens, some groups of people can feel very, very angry. There is a special group in Iran called the \"IRGC.\" This is like a very strong and important army group in their country. When they heard the news, they said very, very strong words. They said they would \"retaliate.\" What does \"retaliate\" mean? It means they want to do something back, because they are angry and feel that something unfair happened to their leader. It’s like if someone pushes your friend, and you feel like pushing them back. But in this case, it’s between countries and their armies, which can be very serious. They said they would do something \"across the region,\" which means in all the nearby countries and places.\n\n**Did you know?** Armies are groups of people who protect their country, but sometimes they also get involved in disagreements with other countries.\n\n<h3>What Does This Mean for Everyone?</h3>\nWhen big countries have disagreements and angry words are spoken, it can make everyone feel a bit worried. It’s like when your friends argue loudly; it makes the whole playground feel a bit tense. The \"region\" means all the countries and places nearby Iran. So, when the IRGC says they want to do something across the region, it means they might want to show their anger in places close to Iran. Grown-ups all over the world, including leaders in Africa, usually wish for peace. They know that when countries fight, it can make many people sad and cause problems for everyone. It's much better when people talk and try to solve problems without fighting.\n\n**Did you know?** The world has many different countries, and sometimes they work together, and sometimes they have problems, just like people!\n\n<h3>Wishing for Peace</h3>\nEven though this news is about anger and sadness, it’s also a time for us to remember how important peace is. Peace means that everyone can live safely, play, and learn without fear. It means that countries can talk to each other and be friends, even if they have different ideas. When sad things happen, it is a chance for grown-ups to try extra hard to find ways for everyone to get along. We hope that the leaders in Iran and other countries will choose to talk and find peaceful ways to deal with their sadness and anger, so that no more people have to feel sad or scared. Everyone, everywhere, deserves to live in a world filled with kindness and peace.",
    "summary": "People in Iran are very sad because their important leader died after being hit by other countries, and now a special army group there is very angry and wants to take strong actions.",
    "whyMatters": "This is important because it shows that sometimes countries can have big problems that make many people sad, and it reminds us that talking and peace are always the best way to solve things.",
    "category": "world",
    "date": "2026-03-01T07:30:26.735Z",
    "image": "https://image.pollinations.ai/prompt/A%20Sad%20Day%20in%20Iran%3A%20People%20Miss%20Their%20Big%20Leader%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-sad-day-in-iran-people-miss-their-big-leader",
    "originalLink": "https://www.aljazeera.com/gallery/2026/3/1/thousands-in-iran-mourn-khameneis-killing?traffic_source=rss"
  },
  {
    "originalTitle": "Despite antiwar MAGA wing, Trump gets Republican support for Iran strikes",
    "title": "Despite antiwar MAGA wing, Trump gets Republican support for Iran strikes",
    "content": "Conservative opposition to war on Iran remains minimal as hawks heap praise on Trump for bombing, killing Khamenei.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T07:30:31.917Z",
    "image": "https://image.pollinations.ai/prompt/Despite%20antiwar%20MAGA%20wing%2C%20Trump%20gets%20Republican%20support%20for%20Iran%20strikes%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "despite-antiwar-maga-wing-trump-gets-republican-support-for-iran-strikes",
    "originalLink": "https://www.aljazeera.com/news/2026/3/1/despite-antiwar-maga-wing-trump-gets-republican-support-for-iran-strikes?traffic_source=rss"
  },
  {
    "originalTitle": "Netanyahu’s war? Analysts say Trump’s Iran strikes benefit Israel, not US",
    "title": "Netanyahu’s war? Analysts say Trump’s Iran strikes benefit Israel, not US",
    "content": "War with Iran contradicts the US president's own criticism of regime change policies in the Middle East, analysts say.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-03-01T07:30:37.176Z",
    "image": "https://image.pollinations.ai/prompt/Netanyahu%E2%80%99s%20war%3F%20Analysts%20say%20Trump%E2%80%99s%20Iran%20strikes%20benefit%20Israel%2C%20not%20US%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "netanyahus-war-analysts-say-trumps-iran-strikes-benefit-israel-not-us",
    "originalLink": "https://www.aljazeera.com/news/2026/3/1/netanyahus-war-analysts-say-trumps-iran-strikes-benefit-israel-not-us?traffic_source=rss"
  },
  {
    "originalTitle": "Ayatollah Khamenei's iron grip on power in Iran comes to an end",
    "title": "Ayatollah Khamenei's iron grip on power in Iran comes to an end",
    "content": "Iranian state TV confirms the supreme leader has been killed on the first day of massive US and Israeli air strikes on the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:30:42.793Z",
    "image": "https://image.pollinations.ai/prompt/Ayatollah%20Khamenei's%20iron%20grip%20on%20power%20in%20Iran%20comes%20to%20an%20end%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ayatollah-khameneis-iron-grip-on-power-in-iran-comes-to-an-end",
    "originalLink": "https://www.bbc.com/news/articles/c3gdnpjvj4ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know so far: Supreme Leader Khamenei killed, as Iran launches retaliatory strikes",
    "title": "What we know so far: Supreme Leader Khamenei killed, as Iran launches retaliatory strikes",
    "content": "Iran responds by launching missiles and drones towards Israel and four Gulf Arab countries that host US military bases.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:30:47.982Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20so%20far%3A%20Supreme%20Leader%20Khamenei%20killed%2C%20as%20Iran%20launches%20retaliatory%20strikes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-so-far-supreme-leader-khamenei-killed-as-iran-launches-retaliatory-strikes",
    "originalLink": "https://www.bbc.com/news/articles/cx2dyz6p3weo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran says US and Israel strikes hit school killing 108",
    "title": "Iran says US and Israel strikes hit school killing 108",
    "content": "There is no confirmation by the US or Israel of the strike on the school located near elite military troops.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:30:53.174Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20says%20US%20and%20Israel%20strikes%20hit%20school%20killing%20108%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-says-us-and-israel-strikes-hit-school-killing-108",
    "originalLink": "https://www.bbc.com/news/articles/c1l7rvqq51eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Celtic and Rangers face double jeopardy in derby like no other'",
    "title": "'Celtic and Rangers face double jeopardy in derby like no other'",
    "content": "BBC Scotland chief sportswriter Tom English sets the scene going into a compelling Old Firm spectacle on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:30:58.620Z",
    "image": "https://image.pollinations.ai/prompt/'Celtic%20and%20Rangers%20face%20double%20jeopardy%20in%20derby%20like%20no%20other'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "celtic-and-rangers-face-double-jeopardy-in-derby-like-no-other",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj98yny3m3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Free-scoring Semenyo takes burden off Haaland",
    "title": "Free-scoring Semenyo takes burden off Haaland",
    "content": "Manchester City have often been accused of being too reliant on Erling Haaland this season. There are signs that could be changing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:31:03.807Z",
    "image": "https://image.pollinations.ai/prompt/Free-scoring%20Semenyo%20takes%20burden%20off%20Haaland%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "free-scoring-semenyo-takes-burden-off-haaland",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg5nm2n9zzpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Carrick not interested in personal Glasner duel",
    "title": "Carrick not interested in personal Glasner duel",
    "content": "Manchester United interim boss Michael Carrick comes up against one of the major contenders for the permanent job when Oliver Glasner's Crystal Palace go to Old Trafford on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T07:31:08.984Z",
    "image": "https://image.pollinations.ai/prompt/Carrick%20not%20interested%20in%20personal%20Glasner%20duel%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "carrick-not-interested-in-personal-glasner-duel",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd03402x4edo?at_medium=RSS&at_campaign=rss"
  }
]