[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "content": "This is the highest number of confirmed casualties from a single African country in the Ukraine-Russia war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:20:19.252Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2055%20Ghanaians%20killed%20in%20Russia-Ukraine%20war%2C%20minister%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-55-ghanaians-killed-in-russia-ukraine-war-minister-says",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "A Grown-Up Who Did Bad Things Gets Caught and Punished!",
    "content": "Hello, my amazing friends! Today, we have a very important story from a country called Burkina Faso. It's about how important it is for everyone, especially grown-ups, to follow rules and be kind. Sometimes, grown-ups make big mistakes and do things that are very, very wrong. When that happens, there are special people who make sure justice happens. Justice means making things right and making sure bad people get consequences for their actions. This story is about a grown-up who did very bad things, and now he is in big trouble.\n\n<h3>Who Was This Grown-Up?</h3>\nThis story is about a grown-up man who used to work for his country. He was someone who traveled to different countries for his job, kind of like a special helper. He was visiting a country called Burkina Faso, which is a lovely place in Africa. People in such jobs are expected to be extra kind and helpful. But this man forgot all about being kind and doing the right thing. He chose to do something very wrong instead.\n\n<h3>What Bad Things Did He Do?</h3>\nIn Burkina Faso, there were two young girls. Just like you, they were children who deserved to be safe and happy. Their mommy was very, very sick. When someone is sick, they need extra help and care, right? This grown-up man should have been kind and helpful. But instead, he was not. He saw that their mommy was sick, and he used this sad time to do very, very bad things to the girls. He made them feel unsafe and scared. He asked them to do things that children should never have to do. This was wrong, wrong, wrong. Grown-ups are supposed to protect children, not hurt them or make them feel scared.\n\n<h3>Why Is This So Wrong?</h3>\nEvery country has rules, and every family has rules, too. These rules are like special instructions to keep everyone safe and happy. One of the biggest rules is that grown-ups must always, always be kind to children and keep them safe. They should never, ever hurt children or make them feel uncomfortable. What this man did was break this very important rule. He took advantage of a sad situation – the girls' mommy being sick – and used it to be mean and do bad things. That is not how good grown-ups act. It made the girls very sad and scared, and that is never okay.\n\nDid you know? There are special rules all over the world that say children must be protected. These rules are called \"children's rights,\" and they help make sure every child is safe, happy, and healthy!\n\n<h3>Where Is Burkina Faso?</h3>\nBurkina Faso is a beautiful country in West Africa. It has lovely sunshine and warm, friendly people. It's a place with its own special history, music, and delicious food. Imagine a place where children play games and learn in school, just like you! The people there care about their children very much. That’s why it was so important that this bad grown-up was caught for what he did in their country. Even though he was not from Burkina Faso, he still had to follow their rules and be a good person while he was there.\n\nDid you know? The name \"Burkina Faso\" means \"Land of Upright People\" or \"Land of Incorruptible People.\" Isn't that a wonderful name? It shows how much the people there value honesty and doing the right thing!\n\n<h3>Getting Caught and Punished</h3>\nWhen someone does something very wrong, like this grown-up did, there are brave people who find out and help. These people are like detectives and helpers. They listened to the girls and found out what happened. Then, the grown-up had to go to a special place called a court. A court is where judges listen to all the stories and decide if someone broke the rules. They look at all the clues and decide what is fair. In this story, the judge listened very carefully and understood that this grown-up had done terrible things to the two girls.\n\nDid you know? When someone breaks a big rule, we call it a \"crime.\" The police and courts work together to make sure that people who commit crimes are caught and judged fairly.\n\n<h3>What Does \"Sentenced to Life\" Mean?</h3>\nThe judge decided that because the man did such very, very bad things, he needed a big punishment. The judge said he would be \"sentenced to life.\" This means he will go to a special jail and stay there for a very, very, very long time. For almost his whole life. This is a big punishment for a big mistake. It means he cannot hurt other children, and it helps show everyone that hurting children is never, ever okay. It is a way to protect other children and to make sure people who do bad things understand the seriousness of their actions.\n\nDid you know? In many places, when someone gets \"sentenced to life,\" it means they will spend the rest of their natural life in prison. It's one of the biggest punishments for very serious crimes.\n\n<h3>Why Rules Are So Important</h3>\nThis story shows us how important rules are. Rules are not just for playing games; they are for keeping everyone safe in real life too. Rules help us know what is right and what is wrong. When grown-ups follow rules, children feel safe and happy. When grown-ups break rules, especially rules about being kind to children, it causes a lot of hurt. This story reminds us that everyone, big or small, needs to follow rules and be kind to each other.\n\nDid you know? Sometimes rules are called \"laws.\" Laws are like super important rules for everyone in a country.\n\n<h3>Who Can Help You?</h3>\nIf anyone, grown-up or child, ever makes you feel unsafe, scared, or uncomfortable, it is so important to tell a grown-up you trust. This could be your mommy, daddy, grandma, grandpa, a teacher, or another grown-up who always makes you feel safe. You should tell them right away! You are brave, and your feelings matter. No one has the right to make you feel bad or scared. There are always people who want to help you.\n\nDid you know? It's always okay to say \"NO!\" if someone asks you to do something that makes you feel bad, even if it's a grown-up. Your body belongs to you!\n\n<h3>A Safe World for Kids</h3>\nEven though this story is a bit sad because of the bad things that happened, it also shows us something good: that good people will work to make things right. It shows us that rules are important, and people who break them get caught. It reminds us that we all need to look out for each other and make sure every child feels safe, loved, and happy. Let's all be kind and help make our world a wonderful and safe place for everyone!",
    "summary": "A grown-up who hurt two children in Burkina Faso has been caught and will stay in jail for a very long time, showing that bad actions have big consequences.",
    "whyMatters": "This story is important because it teaches us that rules keep everyone safe, especially children, and that people who do bad things will always be held accountable.",
    "category": "world",
    "date": "2026-03-01T10:20:44.574Z",
    "image": "https://image.pollinations.ai/prompt/A%20Grown-Up%20Who%20Did%20Bad%20Things%20Gets%20Caught%20and%20Punished!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-grown-up-who-did-bad-things-gets-caught-and-punished",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "content": "The disgraced financier was in talks to buy luxury abode Bin Ennakhi - but the purchase was never completed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:20:49.760Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20tried%20to%20buy%20a%20palace%20in%20Morocco%20days%20before%20his%20arrest%20in%202019%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-tried-to-buy-a-palace-in-morocco-days-before-his-arrest-in-2019",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israel closes Gaza’s Rafah crossing amid attacks on Iran",
    "title": "Israel closes Gaza’s Rafah crossing amid attacks on Iran",
    "content": "The crossing with Egypt is considered vital for delivery of humanitarian aid and evacuation of critically ill patients.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:20:55.130Z",
    "image": "https://image.pollinations.ai/prompt/Israel%20closes%20Gaza%E2%80%99s%20Rafah%20crossing%20amid%20attacks%20on%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israel-closes-gazas-rafah-crossing-amid-attacks-on-iran",
    "originalLink": "https://www.aljazeera.com/news/2026/3/1/israel-closes-gazas-rafah-crossing-amid-attacks-on-iran?traffic_source=rss"
  },
  {
    "originalTitle": "Iran to form interim council to oversee transition after Khamenei’s killing",
    "title": "Iran to form interim council to oversee transition after Khamenei’s killing",
    "content": "Security chief Larijani pledges swift establishment of provisional council as Iran navigates its leadership transition.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:21:00.309Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20to%20form%20interim%20council%20to%20oversee%20transition%20after%20Khamenei%E2%80%99s%20killing%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-to-form-interim-council-to-oversee-transition-after-khameneis-killing",
    "originalLink": "https://www.aljazeera.com/news/2026/3/1/iran-to-form-interim-council-to-oversee-transition-after-khameneis-killing?traffic_source=rss"
  },
  {
    "originalTitle": "Video: Smoke seen rising from Dubai’s main shipping port after Iran attack",
    "title": "Big Smoke, Big Ships: A Story from Dubai!",
    "content": "Hi everyone! It's your kid-friendly news reporter here, bringing you super important news from faraway lands! Today, we're talking about a city called Dubai. It's a very busy place, full of tall buildings and fast cars.\n\n<h3>What Happened in Dubai?</h3>\nImagine you're playing outside, and you see a big puff of smoke far away. That's a bit like what happened in Dubai. People saw some smoke rising from a very important place called Jebel Ali Port.\n\nIt was a Sunday morning, just like when you might be eating your pancakes or playing games. The smoke was big enough for many people to see it.\n\nSmoke usually means there might be a fire, right? But grown-ups acted very fast to see what was happening.\n\n<h3>Where is Dubai?</h3>\nDubai is a super cool city! It's in a country called the United Arab Emirates. This country is not in Africa, but it's not super far either. It's across a big ocean, towards the east from where we are.\n\n**Did you know?** Dubai has some of the tallest buildings in the whole wide world! Imagine a building so tall it touches the clouds!\n\nIt's a desert city, which means it can be very hot and sandy. But people have built amazing things there, like big shopping malls and beautiful parks.\n\n<h3>What is a Port?</h3>\nNow, let's talk about Jebel Ali Port. What exactly is a \"port\"? Imagine a giant parking lot, but not for cars. It's a parking lot for super big ships!\n\nThese ships are like floating cities. They travel all across the world, carrying lots and lots of things.\n\nThink about your favorite toy or your comfy shoes. Many of them might have traveled on a big ship from one country to another.\n\nA port is where these ships come to stop. They unload all the things they carried. Then, they load new things to take to another country. It's a super busy place, like a beehive but for ships!\n\n**Did you know?** Jebel Ali Port is one of the biggest ports in the world! So many ships come and go from there every single day. It's amazing!\n\n<h3>Why Was There Smoke?</h3>\nSo, why was there smoke at this very busy port? Well, sometimes, when grown-ups in different countries have big arguments, or when things get a bit messy, unexpected things can happen.\n\nThere had been some serious talks and disagreements between grown-ups in different countries, especially with a country called Iran.\n\nAround that time, people saw the smoke. It makes us think about what happens when grown-ups don't agree.\n\nIt's a reminder that even far away, things can sometimes get a bit tricky. But many people work hard to make sure everyone is safe.\n\n<h3>Keeping Everyone Safe</h3>\nWhen there's smoke or something unexpected happens, lots of brave people jump into action. Firefighters, police officers, and many other helpers quickly go to see what's wrong.\n\nTheir job is to make sure everyone is okay and to put out any fires. They are superheroes without capes!\n\nWe always hope that everyone stays safe, no matter where they are in the world. Safety is super important, just like when your parents tell you to be careful when playing.\n\n<h3>Why Does This Matter to Us in Africa?</h3>\nYou might be thinking, \"Dubai is far away! Why should I know about this?\" That's a great question!\n\nEven though Dubai is not in Africa, it's a very important stop for ships that travel all around the world.\n\nSome of the things we use and enjoy here in Africa, like certain clothes, electronics, or even parts for cars and buses, might pass through ports like Jebel Ali.\n\nSo, when things are calm and peaceful at these big ports, it helps make sure that the things we need and want can arrive safely and on time.\n\nIt's like a big worldwide game of connect-the-dots, and ports are some of the most important dots!\n\n**Did you know?** Ships carry almost 90% of all the things bought and sold around the world! That's a LOT of toys and food and clothes!\n\n<h3>Learning About Our World</h3>\nIt's always good to learn about what's happening in different parts of our big, beautiful world. Even if it sounds a bit serious, knowing helps us understand.\n\nIt helps us remember that we are all part of one big family, living on one amazing planet.\n\nWe always hope for peace and kindness everywhere. When grown-ups talk instead of having disagreements, it makes the world a happier and safer place for everyone, especially for kids like you!\n\nLet's always wish for peaceful seas and calm ports, so all the ships can keep sailing smoothly, bringing good things to everyone.",
    "summary": "Smoke was seen at a big ship port in Dubai after some disagreements between countries, reminding us about safety and peace.",
    "whyMatters": "It's important because big ports like the one in Dubai help bring many things, like toys and clothes, to us in Africa, and when things are calm there, everyone is safer and happier around the world.",
    "category": "world",
    "date": "2026-03-01T10:21:22.103Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Smoke%2C%20Big%20Ships%3A%20A%20Story%20from%20Dubai!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-smoke-big-ships-a-story-from-dubai",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/video-smoke-seen-rising-from-dubais-main-shipping-port-after-iran-attack?traffic_source=rss"
  },
  {
    "originalTitle": "Ayatollah Khamenei's iron grip on power in Iran comes to an end",
    "title": "Ayatollah Khamenei's iron grip on power in Iran comes to an end",
    "content": "Iranian state TV confirms the supreme leader has been killed on the first day of massive US and Israeli air strikes on the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:21:28.015Z",
    "image": "https://image.pollinations.ai/prompt/Ayatollah%20Khamenei's%20iron%20grip%20on%20power%20in%20Iran%20comes%20to%20an%20end%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ayatollah-khameneis-iron-grip-on-power-in-iran-comes-to-an-end",
    "originalLink": "https://www.bbc.com/news/articles/c3gdnpjvj4ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know so far: Supreme Leader Khamenei killed, as Iran launches retaliatory strikes",
    "title": "News from Far Away: When Countries Get Upset",
    "content": "Jambo, amazing explorers and wonderful friends across Africa! Your friend here, ready to share some big news with you. Sometimes, things happen very far away from our homes, and it's good to understand them, even if they sound a little grown-up. We're going to talk about some countries far, far away, and why sometimes they get upset, just like friends sometimes get upset on the playground.\n\n<h3> What Happened Far Away? </h3>\nImagine a big, big map of the world. On this map, far, far away from our beautiful continent of Africa, there are two countries we're going to talk about today. One is called Iran, and another is called Israel. They are like neighbors, but very far from us. Think of it like a classmate who lives on the other side of town – you don't see them every day, but you know they are there.\n\nSometimes, countries can have big disagreements, just like you might have a disagreement with a friend over a toy. When countries get very, very upset, they sometimes do things that make us worried. This is what happened recently. It's like a big argument between two distant families.\n\nThe country called Iran decided to send some special flying things. These flying things went towards Israel, and also to some other nearby countries. It's a bit like someone throwing a paper airplane when they are upset, but these were much, much bigger and faster. They flew through the sky, making people wonder what was happening.\n\n<h3> What Are These Flying Things? </h3>\nLet's talk about these flying things. Some of them are called 'missiles.' You can think of a missile like a super-fast, giant rocket, but it's not going to space. It's designed to fly from one place to another very quickly. These are not toys you play with; they are big machines that can travel very far and very fast.\n\nAnd then there are 'drones.' Have you ever seen a small drone fly in the sky? Maybe your older brother or sister has one? Well, these drones are like bigger versions of those. They are flying robots, and they can fly without a person inside them. So, Iran sent these big rockets (missiles) and flying robots (drones) towards the other countries. They are controlled by people from far away.\n\n**Did you know?**\nDid you know that drones can be used for many good things too? Like taking cool pictures from the sky or even helping to deliver medicines and food to places that are hard to reach in Africa! But sometimes, like in this story, they are used in ways that make people worried.\n\n<h3> Where Did They Go? </h3>\nThese missiles and drones, sent by Iran, flew towards Israel. Israel is a country that is near Iran, a bit like how Kenya is near Tanzania. They are neighbors in that part of the world, even if there's some land or water between them. They share a neighborhood on the world map.\n\nBut they also flew towards some other countries nearby. These other countries are special because they have places called 'military bases.' Think of a military base like a special camp or a big home where brave helpers, called soldiers, live and train. In these places, there are often soldiers from another country, like America, who are there to help keep peace and be friends with the people of that country. They are like guests who are there to assist.\n\n**Did you know?**\nDid you know that many countries around the world have friends in other countries? They help each other out, just like good neighbors or classmates help each other with their chores or homework! They form special partnerships.\n\n<h3> Why Did This Happen? </h3>\nSo, why did Iran send these flying things? Well, it's because they felt very upset. When we say 'retaliatory strikes,' it means that Iran felt like something bad happened to them first, and they were sending these flying things back to show they were angry. It's like if someone pushes you, and you push them back. It's not a good thing, and it often makes things worse, creating more unhappiness.\n\nIt's like when you have a disagreement with a friend. Sometimes, one person does something that makes the other person very sad or angry. Then the other person might react. In this case, countries are doing it with these big flying machines because of a very serious disagreement.\n\nAdults, like your parents and teachers, always tell us it's better to talk about our feelings and problems, not to fight or throw things. And that's exactly what many grownups around the world are trying to do right now – to get these countries to talk and find a peaceful way to solve their problems. They want them to sit down and discuss things calmly.\n\n<h3> What Does This Mean for Us in Africa? </h3>\nNow, you might be thinking, 'Oh no, is this going to affect me?' And the answer is no, our wonderful friends. These countries, Iran and Israel, are very, very far away from our beautiful continent of Africa. So, what happened there does not mean you are in any danger here at home. You are safe, and everything is calm here, just like always.\n\nIt's like watching a story on TV about things happening in another city, or even another country. You learn about it, but it doesn't mean it's happening outside your window or in your village. It's important for us to know about the world, to be curious, and to understand that sometimes things are complicated for grownups in other places. We learn about them from a distance.\n\n**Did you know?**\nDid you know that Africa is the second-largest continent in the world? It's huge and full of amazing animals, beautiful landscapes, and many, many different languages and cultures! We have so much to celebrate and so many wonderful stories right here!\n\n<h3> Let's Hope for Peace </h3>\nEven though these things are happening far away, it makes all of us, especially the grown-ups, wish for peace. Peace means everyone is happy, safe, and not fighting. It means countries are friends and talk to each other kindly, sharing and listening to each other's ideas and worries.\n\nMany people around the world, including leaders of countries, are working very hard to make sure these countries stop being upset and start talking to each other. They want to make sure everyone is safe and that these flying things don't fly anymore. They are working to cool things down.\n\nJust like in our schools and homes, we always try to be kind to each other, to share, and to listen. That's the best way to make sure everyone is happy and calm. Let's send our happy thoughts and hopes for peace to everyone around the world, hoping they can be friends again!\n\nThank you for listening, my smart and kind friends. Until next time, keep exploring and keep being kind! Your friend from Africa!",
    "summary": "Countries far away, Iran and Israel, had a big disagreement, and Iran sent flying rockets and robots, but adults are working hard to bring peace and make sure everyone is safe.",
    "whyMatters": "It's important to know about these things because everyone wants countries to be friends and safe, and we should always hope for peace in the world, just like we hope for peace in our own homes and schools.",
    "category": "world",
    "date": "2026-03-01T10:21:56.236Z",
    "image": "https://image.pollinations.ai/prompt/News%20from%20Far%20Away%3A%20When%20Countries%20Get%20Upset%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-from-far-away-when-countries-get-upset",
    "originalLink": "https://www.bbc.com/news/articles/cx2dyz6p3weo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran says US and Israel strikes hit school killing 108",
    "title": "Iran says US and Israel strikes hit school killing 108",
    "content": "There is no confirmation by the US or Israel of the strike on the school located near elite military troops.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:22:01.414Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20says%20US%20and%20Israel%20strikes%20hit%20school%20killing%20108%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-says-us-and-israel-strikes-hit-school-killing-108",
    "originalLink": "https://www.bbc.com/news/articles/c1l7rvqq51eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Celtic and Rangers face double jeopardy in derby like no other'",
    "title": "'Celtic and Rangers face double jeopardy in derby like no other'",
    "content": "BBC Scotland chief sportswriter Tom English sets the scene going into a compelling Old Firm spectacle on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:22:06.890Z",
    "image": "https://image.pollinations.ai/prompt/'Celtic%20and%20Rangers%20face%20double%20jeopardy%20in%20derby%20like%20no%20other'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "celtic-and-rangers-face-double-jeopardy-in-derby-like-no-other",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj98yny3m3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Free-scoring Semenyo takes burden off Haaland",
    "title": "Free-scoring Semenyo takes burden off Haaland",
    "content": "Manchester City have often been accused of being too reliant on Erling Haaland this season. There are signs that could be changing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:22:12.111Z",
    "image": "https://image.pollinations.ai/prompt/Free-scoring%20Semenyo%20takes%20burden%20off%20Haaland%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "free-scoring-semenyo-takes-burden-off-haaland",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg5nm2n9zzpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Carrick not interested in personal Glasner duel",
    "title": "Carrick not interested in personal Glasner duel",
    "content": "Manchester United interim boss Michael Carrick comes up against one of the major contenders for the permanent job when Oliver Glasner's Crystal Palace go to Old Trafford on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T10:22:17.287Z",
    "image": "https://image.pollinations.ai/prompt/Carrick%20not%20interested%20in%20personal%20Glasner%20duel%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "carrick-not-interested-in-personal-glasner-duel",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd03402x4edo?at_medium=RSS&at_campaign=rss"
  }
]