[
  {
    "originalTitle": "Her sons were killed by Islamist militants. She's among thousands who had to flee",
    "title": "Helping Hands in Africa: A Brave Mom's Journey",
    "content": "<h3>Hello from Africa!</h3>\nHi everyone! It's your kid-friendly news reporter here, bringing you a very important story from our amazing continent, Africa. Africa is a huge place, full of sunshine, incredible animals like giraffes and elephants, and lots of wonderful people. Today, we're going to talk about some friends who needed to be very brave, and how kind people are helping them. It’s a story about moving, finding new homes, and lots of hope!\n\n**Did you know?** Africa is the second-largest continent in the world! It has 54 different countries, each with its own special stories and people.\n\n<h3>A Brave Mom's Story</h3>\nOur story starts with a very brave mom named Aminata. She lived in a lovely village, maybe with houses made of mud bricks and a big tree where everyone gathered to tell stories. Aminata had a big family, with happy children who loved to play games and help around the house. They probably chased chickens, drew pictures in the sand, and helped their mom fetch water or collect firewood. Life was simple, but full of love.\n\nOne day, some bad people came to Aminata's village. These people were not kind. They caused a lot of trouble and made the village feel very unsafe. It became too scary for Aminata and her children to stay there. Imagine if your playground suddenly became a place where you couldn't play anymore because it wasn't safe. That's how it was for Aminata's family. Her heart was very sad because her sons were hurt, and her daughter went missing. But Aminata knew she had to be strong for the children who were still with her. She had to find a safe place.\n\n<h3>Leaving Home for Safety</h3>\nSo, Aminata and her family had to leave their home. This is called “fleeing” or becoming “displaced.” It means you have to go away from your home very quickly, not because you want to, but because you *have* to, to be safe. It was a very hard journey. They had to walk for many, many days. Sometimes it was hot, and sometimes they were very tired and hungry. They carried what little they could, maybe a cooking pot, some clothes, and a blanket.\n\nImagine walking for days with your mom and dad, not knowing where you would sleep at night, but knowing you had to keep going to find safety. That’s what Aminata and her family did. They walked and walked, holding hands, looking out for each other. Aminata was so strong, always thinking about getting her family to a place where they would be safe from the bad people.\n\n**Did you know?** When people have to leave their homes because it's not safe, we call them “displaced people” or sometimes “refugees” if they cross a country border. They are just like you and me, but they need a little extra help to find a new safe place to live.\n\n<h3>New Friends and New Homes</h3>\nFinally, after a very long and difficult journey, Aminata and her family arrived at a special place. This place was set up to help families just like hers. It’s like a big, temporary village where everyone is looking for safety and peace. Here, they found tents or simple shelters to live in. Imagine a whole village made of tents! It might not be like your house, but it’s a roof over their heads, and most importantly, it’s safe.\n\nIn these safe places, Aminata's children can play again without fear. They can make new friends, maybe from different villages or even different parts of the country. There are places where children can go to school again, learning to read and write, drawing pictures, and playing games. It helps them feel happy and normal after such a big adventure. People also get food to eat, clean water to drink, and doctors to help them if they are sick. It’s a place where they can start to feel a little bit better, even though they miss their old homes very much.\n\n<h3>Many Families Need Help</h3>\nAminata is not the only one. There are thousands and thousands of families in Africa who have had to leave their homes because of these bad people. Just like Aminata, these families are brave. They want their children to be safe, to go to school, and to have a happy life. Many moms, dads, brothers, and sisters have walked long distances, sometimes carrying their smallest children, just to get to a safe place.\n\nIt's a very big problem, but the good news is that there are many, many kind people and groups who are working hard to help. These helpers are like superheroes without capes! They build the shelters, bring the food, teach in the schools, and care for everyone.\n\n**Did you know?** When many people have to leave their homes all at once, it's called a “humanitarian crisis.” This means a lot of people need help with basic things like food, water, and shelter.\n\n<h3>Kind People Are Helping</h3>\nWho are these helpers? Well, they come from all over the world and from right here in Africa! Some are special organizations like the Red Cross or the United Nations, and some are just ordinary people from nearby towns and villages who want to be good neighbors. They work tirelessly to make sure everyone has enough to eat, clean water to drink, and a safe place to sleep. They also help children get back into school because learning is super important, even when you've had to move.\n\nThey also provide toys and games so children can play and laugh, which helps them feel better. Imagine getting a new toy or book when you've lost so much! It means a lot. These helpers show everyone that even when bad things happen, there are always good people who care and want to help make things right. They bring hope to places where people feel like they have lost everything.\n\n<h3>Dreams for Tomorrow</h3>\nAminata and her family, along with thousands of others, are now in a safer place. It’s not their old home, but it’s a place where they can begin to heal and dream of a better tomorrow. Aminata dreams that her children will grow up strong and happy, that they will learn and play, and that one day, perhaps, they can go back to their own village when it is truly safe again. Or maybe they will build a new, wonderful life right where they are now.\n\nThis story reminds us that peace is very important. When people are kind to each other, and everyone respects one another, then everyone can live happily in their homes. But when things go wrong, it's wonderful to know that there are so many people ready to offer a helping hand. We can all do our part, even as kids, by being kind to our friends, sharing, and wishing for peace for everyone in the world.\n\n**Did you know?** You can help too! Even by just being kind to everyone you meet, learning about other cultures, and sharing your toys, you are helping to build a more peaceful world! Every little bit of kindness makes a big difference. Let's all hope for a world where every child can grow up safe and happy in their home.",
    "summary": "A brave mom named Aminata and thousands of other families in Africa had to leave their homes because it wasn't safe, but now they are finding new hope and help from kind people in new safe places.",
    "whyMatters": "This story matters because it shows how important it is for everyone to have a safe home and how kind people help each other when bad things happen, giving hope to many children and families.",
    "category": "world",
    "date": "2026-02-11T14:17:24.554Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Hands%20in%20Africa%3A%20A%20Brave%20Mom's%20Journey%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-hands-in-africa-a-brave-moms-journey",
    "originalLink": "https://www.bbc.com/news/articles/c5yk3d56dgwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A simple guide to the crisis in South Sudan",
    "title": "Friends, Let's Talk About Peace in South Sudan!",
    "content": "<h3>Hello, My Wonderful Friends Across Africa!</h3>\nHello, hello, my wonderful friends! It's your friendly reporter, Zola, here, bringing you super important news from our amazing continent, Africa! Today, we're going to talk about a very special country called South Sudan. Can you point to it on a map? It's in the eastern part of Africa, and it's full of beautiful lands and friendly people, just like where you live!\n\nSometimes, even in the best families or classrooms, grown-ups can have big disagreements. And that's what we're going to talk about today – a disagreement that happened with some important leaders in South Sudan. But don't worry, we're going to understand it together, and remember, people are working very hard for peace.\n\n<h3>What's Happening in South Sudan?</h3>\nImagine you and your friend are playing with toys, and suddenly, you both want to play with the same toy, but you can't agree on who gets it first. Sometimes, important grown-ups who help run a country, called leaders, can have a big disagreement like that. In South Sudan, some very important leaders had a big 'rift' or a big fight with their words. It's like they stopped agreeing on how to help their country grow best.\n\nThis disagreement made some people worried. When grown-ups don't agree, sometimes it can make things difficult for everyone. People want their leaders to work together like a team, just like you work with your classmates to build something amazing.\n\nDid you know? South Sudan is one of the newest countries in the world! It became a country on July 9, 2011. That's not very long ago, right? They are still building many things to make their country strong and happy.\n\n<h3>Who Are the Important Leaders?</h3>\nEvery country has leaders who help make rules and decide important things. Think of your school principal or your head teacher. In a country, we have a President, who is the main leader, like the captain of a team. And then there's a Vice-President, who is like the co-captain, helping the President.\n\nIn South Sudan, there was a big problem because the Vice-President was accused of doing something very, very serious. It's like someone said he broke a very important rule that could hurt the whole country.\n\n<h3>What Does \"Treason\" Mean?</h3>\nThe big word they used was 'treason.' Now, that's a tough word, isn't it? Let's make it simple. Imagine you are part of a very special team, like a football team or a dance team. 'Treason' would be like if someone on your team tried to secretly help the *other* team win, or tried to break your own team's rules in a very bad way, on purpose to hurt them.\n\nWhen someone is accused of treason in a country, it means they are said to have done something very bad against their own country or against the other leaders. It's like trying to make the country weak or trying to change the rules in a secret, bad way. This is a very serious thing, and it makes people very worried about what might happen next.\n\n<h3>Why Is This Worrying For Everyone?</h3>\nWhen leaders have such big disagreements, especially when someone is accused of something so serious, it can make people afraid that there might be more fighting. Nobody wants to see fighting, right? Fighting makes people sad, makes homes unsafe, and stops children from going to school.\n\nWhen there is conflict, it means people might start fighting with weapons. This is very different from just disagreeing with words. And when there is conflict, it means children might not get to play safely, or families might have to leave their homes to find a safer place. That's why grown-ups worry so much when leaders have big problems.\n\nDid you know? In South Sudan, there are many different groups of people, speaking many different languages! It's like having a big, colorful family with lots of interesting stories and ways of talking.\n\n<h3>What Do People Hope For?</h3>\nWhat everyone in South Sudan, and all of us across Africa, hopes for is peace. Peace means everyone can live safely, go to school, play with friends, and help their families. Peace means leaders talk to each other and find ways to agree, even when it's hard.\n\nWhen there are problems, the best way to solve them is to talk. Just like when you have a problem with your friend, you talk about it to find a solution. Leaders in South Sudan are being asked to talk, to listen to each other, and to work together like a good team.\n\nMany people, both inside South Sudan and from other countries, are helping to encourage the leaders to talk and find a peaceful way forward. They want everyone to feel safe and happy again. It's like when your teacher helps you and your friend solve a problem – they want everyone to be fair and kind.\n\n<h3>How Can We Help, Even From Far Away?</h3>\nEven though we are young and might be far away, we can still help! We can think about our friends in South Sudan. We can be kind to everyone around us, because kindness is like a little seed of peace that grows bigger and bigger.\n\nWe can also learn about South Sudan, learn about its people, its cultures, and its hopes. The more we know, the more we can care. And caring is a very powerful thing. We can hope and wish for the leaders to choose peace and friendship.\n\nDid you know? The national animal of South Sudan is the African fish eagle! It's a beautiful bird with a white head and chest, and it makes a very distinctive cry. Imagine seeing that majestic bird flying high!\n\n<h3>Let's Look Forward to a Peaceful Future!</h3>\nSo, my dear friends, remember that even when there are big problems, people are always working for solutions. The people of South Sudan are strong and brave, and they deserve to live in peace.\n\nLet's send them our thoughts of peace and friendship. Let's remember that talking is always better than fighting. And let's keep hoping that the leaders in South Sudan will choose to work together, so all the children there can grow up happy and safe.\n\nThank you for listening, my wonderful friends! Until next time, stay curious and spread kindness!",
    "summary": "Some important leaders in South Sudan had a big disagreement, and people are hoping they can talk and find a peaceful way forward so everyone can be safe and happy.",
    "whyMatters": "This is important because when grown-ups who lead a country have big fights, it can make things difficult and sometimes unsafe for everyone, especially children, and we all want our friends in South Sudan to live in peace.",
    "category": "politics",
    "date": "2026-02-11T14:17:51.737Z",
    "image": "https://image.pollinations.ai/prompt/Friends%2C%20Let's%20Talk%20About%20Peace%20in%20South%20Sudan!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-lets-talk-about-peace-in-south-sudan",
    "originalLink": "https://www.bbc.com/news/articles/c7933p4xe7po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghana declares Wednesday 'Fugu Day' to promote traditional outfit after online mockery",
    "title": "Ghana's Super Special Clothes Day!",
    "content": "<h3>Hello from Sunny Africa!</h3>\nHello, amazing friends! Guess what? We have some super exciting news all the way from a beautiful country in Africa called Ghana! Ghana is a wonderful place with friendly people and lots of sunshine. Something special just happened there that we want to tell you all about. It's about colourful clothes and being proud of where you come from!\n\n<h3>What is Fugu?</h3>\nImagine a very special dress or shirt. It's called a Fugu! The Fugu is a famous and much-loved traditional outfit from Ghana. It is not just any piece of clothing. It is very unique!\n\nFugu clothes are often made with lovely bright colours. You might see shades of blue, red, green, and yellow all woven together. They have cool patterns too! These patterns are made from strips of cotton that are hand-woven. This means people use their hands to make the cloth. Isn't that amazing?\n\nBoth men and women in Ghana wear Fugu. Sometimes, little boys and girls wear them too! It's like wearing a piece of art that tells a story about Ghana.\n\nDid you know? The Fugu is also sometimes called 'Batakari'! It's a special name for this amazing dress.\n\n<h3>Why is Fugu So Special?</h3>\nEvery country has something special that makes its people proud. For Ghana, the Fugu is one of those things! When people wear Fugu, it shows how much they love their country and their culture.\n\nIt's like wearing a superhero cape, but instead of showing you have superpowers, it shows you have Ghana power! It reminds people of their history and all the wonderful things that make Ghana unique.\n\nPeople wear Fugu for many happy occasions. They wear it to parties, to festivals, to weddings, and even just to feel good. It makes them feel smart and proud.\n\nDid you know? In Ghana, different patterns and colours in traditional clothes can sometimes tell a story or show where someone is from! It's like a secret language in their clothes!\n\n<h3>A Little Online Chat</h3>\nNow, here's a funny part of the story. You know how sometimes people chat online, on phones or computers? Well, people from Ghana and another country called Zambia were having a friendly chat online. They were talking about their traditional clothes.\n\nSometimes, people like to tease each other a little bit in a friendly way. It's called 'banter'. It's like when you playfully joke with your friends. So, some people were making friendly jokes about different clothes.\n\nEveryone loves their own country's special clothes, right? So, the people in Ghana got a big idea from this chat. They thought, \"Hey, let's show everyone how much we love our Fugu!\"\n\nDid you know? Ghana and Zambia are both wonderful countries in Africa! Africa is a very big continent with many, many beautiful countries and different cultures. We are all friends!\n\n<h3>What is 'Fugu Day'?</h3>\nBecause everyone was talking about Fugu and showing how proud they are, the leaders in Ghana decided something super cool! They said that every Wednesday will now be called 'Fugu Day'!\n\nYes, you heard that right! Every single Wednesday, people in Ghana are asked to wear their beautiful Fugu outfits. It's like having a special dress-up day every week!\n\nImagine going to school or work, and seeing lots of people in their colourful Fugu. It will be like a bright and happy parade of traditional clothes! This idea makes everyone in Ghana feel happy and united.\n\nIt's a way for everyone, young and old, to remember and celebrate their special traditional clothes. It helps to show the world how beautiful Ghanaian culture is.\n\n<h3>Why is This Important?</h3>\nThis 'Fugu Day' is super important for many reasons. First, it helps people remember and keep their old traditions alive. It's like keeping a special family recipe from long, long ago.\n\nWhen people wear their traditional clothes, it shows how proud they are of their country and their culture. It makes them feel strong and connected to each other. It's like saying, \"We are Ghana, and we are proud!\"\n\nIt also teaches kids, like you, about the importance of their culture. It shows that our heritage is something to cherish and celebrate. It brings everyone together, like a big, happy family.\n\nDid you know? Many countries in Africa have their own special traditional clothes that they wear for celebrations! They are all so colourful and unique!\n\n<h3>Let's Celebrate!</h3>\nSo, 'Fugu Day' in Ghana is a big, happy celebration of culture and pride. It shows that even a small online chat can lead to something really wonderful!\n\nIt reminds us all that being proud of who you are and where you come from is a super important thing. What special clothes or traditions does your family or country have? Maybe you can learn about them and celebrate them too!\n\nLet's all cheer for Ghana and their wonderful Fugu clothes! Hip hip hooray for culture and colours!",
    "summary": "Ghana has declared every Wednesday as 'Fugu Day,' encouraging everyone to wear their traditional Fugu outfit to celebrate their culture and show national pride after friendly online discussions about traditional clothes.",
    "whyMatters": "This is important because it helps people in Ghana celebrate their special history and culture, showing everyone how proud they are of their beautiful traditional clothes and bringing everyone together.",
    "category": "technology",
    "date": "2026-02-11T14:18:11.394Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Super%20Special%20Clothes%20Day!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-super-special-clothes-day",
    "originalLink": "https://www.bbc.com/news/articles/cgqg8xegxqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "FBI releases images of suspect in Guthrie abduction",
    "title": "FBI releases images of suspect in Guthrie abduction",
    "content": "The FBI released new video of a suspect in the abduction of Nancy Guthrie.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T14:18:16.731Z",
    "image": "https://image.pollinations.ai/prompt/FBI%20releases%20images%20of%20suspect%20in%20Guthrie%20abduction%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fbi-releases-images-of-suspect-in-guthrie-abduction",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/fbi-releases-images-of-suspect-in-guthrie-abduction?traffic_source=rss"
  },
  {
    "originalTitle": "Hebron under Israeli lockdown amid wider West Bank annexation plans",
    "title": "Hebron under Israeli lockdown amid wider West Bank annexation plans",
    "content": "Israel’s occupation has carved the Palestinian city of Hebron into zones of control and inserted hundreds of settlers.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T14:18:21.901Z",
    "image": "https://image.pollinations.ai/prompt/Hebron%20under%20Israeli%20lockdown%20amid%20wider%20West%20Bank%20annexation%20plans%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hebron-under-israeli-lockdown-amid-wider-west-bank-annexation-plans",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/hebron-under-israeli-lockdown-amid-wider-west-bank-annexation-plans?traffic_source=rss"
  },
  {
    "originalTitle": "Six men named in US Congress: Why is so much redacted in the Epstein files?",
    "title": "Big Secrets Are Coming Out! Finding Hidden Names to Help Kids Stay Safe!",
    "content": "<h3>Hello, Super Detectives!</h3>\n\nHello, amazing friends! It's your kid-friendly news reporter here, bringing you a very important story all the way from America. Imagine you are playing a big game of 'hide and seek' with some very important secrets. Well, that's a bit like what's happening right now! Grown-ups in America are working hard to find out the truth about some big secrets that were hidden away for a long time. It's like solving a giant puzzle, and everyone wants to find all the missing pieces to make sure children are safe and happy.\n\n<h3>What's This Big Puzzle About?</h3>\n\nThere was a very sad story where some children were not treated kindly. A man named Jeffrey Epstein did some very bad things. Now, special grown-ups, like detectives, are trying to find out who helped him or who knew about the bad things he was doing. It’s super important to find out so that no one can ever do bad things like that again, and so we can protect all children, everywhere. Thinking about how to keep kids safe is a very important job!\n\n<h3>Names That Were Hiding!</h3>\n\nImagine you have a drawing, and you use a big black crayon to color over some parts you don't want anyone to see. That's a bit like what happened in some very important papers, like a secret diary. There were many names written in these papers, but some of them were *hidden*. Someone drew black lines right over the names, so no one could read them. When a name is covered up like this, we say it was 'redacted.' It just means 'hidden' or 'blacked out.'\n\nDid you know? The word 'redacted' sounds tricky, but it just means a secret grown-up covered up a word or a name because they didn't want people to see it. It's like a secret code!\n\n<h3>A Brave Grown-Up Steps Up!</h3>\n\nIn America, there's a very special group of grown-ups called 'Congress.' They meet in a big, beautiful building and their job is to help make good rules for everyone and make sure people are safe. One of these brave grown-ups is called a 'congressman.' He's like a superhero detective! He saw that many names were hidden, and he thought, 'Hey, we need to know these names to understand the whole story and to keep everyone safe!'\n\nHe is working very hard, just like a kind village elder in Africa would work hard to solve a problem for the community. He wants to bring everything into the light so no one can hide secrets that hurt people anymore.\n\n<h3>Who Are Some of the Hidden Names?</h3>\n\nOur brave congressman has started to share some of these hidden names. He said that among the names that were hidden, there was a very important grown-up called a 'US billionaire.'\n\nDid you know? A 'billionaire' is someone who has an amazing amount of money! It's more money than you could count in a whole year, even if you counted every single second! They have enough money to buy many, many houses and cars. They are very rich people.\n\nAnother hidden name belonged to someone called a 'Dubai CEO.' A CEO is like the head teacher of a very, very big school, but instead of a school, they are in charge of a giant company. Dubai is a very famous city far away, known for its super tall buildings and bright lights!\n\nSo, these are not just any grown-ups; they are very powerful and important people. That's why it's a big deal that their names were hidden and are now being revealed.\n\n<h3>Why is it Important to Know These Names?</h3>\n\nThis is the most important part! Imagine you are building a tower with blocks. If some blocks are missing or hidden, your tower might not be strong, and it could fall down. Knowing all the names and all the truth is like finding all the blocks. It makes the 'tower of truth' strong!\n\nWhen we know who knew about bad things, or who might have helped, we can make sure they don't do it again. It helps us to protect all children and make sure the world is a fairer and safer place for everyone to grow up in. It's all about making sure that justice is done.\n\nDid you know? In many parts of Africa, communities work together to protect their children, just like this congressman is trying to protect children in America. We all want our little ones to be safe and happy!\n\n<h3>What Happens Next?</h3>\n\nNow that some names are being shared, people will learn more about the whole story. More truths might come out, like finding more clues in a detective game. The brave grown-ups will keep working to make sure all the hidden names are shown and that everyone understands what happened. This way, we can all learn how to prevent such sad things from ever happening again.\n\nIt's a big step towards making the world a safer place for all children, reminding everyone that secrets that hurt people should never stay hidden. We all want to live in a world where children can laugh, play, and feel loved every single day!",
    "summary": "A brave grown-up in America is helping to reveal the names of important people, including a rich billionaire and a big boss from Dubai, that were hidden in secret papers related to a very sad story, all to help protect children and make sure the truth comes out.",
    "whyMatters": "It matters because when we find out who knew about bad things or who helped, we can make sure children stay safe, and it helps stop bad things from happening again so everyone can grow up happy and protected.",
    "category": "technology",
    "date": "2026-02-11T14:18:47.602Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Secrets%20Are%20Coming%20Out!%20Finding%20Hidden%20Names%20to%20Help%20Kids%20Stay%20Safe!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-secrets-are-coming-out-finding-hidden-names-to-help-kids-stay-safe",
    "originalLink": "https://www.aljazeera.com/news/2026/2/11/six-men-named-in-us-congress-why-is-so-much-redacted-in-the-epstein-files?traffic_source=rss"
  },
  {
    "originalTitle": "Tumbler Ridge mass shooting: What we know so far",
    "title": "Tumbler Ridge mass shooting: What we know so far",
    "content": "Nine people have been killed and 25 injured in the shootings at a school and home in a rural community in western Canada.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T14:18:53.257Z",
    "image": "https://image.pollinations.ai/prompt/Tumbler%20Ridge%20mass%20shooting%3A%20What%20we%20know%20so%20far%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tumbler-ridge-mass-shooting-what-we-know-so-far",
    "originalLink": "https://www.bbc.com/news/articles/c1e98w35qyjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police release man detained in connection to Nancy Guthrie disappearance",
    "title": "Police release man detained in connection to Nancy Guthrie disappearance",
    "content": "Police had searched the home of the person, who was taken into custody at a traffic stop.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-11T14:18:58.426Z",
    "image": "https://image.pollinations.ai/prompt/Police%20release%20man%20detained%20in%20connection%20to%20Nancy%20Guthrie%20disappearance%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-release-man-detained-in-connection-to-nancy-guthrie-disappearance",
    "originalLink": "https://www.bbc.com/news/articles/cr5l4yy3ezmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "title": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "content": "Lyse Doucet is in Iran for the first time since the crackdown on nationwide anti-government protests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-11T14:19:03.596Z",
    "image": "https://image.pollinations.ai/prompt/Watch%3A%20BBC%20in%20Tehran%20sees%20government's%20'political%20reply'%20to%20massive%20protests%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "watch-bbc-in-tehran-sees-governments-political-reply-to-massive-protests",
    "originalLink": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "title": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "content": "Thomas Frank's sacking came as no surprise on Wednesday. His appointment by Tottenham was a gamble that ended in a storm of toxicity, writes Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-11T14:19:09.221Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Frank%20at%20Tottenham%20was%20a%20gamble%20that%20ended%20in%20bitter%20failure%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-frank-at-tottenham-was-a-gamble-that-ended-in-bitter-failure",
    "originalLink": "https://www.bbc.com/sport/football/articles/c783jxqlpv9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "De Zerbi leaves Marseille by mutual consent",
    "title": "De Zerbi leaves Marseille by mutual consent",
    "content": "Roberto de Zerbi, who led Marseille to second in Ligue 1 last season, leaves following their Champions League exit and a 5-0 defeat by Paris St-Germain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-11T14:19:14.383Z",
    "image": "https://image.pollinations.ai/prompt/De%20Zerbi%20leaves%20Marseille%20by%20mutual%20consent%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "de-zerbi-leaves-marseille-by-mutual-consent",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgqejpj4d80o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How much pressure is Slot really under at Liverpool?",
    "title": "How much pressure is Slot really under at Liverpool?",
    "content": "Liverpool have won just once in the Premier League in 2026 - so will they stick with Arne Slot, who took them to the title last season?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T14:19:19.548Z",
    "image": "https://image.pollinations.ai/prompt/How%20much%20pressure%20is%20Slot%20really%20under%20at%20Liverpool%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-much-pressure-is-slot-really-under-at-liverpool",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgl5kd6y8gro?at_medium=RSS&at_campaign=rss"
  }
]