[
  {
    "originalTitle": "Powerful cyclone kills at least 31 as it tears through Madagascar port",
    "title": "Powerful cyclone kills at least 31 as it tears through Madagascar port",
    "content": "Madagascar's disaster management says roads are inaccessible with trees uprooted, power poles down and ninety percent of roofs ripped off.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:01:29.031Z",
    "image": "https://image.pollinations.ai/prompt/Powerful%20cyclone%20kills%20at%20least%2031%20as%20it%20tears%20through%20Madagascar%20port%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "powerful-cyclone-kills-at-least-31-as-it-tears-through-madagascar-port",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "title": "A Brave Lady from South Africa Asks for Help!",
    "content": "Hello, my little friends! Today, we have an important story about a very brave lady. Her name is Juliette Bryant. She lives in a beautiful country called South Africa. That's a super cool place, full of sunshine and amazing animals!\n\nJuliette is asking for something very important from a special family far, far away. This family is called the Royal Family, and they live in a big, old palace in a country called the United Kingdom. It's like a fairy tale castle, but real!\n\n<h3>Juliette's Big Request</h3>\nJuliette is asking the Royal Family to look at some important papers. These papers are about a person named Prince Andrew. Prince Andrew is part of the Royal Family, like a prince in a storybook.\n\nJuliette wants them to search for these papers. Why? To learn more about Prince Andrew and a very bad man named Epstein. Epstein did many wrong things and hurt people.\n\nJuliette wants to find out the truth. She believes that knowing the truth can help make sure bad things don't happen again. It's like when you try to find out who spilled the juice so it doesn't happen next time!\n\n<h3>Who is Juliette?</h3>\nJuliette is a very strong lady. When she was younger, she was hurt by that bad man, Epstein. This made her very sad and scared. But now, Juliette is brave!\n\nShe is telling her story so that other children can be safe. She wants everyone to know that it's important to speak up if something bad happens. Speaking up is like using your super-voice to ask for help!\n\nJuliette is from South Africa, a land known for its bravery and kindness. She is showing us how to be brave and kind, even when things are hard.\n\n<h3>What Are \"Files\"?</h3>\nWhen we talk about \"files,\" we mean important papers or documents. Think of it like your school folder, where you keep all your drawings and homework.\n\nThese files might have letters, notes, or other information. Juliette hopes these files can help tell us more about what happened and who knew about the bad things Epstein did.\n\nIt’s like looking for clues in a detective story! You open the file and see what secrets it holds.\n\n<h3>Why Is This Important?</h3>\nJuliette wants the Royal Family to look at these files because she wants everyone to be safe. Especially children!\n\nWhen bad things happen, it's very important to find out why and how. This helps us stop them from happening again. It's like learning from your mistakes so you don't trip over the same toy twice.\n\nJuliette wants justice. Justice means making things fair and right. When someone does something wrong, they should be held accountable. This means they should answer for their actions.\n\n<h3>Who is Prince Andrew?</h3>\nPrince Andrew is the son of the late Queen Elizabeth II. She was a very famous Queen! He is the brother of the current King, King Charles III.\n\nHe lives in England, and like other members of the Royal Family, he sometimes goes to special events.\n\nJuliette hopes that by looking at the files related to Prince Andrew, we can understand more about what happened with Epstein and protect everyone better.\n\n<h3>The Royal Family and Their Home</h3>\nThe Royal Family lives in a very grand place called Buckingham Palace. It's in London, the capital city of the United Kingdom.\n\nDid you know that Buckingham Palace has hundreds of rooms? It's like a giant maze!\n\nThe King and Queen live there, along with other royal family members. They have important jobs, like meeting people from other countries and helping their country.\n\nJuliette is asking them to use their power to help find the truth.\n\n<h3>Did You Know? Facts</h3>\n*   **Did you know?** South Africa has 11 official languages! That's a lot of ways to say \"hello\"!\n*   **Did you know?** The United Kingdom is an island country, meaning it's surrounded by water. It’s a bit like a very big boat!\n*   **Did you know?** Speaking up when you see something wrong is called \"advocacy.\" It means you are helping to make things better for others.\n*   **Did you know?** The current King of the United Kingdom is King Charles III. His mom was Queen Elizabeth II, who was Queen for a very, very long time!\n*   **Did you know?** It takes a lot of courage to tell a difficult story, just like Juliette is doing. We should always listen to people who are brave enough to share their experiences.\n\n<h3>Why Speaking Up Matters</h3>\nJuliette's story teaches us a very important lesson: it's okay to speak up. If something makes you feel unsafe or uncomfortable, you should tell a grown-up you trust. This could be your mom, dad, teacher, or another trusted adult.\n\nJuliette wants to make sure that children all over the world are safe and happy. She wants grown-ups to listen and act when children need help.\n\nHer call to the Royal Family is a big step. She is saying, \"Please help us make the world a safer place for everyone!\"\n\n<h3>A Message of Hope</h3>\nThis story is about hope. It's about hoping for truth, hoping for fairness, and hoping for a safer world.\n\nJuliette is a hero because she is trying to help so many others. We should always remember that even small voices can make a big difference.\n\nLet's hope that the Royal Family listens to Juliette's request and looks closely at those important files. Because when we all work together, we can make the world a much better and safer place for all children, everywhere!",
    "summary": "A brave lady named Juliette from South Africa is asking the UK Royal Family to look at special papers about Prince Andrew and a bad man, Epstein, to find the truth and help keep children safe.",
    "whyMatters": "This is important because Juliette is speaking up to help make sure bad things don't happen to children, and to show everyone that being fair and finding the truth can make the world safer for all kids.",
    "category": "world",
    "date": "2026-02-12T06:01:49.517Z",
    "image": "https://image.pollinations.ai/prompt/A%20Brave%20Lady%20from%20South%20Africa%20Asks%20for%20Help!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-brave-lady-from-south-africa-asks-for-help",
    "originalLink": "https://www.bbc.com/news/articles/cvg5ww8lq9zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghanaians embrace 'Fugu Day' after online mockery of traditional outfits",
    "title": "Ghana's Fugu Clothes Shine Bright!",
    "content": "Hello, amazing kids! It’s your friend, the kid-friendly news reporter for Africa, here to tell you a super cool story! We are going on an adventure to a country called Ghana. In Ghana, something wonderful happened because of special clothes. These clothes are called Fugu! Let's find out all about them and why everyone is so happy.\n\n<h3>What is Fugu?</h3>\nFugu is a very beautiful outfit. It's like a special shirt or a dress. It has many bright colours and cool patterns. These patterns are sewn into the cloth. Fugu is made from cotton, which is a soft fabric. People in northern Ghana have been wearing Fugu for a very long time.\n\nFugu clothes are also known as 'Smock'. They are very comfy to wear. People wear them for many reasons. They wear them to parties, to church, to school, or just for playing outside. It’s a very special part of Ghanaian culture.\n\nDid you know? Fugu is made by hand! People weave the cotton and then sew the lovely patterns.\n\n<h3>Friends on the Internet: Ghana and Zambia</h3>\nDo you know what the internet is? It's like a very big talking place on computers and phones. People from all over the world can talk and share pictures. Well, a little while ago, something fun and interesting happened on the internet.\n\nThere are two countries in Africa: Ghana and Zambia. Both are amazing places! Some friends from Zambia saw pictures of the Fugu clothes online. Maybe they didn't know much about them. So, some people from Zambia made some jokes about the Fugu clothes.\n\nIt was like playful teasing, like when friends joke around. But sometimes, even playful teasing can make people feel a bit funny. The people in Ghana saw these jokes.\n\nDid you know? Africa has 54 countries! Each one is special and different.\n\n<h3>How Ghanaians Felt</h3>\nWhen the people in Ghana saw the jokes about their Fugu clothes, how do you think they felt? Maybe a little bit surprised! But mostly, they felt very, very proud. They love their Fugu clothes so much.\n\nIt’s like if someone teased your favorite drawing or your special toy. You would still love it, right? The Ghanaians decided to show everyone just how much they love Fugu. They wanted to show that their culture is wonderful and nothing to joke about in a mean way.\n\nThey thought, \"Our Fugu clothes are amazing, and we will show everyone!\" This made them want to celebrate even more.\n\nDid you know? Clothes can tell a story about where people come from and what is important to them!\n\n<h3>Fugu Day! A Big Celebration!</h3>\nSo, what did the Ghanaians do? They decided to have a special day! They didn't call it a holiday, but it felt like one. They called it 'Fugu Day'! On Fugu Day, everyone was asked to wear their Fugu clothes.\n\nAnd guess what? People everywhere wore their Fugu! Kids wore Fugu to school. Grown-ups wore Fugu to work. People wore Fugu to the market and everywhere they went. It was a sea of bright colours and happy faces!\n\nImagine seeing everyone in their beautiful, traditional clothes. It was like a big, happy parade! People took pictures and shared them online. They showed the whole world how proud they were of Fugu. It was a way to say, \"We love our Fugu, and it makes us happy!\"\n\nDid you know? When people celebrate their culture together, it makes them feel strong and joyful!\n\n<h3>Why is This Story Important?</h3>\nThis story about Fugu Day is very important for all of us. It teaches us a few things. First, it shows us that it's super good to be proud of who you are. It’s good to celebrate the special things about your family, your town, and your country.\n\nSecond, it teaches us that even if someone teases you, you can still feel strong and happy. You can show everyone why something is special to you. The people of Ghana turned teasing into a reason to celebrate!\n\nIt also reminds us that all countries in Africa have amazing cultures and traditions. We should always try to learn about each other and be kind. We can be friends and share our wonderful traditions.\n\nDid you know? Many countries in Africa have their own unique and beautiful traditional clothes!\n\nSo, Fugu Day in Ghana was a big, bright success! It was a wonderful way for people to show love for their traditions and to shine brightly for the world. Keep celebrating your uniqueness, amazing kids!",
    "summary": "People in Ghana celebrated their beautiful traditional Fugu clothes on 'Fugu Day' to show pride after some online teasing, making it a big, colorful celebration of culture.",
    "whyMatters": "This story matters because it shows us to always be proud of our culture and special traditions, even if someone teases us, and to celebrate what makes us unique.",
    "category": "technology",
    "date": "2026-02-12T06:02:08.412Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Fugu%20Clothes%20Shine%20Bright!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-fugu-clothes-shine-bright",
    "originalLink": "https://www.bbc.com/news/articles/cgqg8xegxqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein sought help of ex-Russian official linked to FSB, files show",
    "title": "A Story About Asking for Help to Find Facts",
    "content": "Hello, friends! Your friendly news reporter from Africa here, ready with a super interesting story for you today. It's about how people sometimes ask for help to find things out, just like you might ask your teacher or parent for help with your homework! \n\n<h3>What is \"Asking for Help\"?</h3>\nImagine you lost your favourite toy, or you can't remember the answer to a riddle. What do you do? You ask for help, right? Maybe you ask your mum, your dad, or a big brother or sister. Asking for help is a very good thing! It means you are brave enough to say you need a hand, and it lets others show how kind and helpful they can be. \n\nSometimes, grown-ups need help too! They might need help finding a recipe, or finding out how to get to a new place. And sometimes, they need help finding important facts. \n\nDid you know? It's always okay to ask for help! Asking for help can make things easier and more fun. It shows you want to learn and grow!\n\n<h3>Meet Mr. E and Mr. R</h3>\nOur story today is about two grown-up men. Let's call one man Mr. E, and the other man Mr. R. Mr. E lived in one place, and Mr. R lived in another place far, far away. \n\nMr. E needed some special facts. He didn't know how to find them on his own, so he thought, \"Who can help me?\" He remembered that Mr. R was a very smart person who used to work for a big group of people. This big group helped their country know important things and keep everyone safe. So, Mr. R was very good at finding facts!\n\nDid you know? In many countries, there are special groups of people who work very hard to keep their country safe and happy! They learn a lot of important things.\n\n<h3>What Kind of Facts?</h3>\nNow, what kind of facts did Mr. E need? He needed to know some things about a lady. It was like wanting to know her favourite colour, or where she liked to play, or what kind of pet she had. Just simple details, like pieces of a puzzle. \n\nMr. E asked Mr. R if he could please help him find these facts about the lady. Mr. R was a helpful person, and he said, \"Yes, I can try to help you find these details!\" He knew how to look for information because of his special job before.\n\nDid you know? A 'fact' is something that is true! Like, \"The sky is blue,\" or \"Lions live in Africa.\" Knowing many facts helps us understand the world better!\n\n<h3>How Did They Talk?</h3>\nMr. E and Mr. R lived far apart, so they couldn't just walk over to each other's houses to talk. How do you think they talked? Did they send letters on paper? Did they use special smoke signals?\n\nNo, they used something called 'emails'! An email is like a super-fast digital letter that travels through computers and the internet. You write a message on a computer, and it flies across the world in just a few seconds to another computer. It's like magic!\n\nSo, Mr. E sent emails to Mr. R, asking for his help. And Mr. R sent emails back to Mr. E, with the facts he found. These emails were like little digital notes showing their conversation.\n\nDid you know? The internet helps us talk to people all over the world! You can video call your grandmother who lives far away, or send an email to a friend in another country. It's truly amazing!\n\n<h3>Helping from Far Away</h3>\nMr. R went to work. He looked for the facts about the lady, just like a detective looking for clues, or a librarian helping you find a book. Because he used to work for that big group that knew important things, he was very good at finding these details.\n\nOnce Mr. R found all the facts Mr. E needed, he put them together. Then, he sent another email to Mr. E, sharing all the information he had gathered. It was like finding all the pieces of a puzzle and giving them to someone who needed to finish the picture.\n\nThis shows us that even if people live in different countries, far, far away from each other, they can still help each other! The world is big, but we can still connect and be kind.\n\nDid you know? Africa is a continent with many, many different countries! And people in Africa use emails and the internet to talk to people all over the world, just like Mr. E and Mr. R.\n\n<h3>Why This Story is Interesting</h3>\nThis story is interesting because it shows us how people work together. Mr. E needed help, and Mr. R was there to give it. It also reminds us that there are many people in the world who have special skills, like Mr. R's skill in finding important facts.\n\nSometimes, old messages, like the emails Mr. E and Mr. R sent, are found later. These messages can tell us stories about what happened a long time ago. They are like little time capsules!\n\nDid you know? Working together is called 'teamwork'! When you play games with your friends or help clean up your classroom, you are using teamwork. Teamwork makes big tasks easier and more fun!\n\n<h3>The Power of Knowing Things</h3>\nFacts and information are very powerful. When we know things, we can make good choices, learn new things, and understand the world around us. That's why it's so good to go to school and read books!\n\nMr. R helped Mr. E to get the facts he needed, and that was a very helpful thing to do. It reminds us that being kind and helping others is one of the best things we can do. So, next time you or someone you know needs help finding a fact, remember Mr. E and Mr. R, and how they worked together!\n\nDid you know? Every day, you learn new facts! When you learn to count, or learn about different animals, or learn a new word, you are collecting facts! Keep learning, friends!\n\n<h3>Being Helpful is Kind</h3>\nSo, the big lesson from our story today is that asking for help and giving help are both very important. It doesn't matter if you're a grown-up or a child, or if you live in the same village or across the ocean. We can all be kind and helpful to one another. Keep asking questions and keep learning, my friends!",
    "summary": "A man named Mr. E asked another man, Mr. R, who was good at finding facts, to help him learn some things about a lady, and they communicated through emails.",
    "whyMatters": "This story matters because it shows how people can help each other by finding important information, even when they are far apart, and how being helpful is a good thing.",
    "category": "technology",
    "date": "2026-02-12T06:02:31.879Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Asking%20for%20Help%20to%20Find%20Facts%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-asking-for-help-to-find-facts",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/12/epstein-sought-help-of-ex-russian-official-linked-to-fsb-files-show?traffic_source=rss"
  },
  {
    "originalTitle": "Why was El Paso airspace shut down? Drones, security fears and confusion",
    "title": "Why was El Paso airspace shut down? Drones, security fears and confusion",
    "content": "The FAA initially announced a 10-day airspace closure but removed the restriction less than eight hours later.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:02:37.058Z",
    "image": "https://image.pollinations.ai/prompt/Why%20was%20El%20Paso%20airspace%20shut%20down%3F%20Drones%2C%20security%20fears%20and%20confusion%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-was-el-paso-airspace-shut-down-drones-security-fears-and-confusion",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/why-was-el-paso-airspace-shut-down-drones-security-fears-and-confusion?traffic_source=rss"
  },
  {
    "originalTitle": "Three children killed in drone strike on mosque in central Sudan: Doctors",
    "title": "Three children killed in drone strike on mosque in central Sudan: Doctors",
    "content": "The Sudan Doctors Network said the deadly strike was carried out by the paramilitary Rapid Support Forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-12T06:02:42.245Z",
    "image": "https://image.pollinations.ai/prompt/Three%20children%20killed%20in%20drone%20strike%20on%20mosque%20in%20central%20Sudan%3A%20Doctors%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "three-children-killed-in-drone-strike-on-mosque-in-central-sudan-doctors",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/three-children-killed-in-drone-strike-on-mosque-in-central-sudan-doctors?traffic_source=rss"
  },
  {
    "originalTitle": "Police identify 18-year-old as suspect in Tumbler Ridge shooting ",
    "title": "Heroes Helping After a Sad Day Far Away",
    "content": "<h3>Jambo, My Amazing Friends!</h3>\nJambo! That means hello in Swahili, a beautiful language from Africa! It's your friendly news reporter from Africa, here to share some important news with you. Sometimes, news can be a little bit sad, but it's always important to know that there are grown-ups and kind people working very hard to make things better and keep everyone safe. Today, we are talking about something that happened very far away, but it reminds us how important it is for everyone to be kind and help each other.\n\n<h3>What Happened Far, Far Away?</h3>\nIn a place far, far away, in a town called Tumbler Ridge, something very sad happened. It was at a school and also near a home. Some people, both grown-ups and children, got very hurt and needed help from kind doctors and nurses. This made many people very sad. And some people, who were loved very much, are not with us anymore. Our hearts are sending big hugs to everyone in Tumbler Ridge who is feeling sad right now. Remember, it's okay to feel sad, and it's good to talk to a trusted grown-up if you have big feelings.\n\n<h3>Our Brave Police Heroes!</h3>\nWhen something sad or confusing happens, we are so lucky to have police officers! They are like real-life superheroes who wear special uniforms and drive special cars. The police in Tumbler Ridge are working super hard right now. They are like detectives, trying to understand everything that happened. They want to find out why this sad thing happened so it doesn't happen again.\n\nThey found out that a young person, who is 18 years old, might know something important about what happened. The police are talking to this person and asking many questions to put all the puzzle pieces together. Their job is to keep everyone safe and make sure our communities are good places to live and play.\n\nDid you know? Police officers don't just catch bad guys! They also help lost pets, find missing children, and teach us about safety rules, like how to cross the road safely or what to do if you get lost. They are true community helpers!\n\n<h3>Doctors and Nurses: Our Healing Angels!</h3>\nWhen people get hurt, it's very important that they get help quickly. That's where amazing doctors and nurses come in! They are like healing angels who work in hospitals and clinics. In Tumbler Ridge, many doctors and nurses worked tirelessly, which means they worked very, very hard without stopping, to help everyone who was hurt. They gave medicine, fixed boo-boos, and made sure everyone felt comfortable and cared for.\n\nThese brave helpers sometimes work through the night to make sure people get better. They have special tools and smart brains to help our bodies heal. We are so thankful for all the doctors and nurses everywhere who help us when we are sick or get hurt.\n\n<h3>Keeping Our Schools Safe</h3>\nSchools are very special places. They are where you learn new things, play with your friends, and meet kind teachers. Most schools are very, very safe places, full of laughter and learning! After something sad happens like this, grown-ups in schools everywhere think even more about how to keep children safe. Teachers, principals, and all the grown-ups who work at school are always thinking about how to protect you.\n\nThey have rules and plans, like fire drills, to make sure everyone knows what to do in different situations. It's like having a secret superhero plan for safety! If you ever feel unsafe or worried, remember to always tell a trusted grown-up right away. They are there to help you!\n\nDid you know? Many schools around the world have special games and lessons about staying safe. They teach you about strangers, about crossing the street, and about being kind to each other, so everyone feels safe and happy.\n\n<h3>How We Can Help Each Other</h3>\nEven though this sad news happened far away, it teaches us something important: we must always be kind and helpful to each other. When one person is sad, everyone can help by being a good friend, offering a kind word, or just giving a warm smile. In Tumbler Ridge, people are coming together to help their neighbours and friends who are sad or hurt. They are showing love and care, which is the best medicine for a sad heart.\n\nRemember, your words have power! Use them to make someone happy. Your hands have power! Use them to help. Your heart has power! Use it to spread love. Being kind makes our world a brighter place for everyone.\n\n<h3>Sending Love and Strength</h3>\nSo, my little superstars, even when sad things happen, remember that there are always brave helpers, kind grown-ups, and loving friends ready to make things better. The police, doctors, teachers, and all the kind people in Tumbler Ridge are working hard to heal and help. Let's send them all our love and strength from here in Africa, wishing them peace and comfort.\n\nAlways remember to be kind, be safe, and know that you are loved! That's all for today from your friendly African news reporter. Kwaheri (goodbye) for now!",
    "summary": "In a town called Tumbler Ridge far away, a very sad event happened at a school, and grown-ups like police, doctors, and teachers are working hard to help everyone, keep people safe, and understand what happened.",
    "whyMatters": "This story matters because it teaches us that even when sad things happen, brave grown-ups are always there to help, keep us safe, and make sure our schools and homes are good places, reminding us to always be kind and help each other.",
    "category": "world",
    "date": "2026-02-12T06:03:06.629Z",
    "image": "https://image.pollinations.ai/prompt/Heroes%20Helping%20After%20a%20Sad%20Day%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "heroes-helping-after-a-sad-day-far-away",
    "originalLink": "https://www.bbc.com/news/articles/ce8w95knp55o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "title": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "content": "Members of the remote community have spoken of their fear and uncertainty after nine people were killed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:03:11.793Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20terrifying'%3A%20Tumbler%20Ridge's%20tight-knit%20community%20in%20shock%20after%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-terrifying-tumbler-ridges-tight-knit-community-in-shock-after-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cddn078mnn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US House votes to overturn Trump's tariffs on Canada",
    "title": "US House votes to overturn Trump's tariffs on Canada",
    "content": "Six Republican lawmakers joined Democrats to back a resolution that seeks to end the tariffs Trump imposed on Canada last year.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-12T06:03:17.018Z",
    "image": "https://image.pollinations.ai/prompt/US%20House%20votes%20to%20overturn%20Trump's%20tariffs%20on%20Canada%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-house-votes-to-overturn-trumps-tariffs-on-canada",
    "originalLink": "https://www.bbc.com/news/articles/clyz2142e77o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nottingham Forest sack manager Dyche after 114 days",
    "title": "Nottingham Forest sack manager Dyche after 114 days",
    "content": "Nottingham Forest sack Sean Dyche as head coach after just 114 days in charge and are looking for their fourth boss of the season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:03:22.482Z",
    "image": "https://image.pollinations.ai/prompt/Nottingham%20Forest%20sack%20manager%20Dyche%20after%20114%20days%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nottingham-forest-sack-manager-dyche-after-114-days",
    "originalLink": "https://www.bbc.com/sport/football/articles/c98p80g568do?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City 'breathing down Arsenal's neck' as title 'belief' grows",
    "title": "Man City 'breathing down Arsenal's neck' as title 'belief' grows",
    "content": "Pep Guardiola vowed his Manchester City side would \"breathe down the neck of Arsenal\" as they aim to hunt down the Premier League leaders in this fascinating title race.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:03:27.646Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20'breathing%20down%20Arsenal's%20neck'%20as%20title%20'belief'%20grows%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-breathing-down-arsenals-neck-as-title-belief-grows",
    "originalLink": "https://www.bbc.com/sport/football/articles/c7438z9d983o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "PM tells Ratcliffe to apologise for 'colonised' remarks",
    "title": "PM tells Ratcliffe to apologise for 'colonised' remarks",
    "content": "Sir Keir Starmer says comments by the businessman and Manchester United co-owner are \"offensive and wrong\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T06:03:32.822Z",
    "image": "https://image.pollinations.ai/prompt/PM%20tells%20Ratcliffe%20to%20apologise%20for%20'colonised'%20remarks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pm-tells-ratcliffe-to-apologise-for-colonised-remarks",
    "originalLink": "https://www.bbc.com/news/articles/ckglv1n4dzeo?at_medium=RSS&at_campaign=rss"
  }
]