[
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Guess What? Mandela's Special Things Can Now Be Shared!",
    "content": "<h3>Hello, Little News Explorers!</h3>\n\nHello, amazing friends! It's your friendly news reporter here, bringing you some super exciting news from our wonderful continent of Africa. Today, we are going to talk about a very special man, a hero named Nelson Mandela. Have you heard of him? He was a real-life superhero who helped make things fair for everyone in his country, South Africa.\n\n<h3>Who Was Nelson Mandela?</h3>\n\nNelson Mandela was a very brave and kind man. He was known for fighting for freedom and peace. Many years ago, in South Africa, some people were not treated fairly because of the colour of their skin. This was called 'apartheid'. It meant some people couldn't go to the same schools or live in the same places. Nelson Mandela said this was wrong. He wanted everyone to be friends and be treated equally. He worked very hard to make sure all people were free.\n\nDid you know? Nelson Mandela's special nickname was 'Madiba'. Many people loved to call him Madiba! He was the first black president of South Africa. That means he was the first leader chosen by all the people, no matter their skin color.\n\n<h3>Special Things Belonging to a Hero</h3>\n\nNow, our big news is about some things that belonged to Nelson Mandela. Imagine holding something that a great hero once touched! These things are his prison key, a pair of his sunglasses, and one of his shirts. These are not just any old key, glasses, or shirt. They are super important because they belonged to him.\n\n<h3>What is a Prison Key?</h3>\n\nNelson Mandela was put in a special kind of 'house' called a prison for a very long time. This was because he was fighting for what he believed was right, even though some people didn't agree with him back then. He was in prison for 27 years! That's longer than you and your parents have been alive!\n\nThe key we are talking about is a key to his prison cell. Imagine that! It's a key that locked him in, but now it reminds us of his strength and how he finally became free. It's a symbol of hope and freedom for everyone who believes in being fair. It tells a story of a long journey to freedom.\n\nDid you know? A key can mean more than just opening a door. This key represents how Nelson Mandela helped to 'unlock' freedom for his country.\n\n<h3>A Shirt and Some Sunglasses</h3>\n\nNelson Mandela also had a special shirt and a pair of sunglasses. His shirt is a piece of cloth that he wore, just like you wear your clothes every day. It's special because it was his. His sunglasses were probably used to protect his eyes from the sun, but also, they remind us of his famous face and how he looked when he was leading his country.\n\nThese items are like tiny pieces of history. They help us remember what he looked like and what he went through. They help us feel closer to his amazing story. They are not just things, they are memories you can almost touch.\n\n<h3>Why Were These Items So Special?</h3>\n\nBecause Nelson Mandela was such an important person, everything he touched became special. These items are like treasures. They tell us about his journey from being in prison to becoming a respected leader of the world. They remind us of his bravery and how he never gave up on making the world a better place.\n\nDid you know? Nelson Mandela won a very big award called the Nobel Peace Prize. He won it because he worked so hard for peace and for treating everyone fairly. It's one of the highest awards anyone can get for helping people.\n\n<h3>A Big Family Talk in Court</h3>\n\nSo, what happened recently? Nelson Mandela has a daughter named Makaziwe Mandela. She wanted to sell these special things. But some people in charge of the country, we call them 'authorities', said, \"Wait! These are very important for our country's history! They are part of our 'heritage'.\"\n\nWhat is a 'court'? A court is a special building where people go to talk about rules and problems. A judge listens and decides what is fair. So, there was a big talk in court. It was like a big family discussion about these special items.\n\nThe authorities thought the items should stay in South Africa, perhaps in a museum, so everyone in the country could see them and remember their hero. They worried if they left the country, they might be forgotten or not seen by all the children in Africa.\n\n<h3>What Does \"Heritage\" Mean?</h3>\n\n'Heritage' means all the really old and special things from our past that are important to us today. It's like your grandma's old photos or a special story your grandpa tells you. It helps us remember who we are and where we come from. These items of Mandela's are part of South Africa's national heritage.\n\nSo, the people in charge said, \"These things are part of our story, our heritage! We should keep them here so all the children can learn about Madiba!\" But Makaziwe Mandela, his daughter, had a different idea. She wanted to be able to sell them. 'Export' means to send something out of the country to another place.\n\n<h3>What Happens Now?</h3>\n\nAfter a long discussion in the court, the judge made a decision. The judge said that Nelson Mandela's daughter, Makaziwe, can sell the key, the sunglasses, and the shirt. This means they can now be 'exported' or sent to other countries if someone buys them.\n\nSo, these special items might be bought by a museum far away, or a collector who really loves history. This means even more people around the world can learn about Nelson Mandela and his amazing story of courage and freedom.\n\n<h3>Let's Remember Madiba!</h3>\n\nThis news means that Nelson Mandela's story, through these special items, can travel even further! It's a reminder that heroes like Madiba inspire us all, no matter where we live. His message of peace, fairness, and freedom is for everyone. Let's always remember to be kind and fair, just like our hero, Nelson Mandela!\n\nThank you for listening, little news explorers! See you next time!",
    "summary": "Nelson Mandela's daughter won a court battle, allowing her to sell his prison key, sunglasses, and shirt, which authorities previously wanted to keep in South Africa as national heritage.",
    "whyMatters": "This is important because these items belonged to a great African hero, Nelson Mandela, and now they can be shared with people all over the world to help remember his fight for freedom and fairness.",
    "category": "world",
    "date": "2026-01-23T15:21:25.071Z",
    "image": "https://image.pollinations.ai/prompt/Guess%20What%3F%20Mandela's%20Special%20Things%20Can%20Now%20Be%20Shared!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guess-what-mandelas-special-things-can-now-be-shared",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "title": "Helping Our Friends Find Peace in South Sudan!",
    "content": "<h3>Hello From Africa!</h3>\nHello, amazing friends! Welcome to our special news report from beautiful Africa! Today, we're going to learn about a country called South Sudan. It's a land full of sunshine, rivers, and lovely people. Just like in any big family or school, sometimes people in a country don't agree, and it can make things a little difficult. But don't worry, people are working very hard to make everything peaceful and safe again!\n\n<h3>Meet the Army Chief and Soldiers</h3>\nImagine your school has a very important leader who helps everyone stay safe and happy. In a country, there's a similar leader! In South Sudan, there's a special person called the 'Army Chief'. He is like the main captain for all the brave soldiers. Soldiers are special helpers who wear uniforms and work to protect all the people in the country. Their most important job is to keep everyone safe and make sure there is peace, so children can play and learn without any worries.\n\n<h3>What is a 'Rebellion'?</h3>\nSometimes, grown-ups in a country can have really big disagreements. When people get so upset that they start fighting instead of talking, we call it a 'rebellion'. Fighting makes people sad and can make places unsafe. It's never good when people fight. The Army Chief wants to stop this fighting very quickly so that peace can come back for everyone. He wants all the families and children to feel safe in their homes and towns.\n\n<h3>A Plan for Peace in Seven Days!</h3>\nOur brave Army Chief has given his soldiers a very important job. He wants them to work extra, extra hard for seven days, which is just one week! Their big mission is to help make things peaceful and safe again in places where there has been fighting. It's like when your teacher helps two friends stop arguing so they can play together nicely again. The soldiers are working to help stop the disagreements and bring back calm and safety for everyone.\n\nDid you know? South Sudan is one of the newest countries in the world! It only became its own country in 2011. That's not very long ago, which means it's still learning and growing, just like you!\n\n<h3>Bor: A Special Town</h3>\nLet's zoom in on our map of South Sudan! There's a special town called Bor. Bor is like a very important stop on a long road. It's a place where helpers gather before they go to a very big city. This road leads to the country's capital city, which is called Juba. Juba is like the 'brain' of the country, where many important leaders work and make big decisions for everyone. Because Bor is on this important road, it's a very key place to help bring peace to the whole area.\n\n<h3>Extra Helpers Called 'Reinforcements'</h3>\nTo help make Bor safe and ensure peace comes quickly, even more helpers are going there! These extra helpers are called 'reinforcements'. Imagine you are trying to build the biggest, most amazing sandcastle ever, and you need more friends to help carry buckets of water and sand. Those extra friends are like reinforcements! They help the soldiers do their job better and faster so that peace can return quickly to Bor and the areas around it. These reinforcements are there to make sure everyone is protected.\n\nDid you know? The River Nile, one of the longest rivers in the whole world, flows right through South Sudan! It helps many farmers grow delicious food and provides water for animals and people!\n\n<h3>Working for Safety and Happiness</h3>\nEveryone in South Sudan, and all around Africa, wants the fighting to stop so that peace and happiness can come back. When soldiers work to stop fighting, they are helping to protect people, so they can live safely. They want to make sure children can go to school, play with their friends, and sleep soundly at night without any worries. Their job is about bringing stability and calm so that communities can grow strong and happy again.\n\nDid you know? Many people in South Sudan love to sing, dance, and tell stories! It's a big part of their culture and how they share their history and joy with each other!\n\n<h3>A Bright Future for South Sudan</h3>\nWe all hope that the soldiers' hard work will make a big difference very soon. Peace means that everyone can live together without fighting, talking about their problems instead. It means children can laugh and play freely. Let's send our very best wishes and happy thoughts to all our friends in South Sudan, hoping that peace and safety will fill their beautiful country very, very soon!",
    "summary": "The Army Chief in South Sudan has asked his soldiers to work hard for seven days to bring peace and safety back, especially in the important town of Bor, by sending more helpers there to stop fighting.",
    "whyMatters": "This is important because when there is fighting, people can get hurt and children cannot play or go to school safely; the soldiers are working to bring peace so everyone can live happily and without worry.",
    "category": "world",
    "date": "2026-01-23T15:21:47.752Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Our%20Friends%20Find%20Peace%20in%20South%20Sudan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-our-friends-find-peace-in-south-sudan",
    "originalLink": "https://www.bbc.com/news/articles/cj0nn0dvg6jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Blood was all over' - victim of Nigeria church abduction describes escape",
    "title": "'Blood was all over' - victim of Nigeria church abduction describes escape",
    "content": "Some 160 people are believed to be missing after attackers raided three churches in a Nigerian village on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:21:52.928Z",
    "image": "https://image.pollinations.ai/prompt/'Blood%20was%20all%20over'%20-%20victim%20of%20Nigeria%20church%20abduction%20describes%20escape%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "blood-was-all-over-victim-of-nigeria-church-abduction-describes-escape",
    "originalLink": "https://www.bbc.com/news/articles/cn422q1py95o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russia targets Ukraine’s energy as trilateral talks loom",
    "title": "A Big Fight Far Away: Lights Out in Ukraine",
    "content": "<h3>Jambo, Friends from Africa!</h3>\nHi everyone! Your friendly news reporter from Africa is here. I want to tell you about something happening very far away from our sunny continent. It's in a place called Europe. Two big countries, Russia and Ukraine, are having a very big fight, like a war. It's sad, but it's important to know what's happening in our big world, even far away.\n\n<h3>What is a War?</h3>\nA war is when two countries fight with each other. They use soldiers and big machines. It's a very serious thing, and it makes many people sad. When countries fight, people can get hurt, homes can be broken, and life becomes very difficult. We always hope for peace, don't we? Peace means everyone is safe and happy, living together as friends.\n\n<h3>What is 'Energy'?</h3>\nNow, let's talk about something super important that we all need: energy! What is energy? It's like the magic power that makes things work. It's what turns on our lights at home so we can see when it's dark. It makes our fridges cold so food doesn't spoil and our drinks stay cool. It helps us cook yummy meals on the stove and charges our phones and tablets.\n\nEnergy also keeps our houses warm when it's cold outside, which is very important in many places. We get this energy from things like electricity, gas, and oil. These are like the special food our machines and homes need to work properly!\n\n**Did you know?** The sun gives us energy too! It helps plants grow, keeps us warm, and can even make electricity using special solar panels, just like in some homes and schools here in Africa!\n\n<h3>Where Does Energy Come From?</h3>\nElectricity doesn't just appear. It's made in special buildings called 'energy facilities' or power plants. Imagine a big factory, but instead of making toys or clothes, it makes electricity! These big buildings work very hard to create the power we use every day. This electricity then travels through wires, like tiny roads, to your school, your home, and your hospitals.\n\nThere are also places that store gas and oil, which also give us energy. It's a very clever system that helps us live comfortably and do so many things. Without these places, it would be difficult to have all the modern things we use.\n\n<h3>What's Happening in Ukraine's Energy Places?</h3>\nThis is the sad part of the story. In Ukraine, the country that Russia is fighting, Russia is hitting these special energy buildings. They are attacking the places that make electricity, or store gas and oil. When these important places are hit, they can't make power anymore. This means the supply of electricity, gas, or heating can stop.\n\n**Did you know?** There are different ways to make electricity, like using water (this is called hydropower), wind (wind power), or even sunlight (solar power)! Some power plants burn coal or gas to make electricity.\n\n<h3>Why Are They Doing This?</h3>\nNow, why would Russia hit places that make energy and keep people warm and safe? Russia wants Ukraine to give up some of its land. Imagine if someone wanted a piece of your school playground and tried to make you give it to them. That's a bit like it, but with whole countries.\n\nRussia has been fighting Ukraine for a while now, but it hasn't been easy for Russia to win the fights on the ground. So, they are trying a different way. They are trying to make it very difficult for the people of Ukraine to live comfortably. They hope that if it's very cold and dark, Ukraine will agree to give up some land.\n\n<h3>Lights Out and Cold Homes for Kids</h3>\nWhen the energy buildings are hit, what happens? The lights go out in homes, schools, and even hospitals. Children can't do their homework when it's dark. Families can't cook warm food. Hospitals might struggle to keep important machines working for sick people. And when winter comes, it gets very, very cold in Ukraine. Without heating, homes become freezing.\n\nThis makes people very sad, scared, and uncomfortable. Imagine not having electricity for days or weeks! It's a tough situation for the children and families in Ukraine, and it shows how important energy is for our daily lives.\n\n**Did you know?** In some parts of Africa, people use solar lamps to study at night when there is no electricity. It's a smart way to use the sun's energy and helps kids continue learning!\n\n<h3>Why Russia Wants Land</h3>\nEvery country has its own land. This land is where people build their homes, grow their food, have their schools, and where their families have lived for many, many years. Ukraine is a country, and Russia is another country. Russia wants a piece of Ukraine's land. They call this 'territorial concessions,' which means giving up part of your territory or land to someone else.\n\nUkraine doesn't want to give up its land, because it's their home, their country. It's where their history and culture are. This is a big reason why the fight is happening.\n\n<h3>Thinking About Others Far Away</h3>\nEven though this is happening very far away from us in Africa, it's important to think about the children in Ukraine. They just want to live safely, go to school, and play with their friends, just like you. But when there's a war, and lights go out, and homes are cold, it makes everything much harder for them.\n\n**Did you know?** Many people around the world are helping Ukraine by sending food, medicine, and warm clothes to those who need it. Kindness is powerful, and helping others is very important!\n\n<h3>Hope for Peace</h3>\nWe always hope that fights will stop and everyone can live in peace. When countries talk to each other instead of fighting, it's always better for everyone. We wish for the lights to come back on for good in Ukraine and for all the children and families there to be safe, warm, and happy again.\n\n<h3>Our World, Our Home</h3>\nThe world is like one big home for all of us. Even though we are in Africa and Ukraine is far away, we are all part of this big home. Let's remember to be kind to each other, appreciate the energy we have, and always wish for peace for everyone, everywhere. Thank you for listening, my friends! Stay curious and kind!",
    "summary": "Russia is attacking places that make electricity and heating in Ukraine to try and make Ukraine give up some of its land, causing darkness and cold for many families and children.",
    "whyMatters": "This matters because it hurts innocent children and families by taking away their electricity, warmth, and safety, which is very sad and makes life very hard for them.",
    "category": "world",
    "date": "2026-01-23T15:22:23.862Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Fight%20Far%20Away%3A%20Lights%20Out%20in%20Ukraine%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-fight-far-away-lights-out-in-ukraine",
    "originalLink": "https://www.aljazeera.com/features/2026/1/23/russia-targets-ukraines-energy-as-trilateral-talks-loom?traffic_source=rss"
  },
  {
    "originalTitle": "Israeli TikToker attacks activists in occupied West Bank",
    "title": "Israeli TikToker attacks activists in occupied West Bank",
    "content": "Israeli social media figure Roi Star was filmed harassing and attacking activists in the occupied West Bank.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:22:29.097Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20TikToker%20attacks%20activists%20in%20occupied%20West%20Bank%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-tiktoker-attacks-activists-in-occupied-west-bank",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/23/israeli-tiktoker-attacks-activists-in-occupied-west-bank?traffic_source=rss"
  },
  {
    "originalTitle": "Does the World Economic Forum still matter in a fractured global economy?",
    "title": "Does the World Economic Forum still matter in a fractured global economy?",
    "content": "For decades, the World Economic Forum in Davos was a symbol of global cooperation. Today, its relevance is questioned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:22:34.276Z",
    "image": "https://image.pollinations.ai/prompt/Does%20the%20World%20Economic%20Forum%20still%20matter%20in%20a%20fractured%20global%20economy%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "does-the-world-economic-forum-still-matter-in-a-fractured-global-economy",
    "originalLink": "https://www.aljazeera.com/video/counting-the-cost/2026/1/23/does-the-world-economic-forum-still-matter-in-a-fractured-global-economy?traffic_source=rss"
  },
  {
    "originalTitle": "Trump's claim Nato troops avoided Afghanistan front line sparks outrage in UK",
    "title": "Trump's claim Nato troops avoided Afghanistan front line sparks outrage in UK",
    "content": "The US president says Nato troops stayed \"a little off the front lines\" - despite 457 UK military deaths in the conflict.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-23T15:22:39.934Z",
    "image": "https://image.pollinations.ai/prompt/Trump's%20claim%20Nato%20troops%20avoided%20Afghanistan%20front%20line%20sparks%20outrage%20in%20UK%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-claim-nato-troops-avoided-afghanistan-front-line-sparks-outrage-in-uk",
    "originalLink": "https://www.bbc.com/news/articles/czr444j671vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "High stakes but low expectations ahead of Ukraine talks with Russia and US",
    "title": "High stakes but low expectations ahead of Ukraine talks with Russia and US",
    "content": "Donald Trump is pushing hard for a peace deal - but major issues between Russia and Ukraine are still unresolved, writes Sarah Rainsford.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:22:45.101Z",
    "image": "https://image.pollinations.ai/prompt/High%20stakes%20but%20low%20expectations%20ahead%20of%20Ukraine%20talks%20with%20Russia%20and%20US%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "high-stakes-but-low-expectations-ahead-of-ukraine-talks-with-russia-and-us",
    "originalLink": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
    "title": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
    "content": "The BBC sees sites on former United Arab Emirates bases in Yemen where detainees say they were abused.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:22:50.279Z",
    "image": "https://image.pollinations.ai/prompt/'I%20didn't%20hear%20from%20my%20son%20for%20seven%20months'%3A%20Inside%20Yemen's%20UAE-run%20secret%20prisons%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-didnt-hear-from-my-son-for-seven-months-inside-yemens-uae-run-secret-prisons",
    "originalLink": "https://www.bbc.com/news/articles/c3r117w55q4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spurs open talks to sign Liverpool's Robertson",
    "title": "Spurs open talks to sign Liverpool's Robertson",
    "content": "Tottenham enter into talks with Liverpool as they look to secure a deal for left-back Andy Robertson.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:22:55.728Z",
    "image": "https://image.pollinations.ai/prompt/Spurs%20open%20talks%20to%20sign%20Liverpool's%20Robertson%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spurs-open-talks-to-sign-liverpools-robertson",
    "originalLink": "https://www.bbc.com/sport/football/articles/c79rr2440elo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'A big blow' - Grealish has stress fracture",
    "title": "'A big blow' - Grealish has stress fracture",
    "content": "There is no timescale on on-loan Everton winger Jack Grealish's recovery from a stress fracture in his foot, says manager David Moyes.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:23:00.893Z",
    "image": "https://image.pollinations.ai/prompt/'A%20big%20blow'%20-%20Grealish%20has%20stress%20fracture%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-blow-grealish-has-stress-fracture",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20zzx6xw4vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rodman 'becomes highest-paid women's footballer'",
    "title": "Rodman 'becomes highest-paid women's footballer'",
    "content": "Trinity Rodman signs a new three-year deal with Washington Spirit that will reportedly make her the world's highest-paid female footballer.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T15:23:06.064Z",
    "image": "https://image.pollinations.ai/prompt/Rodman%20'becomes%20highest-paid%20women's%20footballer'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rodman-becomes-highest-paid-womens-footballer",
    "originalLink": "https://www.bbc.com/sport/articles/crkrr33yr34o?at_medium=RSS&at_campaign=rss"
  }
]