[
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "Oh No! Our Farm Friends Need Help in Sunny South Africa!",
    "content": "<h3>Hello, My Amazing Friends!</h3>\nHi everyone! It's your kid-friendly reporter from Africa here. Today, we have some important news from a super big country called South Africa. It's a land full of beautiful animals and friendly people. We're going to talk about something that's making some of our animal friends there feel a bit poorly.\n\n<h3>What's Making Our Animal Friends Sick?</h3>\nThere's a sickness that animals can get, and it's called 'Foot-and-Mouth Disease'. It sounds a bit funny, but it's not a cold or a tummy ache for people. This sickness makes animals like cows, pigs, sheep, and goats feel very, very unwell.\n\nImagine having a sore mouth that makes it hard to eat, and sore feet that make it hard to walk. That's a bit like how they feel. They get little spots and blisters inside their mouths and on their feet. It really hurts them.\n\nDid you know? This sickness mostly affects animals that have hooves! Hooves are like their special hard toenails. So, animals like horses and cats don't usually get this kind of sickness. It's special to hoofed animals.\n\n<h3>Why Are Farmers Super Worried?</h3>\nNow, who are farmers? Farmers are amazing people who work really, really hard every single day. They look after these animals, making sure they have food, water, and a safe place to live. Farmers also grow all the yummy vegetables and fruits that we eat!\n\nThe animals on their farms are very important. Cows give us fresh milk for our cereal and cheese. Goats also give milk. Other animals can give us meat to eat. When these animals get sick with Foot-and-Mouth Disease, they can't make milk anymore.\n\nThey also don't grow big and strong. This makes the farmers very sad, and it's really hard for them to sell their animals or their milk. If they can't sell their farm products, they don't have enough money to buy food for their own families or to look after their farms.\n\nDid you know? Farmers are like real-life superheroes for our food! They make sure we have all the delicious things to eat every day, from eggs to apples and everything in between.\n\n<h3>How Does the Sickness Spread So Fast?</h3>\nThis Foot-and-Mouth sickness is very, very good at spreading! It's like a speedy little rumour that zips around. It can move from one sick animal to other healthy animals super quickly. This means that lots and lots of animals can get sick in a short amount of time. Wow!\n\nWhen many animals get sick on one farm, it's a big, big problem. It can even spread to other farms nearby! It's a bit like when one friend gets a cold at school, and then lots of other friends might get it too if they're not careful. But this sickness is just for animals, not for people!\n\nDid you know? Sometimes, the sickness can spread even if animals just share a water trough or eat grass in the same field! That's how fast and tricky it can be.\n\n<h3>What Are the Grown-Ups Doing to Help Our Animals?</h3>\nGood news! The grown-ups who are in charge of the country, called the government, are trying their very best to help. They have started a special plan called a \"vaccination programme.\"\n\nA vaccination is like a tiny little shot that gives animals special medicine. This medicine helps their bodies learn how to fight off the sickness. It's like giving them a super strong shield for their bodies!\n\nWhen animals get vaccinated, they are much less likely to get sick. And if they do get sick, they usually don't get as unwell. This helps them get better faster and feel less pain.\n\nDid you know? Humans also get vaccinations to stop us from getting sick with things like measles or chickenpox! It's a super clever way to stay healthy and strong.\n\n<h3>Why Is It Super Important to Act Fast?</h3>\nSome people are saying that the grown-ups started giving the vaccinations a little bit late. When a sickness like Foot-and-Mouth Disease spreads so quickly, it's super, super important to act very, very fast!\n\nThe quicker you give the medicine and help the animals, the quicker you can stop the sickness from spreading to even more animals. It's like if you see a tiny crack in a window, it's easier to fix it right away before the crack gets bigger!\n\nDid you know? Speed is super important when trying to stop the spread of animal sicknesses! Every day counts when many animals are at risk.\n\n<h3>Our Animals and Our Food Are So Important!</h3>\nThis whole story is important because we all love our animal friends. They are part of our world! And we all need food to grow big and strong every day! Farmers help us have both healthy animals and yummy food.\n\nSo, when farmers and their animals are having a tough time, it can affect everyone. We want all our animals to be happy and healthy, with strong feet and mouths, so they can keep living their best lives on the farm.\n\n<h3>Let's Hope for Healthy Hooves and Happy Farms!</h3>\nSo, while it's a bit of a worry right now for our friends in South Africa, lots of people are working super hard to make sure the animals get better and stop the sickness. With the vaccination programme, we hope that our farm friends will soon have healthy mouths and healthy hooves again! Yay for healthy animals and happy farmers!",
    "summary": "Farmers in South Africa are worried because their cows, pigs, and goats are getting sick with something called Foot-and-Mouth Disease, but the government is now giving special shots to help the animals get better and stop the sickness from spreading quickly.",
    "whyMatters": "This is important because farmers take care of the animals that give us food like milk and meat, and when their animals get sick, it makes it hard for the farmers to get food for their families and for us, so we want all the animals to be healthy and strong.",
    "category": "world",
    "date": "2026-02-20T05:50:23.400Z",
    "image": "https://image.pollinations.ai/prompt/Oh%20No!%20Our%20Farm%20Friends%20Need%20Help%20in%20Sunny%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oh-no-our-farm-friends-need-help-in-sunny-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Son of Robert Mugabe arrested in South Africa on suspicion of attempted murder",
    "title": "Son of Robert Mugabe arrested in South Africa on suspicion of attempted murder",
    "content": "Bellarmine Mugabe is in custody after a man who worked at the place where he was staying was shot and injured.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:50:28.497Z",
    "image": "https://image.pollinations.ai/prompt/Son%20of%20Robert%20Mugabe%20arrested%20in%20South%20Africa%20on%20suspicion%20of%20attempted%20murder%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "son-of-robert-mugabe-arrested-in-south-africa-on-suspicion-of-attempted-murder",
    "originalLink": "https://www.bbc.com/news/articles/c1jkx2pkyyro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Islamist militants accused of killing 34 in raids on Nigerian villages",
    "title": "Islamist militants accused of killing 34 in raids on Nigerian villages",
    "content": "The gunmen launched simultaneous assaults on multiple communities in a remote border district, officials say.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:50:33.617Z",
    "image": "https://image.pollinations.ai/prompt/Islamist%20militants%20accused%20of%20killing%2034%20in%20raids%20on%20Nigerian%20villages%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "islamist-militants-accused-of-killing-34-in-raids-on-nigerian-villages",
    "originalLink": "https://www.bbc.com/news/articles/cgrzgk57r9vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Deadly tower collapse has locals in Lebanon’s Tripoli asking: Are we next?",
    "title": "Keeping Our Homes Strong and Safe!",
    "content": "<h3>Hello, Future Heroes!</h3>\n\nHello, amazing young friends from all over Africa! I'm your special kid-friendly news reporter, and I'm here to share an important story with you today. \n\nWe learn new things every day, don't we? Today, we're going to learn about something very important: our homes and how to keep them safe.\n\nIt’s so good to know about the world, even about places far away. Learning helps us understand things better and helps us grow into caring, smart young people.\n\nOur homes are special places. They keep us warm, safe, and happy. We love our homes, whether they are made of mud, bricks, wood, or anything else!\n\nToday, we will talk about what makes buildings strong and why it's so important for them to be safe for everyone who lives or plays inside them.\n\n<h3>A Story from Far Away</h3>\n\nFar, far away from many of our homes in Africa, across the big blue ocean, there is a country called Lebanon. \n\nLebanon is a beautiful country with cities and towns, just like our countries. It has people who go to school, play games, and live in homes, just like you.\n\nIn Lebanon, there is a city called Tripoli. It's a busy city where many, many people live and work.\n\nNot long ago, in this city of Tripoli, something sad happened. A very, very old building got too weak, and it fell down.\n\nImagine a very old tree that has been standing for hundreds of years. Sometimes, even the strongest trees can get too old and fall over. \n\nThis old building in Tripoli was like that. It had been standing for a very long time, but it wasn't strong anymore.\n\nWhen the building fell, it made many people in Tripoli very, very sad. Some people got hurt, and we send our biggest hugs and kindest thoughts to everyone there.\n\nIt's important to remember that when something sad happens, we can always send our love and hope to those who are affected. We are all global neighbours.\n\n<h3>What Makes a Building Strong?</h3>\n\nLet’s think about our own homes and schools. What makes them stand up tall?\n\nBuildings are amazing structures. They are built with lots of materials like bricks, cement, wood, and sometimes even strong earth or clay.\n\nEvery building needs a very strong base, like strong feet on the ground. This base is called a foundation. It helps the whole building stand firm.\n\nThen, builders add walls. Walls are like the body of the building. They need to be strong enough to hold up the roof and keep everything inside safe.\n\nAfter the walls, comes the roof! The roof protects us from the sun, the rain, and the wind. It’s like a big umbrella over our heads.\n\n**Did you know?** Some of the oldest buildings in the world are still standing today because they were built very, very well, even thousands of years ago!\n\nIn Africa, many homes are built using natural materials like mud bricks, straw, and wood. These materials can be very strong and keep homes cool in the heat.\n\nIt takes careful planning and good work to build a home that will be strong and safe for many, many years. \n\n<h3>When Buildings Get Very Old</h3>\n\nJust like us, buildings can get old. When they get very, very old, sometimes they start to get tired. \n\nWhat does a tired building look like? Well, its walls might get cracks, like little lines appearing on them.\n\nThe paint might peel off, or the roof might start to leak when it rains. These are signs that a building is getting old and might need some help.\n\nIf a building gets too old and no one fixes it, it can become unsafe. This means it might not be strong enough to keep standing anymore.\n\nThis is what happened with the building in Tripoli. It was so old that its parts became too weak to hold up the rest of the structure.\n\nIt's like an old toy that you played with so much that it finally broke. Buildings can break too, if they are not looked after over a very long time.\n\nIt is very important for grown-ups to check on old buildings to make sure they are still strong and safe for everyone.\n\n<h3>Why Are People Worried?</h3>\n\nAfter that old building fell down in Tripoli, many people who live in the city started to worry.\n\nThey looked at other old buildings around them, especially their own homes and the homes of their friends.\n\nThey started asking an important question: \"Is *our* home strong enough? Are *our* other old buildings safe?\"\n\nIt's a very natural thing to worry about safety, especially when something like this happens nearby. Everyone wants to feel safe in their own home.\n\nImagine if you saw a friend's toy break, and you wondered if your own toy was strong enough. It's the same kind of feeling.\n\nIn Tripoli, many of the buildings are quite old. Some of them have not been fixed or updated for many, many years.\n\nThis makes people think about their own safety and the safety of their families and friends. They want to know that someone will help make sure all buildings are strong.\n\nIt's a big worry for the grown-ups in Tripoli, and it's a good reason for everyone to think about safety in their communities.\n\n<h3>How Can We Stay Safe?</h3>\n\nSo, what can be done to make sure buildings are strong and safe for everyone? \n\nGrown-ups who are called engineers are special people. They know all about how to build things very strongly.\n\nEngineers can check old buildings. They look for cracks, wobbly parts, or any signs that a building is not safe anymore.\n\nIf an engineer finds a problem, they can tell people how to fix it. Sometimes, an old building needs new, stronger parts. \n\nSometimes, a building might be too old or too broken to fix, and then it's safer for people to move out and for the building to be taken down carefully.\n\nGovernments and community leaders in places like Tripoli are now thinking about how to help fix or make safer all the old buildings.\n\nThey want to make sure that no more buildings fall down and that everyone can live in a safe home. This is a very important job.\n\n**Did you know?** In many African villages, building and fixing homes is often a community effort! Everyone helps each other to make sure homes are strong and safe.\n\nWorking together, like a big team, is the best way to solve big problems and make our communities better and safer for everyone.\n\n<h3>Learning from Our Neighbours</h3>\n\nEven though this story happened far away in Lebanon, it teaches us some really important lessons here in Africa and all around the world.\n\nFirst, it teaches us to care about people everywhere. Even if we don't know them, they are our human family, and we feel sad when bad things happen to them.\n\nSecond, it teaches us to always think about safety. Our homes, our schools, and all the places we visit should be safe for us.\n\nIt reminds us to look after our buildings. Just like we look after our toys or our clothes, buildings need care too.\n\nWe want all homes to be strong and safe for every child and every family, no matter where they live in the world.\n\nIt's a reminder that everyone deserves a safe place to live, learn, and play.\n\n<h3>What Can Kids Do?</h3>\n\nEven as kids, you can help! How, you ask?\n\nYou can talk to your parents, guardians, or teachers. Ask them about the safety of your home or school. \n\nIf you ever see a big crack in a wall, or a roof that looks like it might fall, tell a grown-up right away. It’s always good to let them know.\n\nDon't be scared, but be aware and helpful. Grown-ups need to know about these things so they can check them out.\n\nAlso, remember to be kind and think about others. When you hear about sad news, you can think of ways to be a good friend and neighbor in your own community.\n\nWe can all help make our communities safer and stronger just by caring and paying attention!\n\n<h3>Let's Build a Safer Future!</h3>\n\nSo, my wonderful friends, let's remember the lessons from Tripoli.\n\nLet's remember how important it is for buildings to be strong and safe. Let's remember to care for our communities and for people everywhere.\n\nTogether, we can all dream of a world where every single home is a strong, safe, and happy place for every child.\n\nKeep learning, keep caring, and keep shining bright! You are the future builders of a safer, kinder world!\n",
    "summary": "Children in Africa can learn about why buildings must be strong and safe, after an old building fell down in a far-away city called Tripoli, in Lebanon, causing worries about other old homes.",
    "whyMatters": "This matters because everyone deserves a safe home, and we can all learn about helping our communities make sure buildings are strong for everyone, protecting our friends and families from harm.",
    "category": "world",
    "date": "2026-02-20T05:50:57.107Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Our%20Homes%20Strong%20and%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-our-homes-strong-and-safe",
    "originalLink": "https://www.aljazeera.com/features/2026/2/20/tower-collapse-locals-lebanon-tripoli-asking-are-we-next?traffic_source=rss"
  },
  {
    "originalTitle": "Indonesia, Morocco, Kosovo among 5 countries to send troops under Gaza plan",
    "title": "Indonesia, Morocco, Kosovo among 5 countries to send troops under Gaza plan",
    "content": "Kazakhstan and Kosovo have also pledged to participate, while Egypt and Jordan will provide training for police.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:02.230Z",
    "image": "https://image.pollinations.ai/prompt/Indonesia%2C%20Morocco%2C%20Kosovo%20among%205%20countries%20to%20send%20troops%20under%20Gaza%20plan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "indonesia-morocco-kosovo-among-5-countries-to-send-troops-under-gaza-plan",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/indonesia-morocco-kosovo-among-5-countries-to-send-troops-under-gaza-plan?traffic_source=rss"
  },
  {
    "originalTitle": "Major road crash leaves 18 dead, 3 injured in northeast Egypt",
    "title": "Major road crash leaves 18 dead, 3 injured in northeast Egypt",
    "content": "Road accidents, often linked to speeding, claim thousands of lives each year in Egypt.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:07.321Z",
    "image": "https://image.pollinations.ai/prompt/Major%20road%20crash%20leaves%2018%20dead%2C%203%20injured%20in%20northeast%20Egypt%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "major-road-crash-leaves-18-dead-3-injured-in-northeast-egypt",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/major-road-crash-leaves-18-dead-3-injured-in-northeast-egypt?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
    "title": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
    "content": "The US is surging forces to the Middle East amid negotiations with the Islamic Republic over its nuclear programme.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:12.933Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20world%20has%2010%20days%20to%20see%20if%20Iran%20agrees%20deal%20or%20'bad%20things%20happen'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-world-has-10-days-to-see-if-iran-agrees-deal-or-bad-things-happen",
    "originalLink": "https://www.bbc.com/news/articles/c86yjnw4x49o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudan atrocities are 'hallmarks of genocide', UN says",
    "title": "Sudan atrocities are 'hallmarks of genocide', UN says",
    "content": "A UN fact-finding mission issued the report after investigating the capture of el-Fasher by the Rapid Support Forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:18.034Z",
    "image": "https://image.pollinations.ai/prompt/Sudan%20atrocities%20are%20'hallmarks%20of%20genocide'%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudan-atrocities-are-hallmarks-of-genocide-un-says",
    "originalLink": "https://www.bbc.com/news/articles/cpqw74d81jqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump's Board of Peace members pledge $7bn in Gaza relief",
    "title": "Trump's Board of Peace members pledge $7bn in Gaza relief",
    "content": "Trump said it \"looks like\" Hamas will disarm, even though there are signs the group is regrouping.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:23.140Z",
    "image": "https://image.pollinations.ai/prompt/Trump's%20Board%20of%20Peace%20members%20pledge%20%247bn%20in%20Gaza%20relief%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-board-of-peace-members-pledge-dollar7bn-in-gaza-relief",
    "originalLink": "https://www.bbc.com/news/articles/cp8rke05kv4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Forest 'enjoy' themselves for perfect start under Pereira",
    "title": "Forest 'enjoy' themselves for perfect start under Pereira",
    "content": "Vitor Pereira asks his Nottingham Forest players to \"express themselves\" prior to their commanding victory at Fenerbahce in the first leg of their Europa League knockout round play-off tie.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:28.592Z",
    "image": "https://image.pollinations.ai/prompt/Forest%20'enjoy'%20themselves%20for%20perfect%20start%20under%20Pereira%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "forest-enjoy-themselves-for-perfect-start-under-pereira",
    "originalLink": "https://www.bbc.com/sport/football/articles/c4g57n9ze17o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "The eerie similarities between Arsenal's 2007-8 collapse and now",
    "title": "The eerie similarities between Arsenal's 2007-8 collapse and now",
    "content": "Arsenal's disappointing 2-2 draw at Wolves on Wednesday has similarities to what happened to the Gunners 18 years ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T05:51:33.693Z",
    "image": "https://image.pollinations.ai/prompt/The%20eerie%20similarities%20between%20Arsenal's%202007-8%20collapse%20and%20now%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-eerie-similarities-between-arsenals-2007-8-collapse-and-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yk6vgppydo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sutton's predictions v Embrace bassist Steve Firth",
    "title": "Sutton's predictions v Embrace bassist Steve Firth",
    "content": "BBC Sport football expert Chris Sutton takes on Embrace bassist Steve Firth plus the BBC readers and AI with his predictions for this weekend's Premier League fixtures.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-20T05:51:38.798Z",
    "image": "https://image.pollinations.ai/prompt/Sutton's%20predictions%20v%20Embrace%20bassist%20Steve%20Firth%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suttons-predictions-v-embrace-bassist-steve-firth",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2j8wljzp3o?at_medium=RSS&at_campaign=rss"
  }
]