[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News from Far Away: Thinking of Our Ghanaian Family",
    "content": "<h3>Hello from Your Friendly Africa Reporter!</h3>\n\nHi everyone! It's your friendly news reporter here, bringing you important news from our big, beautiful continent of Africa. Today, we have some sad news to share, but it's important to understand what's happening in the world, even when it's far away. We're going to talk about some people from Ghana, an African country, who have sadly lost their lives in a war. \n\n<h3>What Happened?</h3>\n\nWe heard some very sad news from Ghana. Ghana is a wonderful country right here in Africa. The government of Ghana has told us that 55 people from their country have sadly died because of a war. This war is happening in two countries far, far away from Africa, called Russia and Ukraine. Fifty-five people is a very big number of friends and family to lose.\n\nThis is important because it is the *most* number of people from any single African country who have sadly lost their lives in this particular war. When one part of our big African family hurts, we all feel a little bit sad and we want to understand and care.\n\n<h3>Where is Ghana?</h3>\n\nLet's talk a little about Ghana first! Ghana is a beautiful country in West Africa. It's known for its friendly people, yummy food like jollof rice, and lovely beaches along the Atlantic Ocean. The capital city is Accra, and it's a busy, lively place. Many different tribes and people live together happily in Ghana.\n\nGhana is full of culture, music, and colorful fabrics called Kente cloth. Imagine a country where everyone smiles and welcomes you! That's a bit like Ghana.\n\nDid you know? Ghana was the first country in sub-Saharan Africa to gain independence from colonial rule in 1957! It's a country with a proud history and many smart, kind people.\n\n<h3>The War Far Away: Ukraine and Russia</h3>\n\nNow, let's talk about where this sad thing happened. There is a big, big problem, a fight, happening between two countries called Ukraine and Russia. They are very, very far away from Africa, on another continent called Europe. When countries fight like this, we call it a 'war'.\n\nWar means people are fighting, and it makes many things broken and many people sad. It's a time when people don't get along, and it can be very dangerous for everyone who lives there, even if they are not fighting themselves.\n\nImagine if your friends started fighting really badly and things got broken, and people got hurt. War is like that, but much, much bigger, with whole countries involved. It's a very serious thing, and it makes people everywhere hope for peace.\n\n<h3>Why Were Ghanaians There?</h3>\n\nYou might be wondering, why were people from Ghana in Ukraine and Russia if the war is so far away? Well, many people from Ghana, especially young people, travel to other countries to study. They might go to university to learn to be doctors, engineers, or many other wonderful things. Others might go to work and send money back home to their families.\n\nSo, these 55 Ghanaians were not there to fight in the war. They were simply living their lives, studying, working, or just being there when the fighting started. They were like you or me, just trying to live a normal life, but they were caught in a very dangerous situation because of the war.\n\nDid you know? People from Africa study all over the world! It's a great way to learn new things and meet new people, helping to make the world a smaller, friendlier place.\n\n<h3>What Does 'Casualties' Mean?</h3>\n\nWhen we hear the word 'casualties', it simply means people who got hurt or sadly died because of something bad that happened, like a war or a big accident. In this sad news, the 55 Ghanaians are called 'casualties' because they lost their lives because of the fighting in Ukraine.\n\nIt's a grown-up word for people who were victims of the war. Every single number, every 'casualty', means a real person with a family, friends, and dreams, just like you. And now their families in Ghana are very, very sad.\n\n<h3>Why is This Important for Africa?</h3>\n\nThis news is important for all of us in Africa because Ghana is part of our African family. We are all connected. When something sad happens to one country in Africa, it affects all of us. It reminds us that even wars far away can touch our homes and our hearts here in Africa.\n\nIt's also important because, as we said, Ghana has lost the *most* people from any African country in this war. This makes us think about peace even more. We want all people, everywhere, especially our African brothers and sisters, to be safe and sound.\n\nDid you know? Africa is the second-largest continent in the world, with 54 different countries! We have so many different cultures, languages, and amazing animals. We are a big family.\n\n<h3>Thinking About Peace</h3>\n\nWhen we hear news like this, it makes us think about how important peace is. Peace means everyone can live happily and safely, without fighting, without fear. It means friends can play, families can be together, and children can go to school without worrying about danger.\n\nWe always hope for peace in the world. We hope that the fighting in Ukraine and Russia will stop soon so that no more people get hurt, and everyone can go back to living in safety. Peace is when people talk and share, instead of fighting.\n\nDid you know? The opposite of war is peace. Many people work very hard every day to try and bring peace to places where there is fighting.\n\n<h3>What Can We Do?</h3>\n\nEven though we are far away, we can still do something. We can send our kind thoughts and prayers to the families in Ghana who have lost their loved ones. We can remember them and hope that they find comfort.\n\nWe can also promise to be kind to each other every single day. We can try to solve our own small problems with words and understanding, not with fighting. Because when we are kind and peaceful in our own lives, we help make the whole world a more peaceful place.\n\nThank you for listening, my dear friends. Let's always remember to be kind and hope for peace for everyone, everywhere. Your friendly Africa reporter, signing off!",
    "category": "world",
    "date": "2026-02-27T17:31:06.475Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Far%20Away%3A%20Thinking%20of%20Our%20Ghanaian%20Family%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-far-away-thinking-of-our-ghanaian-family",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "A Story About Staying Safe and Brave!",
    "content": "<h3>Hello from Africa!</h3>\n\nHello, wonderful friends! It’s me, your friendly reporter, here to share a very important story with you from our amazing continent, Africa! Today, we are going to talk about a country called Burkina Faso. Can you say that? Burkina Faso! It’s a beautiful place with many happy people and bright sunshine. Just like your home, Burkina Faso is full of children who love to play and learn.\n\n<h3>A Sad Story from Burkina Faso</h3>\n\nSometimes, we hear stories that make us feel a little sad, but they also teach us very important lessons. There was a grown-up who used to work for another country, America, in Burkina Faso. He was supposed to be a good helper and kind to everyone. But sadly, this grown-up did something very, very wrong. He was not kind to two young girls. This happened when their mommy was very, very sick and needed help. Instead of being a kind helper, this grown-up did bad things that made the girls feel scared and sad.\n\n**Did you know?** Burkina Faso is in West Africa, and it means \"Land of the Upright People\"! This name shows that the people there believe in being honest and doing what is right.\n\n<h3>Good Grown-ups Are Our Safety Helpers</h3>\n\nMost grown-ups in the world are wonderful people! They love children very much and always want to keep you safe, happy, and healthy. Think about your mommy, daddy, grandma, grandpa, teachers, or even a kind neighbor. These are your safety helpers! They are there to listen to you, protect you, and make sure you feel loved every day. Grown-ups who are good helpers always make sure children feel safe and respected. They would never do anything to make a child feel scared or sad.\n\n<h3>Rules and Laws Keep Us Safe</h3>\n\nEvery country has special rules, just like how your home or school has rules. These big rules are called \"laws.\" Laws are like very important guides that tell everyone what is right and what is wrong. They are made to protect everyone, especially children. One of the most important laws is that every child has the right to feel safe and happy all the time. No grown-up should ever make a child feel unsafe, scared, or uncomfortable. When someone breaks these very important laws, there are consequences to help keep everyone else safe.\n\n**Did you know?** In many parts of Africa, children play games like \"kati\" (like tag) or make their own toys from things they find, like old plastic bags or bottle tops! Fun and games are important for children everywhere.\n\n<h3>Feeling Safe and Unsafe</h3>\n\nHow do you know if you are safe? Being safe means you feel happy, loved, and calm. You can play and learn without worry. But sometimes, a grown-up might say or do something that makes your tummy feel funny, or makes you feel scared, confused, or sad. This is a sign that something might not be safe. Your feelings are like little helpers telling you important things. It’s okay to feel these feelings, but it's super important to know what to do next.\n\n<h3>Your Superpower: Telling a Trusted Grown-up!</h3>\n\nThis is the most important part of our story! If anyone, grown-up or child, ever does something that makes you feel unsafe, scared, or uncomfortable, you have a superpower! Your superpower is to **tell a trusted grown-up right away!** This could be your mommy, daddy, grandma, grandpa, an auntie, an uncle, or your teacher. It’s never your fault if someone does something bad. Telling helps you, and it helps other children too. Being brave and telling a grown-up is the best way to make sure bad things stop and everyone stays safe. You don't have to keep secrets that make you feel scared or sad.\n\n**Did you know?** There's a special day every year called the \"International Day of the African Child\" on June 16th! It's a day to celebrate children and make sure all children are safe and happy.\n\n<h3>Justice Was Served!</h3>\n\nBecause the grown-up in Burkina Faso did very bad things, other good grown-ups worked together to help. People from America and people from Burkina Faso worked very hard to find out what happened and make sure the girls were safe. They caught the grown-up who did the bad things. He was taken to court, which is like a special place where people talk about what happened and decide what is fair. The grown-up who hurt the girls was sent to jail for a very, very long time. This means he cannot hurt anyone else, and he will stay in jail to think about the bad choices he made. This shows that the rules and laws work, and good grown-ups will always make sure children are protected.\n\n<h3>What This Means for You</h3>\n\nThis story reminds us all how important it is for every child to be safe and happy. It also shows us that if someone does bad things, they will be stopped, and they will face consequences. Most grown-ups are kind and wonderful, but if you ever meet one who is not, remember your superpower! Talk to a trusted grown-up. They are there to help you and keep you safe. You are strong, you are brave, and you are loved.\n\n<h3>Always Be Safe and Happy!</h3>\n\nWe want all children in Africa and all over the world to feel safe, loved, and happy every single day! Always remember to be kind to others, and always remember to be brave enough to speak up if you or a friend ever feels unsafe. Your safety is the most important thing. Keep playing, keep learning, and keep shining bright!\n\n**Did you know?** Many countries in Africa have special programs to teach children about safety and who their trusted adults are, just like this story is doing right now!",
    "summary": "Good grown-ups worked together to help two girls in Burkina Faso and made sure a grown-up who did bad things went to jail for a very long time.",
    "whyMatters": "It's important to know that there are grown-ups who will always keep children safe, and bad people who hurt others will be stopped and face consequences.",
    "category": "world",
    "date": "2026-02-27T17:31:31.795Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Staying%20Safe%20and%20Brave!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-staying-safe-and-brave",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "A Big Fancy House in Sunny Morocco!",
    "content": "<h3>Hello, Super Friends! Your Kid Reporter is Here!</h3>\nHello, amazing friends all across Africa! Your favorite kid news reporter is here to tell you a very interesting story today. It's about a super big and fancy house in a beautiful country called Morocco. Guess what? Morocco is part of our big, wonderful continent, Africa!\n\n<h3>What is a Palace, Anyway?</h3>\nFirst, let's talk about what a 'palace' is. Imagine the biggest, most beautiful house you can ever think of! A palace is like a super-duper large house, often with many, many rooms, giant gardens, and sometimes even sparkling fountains. Kings and queens used to live in palaces, and some still do! They are usually very old and have lots of exciting stories hidden in their walls.\n\nDid you know? Some palaces are so big, you could get lost trying to find all the rooms! They often have special names, too, just like our houses have numbers.\n\n<h3>Journey to Sunny Morocco!</h3>\nOur story takes us to a lovely country named Morocco. It's right at the top of Africa, close to a big, blue ocean. Morocco is famous for its bright, happy colors, delicious food, and sometimes you can even see camels walking in the desert! It's a really special place with beautiful sunshine.\n\nDid you know? Morocco is known for its amazing handmade carpets and pretty tiles that look like colorful puzzles on the walls and floors!\n\n<h3>Mr. Money-Man and His Big Plan</h3>\nThere was once a grown-up man named Mr. Epstein. He had a lot, a lot, a lot of money. But, even though he had so much money, Mr. Epstein did not always make good choices. In fact, he did many things that were very wrong and made lots of people sad. It's really important for everyone, grown-ups and kids, to always make good choices and follow the rules to be kind to others.\n\nDid you know? Having lots of money can be helpful, but being kind, honest, and following rules is much more important than any amount of money!\n\n<h3>What Does it Mean to 'Buy' Something?</h3>\nWhen you want a new toy, or your grown-up wants some food from the shop, they use money to 'buy' it. 'Buying' means you give money to someone, and then the thing you wanted becomes yours! Mr. Epstein wanted to buy a very big palace in Morocco. The palace even had a special name, Bin Ennakhi (which sounds super fancy!). He was talking to the grown-ups who owned it, like when you talk about wanting a new toy for your birthday.\n\nDid you know? Money helps us get the things we need and want, but it's important to use it wisely and for good things!\n\n<h3>A Big House Dream That Didn't Come True</h3>\nSo, Mr. Epstein was talking and talking about buying this magnificent palace. He really wanted it to be his! But, something very important happened before he could finish buying it. He was 'arrested'.\n\nDid you know? When someone is 'arrested', it means the police come and take them away because they believe that grown-up has broken some very important rules or done something wrong. The police's job is to keep everyone safe and make sure rules are followed.\n\n<h3>Why Do We Have Rules?</h3>\nRules are super important! We have rules at home, rules at school, and grown-ups have rules in their towns and countries. These rules are like special instructions that help everyone stay safe, happy, and fair. Imagine playing a game without rules – it would be confusing and not fun at all! When grown-ups break big rules, like Mr. Epstein did, the police need to step in to protect everyone.\n\n<h3>Always Choose to Be Kind and Follow the Rules!</h3>\nThis story reminds us of something very important: it doesn't matter how much money someone has, or how big a house they want to buy. What truly matters is being a good person, making kind choices, and always following the rules. Being kind makes the world a much brighter and happier place for everyone!\n\nDid you know? You can make a difference every day just by being kind, sharing a smile, or helping a friend! These good choices make you feel happy inside and help others feel happy too.\n\n<h3>What Happened Next to the Palace?</h3>\nSo, Mr. Epstein couldn't buy the palace in Morocco because he was arrested for the bad things he did. The beautiful palace is still there, waiting for someone who will make good choices to live in it. This story teaches us that even if someone has lots of money, they still have to follow the rules, just like everyone else. It's always best to be a good person!\n\nThank you for listening, my wonderful friends! Stay safe, stay kind, and keep making good choices!",
    "category": "world",
    "date": "2026-02-27T17:31:51.931Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Fancy%20House%20in%20Sunny%20Morocco!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-fancy-house-in-sunny-morocco",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "England keep Pakistan T20 World Cup hopes alive by beating New Zealand",
    "title": "Exciting Cricket News! England Wins Big and Helps a Friend!",
    "content": "Hello, my amazing young friends all across Africa! I'm your special news reporter, and I have some super exciting sports news for you today. It's all about cricket, a fantastic game played with a bat and a ball!\n\n<h3>What is Cricket?</h3>\nImagine a super exciting game where two teams try to score points. One team hits a ball with a special bat, and the other team tries to catch it and get the players out. It's a bit like baseball, but with its own special rules and lots of running!\n\nDid you know? Cricket is very popular in many parts of Africa, like South Africa, Kenya, and Zimbabwe! Many children like you love to play it.\n\n<h3>The T20 World Cup!</h3>\nRight now, grown-up teams from different countries are playing in a very big competition. It's called the T20 World Cup. 'T20' means the game is super-fast! It's like a short, speedy version of cricket, full of action and fun.\n\nThis World Cup is a huge party of sports! Teams travel from all over the world to play their best. Everyone wants to be the champion and lift the big trophy.\n\n<h3>The Big Match: England vs. New Zealand</h3>\nRecently, two strong teams, England and New Zealand, played a very important match. They were playing in a part of the World Cup called the 'Super Eights.' This is like a special second round where only the best teams get to play.\n\nBoth teams really wanted to win this game. A win meant they would get closer to playing in the final matches. The players trained very hard for this moment.\n\n<h3>How England Won the Game</h3>\nEngland played super well! They won against New Zealand. They won by \"four wickets.\" What does that mean? Well, in cricket, a team tries to get the other team's players \"out.\" When a player is \"out,\" it's called a wicket.\n\nEngland scored more points than New Zealand. They did this without losing too many of their own players. It was a great team effort! Each player helped the team score points and stop the other team.\n\nDid you know? There are 11 players on each cricket team. They all work together like a big family!\n\n<h3>England Gets \"Top Spot\"</h3>\nBecause England won this game, they got the \"top spot\" in their group. Imagine you are running a race with your friends. If you come in first place, you get the top spot! That's exactly what England did.\n\nGetting the top spot means they are doing very well in the competition. It means they have a good chance to go forward in the World Cup. Everyone on the England team was very happy!\n\n<h3>A Special Surprise for Pakistan!</h3>\nNow, here is the really interesting part! Sometimes in big sports games, when one team wins, it also helps *another* team. This happened in our story! When England won against New Zealand, it also helped another team called Pakistan.\n\nImagine your friend is playing a game, and if they win, it means you also get a chance to play in the next round. That's what happened for Pakistan! England's win kept Pakistan's \"hopes alive.\"\n\nThis means Pakistan still has a chance to move forward in the T20 World Cup. Before this match, Pakistan was a bit worried. But thanks to England's win, they can still dream of winning the World Cup!\n\nDid you know? Cricket bats are often made from a special type of wood. They are very strong and help players hit the ball far!\n\n<h3>Why This Is Important</h3>\nThis exciting news shows us a few things. First, sports are full of surprises! You never know what will happen. Second, it shows how teams work hard and try their best. England played wonderfully.\n\nThird, it shows how different teams can be connected, even if they are not playing each other directly. England's victory was good news for them, and it was also good news for Pakistan.\n\nThis is why we love sports! It brings people together and creates so much excitement. Whether you are playing or just watching, it's always fun to see teams try their best.\n\n<h3>What Happens Next?</h3>\nThe T20 World Cup will continue with more exciting matches. Teams like England and hopefully Pakistan will keep playing to see who will be the ultimate champion. Everyone is cheering for their favourite teams!\n\nSo, my dear friends, remember to play fair, work together, and always try your best, just like the amazing cricket players in the T20 World Cup! Isn't that super cool? I'll be back with more exciting news soon!",
    "summary": "England won a big cricket game against New Zealand, which helped them get to the top of their group and also gave another team, Pakistan, a chance to keep playing in the T20 World Cup!",
    "whyMatters": "This matters because it shows how exciting big sports games are, how teams play their best, and how one team's win can help another team too, making the T20 World Cup even more thrilling for everyone!",
    "category": "world",
    "date": "2026-02-27T17:32:15.406Z",
    "image": "https://image.pollinations.ai/prompt/Exciting%20Cricket%20News!%20England%20Wins%20Big%20and%20Helps%20a%20Friend!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "exciting-cricket-news-england-wins-big-and-helps-a-friend",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/27/england-keep-pakistan-t20-world-cup-hopes-will-by-beating-new-zealand?traffic_source=rss"
  },
  {
    "originalTitle": "Iran says US must drop ‘excessive demands’ in nuclear negotiations",
    "title": "Iran says US must drop ‘excessive demands’ in nuclear negotiations",
    "content": "Iranian foreign minister emphasizes seriousness and realism as key to successful negotiations with the United States.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T17:32:20.694Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20says%20US%20must%20drop%20%E2%80%98excessive%20demands%E2%80%99%20in%20nuclear%20negotiations%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-says-us-must-drop-excessive-demands-in-nuclear-negotiations",
    "originalLink": "https://www.aljazeera.com/news/2026/2/27/iran-says-us-must-drop-excessive-demands-in-nuclear-negotiations?traffic_source=rss"
  },
  {
    "originalTitle": "‘Like it’s 2024 again’: Trump takes centre stage in 2026 midterm elections",
    "title": "‘Like it’s 2024 again’: Trump takes centre stage in 2026 midterm elections",
    "content": "With control of Congress in the balance, officials say the president plans to campaign as if he were 'on the ballot'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-27T17:32:25.907Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Like%20it%E2%80%99s%202024%20again%E2%80%99%3A%20Trump%20takes%20centre%20stage%20in%202026%20midterm%20elections%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "like-its-2024-again-trump-takes-centre-stage-in-2026-midterm-elections",
    "originalLink": "https://www.aljazeera.com/news/longform/2026/2/27/like-its-2024-again-trump-takes-centre-stage-in-2026-midterm-elections?traffic_source=rss"
  },
  {
    "originalTitle": "Tram derails in Milan, leaving one dead and dozens injured",
    "title": "Tram derails in Milan, leaving one dead and dozens injured",
    "content": "The crowded tram was travelling in the centre of Milan at rush hour when it appeared to crash into the side of a building.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-27T17:33:31.282Z",
    "image": "https://image.pollinations.ai/prompt/Tram%20derails%20in%20Milan%2C%20leaving%20one%20dead%20and%20dozens%20injured%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tram-derails-in-milan-leaving-one-dead-and-dozens-injured",
    "originalLink": "https://www.bbc.com/news/articles/c5y599degnqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "title": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "content": "The latest attacks by Pakistan follow months of clashes between the two countries. despite agreeing to a fragile ceasefire in October.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T17:33:36.493Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20defence%20minister%20says%20country%20in%20'open%20war'%20with%20Afghanistan%20after%20strikes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-defence-minister-says-country-in-open-war-with-afghanistan-after-strikes",
    "originalLink": "https://www.bbc.com/news/articles/cvgjd7pv4y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "title": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "content": "Bombings by Pakistan are the most significant development in tensions between the two neighbours - though the physical impact remains unclear.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T17:33:41.677Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20after%20latest%20escalation%20in%20Pakistan-Afghanistan%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-after-latest-escalation-in-pakistan-afghanistan-tensions",
    "originalLink": "https://www.bbc.com/news/articles/cj32zx48xvxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chelsea to face holders PSG in Champions League last 16",
    "title": "Chelsea to face holders PSG in Champions League last 16",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League last 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-27T17:33:47.345Z",
    "image": "https://image.pollinations.ai/prompt/Chelsea%20to%20face%20holders%20PSG%20in%20Champions%20League%20last%2016%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chelsea-to-face-holders-psg-in-champions-league-last-16",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T17:33:52.551Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20needs%20to%20stay%20'fully%20focused'%20after%20Arsenal%20talk%20-%20Howe%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How do Man City's Muslim players adapt to Ramadan and what help do they get?",
    "title": "How do Man City's Muslim players adapt to Ramadan and what help do they get?",
    "content": "Muslims around the world are currently observing the Islamic holy month of Ramadan, including professional footballers, so how do Manchester City help their players?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T17:33:57.730Z",
    "image": "https://image.pollinations.ai/prompt/How%20do%20Man%20City's%20Muslim%20players%20adapt%20to%20Ramadan%20and%20what%20help%20do%20they%20get%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-do-man-citys-muslim-players-adapt-to-ramadan-and-what-help-do-they-get",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20lzy1n59lo?at_medium=RSS&at_campaign=rss"
  }
]