[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Money Flowers in Kenya: A Special Gift to Be Careful With!",
    "content": "<h3>Jambo, Friends! Let's Talk About Gifts!</h3>\nJambo, everyone! That means 'Hello' in Swahili, a wonderful language spoken in Kenya and other parts of Africa! I'm your friendly news reporter, and I have a super interesting story from Kenya today. It's all about gifts and showing love.\n\nDo you know what Valentine's Day is? It's a special day when people give gifts to show how much they care for someone. Maybe it's for their mom, dad, grandma, or a very good friend. People often give pretty flowers, yummy chocolates, or sweet cards.\n\nBut guess what? In Kenya, some people started giving a very new and exciting kind of gift. It's called a 'money flower' bouquet! Can you imagine that? Instead of real flowers, it's money shaped like flowers! Let's find out more about this cool new trend.\n\n<h3>What Are Money Flowers?</h3>\nImagine a big, beautiful bunch of flowers. We call that a bouquet. Now, imagine that instead of colourful petals, each flower is made from a crisp, clean banknote! Yes, real money, carefully folded and arranged to look like a stunning flower arrangement.\n\nPeople in Kenya started making these special bouquets. They look so fancy and unique! It's like getting two gifts in one: a beautiful display and real money you can use. People thought it was a very creative way to give a present.\n\nIt became very popular, especially for holidays like Valentine's Day or birthdays. It's a big surprise for the person who gets it! They get to admire the 'flowers' and then use the money to buy something they truly want or need.\n\nDid you know? Kenya is a beautiful country in East Africa, known for its amazing wildlife like lions, elephants, and giraffes! It also has a warm and friendly culture.\n\n<h3>Why Do People Love Money Flowers So Much?</h3>\nWell, there are a few reasons why money flowers became a big hit. First, they are very exciting and different. Nobody expects to get a bunch of money shaped like flowers!\n\nSecond, the person who gets the gift can choose exactly what they want to buy. If you get a teddy bear, you have a teddy bear. But if you get money, you can choose if you want a new book, a toy, or even help buy something important for your family.\n\nIt feels very generous to give a money flower bouquet. It shows that you care a lot and want to give a really special present. And let's be honest, getting money can be very helpful for many people.\n\nImagine someone saving up for something important. A money flower bouquet could help them reach their goal faster! It's a very practical gift that can also be very beautiful to look at.\n\nDid you know? In many parts of Africa, giving gifts is a way to show respect and build strong friendships!\n\n<h3>Money Is Important, So We Must Be Careful!</h3>\nNow, here's where the story gets a little bit serious, but don't worry, it's important to understand. Our grown-ups, especially those who work at the Central Bank (they are like the grown-ups who look after all our country's money), have something important to say.\n\nThey want to make sure all the money we use is real and safe. They work hard to print new money that is clean and has special marks so everyone knows it's truly real money. Sometimes, money can get dirty. Think about how many hands a coin or a note passes through every day!\n\nThey also want to make sure that everyone is safe. Carrying around a lot of money, even if it's in a pretty bouquet, might not always be the safest thing to do. It's good to be careful with valuable things.\n\nDid you know? It's always a good idea to wash your hands with soap and water after you touch money. This helps keep away any tiny germs!\n\n<h3>The Warnings: What Grown-ups Are Saying</h3>\nSo, because of these important reasons, the grown-ups at the Central Bank in Kenya gave some warnings about money flowers. They want everyone to be smart and safe.\n\nFirst, they worry about 'dirty money.' Money passes through many hands, right? So it can get a little bit dirty or even have germs. When you fold it up into a flower and give it as a gift, it's not always the cleanest way to give money.\n\nSecond, and this is super important, they worry about 'fake money.' Fake money is not real. It's like a trick! Someone might try to print money that looks real, but it's not. You cannot buy anything with fake money. The Central Bank wants to make sure people only use real, genuine money.\n\nWhen people make money flowers, sometimes they might use money that is not real without knowing it. Or, if you're showing off a big bouquet of money, some bad people might see it and try to take it. The Central Bank wants everyone to be safe and protected.\n\nDid you know? Real money often has special little pictures or textures that you can feel with your fingers to show it's real and not fake!\n\n<h3>What Can We Do Instead?</h3>\nIt's important to remember that giving a gift is all about showing love and care. It doesn't always have to be about money. There are so many wonderful ways to show someone you care!\n\nYou can still give a beautiful bouquet of real flowers! They smell wonderful and look so pretty. Or how about a box of delicious chocolates? Yummy!\n\nA handmade card is always special. When you draw a picture or write a sweet message, it shows you took time and put your heart into the gift. That's one of the best kinds of gifts!\n\nOr, you could spend special time with the person. Play a game together, read a book, or help them with something. Sometimes, just being there for someone is the best present of all.\n\nDid you know? Red roses are a classic flower for Valentine's Day and they mean love! But there are many beautiful African flowers too, like the stunning Strelitzia, also known as the 'bird of paradise' flower!\n\n<h3>Remember What Matters Most!</h3>\nSo, in Kenya and all over Africa, we love to show kindness and make our friends and family feel special. It's really about the feeling you put into the gift, not how much money it costs.\n\nWhether it's a real flower, a yummy treat, a heartfelt drawing, or just a big, warm hug, showing someone you care is the most important thing. The Central Bank wants everyone to be happy and safe while celebrating special days.\n\nSo, let's keep celebrating love and friendship in ways that are safe, real, and full of kindness. Thank you for listening to my news report from Africa! Keep smiling and keep being kind!\n\nDid you know? The most important gift you can give is your love and kindness to others!\n",
    "summary": "In Kenya, 'money flowers' – bouquets made of folded banknotes – became popular gifts, but grown-ups issued warnings about hygiene, fake money, and safety, encouraging people to be careful and choose other thoughtful ways to show love.",
    "whyMatters": "This matters because it teaches us to be smart and safe with money, to understand that real gifts come from the heart, and that it's important to listen to grown-ups who help keep us and our money safe.",
    "category": "world",
    "date": "2026-02-14T04:06:20.913Z",
    "image": "https://image.pollinations.ai/prompt/Money%20Flowers%20in%20Kenya%3A%20A%20Special%20Gift%20to%20Be%20Careful%20With!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "money-flowers-in-kenya-a-special-gift-to-be-careful-with",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:06:26.021Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "South Africa to deploy troops to tackle crime gangs",
    "content": "President Cyril Ramaphosa says the army will work with the police to fight organised crime and illegal mining.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T04:06:31.135Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20to%20deploy%20troops%20to%20tackle%20crime%20gangs%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-to-deploy-troops-to-tackle-crime-gangs",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arundhati Roy ‘shocked’ by jury’s Gaza remarks, quits Berlin film festival",
    "title": "Arundhati Roy ‘shocked’ by jury’s Gaza remarks, quits Berlin film festival",
    "content": "Jury chair Wim Wenders said filmmakers 'have to stay out of politics' when asked about German support for Israel's war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:06:36.360Z",
    "image": "https://image.pollinations.ai/prompt/Arundhati%20Roy%20%E2%80%98shocked%E2%80%99%20by%20jury%E2%80%99s%20Gaza%20remarks%2C%20quits%20Berlin%20film%20festival%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arundhati-roy-shocked-by-jurys-gaza-remarks-quits-berlin-film-festival",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/arundhati-roy-shocked-by-jurys-gaza-remarks-quits-berlin-film-festival?traffic_source=rss"
  },
  {
    "originalTitle": "Fire at Havana oil refinery as Cuba’s fuel crisis deepens",
    "title": "Fire at Havana oil refinery as Cuba’s fuel crisis deepens",
    "content": "A fire at a key fuel refinery in the capital comes amid Cuba's mounting fuel emergency due to US-imposed restrictions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:06:41.481Z",
    "image": "https://image.pollinations.ai/prompt/Fire%20at%20Havana%20oil%20refinery%20as%20Cuba%E2%80%99s%20fuel%20crisis%20deepens%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fire-at-havana-oil-refinery-as-cubas-fuel-crisis-deepens",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/fire-at-havana-oil-refinery-as-cubas-fuel-crisis-deepens?traffic_source=rss"
  },
  {
    "originalTitle": "Peru to debate removal of President Jose Jeri four months into his term",
    "title": "Big News from Far Away: All About Being Fair!",
    "content": "<h3>Hello from your Africa News Friend!</h3>\nHello, amazing friends! It's your kid-friendly news reporter from Africa here. Today, we're going on a special trip. We're going to fly far, far away to learn about something happening in a country called Peru. Peru is a country with big mountains and a long coast, far from our beautiful continent!\n\nDid you know? Africa is a very big continent with many, many countries! Peru is on another continent called South America. It's very far from us!\n\n<h3>What is a President?</h3>\nEvery country needs a leader. We call this leader a \"President.\" Think of your school principal. The principal is the leader of your school, right? They help make sure everything runs smoothly and fairly for all the students.\n\nA President is like the principal for a whole country! They help make big decisions for everyone. They help make sure people are safe and happy. It's a very, very important job.\n\nDid you know? Most countries around the world have a leader. Sometimes they are called a President, sometimes a Prime Minister, or even a King or Queen! They all have big jobs to help their people.\n\n<h3>Meet President Jeri</h3>\nIn the country of Peru, there is a man named Jose Jeri. He is the President there right now. He just started his important job not too long ago. Just about four months ago, people chose him to be their leader. His \"term\" is how long he is supposed to be president.\n\nBeing a President is a big responsibility. You have to work hard for all the people in your country. You must be fair and honest with everyone. It's a job where trust is very important.\n\n<h3>What is Happening in Peru?</h3>\nNow, here's the news part. Something important is happening with President Jeri. People in Peru are talking a lot about him. They are going to have a big \"debate.\"\n\nA debate is like when people have a very important discussion. They talk about what is right and what is wrong. They try to decide what to do next. It's like when your family discusses what game to play, but much, much bigger!\n\nPeople in Peru are debating if President Jeri should stay in his job. They are asking if he should be \"removed.\" Removing means taking him out of his important job early. This is a very serious discussion for the country and its future.\n\nDid you know? In many countries, people can talk freely about their leaders. This is called freedom of speech! It means people can share their ideas and feelings.\n\n<h3>What are \"Allegations\"?</h3>\nWhy are people having this big talk about President Jeri? Well, some people are saying he did some things that are not good. These are called \"allegations.\" An allegation is when someone says, \"I think this person did something wrong.\"\n\nIt's like if your friend says, \"I think someone took my crayons!\" That's an allegation. It doesn't mean it's true yet. It means people need to check and find out the truth very carefully. It's important to listen to both sides of a story.\n\nSo, people are saying that President Jeri might have done some wrong things. They need to find out if these claims are true or not before making any big decisions.\n\n<h3>What is \"Bribery\"?</h3>\nOne of the allegations against President Jeri is \"bribery.\" That's a big word, but it means something very simple and very unfair. Imagine someone giving you a lot of sweets or a special toy. And they say, \"If I give you these, will you let me go first in the queue, even if it's not my turn?\"\n\nThat's like bribery! It's when someone gives money or a gift to someone important. They give it so that the important person will do something special for them. Maybe they will give them a special favour or make a rule just for them. This is not fair because it means people don't get treated equally.\n\nBribery makes things unfair for everyone else. Good leaders should never take bribes. They should always be fair to all people, no matter what.\n\nDid you know? Bribery is against the law in most countries. It helps keep things fair and honest for everyone!\n\n<h3>What is \"Influence-Peddling\"?</h3>\nThere is another allegation too. It's called \"influence-peddling.\" This means using your important job to help your friends or family get special things. It's like if your school principal only gave the best new books to their own children or their friends' children. That would not be fair to the other children in the school, would it?\n\nAn important leader should help everyone in the country. They should not use their power for their own family or friends only. That is not being fair. Influence-peddling means using your special power to get special favors for yourself or people you know, instead of doing what's best for everyone.\n\nGood leaders always think about what is best for all the people. They do not think about only themselves or their friends. They lead with kindness and fairness for every citizen.\n\n<h3>Why is This Important?</h3>\nYou might be thinking, \"Why does this matter to me, all the way in Africa?\" Well, it matters a lot! Leaders are chosen to make things good for everyone in their country. They need to be honest and fair in every decision they make.\n\nIf a leader is not honest, it can hurt the whole country. People might not trust the leader anymore. It's like if your teacher wasn't fair; you might feel sad, upset, or not want to listen to them. Trust is very important.\n\nIt is very important for leaders to be good examples. They need to show everyone how to be honest and kind. This helps build a happy and strong country where everyone feels safe and respected. Fairness builds good communities.\n\n<h3>What Happens Next?</h3>\nSo, what will happen now in Peru? People will talk more about these allegations. They will try to find out the truth with open hearts and minds. They will decide if President Jeri should stay in his important job or not.\n\nPresident Jeri has said he will not try to be president again next time. He will not \"run for re-election.\" This means he won't ask people to vote for him again for another term. But the important question now is if he should even finish his current time as president, or if he should be removed sooner.\n\nThe people of Peru will watch and wait. They hope for a fair decision that is good for their country. The truth must come out.\n\nDid you know? It's important to ask questions and learn about what's happening in the world. This helps you understand how things work and how to be a good citizen!\n\n<h3>Learning About Fairness</h3>\nThis story from Peru reminds us about how important it is to be fair. Whether you are a President, a teacher, a big brother or sister, or just a friend, being fair is a wonderful thing. It makes everyone feel good and helps us live together happily. It's a lesson we can all learn.\n\nThank you for listening to this important news from far away! Stay curious, my friends, and always try to be fair in everything you do! Our world needs kind and fair people like you!",
    "summary": "People in Peru are having a big discussion about their President, Jose Jeri, because some are saying he did bad things like taking bribes and using his power unfairly, and they need to decide if he should keep his job.",
    "whyMatters": "It matters because leaders need to be honest and fair to everyone in their country, so when people say a leader is not being fair, it's very important to find out the truth to keep the country strong and happy.",
    "category": "world",
    "date": "2026-02-14T04:07:05.554Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Far%20Away%3A%20All%20About%20Being%20Fair!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-far-away-all-about-being-fair",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/peru-to-debate-removal-of-president-jose-jeri-four-months-into-his-term?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:07:11.183Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T04:07:16.305Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six possible effects of Trump's climate policy change ",
    "title": "Six possible effects of Trump's climate policy change ",
    "content": "The announcement on Thursday removes the legal bedrock for much of US environmental legislation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:07:21.419Z",
    "image": "https://image.pollinations.ai/prompt/Six%20possible%20effects%20of%20Trump's%20climate%20policy%20change%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-possible-effects-of-trumps-climate-policy-change",
    "originalLink": "https://www.bbc.com/news/articles/cd03ee39945o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:07:26.669Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "title": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "content": "After Igor Tudor agrees to take charge of Tottenham for the remainder of the season, BBC Sport takes a look at what supporters can expect to see from his side.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-14T04:07:31.774Z",
    "image": "https://image.pollinations.ai/prompt/'Intense%2C%20aggressive%2C%20entertaining'%20-%20what%20will%20Tudor%20bring%20to%20Spurs%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "intense-aggressive-entertaining-what-will-tudor-bring-to-spurs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13nkvd2eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Marvellous' Man City set WSL standard in rampant win",
    "title": "'Marvellous' Man City set WSL standard in rampant win",
    "content": "'Marvellous' Manchester City set WSL standard in rampant 6-0 win over bottom side Leicester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T04:07:36.874Z",
    "image": "https://image.pollinations.ai/prompt/'Marvellous'%20Man%20City%20set%20WSL%20standard%20in%20rampant%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "marvellous-man-city-set-wsl-standard-in-rampant-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxwjjqrxeo?at_medium=RSS&at_campaign=rss"
  }
]