[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "The Big Friendship Fish Festival in Nigeria!",
    "content": "Hello, amazing friends! It's your kid-friendly reporter from Africa, here with some super exciting news! Have you ever been to a big party? Well, imagine a party that lasts for days, full of fun, laughter, and lots of fish! We are flying all the way to a beautiful country called Nigeria to tell you about a very special event.\n\nIt's called the Friendship Fish Festival! Isn't that a wonderful name? This festival is not just about catching fish; it's about catching smiles and making friends too! Get ready to dive into this amazing story with me!\n\n<h3>What is the Friendship Fish Festival?</h3>\nSo, what exactly is this amazing festival? It's a huge competition where people gather from many different towns and villages. They all come together near a big, wide river. This river is super important to everyone living nearby. The main event is a big fishing contest! Imagine hundreds of people, all trying to catch the biggest and best fish.\n\nIt's a very old tradition, meaning people have been doing it for a very, very long time. Grandparents tell their grandchildren stories about it! It's one of the most colourful and exciting events in Nigeria. People prepare for days, getting ready for the big catch and the big celebration.\n\nDid you know? Nigeria is a very big country in Africa! It has many different people and languages, just like different kinds of fish in the river!\n\n<h3>Why is it Special? Friendship is the Key!</h3>\nNow, this festival is not just for fun; it has a very important secret mission! What is it? It's all about making sure everyone lives in peace. Sometimes, people in different villages might have small disagreements or little arguments. But when it's time for the Friendship Fish Festival, all those little worries melt away.\n\nEveryone comes together as friends. They share food, they dance, and they laugh together. When people play and work together, they remember that they are all one big family. This helps them stay friends and be kind to each other long after the festival is over. It helps to 'cement local peace,' which means making sure peace stays strong and firm, like super glue!\n\nDid you know? Peace means everyone is happy and safe, without fighting or worries. It's like having sunny weather in your heart, always bright and warm!\n\n<h3>How Do They Catch the Fish?</h3>\nYou might be wondering, how do they catch all these fish? Do they use big fishing rods like you see sometimes? No, not really! At this festival, people use very traditional ways to fish. Many use special, big, hand-woven nets. These nets are sometimes so big that many people need to work together to throw them into the water.\n\nOther people might even jump into the river with big baskets, trying to catch fish with their hands! It takes a lot of skill and patience. The river is full of many types of fish, some small and some super big! Everyone tries their best to find the 'catch of the day', the most amazing fish of all.\n\nDid you know? Fish can breathe underwater because they have special parts called gills! Gills help them take oxygen from the water, just like our lungs help us take oxygen from the air! Isn't nature amazing?\n\n<h3>The Excitement of the Big Day!</h3>\nWhen the main fishing contest day arrives, the air is filled with excitement! The sun rises bright and early. People wake up before the birds! They put on their most colourful clothes, bright yellows, blues, and reds. Drums start beating a lively rhythm, and people sing happy songs. You can hear cheers and laughter all around.\n\nEveryone gathers by the riverbank, their eyes sparkling with hope. When the signal is given – maybe a special drumbeat or a loud shout – all the fishermen and fisherwomen rush into the water! Splash! Splash! Splash! The water fills with energy. Everyone is hoping to catch the biggest fish. It's like a big race, but everyone is also helping each other a little bit, sharing tips and smiles.\n\nDid you know? Festivals are special times when people celebrate something important! They often include music, dancing, special food, and games. It's a time for everyone to feel joyful!\n\n<h3>Who Catches the Biggest Fish?</h3>\nAs the day goes on, people start bringing their catches to the shore. There are shouts of joy when someone pulls out a really big fish! Imagine seeing a fish almost as big as you! All the fish are measured and weighed very carefully. Judges, who are often wise old people from the villages, watch everything.\n\nThe person who catches the biggest fish gets a special prize! It might be a beautiful handmade item or a special honour for their village. But even if you don't catch the biggest fish, everyone feels like a winner. Why? Because they all had so much fun and spent the day together as friends. The prize is not just about the fish; it's about the happiness and sharing that everyone feels!\n\nDid you know? Many rivers in Africa, like the mighty River Niger in Nigeria, are super important! They provide water for drinking, farming, and homes for amazing animals and fish!\n\n<h3>More Than Just Fish!</h3>\nThe Friendship Fish Festival is truly more than just a fishing contest. After the fishing is done, the party continues! There is beautiful music played on traditional instruments like drums and flutes. People dance with so much energy, their colourful clothes swirling around. Everyone shares delicious food, cooked with fresh ingredients from their farms and, of course, some of the fish from the river!\n\nStories are told under the starry night sky. Children play games, running and laughing, making new friends. It's a time for everyone to feel proud of their community and happy to be together. It's a time to remember what it means to be a good neighbor and a good friend. It's a feast for the eyes, ears, and tummy!\n\nDid you know? Storytelling is a very old and special way that people share history, lessons, and fun adventures with each other, especially in Africa! It's like watching a movie in your mind!\n\n<h3>Lessons from the Festival</h3>\nSo, what does this amazing festival teach us? It teaches us that even simple things, like catching fish, can bring people together in a big, important way. It shows us that having fun together helps us forget our differences and become closer. It helps us build strong bridges of friendship instead of walls.\n\nThe Friendship Fish Festival reminds everyone, young and old, that living in peace and harmony is the best way to live. When everyone helps each other and respects each other, the whole community becomes stronger and happier. And that's a truly wonderful thing for everyone to learn and remember, every single day!\n\nWhat a wonderful adventure to Nigeria! The Friendship Fish Festival sounds like such a joyful and meaningful event. It's a reminder that peace and friendship are treasures, just like the biggest fish in the river! Keep sharing smiles and being kind, my friends, and remember the spirit of the Friendship Fish Festival! This is your kid-friendly reporter signing off from Africa. See you next time for more amazing stories!",
    "summary": "The Friendship Fish Festival in Nigeria is a big, colourful fishing contest where people from many villages come together to catch fish, celebrate, and build strong friendships to keep peace in their communities.",
    "whyMatters": "This festival is important because it teaches everyone, especially kids, that having fun together and being kind helps people stay friends and live in peace, making their communities happy and strong.",
    "category": "world",
    "date": "2026-02-22T05:48:02.748Z",
    "image": "https://image.pollinations.ai/prompt/The%20Big%20Friendship%20Fish%20Festival%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-big-friendship-fish-festival-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rules Are for Everyone! News from Cameroon!",
    "content": "Hello, amazing friends all across Africa! It's your friendly news reporter, here to share a very important story from a beautiful country called Cameroon. Imagine a big, colourful map of Africa – Cameroon is right there, full of sunshine and wonderful people!\n\nSometimes, grown-ups have big jobs. Like soldiers! Soldiers usually help keep everyone safe and protect their country. But just like you have rules at school and home, grown-ups with big jobs have rules too. Today, we're talking about how important it is for *everyone* to follow these rules.\n\n<h3>What Happened in Cameroon?</h3>\n\nIn a special part of Cameroon, where some grown-ups were having big disagreements, something sad happened. Some soldiers, who are supposed to protect people, did a very wrong thing. They hurt some grown-ups who were not fighting or causing trouble.\n\nThis was a very sad event because soldiers have a big job to protect people, not to hurt them. When someone breaks such an important rule, it makes many people sad and worried.\n\nDid you know? Cameroon is a country in Central Africa with many different languages and beautiful places, from sunny beaches to green mountains!\n\n<h3>Who Are Soldiers and Their Rules?</h3>\n\nThink about the grown-ups who help us every day, like teachers, doctors, or police officers. Soldiers are like that too; they have a job to help their country. They wear special uniforms and learn how to be very brave.\n\nBut being brave also means being good and following very strict rules. These rules are there to make sure everyone is treated fairly and safely. It's like how you have rules in your classroom to make sure everyone can learn and play nicely together.\n\nIf a soldier does not follow the rules, especially rules about not hurting people who are peaceful, then it is a very big problem. It's a problem because it means they are not doing their job the right way.\n\n<h3>Why Are Rules So Important?</h3>\n\nRules are like invisible helpers that keep everything fair and safe! Imagine if there were no rules for playing games; it would be very messy and maybe even hurtful. Rules help us know what is right and what is wrong.\n\nIn every country, there are big rules called 'laws'. These laws are for everyone – for you, for your parents, and even for people with very important jobs like soldiers. Laws help everyone live together in peace and feel safe.\n\nDid you know? Laws are made by wise grown-ups in special buildings to help everyone in the country live a happy and safe life!\n\n<h3>What Does 'Justice' Mean?</h3>\n\nNow, here's the important part of our story from Cameroon. When these soldiers broke the rules and hurt innocent grown-ups, other wise grown-ups called judges had to step in. Their job is to make sure that rules are followed and that things are fair.\n\nThis is called 'justice'. Justice means making things right when something wrong has happened. It means that people who break big rules have to take responsibility for their actions. In this case, the soldiers who did the wrong thing were given a special kind of 'time-out'.\n\nThis 'time-out' is called a 'jail term'. It means they have to go to a special place for grown-ups for a period of time to think about what they did. This doesn't happen very often for soldiers, which is why this news is so important.\n\nDid you know? 'Justice' is like making sure that if someone takes your toy without asking, they give it back and say sorry, so things can be fair again!\n\n<h3>Everyone Must Follow the Rules</h3>\n\nThis story from Cameroon shows us something very important: no one is above the rules. Not even soldiers with big jobs. If someone does something wrong, especially something that hurts others, they need to be held responsible. This helps everyone trust that the rules are there to protect them.\n\nWhen justice happens, it helps people feel safer and know that good grown-ups are working hard to make sure everyone is treated fairly. It's a way of saying, 'We care about everyone, and we want peace for all.'\n\n<h3>Let's All Work for Peace!</h3>\n\nThis news reminds us that being kind and following rules are important for everyone, everywhere. Even when grown-ups have disagreements, it's always best to talk things out and be peaceful.\n\nWe can all help make our communities and our beautiful continent of Africa a better place by being kind, listening to each other, and following the rules. Every small act of kindness helps build a big, strong peace!\n\nThank you for listening, my wonderful friends! Stay safe, be kind, and remember to always follow the rules! Until next time!",
    "category": "technology",
    "date": "2026-02-22T05:48:21.061Z",
    "image": "https://image.pollinations.ai/prompt/Rules%20Are%20for%20Everyone!%20News%20from%20Cameroon!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rules-are-for-everyone-news-from-cameroon",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:26.166Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Eight bodies found in Libya, Greece as the toll in the Mediterranean rises",
    "title": "Eight bodies found in Libya, Greece as the toll in the Mediterranean rises",
    "content": "Bodies of five asylum seekers wash ashore in Libya as three others die in a separate incident off the coast of Greece.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:31.430Z",
    "image": "https://image.pollinations.ai/prompt/Eight%20bodies%20found%20in%20Libya%2C%20Greece%20as%20the%20toll%20in%20the%20Mediterranean%20rises%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eight-bodies-found-in-libya-greece-as-the-toll-in-the-mediterranean-rises",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/eight-bodies-found-in-libya-and-greece-as-mediterranean-crossings-continue?traffic_source=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,459",
    "title": "Russia-Ukraine war: List of key events, day 1,459",
    "content": "These are the key developments from day 1,459 of Russia’s war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:36.538Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C459%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1459",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/russia-ukraine-war-list-of-key-events-day-1459?traffic_source=rss"
  },
  {
    "originalTitle": "Trump to raise US global tariff from 10 to 15% after Supreme Court ruling",
    "title": "Trump to raise US global tariff from 10 to 15% after Supreme Court ruling",
    "content": "Move comes as businesses seek repayment for the estimated $133bn the Trump administration has already collected.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:41.645Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20to%20raise%20US%20global%20tariff%20from%2010%20to%2015%25%20after%20Supreme%20Court%20ruling%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-to-raise-us-global-tariff-from-10-to-15percent-after-supreme-court-ruling",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/trump-to-raise-us-global-tariff-from-ten-to-fifteen-percent-after-supreme-court-ruling?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:47.023Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "title": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "content": "The announcement by the head of Venezuela's National Assembly comes amid US pressure following the capture of ex-President Nicolás Maduro.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:48:52.141Z",
    "image": "https://image.pollinations.ai/prompt/More%20than%201%2C500%20Venezuelan%20political%20prisoners%20apply%20for%20amnesty%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-than-1500-venezuelan-political-prisoners-apply-for-amnesty",
    "originalLink": "https://www.bbc.com/news/articles/c93w9g2dvn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "title": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "content": "Far-left militants are suspected of being behind Quentin Deranque's death and the party of Jean-Luc Mélenchon is being widely condemned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-22T05:48:57.253Z",
    "image": "https://image.pollinations.ai/prompt/Killing%20of%20nationalist%20student%20leaves%20French%20far%20left%20in%20deep%20trouble%20as%20elections%20loom%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killing-of-nationalist-student-leaves-french-far-left-in-deep-trouble-as-elections-loom",
    "originalLink": "https://www.bbc.com/news/articles/cnv61zv534eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "O'Reilly scores twice as Man City beat Newcastle",
    "title": "O'Reilly scores twice as Man City beat Newcastle",
    "content": "Manchester City move to within two points of Premier League leaders Arsenal with a tense victory against Newcastle United at Etihad Stadium.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:49:16.281Z",
    "image": "https://image.pollinations.ai/prompt/O'Reilly%20scores%20twice%20as%20Man%20City%20beat%20Newcastle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oreilly-scores-twice-as-man-city-beat-newcastle",
    "originalLink": "https://www.bbc.com/sport/football/videos/cre09v8yglqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "title": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "content": "Chelsea make it 17 points dropped from winning positions in the Premier League this season as Zian Flemming's 93rd-minute header gives Burnley a 1-1 draw, after Wesley Fofana is sent off at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T05:49:21.392Z",
    "image": "https://image.pollinations.ai/prompt/Ten-man%20Chelsea%20drop%20points%20again%20as%20Burnley%20score%20stoppage-time%20equaliser%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ten-man-chelsea-drop-points-again-as-burnley-score-stoppage-time-equaliser",
    "originalLink": "https://www.bbc.com/sport/football/videos/cedz2v0edpgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late Abraham goal rescues point for Villa against Leeds",
    "title": "Late Abraham goal rescues point for Villa against Leeds",
    "content": "Tammy Abraham comes off the bench to score an 88th minute equaliser to cancel out Anton Stach's spectacular freekick, as Aston Villa rescue a 1-1 draw against Leeds United at Villa Park in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T05:49:26.494Z",
    "image": "https://image.pollinations.ai/prompt/Late%20Abraham%20goal%20rescues%20point%20for%20Villa%20against%20Leeds%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-abraham-goal-rescues-point-for-villa-against-leeds",
    "originalLink": "https://www.bbc.com/sport/football/videos/cy8gn54mr0jo?at_medium=RSS&at_campaign=rss"
  }
]