[
  {
    "originalTitle": "This woman fought back when jihadists killed her sons",
    "title": "This woman fought back when jihadists killed her sons",
    "content": "Yameogo Aminata says her four sons were slaughtered and her daughter is missing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T10:44:13.441Z",
    "image": "https://image.pollinations.ai/prompt/This%20woman%20fought%20back%20when%20jihadists%20killed%20her%20sons%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-woman-fought-back-when-jihadists-killed-her-sons",
    "originalLink": "https://www.bbc.com/news/articles/c5yk3d56dgwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghana declares Wednesday 'Fugu Day' to promote traditional outfit after online mockery",
    "title": "Ghana's Super Special Fugu Day!",
    "content": "<h3>Hello, Friends from Africa and Beyond!</h3>\nHi everyone! It's me, your kid-friendly news reporter, bringing you super exciting news from our amazing continent, Africa! Today, we are zooming into a wonderful country called Ghana. Ghana is a land full of sunshine, happy people, and incredible stories. It's a place where traditions are cherished, like colourful beads, tasty jollof rice, and lively music. You know, every country has special things that make it unique, right? Well, Ghana has something super special they are celebrating, and it's all about clothes! Yes, clothes! Let's find out more about this exciting news.\n\n<h3>What is a Fugu?</h3>\nImagine a comfy, colourful top that people wear in Ghana. That's a Fugu! It's a special kind of shirt, or sometimes a top and trousers set, worn by many people, especially in the northern parts of Ghana. The Fugu is not just any shirt. It is often made from strips of cotton cloth that are woven together. These strips are called \"smock\" fabric. They come in many bright colours like blue, red, green, and yellow, with cool patterns sewn onto them. Think of it like wearing a piece of art! The Fugu is super comfortable and perfect for the warm weather in Ghana. It shows how rich and beautiful Ghanaian culture is. When you see someone wearing a Fugu, you know they are celebrating their heritage and showing off their style!\n\nDid you know? The Fugu is also sometimes called a \"Smock\"! It’s often hand-woven, which means people use their hands to make the beautiful fabric on a special machine called a loom. This makes each Fugu unique and very special!\n\n<h3>Why is Wednesday \"Fugu Day\"?</h3>\nGuess what? The leaders in Ghana have made a super cool announcement! They said that every Wednesday will now be known as \"Fugu Day\"! Isn't that awesome? This means that on Wednesdays, everyone in Ghana is encouraged to wear their beautiful Fugu outfits. Why did they do this? It's like having a special uniform day at school, but for a whole country! The main reason is to show how proud Ghanaians are of their traditional clothes. They want everyone, especially young people like you, to know how special the Fugu is. By wearing it, they are celebrating their culture, their history, and their identity. It’s a way of saying, \"Look how amazing our traditions are!\" It helps to keep old customs alive and teaches new generations about their roots.\n\nDid you know? Wearing traditional clothes helps us remember where we come from and the stories of our ancestors! It’s like wearing a piece of history.\n\n<h3>A Friendly Chat on the Internet</h3>\nNow, you might be wondering, why did they suddenly decide to have a \"Fugu Day\"? Well, sometimes people talk about things online, on the internet. You know, like on your parent's phone or computer. Recently, people from Ghana and people from another lovely African country called Zambia were having a friendly chat online. They were talking about clothes and traditions. Sometimes, when people chat, they might tease each other a little bit in a fun way, like when friends joke around. Some people online were talking about the Fugu. So, the people of Ghana decided to take this friendly talk and turn it into something wonderful! They said, \"Hey, let's use this opportunity to show the whole world how much we love our Fugu!\" It was a way to make something positive and spread pride.\n\nDid you know? The internet is a huge network where people all over the world can share pictures and talk to each other! But it's always important to be kind and respectful online.\n\n<h3>Showing Pride in Our Clothes</h3>\nHaving a \"Fugu Day\" is a big deal because it helps everyone remember to be proud of their culture. Imagine if your school had a day where everyone wore clothes from their family's country! It would be so colourful and exciting, right? That's what Ghana is doing with the Fugu. It helps people appreciate their own unique style and history. When you wear traditional clothes, you're not just wearing fabric; you're wearing stories, memories, and the spirit of your ancestors. It connects you to your community and shows respect for your heritage. It teaches children that being different is wonderful and that our traditions make us special.\n\n<h3>More Fun Facts About Ghana!</h3>\nGhana is a truly amazing country in West Africa. Its capital city is called Accra, and it's a bustling, lively place! Ghana is also famous for its delicious cocoa beans, which are used to make chocolate. Yum! Imagine a whole country helping to make yummy chocolate for the world. They also have beautiful beaches and incredible wildlife. The people of Ghana are known for being very friendly and welcoming. So, if you ever visit Ghana, you'll be met with warm smiles and perhaps even see lots of people wearing their gorgeous Fugu outfits! It's a land of rich history and bright futures, and celebrating things like \"Fugu Day\" makes it even more vibrant.\n\nDid you know? Ghana was the first country in sub-Saharan Africa to gain independence from colonial rule in 1957! This was a very important moment for Africa.\n\n<h3>What Can We Learn?</h3>\nSo, what does this \"Fugu Day\" in Ghana teach us? It teaches us that it's super important to love and celebrate where we come from. Every one of us, no matter where we live in Africa or the world, has a special culture, special clothes, special foods, and special stories. We should always be proud of our traditions. Just like the Ghanaians are proud of their Fugu, you can be proud of your own family's unique customs and heritage. Share them with your friends, learn about them from your elders, and keep those beautiful traditions alive! Let's all celebrate the amazing diversity and richness of Africa, one beautiful Fugu at a time!",
    "summary": "Ghana has declared every Wednesday 'Fugu Day' to celebrate and promote their beautiful traditional Fugu clothes, encouraging everyone to wear them and be proud of their culture.",
    "whyMatters": "This is important because it helps people love and celebrate their own special clothes and traditions, making sure these wonderful parts of their history are never forgotten.",
    "category": "technology",
    "date": "2026-02-11T10:44:38.775Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Super%20Special%20Fugu%20Day!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-super-special-fugu-day",
    "originalLink": "https://www.bbc.com/news/articles/cgqg8xegxqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bid launched to extend Zimbabwe president's term in office",
    "title": "Bid launched to extend Zimbabwe president's term in office",
    "content": "President Mnangagwa's term in office is due to end in 2028 but a bill could open the way for him to extend that time.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T10:44:43.901Z",
    "image": "https://image.pollinations.ai/prompt/Bid%20launched%20to%20extend%20Zimbabwe%20president's%20term%20in%20office%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bid-launched-to-extend-zimbabwe-presidents-term-in-office",
    "originalLink": "https://www.bbc.com/news/articles/c15x3xl52qdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pezeshkian calls for unity as Iran marks 1979 Revolution anniversary",
    "title": "Pezeshkian calls for unity as Iran marks 1979 Revolution anniversary",
    "content": "Iran's president also says his country does not seek a nuclear weapon, and apologises for his government's shortcomings.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T10:44:49.163Z",
    "image": "https://image.pollinations.ai/prompt/Pezeshkian%20calls%20for%20unity%20as%20Iran%20marks%201979%20Revolution%20anniversary%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pezeshkian-calls-for-unity-as-iran-marks-1979-revolution-anniversary",
    "originalLink": "https://www.aljazeera.com/news/2026/2/11/pezeshkian-calls-for-unity-as-iran-marks-1979-revolution-anniversary?traffic_source=rss"
  },
  {
    "originalTitle": "Colombia’s Petro says he escaped assassination attempt",
    "title": "Good News! A President is Safe!",
    "content": "Hello, amazing kids of Africa! It's your friendly news reporter here, bringing you important news from far across the big blue ocean. Today, we have a story about a very important person called a President. He lives in a country far away called Colombia. We are so happy to tell you he is safe and sound!\n\n<h3>Meet President Petro!</h3>\nHis name is President Gustavo Petro. Imagine your school's head teacher, but for a whole country! That's what a President does. He is like the leader of all the people in Colombia. His job is to help make sure everyone in his country is safe and happy. He wants all the children in Colombia to go to school, play fun games, and live peaceful lives.\n\nDid you know? A President is chosen by the people to lead their country. They work very, very hard to make good decisions for everyone!\n\n<h3>A Scary Ride in the Sky</h3>\nOne sunny day, President Petro was flying high in the sky. He wasn't in a car, he was in a big helicopter! Helicopters are like super cool flying machines with giant spinning wings on top. They can fly straight up and down, and even hover like a bee. President Petro was using the helicopter to visit different towns and villages in his country, just like a leader goes to check on things.\n\nDid you know? Helicopters are super useful! They can land almost anywhere, even on top of buildings or in places where there are no roads. They help people in emergencies too!\n\n<h3>What Happened Next?</h3>\nWhile the helicopter was flying high above the ground, something a little bit scary happened. There were some people who do not like peace. They tried to do a very bad thing. They tried to shoot at the helicopter! Imagine how loud and scary that must have been for everyone on board.\n\nBut don't you worry! Our story has a happy ending. The helicopter was very strong and the pilot was very clever. No one on the helicopter got hurt at all! President Petro and his team were safe. It was a very dangerous moment, but they were brave.\n\n<h3>Why Would Someone Do This?</h3>\nIt's very sad when people try to hurt others. Sometimes, in the big world, people disagree with each other very strongly. Instead of talking about their problems or trying to find a happy way to live together, some people choose to do bad things. They might not like the plans the President has for his country. But it is always, always wrong to use violence or try to hurt anyone.\n\nDid you know? Talking about our problems and listening to each other is much better than fighting. It helps everyone understand each other and find solutions together. That's what true peace means!\n\n<h3>He is Safe and Sound!</h3>\nWe are so, so happy to tell you again that President Petro is perfectly safe! After the scary moment, he bravely continued with his important work. His security team, who are like super-protectors, made sure he was out of harm's way and completely safe. This is very good news for all the children and grown-ups in Colombia. They can be happy that their leader is well.\n\n<h3>About Beautiful Colombia</h3>\nColombia is a beautiful country far away in a place called South America. It has amazing rainforests with lots of animals, tall mountains, and sunny beaches! Many children there love to play soccer, just like many of you here in Africa! They have colourful birds, yummy fruits like mangoes and pineapples, and big, beautiful flowers. It's a place full of life and joy, and everyone there deserves to live in peace.\n\nDid you know? Colombia is famous for its delicious coffee! And it has more kinds of birds than almost any other country in the world!\n\n<h3>Working for Peace</h3>\nPresident Petro wants to bring peace to all of Colombia. He wants all the people, young and old, to live happily together, without any fear. It's a very big and important job, but he is working very hard every day to achieve it. Just like in our schools, where we all try to be good friends and help each other, that's what peace is all about on a bigger scale!\n\n<h3>A Message of Hope from Africa</h3>\nSo, remember, even when scary things happen in the world, there are always many good people working to make things better and safer for everyone. Let's all wish President Petro and the wonderful people of Colombia lots of peace and happiness. And let's all remember to be kind to each other every single day, here in Africa and everywhere around the world! Together, we can make the world a more peaceful place.",
    "summary": "Colombian President Gustavo Petro is safe after some bad people tried to hurt his helicopter, and he continues to work for peace in his country.",
    "whyMatters": "It matters because everyone, especially leaders who work for their country, should be safe, and we should always choose peace instead of trying to hurt others.",
    "category": "politics",
    "date": "2026-02-11T10:45:07.999Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20A%20President%20is%20Safe!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-a-president-is-safe",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/colombias-petro-says-he-escaped-assassination-attempt?traffic_source=rss"
  },
  {
    "originalTitle": "Iran’s president condemns ‘conspiracy from imperial powers’",
    "title": "Iran’s president condemns ‘conspiracy from imperial powers’",
    "content": "Iran’s President Masoud Pezeshkian spoke out against intervention by ‘alien Westerners’ during a rally.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-11T10:45:13.136Z",
    "image": "https://image.pollinations.ai/prompt/Iran%E2%80%99s%20president%20condemns%20%E2%80%98conspiracy%20from%20imperial%20powers%E2%80%99%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "irans-president-condemns-conspiracy-from-imperial-powers",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/irans-president-condemns-conspiracy-from-imperial?traffic_source=rss"
  },
  {
    "originalTitle": "Police release man detained in connection to Nancy Guthrie disappearance",
    "title": "Police release man detained in connection to Nancy Guthrie disappearance",
    "content": "Police had searched the home of the person, who was taken into custody at a traffic stop.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-11T10:45:18.876Z",
    "image": "https://image.pollinations.ai/prompt/Police%20release%20man%20detained%20in%20connection%20to%20Nancy%20Guthrie%20disappearance%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-release-man-detained-in-connection-to-nancy-guthrie-disappearance",
    "originalLink": "https://www.bbc.com/news/articles/cr5l4yy3ezmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US lawmakers tell BBC Andrew should testify over Epstein files",
    "title": "US lawmakers tell BBC Andrew should testify over Epstein files",
    "content": "It comes after the King said the Royal Family were \"ready to support\" police in their inquiries.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-11T10:45:23.992Z",
    "image": "https://image.pollinations.ai/prompt/US%20lawmakers%20tell%20BBC%20Andrew%20should%20testify%20over%20Epstein%20files%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-lawmakers-tell-bbc-andrew-should-testify-over-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cx2gmde0vjlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Netanyahu to meet Trump as Iran nuclear talks reach critical stage",
    "title": "Netanyahu to meet Trump as Iran nuclear talks reach critical stage",
    "content": "The Israeli prime minister is expected to press Trump to pursue a deal that would halt Iran's uranium enrichment.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-11T10:45:29.111Z",
    "image": "https://image.pollinations.ai/prompt/Netanyahu%20to%20meet%20Trump%20as%20Iran%20nuclear%20talks%20reach%20critical%20stage%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "netanyahu-to-meet-trump-as-iran-nuclear-talks-reach-critical-stage",
    "originalLink": "https://www.bbc.com/news/articles/c0k1j2j4607o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Frank sacked by Spurs after eight months in charge",
    "title": "Frank sacked by Spurs after eight months in charge",
    "content": "Tottenham sack Thomas Frank as head coach after a run of only two wins in 17 Premier League matches.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T10:45:34.493Z",
    "image": "https://image.pollinations.ai/prompt/Frank%20sacked%20by%20Spurs%20after%20eight%20months%20in%20charge%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "frank-sacked-by-spurs-after-eight-months-in-charge",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckgzqdzz1zdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "De Zerbi leaves Marseille by mutual consent",
    "title": "De Zerbi leaves Marseille by mutual consent",
    "content": "Roberto de Zerbi, who led Marseille to second in Ligue 1 last season, leaves following their Champions League exit and a 5-0 defeat by Paris St-Germain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-11T10:45:39.621Z",
    "image": "https://image.pollinations.ai/prompt/De%20Zerbi%20leaves%20Marseille%20by%20mutual%20consent%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "de-zerbi-leaves-marseille-by-mutual-consent",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgqejpj4d80o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How much pressure is Slot really under at Liverpool?",
    "title": "How much pressure is Slot really under at Liverpool?",
    "content": "Liverpool have won just once in the Premier League in 2026 - so will they stick with Arne Slot, who took them to the title last season?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T10:45:44.733Z",
    "image": "https://image.pollinations.ai/prompt/How%20much%20pressure%20is%20Slot%20really%20under%20at%20Liverpool%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-much-pressure-is-slot-really-under-at-liverpool",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgl5kd6y8gro?at_medium=RSS&at_campaign=rss"
  }
]