[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News from Far Away: Our Ghanaian Friends",
    "content": "<h3>Hello, Wonderful Friends!</h3>\n<p>Hello, hello, my amazing friends all across Africa! It’s me, your super-friendly news reporter, here to talk about something important. We live in a big, beautiful world, and sometimes things happen far away that we need to know about. Today, we have some news from a country right here in Africa called Ghana. It's a little sad, but it's important for us to understand.</p>\n<p>Did you know? Ghana is a lovely country on the west side of Africa! It has warm sunshine and very kind people. It is famous for its bright, colourful Kente cloth, yummy jollof rice, and amazing music!</p>\n\n<h3>What is a War?</h3>\n<p>Sometimes, in our big world, grown-ups from different countries have very, very big disagreements. These disagreements can sometimes get so big that people start to fight. When this happens, we call it a 'war'. A war is a very sad time. It means people are not safe, and many people can get hurt or have to leave their homes to find safety.</p>\n<p>Right now, there is a war happening very, very far away from us. It is happening in countries called Russia and Ukraine. These countries are not in Africa. They are on another continent, very far across the seas. This war has been going on for a little while, and it has made many people sad all over the world.</p>\n<p>Did you know? The world has seven big land areas called continents! Africa is one, and Europe is another, where Russia and Ukraine are found.</p>\n\n<h3>Sad News for Our Ghanaian Family</h3>\n<p>Now, here is the important news that connects us to this faraway war. A very important person in Ghana, a 'minister', has told us something sad. He said that some people from Ghana were in the countries where the war is happening. And sadly, about 55 people from Ghana have passed away because of this war.</p>\n<p>Fifty-five is a really big number. Imagine your classroom, then imagine maybe two or three more classrooms full of children. That's how many people passed away. It’s a lot of people from one African country. This makes us feel very sad for their families and for all of Ghana.</p>\n<p>This is the highest number of people reported to have died from one African country in this war. It means that more Ghanaians have been affected than people from any other African country we know about so far. This news makes us pause and think about how precious life and peace are.</p>\n<p>Did you know? A 'minister' is like a super-helper in the government. They work very hard to make sure their country runs well and that people are safe and happy.</p>\n\n<h3>Why Were Ghanaians There?</h3>\n<p>You might be asking, \"Why were people from Ghana so far away in a place where there was war?\" That's a very good question!</p>\n<p>Many of the Ghanaians who were there were young students. Just like you go to school to learn, these young men and women went to big universities in Ukraine. They wanted to learn special things, like how to become doctors to help sick people, or engineers to build strong bridges and buildings. They had big dreams of coming back to Ghana to help their own communities and make their country even better.</p>\n<p>But when the war started, it became very, very dangerous for everyone there, including these students. It was a scary time. People had to try and find safe places or try to travel back home to their families. Many were caught in the middle of the fighting, and it was very hard for them to get to safety.</p>\n<p>Did you know? Students travel all over the world to learn new things and bring that knowledge back to their home countries! It helps them grow and helps their communities too.</p>\n\n<h3>Our Leaders Are Helping</h3>\n<p>When the war started, many African countries, including Ghana, worked very, very hard. They wanted to make sure their citizens, especially the students, could get home safely. Our leaders sent special airplanes and buses to help bring people back from the dangerous places. It was a big effort to get everyone to safety.</p>\n<p>Many Ghanaians were able to come home. They were so happy to be safe with their families again. But sadly, not everyone could make it out, and that is why we have this very sad news today about the 55 people who passed away.</p>\n<p>Our governments are still working hard to understand everything that happened and to help the families who have lost loved ones. They are making sure that everyone who was there is accounted for and that their families receive support.</p>\n<p>Did you know? Governments often work together, like good neighbours, to help people from different countries in times of trouble! This is called international cooperation.</p>\n\n<h3>Why This News Matters for Africa</h3>\n<p>This sad news from Ghana is important for all of us in Africa. It shows us that even when bad things happen very far away, they can still touch our lives here. We are all connected in this big world. When our brothers and sisters in Ghana are sad, we all feel a bit of that sadness too.</p>\n<p>It also reminds us how precious peace is. Peace means everyone is safe, happy, and not fighting. We wish for peace everywhere in the world, so that no more children, students, or grown-ups have to be hurt or scared because of wars.</p>\n<p>Africa is a continent of peace and togetherness. We love to help each other and live in harmony. This news makes us want to wish for peace even more strongly, for all people, everywhere.</p>\n<p>Did you know? Africa is known for its beautiful wildlife, amazing ancient history, and for being a continent that loves peace and unity!</p>\n\n<h3>Let’s Wish for Peace Together</h3>\n<p>So, my dear friends, let's take a moment today to think about the people from Ghana who have passed away. Let's think about their families and send them warm thoughts and strength. It’s important to be kind and caring to everyone, especially when they are sad.</p>\n<p>Let's all hope that the war far away will end very soon. Let's wish for a world where everyone can live safely, learn, play, and grow up without any fear of fighting. A world full of smiles and laughter is what we all want!</p>\n<p>Thank you for listening, my wonderful friends. Always remember to be kind, stay curious, and keep hoping for a peaceful world. Until next time!</p>",
    "summary": "Sadly, an important leader in Ghana has shared that about 55 people from Ghana have passed away because of a war happening very far away between Russia and Ukraine, which is the most from any African country reported so far.",
    "whyMatters": "This news is important because it shows that even wars far away can affect our African family, reminding us that we all need to wish for peace and safety for everyone in the world.",
    "category": "world",
    "date": "2026-02-28T18:26:25.534Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Far%20Away%3A%20Our%20Ghanaian%20Friends%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-far-away-our-ghanaian-friends",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Bad Man Gets Caught: Keeping Kids Safe!",
    "content": "<h3>Hello from Africa!</h3>\nI'm your friendly news reporter, bringing you important stories from our amazing continent, Africa! Today, we're talking about something very serious, but also about how we all work together to make sure every child is safe and happy. It's important to learn about these things so we know how to protect ourselves and help others. So, let's learn together!\n\n<h3>A Man Who Worked for Another Country</h3>\nOnce upon a time, there was a grown-up man. He used to work for a country far away called the United States of America, or the USA. He was working in a beautiful country in Africa called Burkina Faso. Burkina Faso is a lovely place with kind people, just like many places in Africa. This man was supposed to be a helper, working to make things good between his country and Burkina Faso.\n\nDid you know? Burkina Faso is a country in West Africa! It's known for its friendly people and its beautiful culture!\n\n<h3>When Things Went Wrong</h3>\nNow, this man did something very, very wrong. He hurt two young girls in Burkina Faso. He made them feel very scared and unsafe. This happened at a time when their mommy was very, very sick. Because their mommy was so unwell, she couldn't protect her little girls as easily as she usually would. This man knew she was sick, and he used that time to do bad things to the girls. That is not how grown-ups should behave. Grown-ups should always protect children, especially when they need extra care.\n\n<h3>Grown-ups Should Protect Children</h3>\nIt's very important to remember that grown-ups are supposed to keep children safe. They should be kind and helpful. This man did the opposite. He used his position, his power, to do things that were not okay at all. He made the girls feel sad, scared, and uncomfortable. No grown-up should ever do that to a child. Children have a right to feel safe all the time, everywhere.\n\nDid you know? Every child in the world has special rights, and one of the most important rights is the right to be safe from harm!\n\n<h3>Finding Out About The Wrongdoing</h3>\nBut guess what? People found out about what this man did. There are special grown-ups whose job it is to make sure everyone follows the rules and that children are safe. They listen carefully to make sure bad things don't stay hidden. When someone does something wrong, especially to children, it's very important that others find out so that the children can be helped and the bad actions can stop.\n\n<h3>Justice Is Important</h3>\nWhen bad things happen, it's important that there is justice. Justice means making things right again and making sure the person who did wrong understands the consequences of their actions. This man had to go to a special place called a court. In court, a very important grown-up called a judge listens to everything that happened. The judge decides what should happen next.\n\nDid you know? A judge is like a super-referee for grown-ups! They make sure everyone follows the rules and that punishments are fair for wrong things that happen.\n\n<h3>Big Consequences for Bad Choices</h3>\nThe judge listened to everything about what the man did to the two girls. The judge saw that the man had made very, very bad choices. Because what he did was so wrong and so hurtful, the judge decided that the man must stay in jail for a very, very long time. This is called \"life in prison.\" It means he will stay there for the rest of his life because he hurt the children so badly. This shows that if you make really bad choices, there are big, big consequences.\n\n<h3>What This Means For You</h3>\nThis story might sound a bit scary, but it has a very important message for all of you. It shows that even if someone tries to do something wrong, they will get caught. And it shows that there are always good grown-ups who will help protect children. It's a reminder that it's okay to tell someone if you ever feel unsafe or uncomfortable.\n\n<h3>Your Superpower: Telling a Trusted Adult!</h3>\nIf anyone ever makes you feel scared, uncomfortable, or asks you to do something you don't like, please, please tell a trusted grown-up. A trusted grown-up could be your mommy, your daddy, your grandma, your grandpa, your teacher, or any adult you feel safe with. Telling someone is your superpower! It helps keep you and other children safe.\n\nDid you know? Telling a trusted adult when you feel unsafe is one of the bravest things you can do! It helps everyone stay safe.\n\n<h3>We All Help Each Other</h3>\nWe all have a part to play in keeping our communities safe. When we see something that doesn't feel right, or if someone makes us feel uneasy, talking about it is the first step. Good grown-ups want to help you. They want to make sure you can play, learn, and grow up happily, feeling safe every single day. This man made a very bad choice, but many good grown-ups worked together to make sure justice was done.\n\n<h3>A Safer World For All Children</h3>\nThis story reminds us that we must always look out for each other, especially for our young friends. It shows that even bad people can't get away with doing wrong things to children. There are always people watching, listening, and ready to help. Our world, especially here in Africa, is full of wonderful people who care deeply about children's safety and happiness.\n\n<h3>Stay Safe and Keep Smiling!</h3>\nSo, remember, you are important, and you deserve to feel safe. If anything or anyone ever makes you feel unsafe, use your superpower and tell a trusted grown-up! We will always be here to share important news and remind you to stay safe and keep those beautiful smiles shining bright. Bye for now, from your friend in Africa!",
    "summary": "A grown-up who did bad things to two girls in Burkina Faso has been put in jail for a very long time, showing that children are protected and bad choices have big consequences.",
    "whyMatters": "This is important because it shows that grown-ups work hard to keep children safe, and that if someone does bad things, they will face justice, reminding all kids to always tell a trusted adult if they feel unsafe.",
    "category": "world",
    "date": "2026-02-28T18:26:48.737Z",
    "image": "https://image.pollinations.ai/prompt/Bad%20Man%20Gets%20Caught%3A%20Keeping%20Kids%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bad-man-gets-caught-keeping-kids-safe",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "A Big House Story in Sunny Morocco!",
    "content": "<h3>Hello, Super Reporters!</h3>\nHello, my amazing friends! Your friendly news reporter from Africa is here to tell you a very interesting story today! It's all about a very big, fancy house in a beautiful country called Morocco. Morocco is a special place, part of our incredible continent, Africa! Get ready for an adventure, because this story has big houses, sunny places, and important lessons.\n\n<h3>What is a Palace?</h3>\nFirst, let's talk about what a palace is! Imagine a house that is super-duper big. Not just two rooms, but maybe twenty, thirty, or even more rooms! This is what we call a palace. Palaces often have huge gardens, tall walls, and look like something out of a fairy tale! Kings and queens used to live in them a long, long time ago. Sometimes, very rich people live in them today.\n\nDid you know? Some palaces are so big, they have their own swimming pools, libraries full of books, and even special rooms just for playing games! They are like giant, fancy playgrounds, but for grown-ups too!\n\n<h3>Meet the Man in Our Story</h3>\nSo, there was a man in our story. Let's call him Mr. Big Plans. He had a lot of money. He decided he wanted to buy a very special palace in Morocco. This palace was called Bin Ennakhi. That name sounds a bit like 'the beautiful palm tree house,' doesn't it? It was a truly amazing place, with lots of space and pretty things inside.\n\n<h3>Where is Beautiful Morocco?</h3>\nOur story takes us to Morocco. It's a sunny country right at the top of Africa. Imagine beautiful beaches where the sand meets the sea, colourful markets full of yummy spices that smell wonderful, and even friendly camels walking around! People in Morocco are often very kind, and they have delicious food too, like 'tagine' and 'couscous'! Yummy!\n\nDid you know? Morocco is famous for its bright, colourful cities! One city, Chefchaouen, is almost entirely painted blue! It looks like a magical dream! And sometimes, you can even see little monkeys playing in the mountains there!\n\n<h3>The Big Idea: Buying a Palace</h3>\nMr. Big Plans really, really wanted this palace. When you want to buy something big, like a palace, you talk to the person who owns it. This man was talking to the people who owned the Bin Ennakhi palace. He was saying, 'I want to buy your wonderful house!' Buying a palace takes a lot of time. There are lots of papers to sign and many talks to have, like grown-ups doing very important work.\n\nHe was very close to buying it. Imagine having a big, beautiful house almost all your own! He must have been very excited to think about living in such a grand place in sunny Morocco.\n\n<h3>Oops! Something Happened!</h3>\nBut guess what happened? Before he could finish buying this beautiful palace, something big and unexpected changed. The police came! The police are very important people who help keep us safe and make sure everyone follows the rules. If someone breaks the rules or does something wrong, the police need to talk to them. It's their job to make sure everything is fair and safe for everyone.\n\n<h3>The Police Are Our Friends</h3>\nDid you know? Police officers are like real-life superheroes in uniforms! They protect us from bad things and help us when we are in trouble. They work very hard to make sure everyone is safe and happy in our towns, cities, and countries, all across Africa and the whole wide world! We should always be thankful for the police and the good work they do.\n\n<h3>Why He Didn't Get the Palace</h3>\nSo, because Mr. Big Plans had done some bad things – he made some big mistakes – the police came to talk to him. He had to go with them. This happened just a few days after he was trying to buy the palace. Because he was with the police, he couldn't finish buying the big house in Morocco. The purchase was never completed. So, the palace stayed with its owners, safe and sound, just as it was before.\n\n<h3>Important Lessons for All of Us</h3>\nThis story teaches us something very important, my friends. It doesn't matter how much money someone has, everyone must follow the rules. Everyone needs to make good choices and be kind. If you do good things and are kind to others, you will always be a true winner in life. Making good choices is the best superpower you can have!\n\n<h3>Morocco is Still Amazing!</h3>\nEven with this story about the man and the palace, Morocco is still a wonderful and magical place! Its palaces are still beautiful, its people are still friendly and welcoming, and its sunshine is still warm and bright. It's a land full of amazing history and vibrant culture, waiting for you to discover it one day.\n\nSo, remember, my friends, always be good, be kind, and keep exploring the amazing world around us! Your friendly African reporter signing off with a big smile!",
    "summary": "A rich man tried to buy a giant, fancy house (a palace) in beautiful Morocco, but he couldn't finish buying it because the police came for him as he had made some big mistakes.",
    "whyMatters": "This story matters because it teaches us that everyone, no matter how much money they have, must follow the rules, and if you do bad things, the police will come to make sure things are right again.",
    "category": "world",
    "date": "2026-02-28T18:27:09.562Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20House%20Story%20in%20Sunny%20Morocco!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-house-story-in-sunny-morocco",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Suspected Iranian drone hits Bahrain high-rise building",
    "title": "Suspected Iranian drone hits Bahrain high-rise building",
    "content": "A suspected Iranian drone struck a high-rise building in Bahrain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-28T18:27:14.934Z",
    "image": "https://image.pollinations.ai/prompt/Suspected%20Iranian%20drone%20hits%20Bahrain%20high-rise%20building%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suspected-iranian-drone-hits-bahrain-high-rise-building",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/28/suspected-iranian-drone-hits-bahrain-high-rise-building?traffic_source=rss"
  },
  {
    "originalTitle": "Nine months after 12-day war, US, Israel seek to topple Iran’s leaders",
    "title": "Nine months after 12-day war, US, Israel seek to topple Iran’s leaders",
    "content": "US, Israel launch attacks on Iran in a move that risks destabilising the Middle East.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:20.265Z",
    "image": "https://image.pollinations.ai/prompt/Nine%20months%20after%2012-day%20war%2C%20US%2C%20Israel%20seek%20to%20topple%20Iran%E2%80%99s%20leaders%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nine-months-after-12-day-war-us-israel-seek-to-topple-irans-leaders",
    "originalLink": "https://www.aljazeera.com/editorial/2026/2/28/nine-months-after-12-day-war-us-israel-seek-to-topple-irans-leaders?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan edge last-ball thriller against Sri Lanka but exit T20 World Cup",
    "title": "Pakistan edge last-ball thriller against Sri Lanka but exit T20 World Cup",
    "content": "Pakistan needed to beat Sri Lanka by a substantial margin to leapfrog New Zealand into second semifinal qualifying spot.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:25.452Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20edge%20last-ball%20thriller%20against%20Sri%20Lanka%20but%20exit%20T20%20World%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-edge-last-ball-thriller-against-sri-lanka-but-exit-t20-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/28/pakistan-edge-last-ball-thriller-against-sri-lanka-but-exit-t20-world-cup?traffic_source=rss"
  },
  {
    "originalTitle": "Inside Iran, panic as strikes hit but for some it's a moment of relief",
    "title": "Inside Iran, panic as strikes hit but for some it's a moment of relief",
    "content": "Iranians talk about what is happening inside the country, despite an almost total internet blackout.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:31.034Z",
    "image": "https://image.pollinations.ai/prompt/Inside%20Iran%2C%20panic%20as%20strikes%20hit%20but%20for%20some%20it's%20a%20moment%20of%20relief%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "inside-iran-panic-as-strikes-hit-but-for-some-its-a-moment-of-relief",
    "originalLink": "https://www.bbc.com/news/articles/c05v8jzjn40o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Luxury Dubai hotel hit as Iran launches retaliatory strikes across region",
    "title": "Luxury Dubai hotel hit as Iran launches retaliatory strikes across region",
    "content": "Smoke and flames rose from Dubai's Fairmont The Palm hotel as civilian targets came under fire along with the US military bases across the middle east.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:36.213Z",
    "image": "https://image.pollinations.ai/prompt/Luxury%20Dubai%20hotel%20hit%20as%20Iran%20launches%20retaliatory%20strikes%20across%20region%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "luxury-dubai-hotel-hit-as-iran-launches-retaliatory-strikes-across-region",
    "originalLink": "https://www.bbc.com/news/articles/c204px4zddro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At least 20 killed after military plane carrying banknotes crashes in Bolivia",
    "title": "At least 20 killed after military plane carrying banknotes crashes in Bolivia",
    "content": "Police fire tear gas to disperse crowds allegedly trying to take banknotes from the crash site.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:41.429Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2020%20killed%20after%20military%20plane%20carrying%20banknotes%20crashes%20in%20Bolivia%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-20-killed-after-military-plane-carrying-banknotes-crashes-in-bolivia",
    "originalLink": "https://www.bbc.com/news/articles/c0rjpxxpp49o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More VAR challenge trials expected during two-year review",
    "title": "More VAR challenge trials expected during two-year review",
    "content": "Pierluigi Collina says there will be further trials of a challenge system as part of a two-year review of VAR.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:47.167Z",
    "image": "https://image.pollinations.ai/prompt/More%20VAR%20challenge%20trials%20expected%20during%20two-year%20review%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-var-challenge-trials-expected-during-two-year-review",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxzerk1yr9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Out of absolutely nothing' - Yamal scores solo stunner",
    "title": "'Out of absolutely nothing' - Yamal scores solo stunner",
    "content": "Lamine Yamal goes on a brilliant solo run before curling an effort into the far corner to score his second goal, enroute to his first career hat-trick in Barcelona's 4-1 win over Villarreal in La Liga.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:52.347Z",
    "image": "https://image.pollinations.ai/prompt/'Out%20of%20absolutely%20nothing'%20-%20Yamal%20scores%20solo%20stunner%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "out-of-absolutely-nothing-yamal-scores-solo-stunner",
    "originalLink": "https://www.bbc.com/sport/football/videos/cddn50mjy23o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pickford save 'out of this world' - Moyes",
    "title": "Pickford save 'out of this world' - Moyes",
    "content": "Everton manager David Moyes praises the late-game heroics of Jordan Pickford, who made a stunning save to deny Sandro Tonali in Everton's 3-2 win over Newcastle United.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T18:27:57.524Z",
    "image": "https://image.pollinations.ai/prompt/Pickford%20save%20'out%20of%20this%20world'%20-%20Moyes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pickford-save-out-of-this-world-moyes",
    "originalLink": "https://www.bbc.com/sport/football/videos/cqlg9l4ly66o?at_medium=RSS&at_campaign=rss"
  }
]