[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Peace, Fish, and Fun in Nigeria!",
    "content": "<h3>Hello from Sunny Africa!</h3>\n\nHi everyone! It's your friend Aisha, reporting live from beautiful Africa! I have a super exciting story to share with you today. It's about a very special party in a big country called Nigeria. Can you guess what kind of party? It's a big, happy fishing festival!\n\nDid you know? Africa is a huge continent with many, many countries, and Nigeria is one of the biggest!\n\n<h3>What is a Fishing Festival?</h3>\n\nImagine a really big celebration! That's what a festival is. And a fishing festival means people come together to catch fish! It's not just about catching fish, though. It's about having fun, being together, and making friends.\n\nThis festival in Nigeria is called a 'spectacular' festival. That means it's super amazing and exciting to watch! People from all around come to see it.\n\n<h3>Where is Nigeria?</h3>\n\nNigeria is a big country right here in Africa. It's far away from many places, but it's full of wonderful people and amazing places. Nigeria has lots of big rivers and lakes. These are perfect homes for many kinds of fish!\n\nDid you know? Nigeria has more people living in it than any other country in Africa! It's a very lively place.\n\n<h3>The Big Day Begins!</h3>\n\nFor many days, people get ready for this festival. They clean their fishing nets and get excited. Then, on the main day, everyone gathers by the water. Imagine hundreds and hundreds of people, all ready for the big fishing contest!\n\nThey stand by the riverbanks, chatting and laughing. The air is full of excitement. Children are there too, watching with wide eyes, hoping to see a really big fish.\n\n<h3>Ready, Set, Fish!</h3>\n\nWhen the signal is given, it's time to start! All the fishermen rush into the water together. They carry their big fishing nets. These nets are specially made to catch fish. The water splashes everywhere!\n\nThey throw their nets into the river, hoping to catch the biggest fish of the day. It's like a big race, but instead of running, they are fishing! Everyone is cheering and shouting with joy.\n\nDid you know? Many people in Africa get their food by fishing from rivers and lakes. It's a very important skill!\n\n<h3>Who Catches the Biggest Fish?</h3>\n\nThe fishermen work hard, pulling their nets out of the water. Some nets might have small fish, but everyone hopes for a really, really big one! Imagine seeing a giant fish caught in a net! It's very thrilling.\n\nAfter some time, the fishing contest comes to an end. This is what we call 'culminates'. It means the main event finishes. Then, the judges look at all the fish that have been caught.\n\nThey measure them carefully to see which one is the biggest. The person who catches the largest fish is the winner! They get a special prize and everyone cheers for them. It's a fun game for everyone!\n\n<h3>The Most Important Thing: Peace!</h3>\n\nNow, here is the really special part about this festival. It's not just about catching fish. It's about making peace. What is peace? Peace means everyone is friends, everyone is kind, and there is no fighting. Everyone helps each other and lives happily together.\n\nThis festival helps people from different villages and communities meet each other. Sometimes, villages might have little disagreements. But when they come to the festival, they remember they are all friends. They laugh together, eat together, and celebrate together.\n\nThe festival is like a big, happy meeting that helps to 'cement local peace'. This means it helps make the friendship and peace between nearby villages very strong, like glue that holds things together tightly. It reminds everyone to be kind and friendly.\n\nDid you know? When people come together for festivals, they often share food and stories. This helps them become good friends!\n\n<h3>More Fun and Celebration!</h3>\n\nWhile the fishing contest is going on, and after it finishes, there is even more fun! People wear their most colourful clothes. There is music playing, and people dance to the rhythm of the drums. It's a very lively and happy atmosphere!\n\nChildren play games, and families share delicious food. It's a wonderful day for everyone to forget their worries and just enjoy being together. It shows how much joy and happiness a community can have when everyone is friends.\n\nDid you know? Music and dancing are very important parts of celebrations in many African countries! They tell stories and bring people closer.\n\n<h3>Learning from the Festival</h3>\n\nThis amazing Nigerian fishing festival teaches us something very important. It teaches us that coming together, having fun, and making peace are super important. When people are friends, everyone is happier. Sharing and understanding help everyone live better lives.\n\nSo, from the big splashes in the river to the happy dances, this festival is all about community, fun, and most importantly, making sure everyone is kind to each other. It’s a wonderful example of how traditions can bring people together in a happy way.\n\n<h3>Goodbye from Aisha!</h3>\n\nWasn't that a super story? From the rivers of Nigeria, we learned about fish, fun, and friendship. I hope you enjoyed our adventure today! This is Aisha, your kid-friendly reporter, signing off from Africa. See you next time for more amazing stories!",
    "summary": "This news tells us about a big fishing festival in Nigeria, Africa, where people catch fish, have lots of fun, and most importantly, come together to make sure everyone stays friends and peaceful.",
    "whyMatters": "This festival is important because it brings people from different villages together, helping them be kind and friendly to each other, which makes their communities strong and happy.",
    "category": "world",
    "date": "2026-02-22T12:38:14.241Z",
    "image": "https://image.pollinations.ai/prompt/Peace%2C%20Fish%2C%20and%20Fun%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "peace-fish-and-fun-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rules for Everyone! Soldiers in Cameroon Learn About Fairness",
    "content": "Hello, my super friends! It’s your friendly reporter here with some important news from our amazing continent, Africa! Today, we are going to talk about something really important: rules and fairness. You know how important rules are, right? At home, at school, and even when you play with your friends, rules help everyone stay safe and happy. \n\nWell, today’s story comes from a beautiful country called Cameroon. It’s a country in Africa, just like many of our homes! In Cameroon, something happened that reminds us that rules are for everyone, no matter how big or how important their job is. \n\n<h3>What Happened in Cameroon?</h3>\n\nImagine you have a very important job, like being a police officer or a firefighter. These people help keep us safe, right? Well, in Cameroon, there are brave people called soldiers. Soldiers have a very big job. Their job is to protect their country and the people in it. They work hard to make sure everyone is safe from danger. \n\nBut sometimes, even people with very important jobs can make big mistakes. This is what happened with some soldiers in Cameroon. They made a very, very big mistake. They hurt some ordinary people who were not soldiers. We call these ordinary people 'civilians'. It was a very sad thing that happened. \n\nDid you know? Cameroon is famous for its beautiful mountains and lovely beaches! It's often called 'Africa in miniature' because it has so many different landscapes.\n\n<h3>Rules Are For Everyone!</h3>\n\nWhen someone makes a big mistake like this, what happens? Well, just like when you break a rule at school, there are consequences. Consequences mean that there are things that happen because of what you did. In big grown-up life, we have something called 'laws'. Laws are like super important rules for everyone in a country. They help keep our world fair and safe. \n\nBecause these soldiers hurt civilians, they broke very important laws. And because they broke these laws, they had to go to a special place called a court. A court is like a big classroom where grown-ups talk about rules and fairness. Judges are like special teachers who listen to what happened and decide what is fair. \n\n<h3>What is Justice?</h3>\n\nIn the court, the judges listened carefully. They wanted to make sure that things were fair for the people who were hurt and for their families. This is called 'justice'. Justice means making things right and fair for everyone. It means that if someone does something wrong, they have to take responsibility for it. \n\nFor a long time, people in this part of Cameroon were very sad about what happened. It’s not often that soldiers who make such big mistakes get held responsible. But this time, something special happened! The court decided that the soldiers who made these big mistakes would have to go to a place called prison. \n\nDid you know? Justice is like when your teacher makes sure everyone gets a turn on the swing, or when your mom makes sure you and your brother share your toys equally! It’s all about fairness.\n\n<h3>What is a Prison?</h3>\n\nA prison is a special place where grown-ups go if they break very big laws. It’s a place where they have to stay for a while to think about their mistakes and learn why following rules is so important. It’s not a happy place, but it's important for keeping everyone else safe and showing that laws must be followed by everyone. \n\nThree soldiers were told they would have to go to prison. This is a big deal! It means that the laws in Cameroon are strong, and they apply to everyone, even people with very important jobs like soldiers. It shows that no one is above the law. Everyone must follow the rules. \n\nDid you know? Many countries in Africa have their own special flags with beautiful colours and symbols. Cameroon's flag has green, red, and yellow stripes with a yellow star!\n\n<h3>Why This Story is Important for All of Us</h3>\n\nThis story might sound a little bit grown-up, but it has a very important message for you too, my young friends! It teaches us that rules are super important. They are there to protect us all. And it teaches us that everyone, absolutely everyone, must follow the rules. \n\nWhen something unfair happens, it's important that we try to make it right. This story shows that even when big mistakes are made, it is possible for justice to happen. It shows that people are trying their best to make sure everyone in Cameroon feels safe and that fairness is important. \n\nIt’s a reminder that we all need to treat each other with kindness and respect. We need to remember that everyone has feelings, and we should try our best to help each other, not hurt each other. When we all follow the rules, our communities become happier and safer places to live. \n\nDid you know? Africa is the second-largest continent in the world! It has 54 different countries, each with its own special stories and cultures!\n\n<h3>Our Hope for the Future</h3>\n\nThis news from Cameroon gives us hope. Hope that people will continue to work for peace and fairness. Hope that everyone will feel safe in their homes and their communities. It’s a step towards making sure that such sad mistakes don’t happen again. It helps everyone understand that people with power also have to follow the rules, just like you and me. \n\nSo, remember, my dear friends: rules are important, fairness is important, and being kind to everyone is the most important rule of all! Until next time, stay safe and keep shining brightly!",
    "summary": "Three soldiers in Cameroon received jail time for hurting civilians, showing that rules and justice apply to everyone.",
    "whyMatters": "This is important because it shows that even people with important jobs must follow the rules, helping everyone feel safe and treated fairly.",
    "category": "technology",
    "date": "2026-02-22T12:38:41.800Z",
    "image": "https://image.pollinations.ai/prompt/Rules%20for%20Everyone!%20Soldiers%20in%20Cameroon%20Learn%20About%20Fairness%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rules-for-everyone-soldiers-in-cameroon-learn-about-fairness",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:38:46.931Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How four years of Ukraine war have changed Russia",
    "title": "How four years of Ukraine war have changed Russia",
    "content": "From curbs on rights to fewer choices at the market, the war has taken its toll. Still, support for it remains high.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:38:52.139Z",
    "image": "https://image.pollinations.ai/prompt/How%20four%20years%20of%20Ukraine%20war%20have%20changed%20Russia%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-four-years-of-ukraine-war-have-changed-russia",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/how-four-years-of-ukraine-war-have-changed-russia?traffic_source=rss"
  },
  {
    "originalTitle": "UEFA and FIFA may get a red card at the ICC for ignoring Israeli violations",
    "title": "UEFA and FIFA may get a red card at the ICC for ignoring Israeli violations",
    "content": "A landmark referral of UEFA and FIFA leaders to the International Criminal Court could set an important legal precedent.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-22T12:38:57.275Z",
    "image": "https://image.pollinations.ai/prompt/UEFA%20and%20FIFA%20may%20get%20a%20red%20card%20at%20the%20ICC%20for%20ignoring%20Israeli%20violations%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uefa-and-fifa-may-get-a-red-card-at-the-icc-for-ignoring-israeli-violations",
    "originalLink": "https://www.aljazeera.com/opinions/2026/2/22/uefa-and-fifa-may-get-a-red-card-at-the-icc-for-ignoring-israeli-violations?traffic_source=rss"
  },
  {
    "originalTitle": "Rafael Grossi on nuclear risk and reforming the UN",
    "title": "Rafael Grossi on nuclear risk and reforming the UN",
    "content": "The IAEA chief discusses rising nuclear tensions, UN reform and whether the system can still prevent war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:39:02.403Z",
    "image": "https://image.pollinations.ai/prompt/Rafael%20Grossi%20on%20nuclear%20risk%20and%20reforming%20the%20UN%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rafael-grossi-on-nuclear-risk-and-reforming-the-un",
    "originalLink": "https://www.aljazeera.com/video/talk-to-al-jazeera/2026/2/22/rafael-grossi-on-nuclear-risk-and-reforming-the-un?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:39:07.889Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan launches deadly strikes on Afghanistan",
    "title": "Pakistan launches deadly strikes on Afghanistan",
    "content": "Pakistan says the strikes were retaliation for recent suicide bombings in the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:39:13.027Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20launches%20deadly%20strikes%20on%20Afghanistan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-launches-deadly-strikes-on-afghanistan",
    "originalLink": "https://www.bbc.com/news/articles/cdxgln3gnd6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US ambassador's Israel comments condemned by Arab and Muslim nations",
    "title": "US ambassador's Israel comments condemned by Arab and Muslim nations",
    "content": "Mike Huckabee suggested Israel would be justified in taking much of the Middle East on Biblical grounds.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T12:39:18.159Z",
    "image": "https://image.pollinations.ai/prompt/US%20ambassador's%20Israel%20comments%20condemned%20by%20Arab%20and%20Muslim%20nations%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-ambassadors-israel-comments-condemned-by-arab-and-muslim-nations",
    "originalLink": "https://www.bbc.com/news/articles/cn5gkkgdzkyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Educate yourself and your kids' - Fofana and Mejbri racially abused",
    "title": "Let's Play Fair: A Story About Being Kind to Everyone!",
    "content": "Hello, amazing friends! Reporter Kiki here, bringing you super important news from our wonderful continent of Africa! Today, let's talk about something that happened in the big, exciting world of football. You know football, right? It's that super fun game where you kick a round ball with your friends and try to score goals! It makes everyone cheer and jump with joy!\n\nFootball is played by people all over the world. Players come from many different countries, and they all have special talents. We see them on TV, running super fast and making incredible passes. It's a game that brings people together, no matter where they are from or what language they speak. Everyone cheers for their favourite team and their favourite players. That's what makes football so much fun!\n\n<h3> What Happened After a Big Game? </h3>\n\nSo, a few days ago, two super talented football players were playing a really big game. One player is named Hannibal Mejbri. He plays for a team called Burnley. The other player is Wesley Fofana. He plays for a team called Chelsea. They are both very good at football and work super hard to be the best players they can be.\n\nAfter their exciting game, something not very nice happened. Some people sent mean messages to Hannibal and Wesley. They sent these messages online, where people share things and talk to each other. These messages were unkind because they talked about how Hannibal and Wesley look, like their skin colour. Can you imagine getting mean messages just because of how you look? It made them feel sad, and it's really not fair at all.\n\n<h3> What Are Mean Words? </h3>\n\nMean words are like little bullies. They try to make you feel small or sad. When someone uses mean words because of how someone looks, their skin colour, or where their family comes from, we call it 'racism.'\n\nIt means thinking that one type of person is better or worse than another. But guess what? That's never, ever true! Everyone is special and good, just the way they are.\n\nImagine if someone said you couldn't play with them because your hair is curly, or because you like the colour blue more than green. That would be silly and unkind, wouldn't it? Everyone is different, and that's what makes our world so colourful and interesting!\n\n<h3> Why Is It Not Okay? </h3>\n\nDid you know? There are so many different people in our big, beautiful world! We all look a little different. Some people have dark skin, some have light skin. Some people have curly hair, some have straight hair. Some people have brown eyes, some have blue eyes. And guess what? All of these differences make each person special and unique!\n\nWhen someone says mean words about how someone looks, it hurts their feelings. It's like kicking someone in their heart. We wouldn't want someone to be mean to us, so we shouldn't be mean to others. Everyone deserves to be treated with respect and kindness, always. It doesn't matter where they come from or what they look like.\n\n<h3> What Did Hannibal and Wesley Do? </h3>\n\nEven though Hannibal and Wesley felt sad and disappointed, they were also very brave. They told everyone what happened. They used their voices to say, \"Hey, this is not okay! This makes us feel bad, and it's wrong.\"\n\nIt takes a lot of courage to speak up when someone has been unkind to you. They want everyone to learn that being mean because of how someone looks is wrong. They want people to understand that we should celebrate our differences, not use them to be unkind.\n\nThey are like superheroes, using their voices for good! They showed us all that it's important to be brave and stand up for what is right.\n\n<h3> Being Kind and Playing Fair </h3>\n\nBeing kind is like having a superpower! When you are kind, you make others feel happy and safe. You can share your toys, help a friend, or just say nice words. Kindness makes the world a brighter place for everyone.\n\nIn football, players always shake hands, even if they are on different teams. That's showing respect and kindness. We should always try to be kind to everyone, no matter if they look different, sound different, or play differently. We can all learn so much from each other!\n\nLet's make sure our playgrounds, our schools, and our homes are full of kindness and smiles. When we play fair and are kind, everyone has more fun.\n\n<h3> You Are Special! </h3>\n\nDid you know? Africa is a giant continent with so many amazing countries and people! We have many different cultures, languages, and ways of life. And guess what? Every single person is special, just the way they are!\n\nYour skin colour, your hair, your eyes – they are all part of what makes YOU uniquely wonderful. Nobody should ever make you feel bad about how you look or where you come from. We should celebrate all the beautiful colours and faces in our world.\n\nImagine a rainbow with only one colour – it wouldn't be nearly as pretty, would it? Our world is like a rainbow, full of amazing and wonderful colours! Each person adds a special colour to our world.\n\n<h3> What Can We Do? </h3>\n\nSo, what can YOU do? If you ever hear someone saying unkind words to another person because of how they look, or if it happens to you, tell a grown-up. Tell your teacher, your mom, your dad, or another grown-up you trust. They will help you.\n\nYou can also be a good friend and stand up for others. If you see someone being left out because they look different, invite them to play! Being a friend is a very powerful way to stop unkindness. Remember, your words and actions have power. Use them to spread kindness, not hurt!\n\n<h3> Let's All Play Together! </h3>\n\nLet's all promise to be kind, fair, and respectful to everyone. Let's make sure our football fields, our schools, and our homes are places where everyone feels welcome and happy. When we are kind to each other, our whole world becomes a better place. \n\nLet's cheer for our favourite football players, celebrate their amazing skills, and always remember that every player, every person, is important and special. Go out there and spread some kindness today! Reporter Kiki, signing off with a big smile and a big heart for everyone!",
    "summary": "Two football players, Hannibal Mejbri and Wesley Fofana, received mean messages because of how they look, and they bravely spoke up to remind everyone to be kind and fair to each other.",
    "whyMatters": "It matters because everyone is special and deserves to be treated kindly, no matter what they look like, and we should all stand up against mean words.",
    "category": "sports",
    "date": "2026-02-22T12:39:41.251Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Play%20Fair%3A%20A%20Story%20About%20Being%20Kind%20to%20Everyone!%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-play-fair-a-story-about-being-kind-to-everyone",
    "originalLink": "https://www.bbc.com/sport/football/articles/c24dv38q224o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Guardiola tells team to chill with cocktails as Man City pile pressure on Arsenal",
    "title": "Guardiola tells team to chill with cocktails as Man City pile pressure on Arsenal",
    "content": "As Manchester City continue to crank up the pressure on Arsenal, Pep Guardiola tells his players to take three days off to \"enjoy life\" with \"caipirinhas and daiquiris\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T12:39:46.375Z",
    "image": "https://image.pollinations.ai/prompt/Guardiola%20tells%20team%20to%20chill%20with%20cocktails%20as%20Man%20City%20pile%20pressure%20on%20Arsenal%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guardiola-tells-team-to-chill-with-cocktails-as-man-city-pile-pressure-on-arsenal",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckgl393k2l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Red cards and poor home form - Chelsea 'set fire to points'",
    "title": "Red cards and poor home form - Chelsea 'set fire to points'",
    "content": "Chelsea have more red cards than any side in the Premier League this season, and boss Liam Rosenior says they have \"set fire\" to points.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T12:39:51.507Z",
    "image": "https://image.pollinations.ai/prompt/Red%20cards%20and%20poor%20home%20form%20-%20Chelsea%20'set%20fire%20to%20points'%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "red-cards-and-poor-home-form-chelsea-set-fire-to-points",
    "originalLink": "https://www.bbc.com/sport/football/articles/c05v6j380nmo?at_medium=RSS&at_campaign=rss"
  }
]