[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Our Brave School Friends Who Never Give Up!",
    "content": "<h3>Hello, Super Kids of Africa!</h3>\nHello everyone! It's your friendly kid reporter here, from our amazing continent of Africa! I have a very important story to share with you today. It's a story about two super brave girls who live in Africa and love their school very much.\n\nThese girls are special because they are twins! That means they look very much alike. Let's call them Sola and Lena. They are just like you – they love to play, they love to learn, and they love their friends at school.\n\n<h3>Meet Sola and Lena</h3>\nSola and Lena live in a place where sometimes things can be a bit hard. But even when things are hard, they know that school is a bright place. They love to get ready in the morning, put on their clean school uniforms, and head out with their school bags.\n\nWalking to school is an adventure for them. They see their friends along the way. They laugh and talk about what they will learn that day. School is a happy place where they feel safe and loved.\n\n<h3>Their Happy School Days</h3>\nAt school, Sola and Lena learn so many cool things! They learn to read exciting stories. They learn to count numbers and solve puzzles. Their teachers are kind and help them understand everything.\n\nThey also sing songs together and draw colourful pictures. But the best part is playing with all their friends during break time. Running around, sharing jokes, and playing games – these are some of their favourite memories.\n\nDid you know? Many children in Africa walk a long way to get to school every day! They are very determined to learn.\n\n<h3>A Very Sad Day</h3>\nOne day, something very scary happened near their school. There were loud noises, like big thunder. It was not thunder from rain; it was something else, something dangerous. This scary thing is called 'shelling' or 'war'. It means grown-ups are fighting, and it can make places unsafe.\n\nSola and Lena were very, very scared. Everyone had to run and hide to be safe. It was a very confusing and frightening time for all the children and grown-ups.\n\nExplanation: When there is war, places that used to be safe, like schools, can become dangerous. This makes children and their families very sad and worried.\n\n<h3>Missing Their Friends</h3>\nAfter the scary noises stopped, Sola and Lena slowly went back to school. But things were not the same. When they looked around, many of their friends were not there. Some of their friends had to move far away to a safer place. And some of their friends, sadly, would not be coming back to school ever again.\n\nSola and Lena missed their friends so much. Their hearts felt heavy and sad. They remembered laughing and playing with them. It was very hard to think about their friends being gone.\n\nDid you know? It's okay to feel sad when you miss your friends. Talking about your feelings can help a lot.\n\n<h3>Why School Is So Important Now</h3>\nEven though they were sad, Sola and Lena were also very brave. They looked at each other and made a promise. They promised to keep going to school. They wanted to learn even more than before. They said, \"We must finish our studies!\"\n\nThey knew that learning was a special gift. It helps you understand the world. It helps you find good jobs when you grow up. And it helps you make the world a better, more peaceful place. For Sola and Lena, school was now more important than ever. They wanted to learn for themselves, and for their friends who couldn't be there.\n\n<h3>Dreams for Tomorrow</h3>\nSola and Lena have big dreams for the future. Sola wants to be a doctor. She wants to help people who are sick or hurt. She wants to make sure everyone can be healthy and strong.\n\nLena wants to be a teacher. She wants to teach other children to read, write, and count. She wants to make school a happy and safe place for all kids, just like her teachers did for her.\n\nDid you know? Going to school helps you learn everything you need to know to follow your biggest dreams!\n\n<h3>Learning and Playing Safely</h3>\nGrown-ups, teachers, and kind people from all over the world are working very hard to make sure schools are safe again. They are trying to fix anything that broke. They are making sure that no more scary things happen.\n\nThey know that every child deserves a safe place to learn and play. They want Sola and Lena, and all children, to feel happy and secure when they are at school. Safety is very important for all of us.\n\nExplanation: Many people called 'humanitarian workers' help families and children in places affected by war. They bring food, water, and help make schools safe.\n\n<h3>Everyone Can Help</h3>\nSola and Lena's story teaches us something very important. It teaches us that even when things are very, very hard, we should never give up on learning. Our education is a superpower!\n\nWe can all help each other. We can be kind to our friends. We can listen to our teachers. We can learn as much as we can. This makes us strong. It helps us build a brighter future for Africa and for the whole world.\n\n<h3>Keep Learning, Keep Dreaming!</h3>\nSo, let's cheer for Sola and Lena! They are true heroes. They remind us that school is a precious gift. It gives us hope, knowledge, and the power to make our dreams come true.\n\nKeep going to school, super kids! Keep learning, keep playing, and keep dreaming big dreams. Together, we can make our world a better and safer place for everyone. Bye for now, from your friend in Africa!",
    "summary": "Sola and Lena, two brave twin girls in Africa, found strength to continue their studies even after a war-like incident made their school unsafe and caused them to lose many friends, inspiring them to pursue their dreams of becoming a doctor and a teacher.",
    "whyMatters": "This story matters because it shows us how important school is, even when things are very hard. It tells us that learning helps us stay strong, hope for a better future, and make our dreams come true for ourselves and our friends.",
    "category": "world",
    "date": "2026-01-25T11:14:12.609Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Brave%20School%20Friends%20Who%20Never%20Give%20Up!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-brave-school-friends-who-never-give-up",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Treasures Can Now Be Sold!",
    "content": "<h3>Hello, Little Friends!</h3>\n\nHello, everyone! I am your friendly news reporter for Africa. Today, we have some very interesting news about a super important person. His name is Nelson Mandela. Have you heard of him? He was a great hero for our country, South Africa, and for all of Africa!\n\nWe are going to talk about some of his very special things. These are things he used a long, long time ago. They are a prison key, some cool sunglasses, and a shirt. Something amazing happened with these items. Let's find out together!\n\n<h3>Who Was Nelson Mandela?</h3>\n\nNelson Mandela was a very brave man. He was born in a beautiful place in South Africa. When he grew up, he saw that things were not fair for everyone. Some people were treated badly just because of the colour of their skin. This made him sad, and he wanted to change it.\n\nHe worked very hard to make sure everyone was treated with love and respect. He wanted everyone to be free and equal. Because he fought so hard for fairness, some powerful people put him in prison. He was in prison for a very, very long time. But he never, ever gave up!\n\nHe kept dreaming of a free and fair country where everyone could live happily together. And guess what? His dream came true! He became the first black President of South Africa! He taught us all about peace and forgiveness.\n\nDid you know? Nelson Mandela spent 27 years in prison! That's almost as long as your mom and dad have been alive, maybe even longer! Imagine being away from your family for so many years and still staying strong.\n\n<h3>Mandela's Special Things</h3>\n\nNow, let's talk about the special things we mentioned. These are not just any key, any sunglasses, or any shirt. These are things that Nelson Mandela himself touched and used. They are like small pieces of his incredible life.\n\nThey tell a story about his journey, his struggles, and his triumphs. They are like little treasures that hold big memories! Imagine holding something that a great hero held. It makes you feel close to them, right?\n\nThat's how special these items are. People all over the world love and respect Nelson Mandela. So, anything he used becomes very, very precious to many people.\n\n<h3>The Prison Key Story</h3>\n\nOne of the items is a key. But not just any key! It is a key from the prison cell where Nelson Mandela was kept. He was held in a very famous prison on a small island called Robben Island. This key is like a symbol of his time there.\n\nIt reminds us that he was locked away, but his spirit was never locked down. He remained strong and hopeful even behind bars. When he finally came out of prison, it was a super happy day for everyone in South Africa and around the world. People danced and celebrated!\n\nThis key reminds us of his amazing strength and his long wait for freedom. It's a key to a very important part of our history, showing us that even in the darkest times, hope can shine through.\n\nDid you know? Robben Island is a small island near Cape Town in South Africa. It used to be a prison for many brave people, but now it's a museum! You can visit it and learn more about Mandela and others who fought for freedom.\n\n<h3>His Cool Sunglasses</h3>\n\nAnother item is a pair of sunglasses. We wear sunglasses to protect our eyes from the bright sun. Nelson Mandela wore sunglasses too! His sunglasses are special because *he* wore them. They show a little bit of his personal style and how he looked every day.\n\nWhen we see pictures of him wearing them, we remember his kind smile, his wise eyes, and his calm manner. These sunglasses are a small piece of his everyday life. They make us feel like we know him a little better, don't they?\n\nThey are a fun and stylish reminder of him, showing us that even heroes have simple things they use every day. They remind us of his quiet strength and his bright outlook on life.\n\nDid you know? Nelson Mandela loved children very much! He always said that children are our future. He often wore bright, colourful shirts and loved to smile and laugh, especially with kids.\n\n<h3>A Shirt He Wore</h3>\n\nThe third item is a shirt. It's not just a plain shirt. It's a shirt that Nelson Mandela wore. Maybe he wore it when he was meeting very important people, like kings and queens, or when he was giving a big, inspiring speech to thousands of people.\n\nWe don't know exactly when or where he wore it, but we know it was *his* shirt. When we see clothes worn by heroes, it helps us imagine them more clearly. It helps us feel their presence and remember their courage.\n\nThis shirt reminds us of his strong spirit and his journey to make things right for everyone. It's a soft piece of fabric with a very hard story of bravery and justice woven into it.\n\nDid you know? Nelson Mandela won the Nobel Peace Prize! This is a very, very big award given to people who work hard to bring peace and understanding to the world. It's one of the highest honours anyone can receive.\n\n<h3>Why Are These Things So Important?</h3>\n\nThese items are important because they are part of our \"heritage.\" What does \"heritage\" mean? It means things that are passed down from the past that are very, very special and important to our country and our people. They help us remember our history and where we come from.\n\nThey help us remember Nelson Mandela's incredible fight for freedom and fairness for all. They help us remember how far we have come as a country, from a time of unfairness to a time of democracy and equality.\n\nThat's why many people in South Africa felt these items should stay right here, in our country, so everyone could see them in museums and learn from them. They are like storybooks without words.\n\nDid you know? South Africa has 11 official languages! People speak many different beautiful languages like Zulu, Xhosa, Afrikaans, and English. It's a country rich in cultures and languages.\n\n<h3>Who Wanted to Sell Them?</h3>\n\nSo, who wanted to sell these special things? It was Nelson Mandela's daughter. A daughter is a girl child of a parent. Her name is Makaziwe Mandela. She wanted to sell them to help tell her father's story to even more people around the world, and perhaps for other family reasons.\n\nShe believes that these items can travel to different places so more people can learn about her father and his amazing life. She also has the right, as his family, to decide what happens to some of her father's personal things.\n\n<h3>Who Tried to Stop It?</h3>\n\nBut some important people thought these items should not be sold or leave South Africa. These people are called \"the authorities.\" You can think of them as the government, or the people who look after very important historical things for our country. They felt that these items were too special and too much a part of our national story to leave South Africa.\n\nThey wanted these things to stay here, in our country, perhaps in museums, so all children and adults in South Africa could see them and learn from them. They said these items are part of our national story, our very precious \"heritage.\"\n\n<h3>Going to See the Judge</h3>\n\nBecause there was a big disagreement between Nelson Mandela's daughter and the government, they had to go to a \"court.\" A court is a special place where a \"judge\" helps people decide what is fair and right according to the rules and laws. It's like a very serious talk where both sides explain their reasons.\n\nNelson Mandela's daughter explained why she wanted to sell the items. The government people explained why they wanted them to stay in South Africa. The judge listened very, very carefully to both sides, like a wise teacher listening to a classroom debate.\n\nDid you know? A judge is a very wise person who helps make important decisions based on rules and laws that everyone in the country follows. They make sure things are fair for everyone.\n\n<h3>What Did the Judge Say?</h3>\n\nAfter listening to everyone and thinking very carefully, the judge made a big decision. The judge said that Nelson Mandela's daughter *can* sell the prison key, the cool sunglasses, and the special shirt! This means she won the \"court battle.\"\n\nSo now, these special items can be sold. Maybe they will go to a museum in another country, where people from far away can see them. Or maybe a special collector will buy them and keep them safe. It's a big decision that lets the family decide what to do with these pieces of history.\n\nThis decision shows that sometimes, even with very important historical items, the family's wishes are respected.\n\n<h3>Why Does This Matter to Us?</h3>\n\nThis news is important because it reminds us of Nelson Mandela, our great hero. He taught us so much about being fair, being brave, and never, ever giving up on your dreams. Even simple things like a key or a shirt can tell a big, important story.\n\nIt also shows us that families have rights, and sometimes decisions about history and family things can be a little tricky. But in the end, we always remember our heroes and the amazing things they did for us and for the world.\n\nLet's always remember Nelson Mandela and his dream of a fair world where everyone is treated with kindness and respect! His legacy lives on, even in these small, special treasures.\n\nDid you know? Nelson Mandela's nickname was Madiba. It's a special clan name that people use in South Africa to show deep respect and love for him. It's like calling him \"our beloved elder.\"",
    "summary": "Nelson Mandela's daughter can now sell his prison key, sunglasses, and a shirt after a judge said yes, even though the government wanted to keep them in South Africa because they are important to the country's history.",
    "whyMatters": "This is important because it reminds us about Nelson Mandela, a great hero who fought for fairness. It shows how even small things he used are special and tell his amazing story to the world, helping us remember his lessons of bravery and peace. It also shows that deciding what happens to historical treasures can sometimes be difficult, but family wishes are also important.",
    "category": "world",
    "date": "2026-01-25T11:14:41.864Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Treasures%20Can%20Now%20Be%20Sold!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-treasures-can-now-be-sold",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Big News from Somaliland! Our President Makes New Friends!",
    "content": "<h3>Hello, Super Kids of Africa!</h3>\n\nGuess what, amazing children! I have some super exciting news to share from a very special place in our big, beautiful continent of Africa called Somaliland! Our president, the kind and brave leader of Somaliland, recently went on a very important trip. He travelled far, far away to meet some big, important people. Why? To make Somaliland even better for all of you!\n\nWe're going to talk about his journey and the amazing things that happened. It's like a big adventure story, but it's all true! Let's find out more about Somaliland and the wonderful news.\n\n<h3>Meet Somaliland!</h3>\n\nSomaliland is a lovely place in the eastern part of Africa. It's right on the ocean, so it has beautiful beaches! It's a land of warm sunshine, friendly people, and cool animals like camels and gazelles. The people of Somaliland have worked very hard to build their own government and schools and hospitals. They want to be a recognised country by all the other countries in the world.\n\nImagine you have a special club with your friends. Somaliland is like a club that has grown up strong and wants other big clubs to say, \"Yes, you are a real club!\" They have their own flag, their own money, and their own leaders. It's a place full of hope and dreams for a bright future.\n\nDid you know? Somaliland's capital city is Hargeisa! It's a busy and growing city, just like many other big cities you know.\n\n<h3>Our President Travels Far!</h3>\n\nThe leader of Somaliland is called the President. His job is to help all the people in Somaliland. He makes sure there are schools for children, hospitals for when people are sick, and roads for cars to drive on. A president is like the head of a very big family, trying to make everyone happy and safe.\n\nOur President, whose name is Muse Bihi Abdi, decided to go on a long journey. He wanted to tell people from other parts of the world about Somaliland. He wanted to tell them how special Somaliland is and how it can be a great place for business and friendship. When a president travels, it's usually for a very good reason that helps everyone back home.\n\nDid you know? Presidents are chosen by the people! Just like you might choose a class captain, grown-ups in a country vote to pick their president.\n\n<h3>Meeting a Special Friend: Donald Trump Junior!</h3>\n\nOne of the important people our President met was Donald Trump Junior. Now, his father, Donald Trump, used to be the very big leader of a very big country called America! So, Donald Trump Junior is an important person who knows many people and is involved in many big businesses.\n\nOur President talked to Donald Trump Junior about \"business opportunities.\" What does that mean? Well, imagine you have a special delicious fruit in Somaliland. A business opportunity is like finding someone who wants to help you pick more of that fruit, pack it nicely, and send it to other countries so more people can enjoy it! It's about working together to make good things, sell them, and create jobs for people.\n\nWhen we have more businesses, it means more people in Somaliland can have jobs. And when people have jobs, they can earn money to buy food, clothes, and send their children to school. So, meeting people like Donald Trump Junior can help bring exciting new projects to Somaliland that make everyone's lives better.\n\nDid you know? When countries do business together, it's called 'trade'! It helps everyone get things they need and want.\n\n<h3>Making Another New Friend: From Israel!</h3>\n\nOur President also met a very important person from a country far away called Israel. Israel is another country on the map, with its own people and leaders. And guess what? This meeting was extra special!\n\nThe person from Israel said something very important about Somaliland. They said that Israel \"recognised the independence\" of Somaliland! What does \"recognised independence\" mean? It's like when you tell your friends, \"Look, I can tie my own shoes now!\" And your friends say, \"Wow, yes you can! You're a big kid and you can do it!\"\n\nSo, when Israel said they recognised Somaliland's independence, it means they are saying, \"Yes, Somaliland, you are a real country, and we want to be friends with you!\" This is super, super good news because it means more countries might start to say the same thing. Having more friends in the world helps Somaliland grow stronger and safer.\n\nDid you know? When one country recognises another, it means they see them as an equal and a friend in the big family of nations!\n\n<h3>What Does This Mean for Somaliland?</h3>\n\nAll these meetings and new friendships are like planting special seeds for Somaliland's future. When more countries say, \"Yes, you are a country!\" and more people want to do business with Somaliland, it brings wonderful things.\n\nIt can mean more money to build new schools for children, better hospitals for sick people, and more clean water for everyone. It means more jobs for mothers and fathers, so families can be happy and healthy. It means Somaliland can keep growing and showing the world what an amazing place it is.\n\nOur President is working hard to make Somaliland shine brightly on the world map. These trips are all about building a wonderful future for every child and every family in Somaliland. Isn't that amazing?\n\nDid you know? When countries are friends, they can help each other in many ways, like sharing ideas and resources!\n\nStay tuned for more happy news from Africa, super kids!",
    "summary": "The President of Somaliland travelled to meet important people, including Donald Trump Junior to talk about business, and a friend from Israel who said they recognise Somaliland as its own country.",
    "whyMatters": "This is important because these meetings can bring new jobs and help build more schools and hospitals in Somaliland, making life better for everyone there, and helping Somaliland become a recognised country around the world.",
    "category": "world",
    "date": "2026-01-25T11:15:01.415Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Somaliland!%20Our%20President%20Makes%20New%20Friends!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-somaliland-our-president-makes-new-friends",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli forces kill Palestinian man in occupied West Bank",
    "title": "Israeli forces kill Palestinian man in occupied West Bank",
    "content": "Israeli army intensifies its deadly West Bank attacks as settlers rampage across Palestinian lands with impunity.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:06.730Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20forces%20kill%20Palestinian%20man%20in%20occupied%20West%20Bank%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-forces-kill-palestinian-man-in-occupied-west-bank",
    "originalLink": "https://www.aljazeera.com/news/2026/1/25/israeli-forces-kill-palestinian-man-in-occupied-west-bank-10?traffic_source=rss"
  },
  {
    "originalTitle": "Babar returns as Pakistan name T20 World Cup squad despite tournament doubt",
    "title": "Babar returns as Pakistan name T20 World Cup squad despite tournament doubt",
    "content": "Uncertainty shrouds Pakistan's participation after ICC expels Bangladesh from the tournament.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:11.909Z",
    "image": "https://image.pollinations.ai/prompt/Babar%20returns%20as%20Pakistan%20name%20T20%20World%20Cup%20squad%20despite%20tournament%20doubt%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "babar-returns-as-pakistan-name-t20-world-cup-squad-despite-tournament-doubt",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/25/babar-returns-as-pakistan-name-t20-world-cup-squad-despite-tournament-doubt?traffic_source=rss"
  },
  {
    "originalTitle": "Here’s what to know about your legal rights when encountered with ICE",
    "title": "Here’s what to know about your legal rights when encountered with ICE",
    "content": "Experts clarify ICE limits, detailing when agents can stop, detain or enter homes and what rights residents have.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:17.079Z",
    "image": "https://image.pollinations.ai/prompt/Here%E2%80%99s%20what%20to%20know%20about%20your%20legal%20rights%20when%20encountered%20with%20ICE%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "heres-what-to-know-about-your-legal-rights-when-encountered-with-ice",
    "originalLink": "https://www.aljazeera.com/news/2026/1/25/heres-what-to-know-about-your-legal-rights-when-encountered-with-ice?traffic_source=rss"
  },
  {
    "originalTitle": "What we know about fatal shooting of Alex Pretti by federal agents in Minneapolis",
    "title": "What we know about fatal shooting of Alex Pretti by federal agents in Minneapolis",
    "content": "Trump officials says federal agents shot in self-defence, as Pretti's parents accuse them of \"sickening lies\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:22.976Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20about%20fatal%20shooting%20of%20Alex%20Pretti%20by%20federal%20agents%20in%20Minneapolis%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-about-fatal-shooting-of-alex-pretti-by-federal-agents-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/c20zjyxep99o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
    "title": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
    "content": "The US president's praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-25T11:15:28.151Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20UK%20soldiers%20in%20Afghanistan%20'among%20greatest%20of%20all%20warriors'%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-uk-soldiers-in-afghanistan-among-greatest-of-all-warriors",
    "originalLink": "https://www.bbc.com/news/articles/c3edwx37pd9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump threatens Canada with 100% tariffs if it 'makes a deal with China'",
    "title": "Trump threatens Canada with 100% tariffs if it 'makes a deal with China'",
    "content": "It comes as tensions appear to have escalated between Trump and Canadian Prime Minister Mark Carney.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:33.342Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20Canada%20with%20100%25%20tariffs%20if%20it%20'makes%20a%20deal%20with%20China'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-canada-with-100percent-tariffs-if-it-makes-a-deal-with-china",
    "originalLink": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Liverpool's struggles can no longer be hidden by long unbeaten run'",
    "title": "'Liverpool's struggles can no longer be hidden by long unbeaten run'",
    "content": "Liverpool's struggles can no longer be hidden by their long unbeaten run after their last-gasp defeat at Bournemouth, writes Aadam Patel.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:38.930Z",
    "image": "https://image.pollinations.ai/prompt/'Liverpool's%20struggles%20can%20no%20longer%20be%20hidden%20by%20long%20unbeaten%20run'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "liverpools-struggles-can-no-longer-be-hidden-by-long-unbeaten-run",
    "originalLink": "https://www.bbc.com/sport/football/articles/c338j0dzgx1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Joyless and toxic' - will Spurs put Frank out of his misery?",
    "title": "'Joyless and toxic' - will Spurs put Frank out of his misery?",
    "content": "Tottenham manager Thomas Frank remains in deep trouble despite his side rescuing a late draw at Burnley, writes Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-25T11:15:44.093Z",
    "image": "https://image.pollinations.ai/prompt/'Joyless%20and%20toxic'%20-%20will%20Spurs%20put%20Frank%20out%20of%20his%20misery%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "joyless-and-toxic-will-spurs-put-frank-out-of-his-misery",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd7z0jplzd9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Carrick's Man Utd coaches are more than just 'a bunch of his mates'",
    "title": "Why Carrick's Man Utd coaches are more than just 'a bunch of his mates'",
    "content": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains the thinking behind Michael Carrick's backroom staff appointments at Manchester United, and what a manager wants from those roles.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T11:15:49.258Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Carrick's%20Man%20Utd%20coaches%20are%20more%20than%20just%20'a%20bunch%20of%20his%20mates'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-carricks-man-utd-coaches-are-more-than-just-a-bunch-of-his-mates",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd7zrp8v3qgo?at_medium=RSS&at_campaign=rss"
  }
]