[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News from Far Away: Our Ghanaian Friends",
    "content": "<h3>Hello from Your Friendly African Reporter!</h3>\nHi everyone! It's me, your friendly news reporter, bringing you important stories from all over Africa and the world. I hope you're all having a great day, learning and playing!\n\nToday, we have some news that is a little bit sad. But it's important for us to talk about it and understand what's happening in our big, wide world.\n\n<h3>Sad News from Ghana</h3>\nWe heard some sad news from a very important grown-up in Ghana. This grown-up is called a Minister, and they help lead our country. The Minister told us that 55 people from Ghana have died.\n\nFifty-five people is a lot of grown-ups. It's a big number. This happened very, very far away from Ghana, in a place you might have heard of on the news.\n\n<h3>What is a War? (Far, Far Away)</h3>\nThis sad news comes from a very big and very, very serious fight. It's not a small fight like you might have with a friend, but a huge fight between two countries.\n\nThese two countries are called Russia and Ukraine. They are very, very far away from Africa, on another side of the world. When countries fight like this, it is called a war.\n\nA war is when soldiers from different countries use big machines and guns to fight each other. Wars are very sad because many people get hurt, and sometimes, people even die. They make lots of families sad.\n\n<h3>Did You Know?</h3>\nGhana is a beautiful country located in West Africa! It's famous for its lovely beaches, its delicious jollof rice, and its very friendly people. It's a wonderful part of our big African family.\n\n<h3>Our Ghanaian Friends: Why Were They There?</h3>\nYou might be asking, \"Why were people from Ghana so far away in Russia and Ukraine?\"\n\nWell, sometimes grown-ups travel to other countries for different reasons. Some Ghanaians might have gone to Russia or Ukraine to study at big schools, like universities. They wanted to learn new things and get good jobs.\n\nOthers might have gone there to work and earn money to send back home to their families in Ghana. Some might have even lived there for a very long time, making new homes for themselves.\n\nSo, these 55 people were living their lives, perhaps studying or working, when the big fight, the war, started.\n\n<h3>What Does 'Casualty' Mean?</h3>\nWhen we talk about people who get hurt or die in a war, sometimes grown-ups use a word called 'casualties'. It's a grown-up word for someone who has suffered because of the war.\n\nIn this sad news, 'casualties' means the 55 people from Ghana who died because of the big fight between Russia and Ukraine. It's a very sad word.\n\n<h3>The Sad Number: 55 People</h3>\nThis news is extra sad for Ghana and for all of us in Africa. The Minister said that 55 people is the highest number of people who have died from just *one* African country in this war.\n\nThis means that Ghana has felt a lot of sadness because of this far-away war. It tells us that this war has affected people from many different places, even far away from where the fighting is happening.\n\n<h3>Did You Know?</h3>\nAfrica is a super big continent! It has 54 different countries, each with its own special people, languages, and cultures. Ghana is just one of these amazing countries!\n\n<h3>Families Are Sad: Our Hearts Go Out</h3>\nWhen someone dies, especially someone far from home, their family misses them terribly. Their mums, dads, brothers, sisters, and friends in Ghana are feeling very, very sad right now.\n\nIt makes us all sad when we hear about people getting hurt and dying in wars. We send all our love and warm thoughts to the families in Ghana who have lost their loved ones.\n\n<h3>Did You Know?</h3>\nThe world is an incredibly big place! Russia and Ukraine are so far away from Ghana and other parts of Africa that it would take many hours, even a full day, to fly there in an airplane!\n\n<h3>What Can We Do? Hope for Peace</h3>\nEven though we are small, we can still do important things. We can hope for peace. Peace means no fighting. Peace means everyone is kind to each other, and countries can talk things out instead of fighting.\n\nWe can also be kind to our friends, our family, and everyone we meet every day. When we are kind, we help make our own small part of the world a more peaceful and happy place.\n\n<h3>Africa Wants Peace Too!</h3>\nOur leaders in Africa, the very important grown-ups who help run our countries, they also want this big fight to stop. They want peace for Russia and Ukraine.\n\nAfrican leaders are working hard to try and help stop the fighting. They want people to be safe and for wars to end so that everyone can live happily and without fear.\n\n<h3>Did You Know?</h3>\nWhen people are very sad, a kind word, a warm hug, or even drawing a picture for them can sometimes help them feel a little bit better. Being kind is a powerful thing!\n\n<h3>Remembering and Moving Forward</h3>\nWe remember the 55 people from Ghana who died far away. It is important to remember them and to understand that wars bring much sadness.\n\nLet's all continue to hope for a world where there are no big fights, where everyone is safe, and where kindness is always the winner. Let's make sure we learn from sad news and always choose to be kind.\n\nThank you for listening, friends. See you next time for more news from Africa and beyond!",
    "summary": "A high number of 55 people from Ghana have died in the big fight between Russia and Ukraine, which is a very sad event for their families and for Africa.",
    "whyMatters": "This news is important because it shows how a big fight far away can make people sad even here in Africa, and it reminds us to always hope for peace and be kind to everyone.",
    "category": "world",
    "date": "2026-02-27T18:35:04.758Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Far%20Away%3A%20Our%20Ghanaian%20Friends%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-far-away-our-ghanaian-friends",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "content": "He used the girls' mother's life-threatening illness as an opportunity to demand sex, said the US Office of Public Affairs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:35:09.885Z",
    "image": "https://image.pollinations.ai/prompt/Former%20US%20diplomat%20sentenced%20to%20life%20for%20abusing%20two%20girls%20in%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "former-us-diplomat-sentenced-to-life-for-abusing-two-girls-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "content": "The disgraced financier was in talks to buy luxury abode Bin Ennakhi - but the purchase was never completed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:35:15.016Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20tried%20to%20buy%20a%20palace%20in%20Morocco%20days%20before%20his%20arrest%20in%202019%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-tried-to-buy-a-palace-in-morocco-days-before-his-arrest-in-2019",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Residents describe panic as Pakistan attacks Afghanistan in ‘open war’",
    "title": "Residents describe panic as Pakistan attacks Afghanistan in ‘open war’",
    "content": "Residents of Kabul, Afghanistan are cleaning up broken glass and describing how they tried to run to safety.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:35:20.344Z",
    "image": "https://image.pollinations.ai/prompt/Residents%20describe%20panic%20as%20Pakistan%20attacks%20Afghanistan%20in%20%E2%80%98open%20war%E2%80%99%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "residents-describe-panic-as-pakistan-attacks-afghanistan-in-open-war",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/27/residents-describe-panic-as-pakistan-attacks-afghanistan-in-open?traffic_source=rss"
  },
  {
    "originalTitle": "Has Trump’s trade strategy lost leverage?",
    "title": "Has Trump’s trade strategy lost leverage?",
    "content": "A Supreme Court setback on tariffs challenges Trump's protectionist trade strategy.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-27T18:35:25.472Z",
    "image": "https://image.pollinations.ai/prompt/Has%20Trump%E2%80%99s%20trade%20strategy%20lost%20leverage%3F%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "has-trumps-trade-strategy-lost-leverage",
    "originalLink": "https://www.aljazeera.com/video/counting-the-cost/2026/2/27/has-trumps-trade-strategy-lost-leverage?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan vs Sri Lanka: T20 World Cup Super Eights – teams, net run-rate",
    "title": "Big Cricket Fun! Pakistan's Super Challenge!",
    "content": "<h3>Hello, Sports Fans from Africa!</h3>\nHello, my amazing friends all across Africa! It's your kid-friendly reporter here, ready to share some super exciting news from the big world of sports!\n\nToday, we're going to talk about a super fun game called cricket. Have you ever heard of it?\n\nIt's like a big party where teams from different countries play together!\n\n<h3>What is Cricket?</h3>\nImagine a game with a bat and a ball, a bit like baseball, but with its own special rules!\n\nTwo teams play, and they try to score points called 'runs'.\n\nOne team bats and tries to hit the ball far. The other team bowls and tries to get the players out.\n\nIt's super exciting to watch!\n\nDid you know? Cricket is played in many countries, like India, Australia, England, and many more, even some places in Africa!\n\n<h3>The Big Cricket Party: T20 World Cup!</h3>\nRight now, there's a huge competition happening called the T20 World Cup.\n\nThink of it like the Olympics for cricket! Teams from all over the world come to play and see who is the best.\n\nT20 means the game is a bit shorter and super fast-paced, so there's always lots of action!\n\nEveryone gets very excited about the T20 World Cup!\n\nDid you know? The 'T' in T20 stands for Twenty, because each team gets to bat for twenty 'overs'! An 'over' is like a mini-round where one player bowls six balls to the other team.\n\n<h3>Who is Playing Today? Pakistan and Sri Lanka!</h3>\nToday, two wonderful teams are playing a very important game.\n\nOne team is from a country called Pakistan. They wear green shirts and are very good at cricket.\n\nThe other team is from a beautiful island country called Sri Lanka. They often wear blue uniforms.\n\nThese teams are like good friends who play a fun game together, but they both want to win!\n\n<h3>What's the Big News? Pakistan Needs a Big Win!</h3>\nSo, here's the exciting part! Pakistan needs to win their game against Sri Lanka today.\n\nBut not just any win! They need a *really, really big win*!\n\nImagine you're playing a game, and you need to score lots and lots of points to get to the next level. That's what Pakistan needs to do!\n\nThey need to play their absolute best today!\n\n<h3>What Does \"Already Eliminated\" Mean?</h3>\nYou know how in some games, if you don't score enough points, you can't play in the next round?\n\nWell, for Sri Lanka, sadly, they have already played their games and even if they win today, they won't go to the very next big round of the tournament.\n\nThey are still playing their best, because that's what good sports do! They will try their hardest anyway.\n\nBut it means Pakistan has a chance to win big and move forward in the competition.\n\n<h3>What is a \"Handsome Margin\"?</h3>\nWhen we say 'handsome margin,' it means winning by a lot! A really big difference in points!\n\nIn cricket, this could mean scoring many more runs than the other team. Imagine scoring 150 runs and the other team only gets 50 runs! That's a huge difference!\n\nOr, if Pakistan is bowling, it means getting the other team's players 'out' very quickly and for very few runs. So, they don't score much at all!\n\nIt's like winning by 10 goals in soccer, or a very high score in any game you play with your friends!\n\nPakistan needs to be super good today to win by a big, handsome margin!\n\n<h3>What is a \"Semifinal\"?</h3>\nWhy does Pakistan need to win so big? Because they want to get to something called the 'Semifinal'!\n\nThe T20 World Cup has many games. First, there are group games, then the 'Super Eights' (where Pakistan and Sri Lanka are now).\n\nAfter the Super Eights, come the Semifinals. These are very, very important games!\n\nA Semifinal is like a super-duper important game. It's the game *before* the final game that decides the champion!\n\nIf you win your Semifinal game, you get to play in the *Final* and have a chance to win the whole big trophy!\n\nSo, Pakistan really, really wants to reach that Semifinal!\n\nDid you know? The winner of the Final game gets a big, shiny trophy and is called the World Champion! Everyone wants to be the champion!\n\n<h3>Why is Winning by a Lot So Important? (Net Run-Rate Explained Simply)</h3>\nNow, here's a little trick in cricket called 'net run-rate'.\n\nIt's a fancy way to say how well a team has been scoring points and stopping the other team from scoring throughout all their games.\n\nImagine you're playing a game, and if two teams have the same number of wins, the one who scored *more points overall* (and let the other team score fewer points) gets to go to the next round.\n\nThat's kind of like net run-rate! Pakistan needs to show everyone they are really good by winning with many, many runs today.\n\nThis big win will help their 'net run-rate' number go up a lot, which is very good for them!\n\n<h3>Cheering for Fair Play and Fun!</h3>\nNo matter who wins today, we know both Pakistan and Sri Lanka will play with all their heart!\n\nSports are about trying your best, being fair, and having fun together.\n\nWe hope everyone enjoys the game and sees some amazing cricket!\n\nLet's all cheer for great sportsmanship and lots of smiles!\n\n<h3>Bye for Now!</h3>\nSo, that's the big news from the T20 World Cup today, my friends!\n\nRemember to always try your best in whatever you do, just like these amazing cricket players.\n\nKeep smiling, keep learning, and keep enjoying the wonderful world of sports!\n\nThis is your reporter, signing off from beautiful Africa! Bye for now!",
    "summary": "Pakistan needs to win their big cricket game against Sri Lanka by scoring lots and lots of points so they can go to the next important game called the Semifinal in the T20 World Cup.",
    "whyMatters": "This game is important because if Pakistan wins really big, they can get closer to winning the whole T20 World Cup trophy and become the champions!",
    "category": "world",
    "date": "2026-02-27T18:35:51.776Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Cricket%20Fun!%20Pakistan's%20Super%20Challenge!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-cricket-fun-pakistans-super-challenge",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/27/pakistan-vs-sri-lanka-t20-world-cup-super-eights-teams-start-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "Tram derails in Milan, leaving one dead and dozens injured",
    "title": "Tram derails in Milan, leaving one dead and dozens injured",
    "content": "The crowded tram was travelling in the centre of Milan at rush hour when it appeared to crash into the side of a building.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-27T18:35:57.255Z",
    "image": "https://image.pollinations.ai/prompt/Tram%20derails%20in%20Milan%2C%20leaving%20one%20dead%20and%20dozens%20injured%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tram-derails-in-milan-leaving-one-dead-and-dozens-injured",
    "originalLink": "https://www.bbc.com/news/articles/c5y599degnqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "title": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "content": "The latest attacks by Pakistan follow months of clashes between the two countries. despite agreeing to a fragile ceasefire in October.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:36:02.417Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20defence%20minister%20says%20country%20in%20'open%20war'%20with%20Afghanistan%20after%20strikes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-defence-minister-says-country-in-open-war-with-afghanistan-after-strikes",
    "originalLink": "https://www.bbc.com/news/articles/cvgjd7pv4y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "title": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "content": "Bombings by Pakistan are the most significant development in tensions between the two neighbours - though the physical impact remains unclear.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:36:07.542Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20after%20latest%20escalation%20in%20Pakistan-Afghanistan%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-after-latest-escalation-in-pakistan-afghanistan-tensions",
    "originalLink": "https://www.bbc.com/news/articles/cj32zx48xvxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chelsea to face holders PSG in Champions League last 16",
    "title": "Chelsea to face holders PSG in Champions League last 16",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League last 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-27T18:36:13.007Z",
    "image": "https://image.pollinations.ai/prompt/Chelsea%20to%20face%20holders%20PSG%20in%20Champions%20League%20last%2016%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chelsea-to-face-holders-psg-in-champions-league-last-16",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:36:18.133Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20needs%20to%20stay%20'fully%20focused'%20after%20Arsenal%20talk%20-%20Howe%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How do Man City's Muslim players adapt to Ramadan and what help do they get?",
    "title": "How do Man City's Muslim players adapt to Ramadan and what help do they get?",
    "content": "Muslims around the world are currently observing the Islamic holy month of Ramadan, including professional footballers, so how do Manchester City help their players?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T18:36:23.258Z",
    "image": "https://image.pollinations.ai/prompt/How%20do%20Man%20City's%20Muslim%20players%20adapt%20to%20Ramadan%20and%20what%20help%20do%20they%20get%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-do-man-citys-muslim-players-adapt-to-ramadan-and-what-help-do-they-get",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20lzy1n59lo?at_medium=RSS&at_campaign=rss"
  }
]