[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "content": "This is the highest number of confirmed casualties from a single African country in the Ukraine-Russia war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:26:25.655Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2055%20Ghanaians%20killed%20in%20Russia-Ukraine%20war%2C%20minister%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-55-ghanaians-killed-in-russia-ukraine-war-minister-says",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "content": "He used the girls' mother's life-threatening illness as an opportunity to demand sex, said the US Office of Public Affairs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:26:30.805Z",
    "image": "https://image.pollinations.ai/prompt/Former%20US%20diplomat%20sentenced%20to%20life%20for%20abusing%20two%20girls%20in%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "former-us-diplomat-sentenced-to-life-for-abusing-two-girls-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa beat Zimbabwe to set up NZ semi-final",
    "title": "South Africa beat Zimbabwe to set up NZ semi-final",
    "content": "South Africa produce an unconvincing performance with the bat as they beat Zimbabwe by five wickets to set up a semi-final against New Zealand",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:26:35.941Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20beat%20Zimbabwe%20to%20set%20up%20NZ%20semi-final%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-beat-zimbabwe-to-set-up-nz-semi-final",
    "originalLink": "https://www.bbc.com/sport/cricket/articles/cj0d11qrz9eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "India beat West Indies by five wickets to enter T20 World Cup semifinals",
    "title": "India beat West Indies by five wickets to enter T20 World Cup semifinals",
    "content": "Samson hits 97 not out, West Indian bowling falters in Kolkata as India set up World Cup semifinal against England.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:26:41.341Z",
    "image": "https://image.pollinations.ai/prompt/India%20beat%20West%20Indies%20by%20five%20wickets%20to%20enter%20T20%20World%20Cup%20semifinals%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "india-beat-west-indies-by-five-wickets-to-enter-t20-world-cup-semifinals",
    "originalLink": "https://www.aljazeera.com/sports/2026/3/1/india-beat-west-indies-by-five-wickets-to-enter-t20-world-cup-semifinals?traffic_source=rss"
  },
  {
    "originalTitle": "Black smoke pours from oil tanker near Strait of Hormuz",
    "title": "News Alert: Fire on a Big Oil Ship!",
    "content": "Hello amazing kids of Africa! It's your friendly news reporter, always ready to share exciting and important stories from around our big, beautiful world. Today, we have some news about a very big ship far, far away.\n\n<h3>A Giant Ship on Fire!</h3>\nImagine a ship so big, it's like a floating city! Well, a ship like that, called an \"oil tanker,\" had a problem. It caught fire in a busy part of the sea. There was lots of black smoke floating up into the sky.\n\nThis happened in a place called the Strait of Hormuz. It's a long way from Africa, but it's important for everyone. We saw pictures and videos of the fire. It looked scary, but don't worry, people are working hard to help.\n\n<h3>What is an Oil Tanker?</h3>\nAn oil tanker is like a giant swimming pool that floats! But instead of water, it carries a special liquid called oil. These ships are super, super big. They help carry oil from one country to another.\n\nThe oil is very important. It helps our cars drive and planes fly. It also helps make electricity in some places. So, these tankers are like important delivery trucks for oil!\n\nDid you know? Some oil tankers are longer than three football fields put together! They can carry enough oil to fill millions of car tanks. Imagine how much oil that is!\n\n<h3>What is Oil?</h3>\nOil is a thick, dark liquid that comes from deep, deep underground. It's like the earth's special juice! We can't drink it, but it helps power many things we use every day.\n\nWhen we clean the oil, it can be made into petrol for cars, diesel for trucks, and even the fuel that makes airplanes zoom through the sky. Oil also helps make plastics, which are in many toys and things around your home.\n\nDid you know? Oil was formed from tiny plants and animals that lived in the sea millions of years ago! They got buried under rocks and dirt, and over a very long time, they turned into oil.\n\n<h3>Where is the Strait of Hormuz?</h3>\nThe Strait of Hormuz is not a real road with cars, but a very narrow path in the sea. It's like a special water highway. Many, many ships travel through this narrow path every day.\n\nIt's between two countries far away, near a big ocean. Think of it like a very important gate for ships. If ships can't go through this gate easily, it can cause problems for everyone.\n\nDid you know? More than one-fifth (that's one out of five!) of all the oil that travels by sea goes through the Strait of Hormuz. That's a huge amount of oil every single day!\n\n<h3>Why is a Ship Fire Bad?</h3>\nWhen a big ship carrying oil catches fire, it's a big problem. First, it's very dangerous for the people working on the ship. We always hope everyone is safe.\n\nSecond, the fire makes a lot of black smoke. This smoke can be bad for the air we breathe. Also, if the oil spills into the sea, it can hurt fish, birds, and other animals that live in the ocean. The oil makes their feathers sticky and they can't swim or fly.\n\nDid you know? If oil spills into the sea, it can float on top of the water like a big, sticky blanket. This blanket blocks sunlight from reaching the plants and animals under the water.\n\n<h3>Who Helps When There's a Fire?</h3>\nWhen a big ship is on fire, special helpers come quickly! There are firefighters, just like the ones in your town, but these ones work on boats! They use powerful water cannons to try and put out the flames.\n\nOther boats also come to help. They might look for anyone who needs rescue. They also try to stop the oil from spreading if it spills. It's a very big team effort to keep everyone safe and clean up the sea.\n\n<h3>What Hit the Ship?</h3>\nThe news says that something hit the ship before it caught fire. We don't know exactly what it was. Sometimes, things can be thrown or shot, and we call that a \"projectile.\"\n\nBut the important thing is that nobody knows who or what sent it. People are now looking very carefully to find out exactly what happened. It's like being a detective to solve a mystery!\n\n<h3>Why Does This Matter to Us in Africa?</h3>\nYou might be thinking, \"This is far away, why should I care?\" Well, remember how we said oil is super important for many things? A lot of the oil that travels through the Strait of Hormuz goes to countries all over the world, including some in Africa!\n\nIf there are problems with ships carrying oil, it can make oil more expensive. And if oil is more expensive, it means that the fuel for the big trucks that bring food to your market might cost more. It could even make the electricity more expensive in some places if it's made using oil.\n\nSo, even though it's far away, what happens to these ships can touch our daily lives here in Africa. It reminds us that we are all connected in this big world!\n\nDid you know? Many countries in Africa use oil and gas to help power their homes, schools, and hospitals! It's used in cars, buses, and trains too.\n\n<h3>What Happens Next?</h3>\nNow, many clever people are working together. They are trying to put out the fire completely and make sure the ship is safe. They are also trying to find out exactly how the fire started.\n\nThey want to make sure such a thing doesn't happen again. And they will work hard to clean up any oil that might have spilled to protect our ocean friends.\n\nSo, that's the news for today, my friends! It's a reminder that even when problems happen far away, we learn about them, and people work hard to fix them. Keep exploring and asking questions!",
    "summary": "A very big ship carrying oil caught fire far away in a busy sea path called the Strait of Hormuz, and special helpers are working to put out the fire and keep everyone safe.",
    "whyMatters": "This matters because the big ship carries oil that many countries, including some in Africa, use for cars, electricity, and making things, so problems with these ships can make our daily things cost more money.",
    "category": "world",
    "date": "2026-03-01T18:27:08.763Z",
    "image": "https://image.pollinations.ai/prompt/News%20Alert%3A%20Fire%20on%20a%20Big%20Oil%20Ship!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-alert-fire-on-a-big-oil-ship",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/black-smoke-pours-from-oil-tanker-near-strait-of-hormuz?traffic_source=rss"
  },
  {
    "originalTitle": "“Trump chose an avoidable war over a good deal.”",
    "title": "“Trump chose an avoidable war over a good deal.”",
    "content": "Trita Parsi says Iran had offered major nuclear concessions and that Trump could have claimed diplomatic victory.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T18:27:13.895Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%9CTrump%20chose%20an%20avoidable%20war%20over%20a%20good%20deal.%E2%80%9D%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-chose-an-avoidable-war-over-a-good-deal",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/trump-chose-an-avoidable-war-over-a-good-deal?traffic_source=rss"
  },
  {
    "originalTitle": "At least 153 dead after reported strike on school, Iran says",
    "title": "At least 153 dead after reported strike on school, Iran says",
    "content": "Iran has blamed the US and Israel for the strike; the US is looking into reports of the incident, while the IDF says it is \"not aware\" of operations in the area.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:27:19.864Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%20153%20dead%20after%20reported%20strike%20on%20school%2C%20Iran%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-153-dead-after-reported-strike-on-school-iran-says",
    "originalLink": "https://www.bbc.com/news/articles/c1l7rvqq51eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nine dead in missile attack on Israel as Iran strikes region",
    "title": "Nine dead in missile attack on Israel as Iran strikes region",
    "content": "Several deaths are reported across the Middle East as Tehran retaliates for massive strikes by the US and Israel.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:27:24.999Z",
    "image": "https://image.pollinations.ai/prompt/Nine%20dead%20in%20missile%20attack%20on%20Israel%20as%20Iran%20strikes%20region%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nine-dead-in-missile-attack-on-israel-as-iran-strikes-region",
    "originalLink": "https://www.bbc.com/news/articles/c363zkp1pgxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Deadly Texas bar shooting is 'potentially an act of terrorism', FBI says",
    "title": "Deadly Texas bar shooting is 'potentially an act of terrorism', FBI says",
    "content": "Two people were killed and 14 injured, with the suspected gunman also shot dead on the scene.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:27:30.135Z",
    "image": "https://image.pollinations.ai/prompt/Deadly%20Texas%20bar%20shooting%20is%20'potentially%20an%20act%20of%20terrorism'%2C%20FBI%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "deadly-texas-bar-shooting-is-potentially-an-act-of-terrorism-fbi-says",
    "originalLink": "https://www.bbc.com/news/articles/cgjznzgly0po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Hearts & Motherwell the winners after damaging Old Firm stalemate'",
    "title": "'Hearts & Motherwell the winners after damaging Old Firm stalemate'",
    "content": "BBC Scotland's chief sportswriter Tom English evaluates the impact of Sunday's draw at Ibrox.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:27:35.726Z",
    "image": "https://image.pollinations.ai/prompt/'Hearts%20%26%20Motherwell%20the%20winners%20after%20damaging%20Old%20Firm%20stalemate'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hearts-and-motherwell-the-winners-after-damaging-old-firm-stalemate",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgqgzgqweklo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran, the US, and a World Cup that starts in three months",
    "title": "Iran, the US, and a World Cup that starts in three months",
    "content": "What does the US conflict with Iran mean for what was already set to be a highly politicised World Cup this summer?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T18:27:40.849Z",
    "image": "https://image.pollinations.ai/prompt/Iran%2C%20the%20US%2C%20and%20a%20World%20Cup%20that%20starts%20in%20three%20months%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-the-us-and-a-world-cup-that-starts-in-three-months",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20j8jnezl8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What now for 'epic' Scottish title race after Old Firm draw?",
    "title": "Super Fun Football Race in Faraway Scotland!",
    "content": "<h3>Hello, My Wonderful Friends!</h3>\n\nHello, hello, my amazing friends! Welcome to our special news from far, far away! Imagine a place called Scotland. It's a country with beautiful green hills and old castles. It's very far from Africa, but guess what? People there love playing games, just like you!\n\nOne of their favourite games is football! Have you ever played football? It's a game where two teams try to kick a round ball into a special net called a goal. Each team has many players, and they all work together.\n\n<h3>What is Football, Really?</h3>\n\nImagine you and your friends on a big grassy field. You have a ball, and your goal is to kick it into a net. But another team of friends wants to stop you! And they want to kick the ball into *your* net! That's football!\n\nIt's so much fun! Players run fast, they kick the ball, and sometimes they make amazing passes to their friends. Everyone tries their very best to score a goal. When a team scores a goal, everyone cheers loudly!\n\nDid you know? Football is played all over the world! It's the most popular sport ever! Millions of people love to play it and watch it.\n\n<h3>Teams and Points</h3>\n\nIn football, teams play games against each other. Each game is super important! If a team wins a game, they get special points. These points help them get closer to winning a big prize at the end of the year.\n\nThink of it like a fun contest. The team that wins a game gets three points. Wow, three points! If the game ends with both teams scoring the same number of goals, we call it a \"draw.\" This means no one wins and no one loses. Both teams get one point.\n\n<h3>The Big Race in Scotland!</h3>\n\nRight now, in Scotland, there is a very, very exciting football race happening! It’s like a super special competition. Many teams are playing, but two teams are trying extra hard to win the biggest prize.\n\nThese two teams are like friendly rivals. Their names are Celtic and Rangers. They are both very, very good at football! They want to be the best team in Scotland and win a beautiful trophy.\n\nA trophy is a shiny cup or prize that you get for being the winner! It shows everyone that your team worked the hardest and was the best.\n\n<h3>The Old Firm Draw</h3>\n\nRecently, Celtic and Rangers played a game against each other. This game is extra special because they are two of the biggest and most famous teams! When they play, it’s called an \"Old Firm\" game. Imagine how exciting that must be!\n\nEveryone watched with wide eyes. Both teams played with all their might! They ran, they kicked, they tried to score many goals. And guess what happened? The game ended in a \"draw\"!\n\nRemember what a draw means? It means both teams scored the same number of goals. So, no one team won, and no one team lost. Both teams got one point each from that game.\n\nDid you know? A normal football game lasts about 90 minutes! That's a long time to run and kick! But it's split into two halves, so players get a little rest in the middle.\n\n<h3>Why is a Draw Exciting?</h3>\n\nYou might think a draw is boring because no one won. But actually, in this big race, a draw makes things even MORE exciting! Why? Because it means the race to win the trophy is still super close!\n\nIf one team had won, they would have gotten three points and maybe jumped far ahead of the other team. But because it was a draw, both teams got one point. This keeps them very, very close to each other on the points table.\n\nImagine you are having a race with your friends. If you both finish at exactly the same time, it means you both tried so hard, and the race was very close! It makes the next part of the race even more thrilling!\n\n<h3>What Happens Next?</h3>\n\nSo, what happens now for these amazing teams in Scotland? They will keep playing more games! Every single game they play is important. They will try their best to win as many games as they can.\n\nThe teams will practice very hard. They will work together even more closely. They want to score more goals and get more points. The team with the most points when all the games are finished will be the champion! They will win the shiny trophy!\n\nDid you know? Teamwork is super important in football! When players work together, pass the ball, and help each other, they are much stronger! It's like when you work with your friends to build something amazing.\n\n<h3>Keep Trying Your Best!</h3>\n\nThis exciting football race in Scotland reminds us of something very important: always try your best! Whether you are playing a game, learning at school, or helping at home, trying your best makes you feel good.\n\nIt also shows us how much fun sports can be. When we play games, we make friends, we learn to work together, and we learn to be good sports, even if we don't win every time.\n\nSo, let's cheer for the teams in Scotland! They are showing us how exciting football can be and how important it is to never give up. Who will win the trophy? We will have to wait and see! But one thing is for sure: it will be a fun adventure watching them try!\n\nDid you know? Scotland is also famous for a friendly mythical creature called the Loch Ness Monster! It's a fun story!",
    "summary": "Teams in faraway Scotland are having a super close and exciting football race to win a big trophy, and a recent game between two top teams ended in a draw, making the competition even more thrilling!",
    "whyMatters": "This news is important because it shows us how fun and exciting sports like football can be, and how working together and always trying your best is a wonderful way to play and live!",
    "category": "world",
    "date": "2026-03-01T18:28:05.567Z",
    "image": "https://image.pollinations.ai/prompt/Super%20Fun%20Football%20Race%20in%20Faraway%20Scotland!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "super-fun-football-race-in-faraway-scotland",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70n9nr3dx6o?at_medium=RSS&at_campaign=rss"
  }
]