[
  {
    "originalTitle": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "title": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "content": "Insurgents have carried out a wave of drone strikes on military positions in the region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:49:02.086Z",
    "image": "https://image.pollinations.ai/prompt/How%20off-the-shelf%20drones%20are%20changing%20jihadist%20warfare%20in%20West%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-off-the-shelf-drones-are-changing-jihadist-warfare-in-west-africa",
    "originalLink": "https://www.bbc.com/news/articles/cew8vldpzdyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Senegal arrests 14 members of alleged paedophile gang linked to France",
    "title": "Our Police Heroes Keep Children Safe in Senegal!",
    "content": "Hello, amazing children of Africa! Your friendly news reporter here, bringing you some important news from a beautiful country called Senegal. Senegal is in West Africa, a place full of sunshine and wonderful people. Today, we want to talk about how super special our police officers are and how they keep everyone safe.\n\nOur police officers work very hard every single day. They are like real-life superheroes, wearing their uniforms and making sure our towns and villages are safe places to play and learn. They help us when we are lost, and they make sure that no one does anything bad.\n\n<h3>Big News from Senegal!</h3>\nRecently, our brave police officers in Senegal did something incredibly important. They found a group of people who were not being kind. These people were doing things that could hurt children, and that is not okay at all.\n\nBut guess what? Our police heroes worked quickly and cleverly! They found these people and made sure they could not do anything bad anymore. This is super good news because it means more children are safe.\n\n*Did you know?* Senegal is famous for its beautiful music and friendly people! It’s a place where children love to play football and learn in school.\n\n<h3>Police Heroes at Work!</h3>\nThink about your local police officers. They patrol our streets, help old people cross the road, and sometimes even help find lost pets! Their biggest job is to make sure everyone follows the rules and stays safe.\n\nIn this special situation, the police officers had to be extra brave and smart. They had to gather clues, just like detectives in a cartoon! They worked together to understand what was happening and how to help. They wanted to make sure all children could feel happy and secure.\n\n*Did you know?* Police officers train a lot to be strong and smart. They learn how to help people in all sorts of situations. They are very good at solving puzzles and finding out information!\n\n<h3>Working Together, Far and Wide</h3>\nThis story is even more amazing because the police in Senegal did not work alone. They got help from police officers in another country called France! Imagine friends from two different schools working together on a big project. That’s what happened!\n\nFrance is a country far away from Senegal, across a big ocean. But even though they are far apart, the police officers from both countries decided to help each other. They shared important information and worked as a team.\n\nThis shows us how important it is for everyone to work together. When people help each other, big problems can be solved, and everyone becomes safer. It's like building a big, strong wall of kindness around our children.\n\n*Did you know?* Africa is a huge continent with many amazing countries, and Europe is another continent. People from different continents can still be friends and help each other!\n\n<h3>Stopping the Not-So-Good Group</h3>\nThe group of people who were not kind had been doing their not-so-good things for a little while, since 2017. That’s a few years! But our police never gave up. They kept working hard to find them.\n\nFinally, the police officers caught these people. Now, they are stopped, and they cannot do any more bad things. This is a big victory for the good guys, and it makes Senegal an even safer place for all children.\n\nIt's important to remember that most people in the world are good and kind. But sometimes, there are a few people who forget how to be kind. That's why we have our police officers – to help us all stay safe from these rare not-so-good people.\n\n*Did you know?* The year 2017 was when many of you were just tiny babies or even before you were born! It shows how long the police worked to solve this.\n\n<h3>How You Can Be Safe and Super!</h3>\nNow, let’s talk about how YOU can be a super safety hero! It’s important for every child to know how to stay safe. Here are some simple tips:\n\n1.  **Always Talk to a Grown-Up You Trust:** If anything ever makes you feel scared, worried, or uncomfortable, tell a grown-up you trust right away. This could be your mom, dad, a grandparent, your teacher, or another family member. They will listen to you and help.\n\n2.  **Say \"No!\" if Something Feels Wrong:** Your feelings are very important! If someone asks you to do something that feels strange, bad, or makes you feel yucky, it’s okay to say \"NO!\" very loudly. You don't have to be polite if you feel unsafe.\n\n3.  **Be Careful with Strangers:** A stranger is someone you don’t know. It’s always best to stay with your grown-up and not go anywhere with someone you don't know, even if they seem friendly. If a stranger tries to talk to you or give you things, tell your grown-up immediately.\n\n*Did you know?* Your parents and teachers want to keep you safe more than anything in the whole wide world! They are always there to protect you.\n\n<h3>Always Tell a Grown-Up</h3>\nRemember, telling a grown-up is not \"telling tales\" when something makes you feel bad or unsafe. It’s being smart and brave! Grown-ups have big ears and big hearts, and they are there to help you solve problems.\n\nEven if someone tells you to keep a secret that makes you feel bad, it's never a good secret to keep. Good secrets are fun, like a surprise birthday party! Bad secrets make you feel worried or scared.\n\nSo, if you ever have a \"bad secret,\" please, please tell a trusted adult. They will know what to do to make everything okay again. You are never alone.\n\n*Did you know?* Asking for help is one of the bravest things you can ever do! It means you are strong enough to know when you need a helping hand.\n\n<h3>A Safer Place for Everyone</h3>\nThanks to our incredible police officers in Senegal and their friends in France, our communities are even safer. They will keep working hard every day to protect all of us.\n\nRemember, children are special, precious, and deserve to be happy and safe always. There are so many people who love you and want to keep you protected. You are loved, and you are safe.\n\nKeep playing, keep learning, and keep being the amazing children you are! And remember, our police heroes are always watching out for you.",
    "summary": "Police in Senegal, with help from France, have stopped a group of people who were not kind to children, making sure all kids are safer.",
    "whyMatters": "This is important because it shows our police officers are brave and work hard to protect children and keep everyone safe from people who do bad things. It reminds us that good people are always watching out for us.",
    "category": "world",
    "date": "2026-02-09T11:49:37.299Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Police%20Heroes%20Keep%20Children%20Safe%20in%20Senegal!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-police-heroes-keep-children-safe-in-senegal",
    "originalLink": "https://www.bbc.com/news/articles/cy4wy2xy300o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Colossus' of Ghanaian highlife music Ebo Taylor dies at 90",
    "title": "'Colossus' of Ghanaian highlife music Ebo Taylor dies at 90",
    "content": "The guitarist, composer and band leader fused Ghanaian music and funk to create tracks sampled around the world.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:49:42.467Z",
    "image": "https://image.pollinations.ai/prompt/'Colossus'%20of%20Ghanaian%20highlife%20music%20Ebo%20Taylor%20dies%20at%2090%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "colossus-of-ghanaian-highlife-music-ebo-taylor-dies-at-90",
    "originalLink": "https://www.bbc.com/news/articles/c1e9p04n8y9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Video: Building collapse in northern Lebanon kills people in apartments",
    "title": "Video: Building collapse in northern Lebanon kills people in apartments",
    "content": "A multi-storey apartment building collapsed in Lebanon's northern city of Tripoli, killing at least 14 people.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:49:47.787Z",
    "image": "https://image.pollinations.ai/prompt/Video%3A%20Building%20collapse%20in%20northern%20Lebanon%20kills%20people%20in%20apartments%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "video-building-collapse-in-northern-lebanon-kills-people-in-apartments",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/9/video-building-collapse-in-northern-lebanon-kills-people-in-apartments?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan can sell weapons in the Middle East, but can it sell security?",
    "title": "Pakistan's Big Plans to Help Keep the World Safe!",
    "content": "<h3>Hello, Amazing Adventurers!</h3>\n\nHello, amazing adventurers! Your friend, Uncle Kofi, is here again with some exciting news from around our big, beautiful world! Today, we're going on a special journey to a country very far away from our homes in Africa. It’s a country called Pakistan.\n\nImagine looking at a big map of the world. You’d find Pakistan quite far from us, but learning about other countries helps us understand how the whole world works together. It's like learning about different families in a big village!\n\nPakistan is a country with lots of people, beautiful mountains, and busy cities. Just like our own countries in Africa, Pakistan has its own special stories and its own big dreams!\n\n<h3>What Pakistan Makes to Share</h3>\n\nNow, let's talk about something really interesting Pakistan does. Pakistan is very good at making special things for armies. What are these special things? We can call them 'defence equipment' or 'special tools' that soldiers use. These are not toys, but important tools that help soldiers protect their country and its people.\n\nThink about it like this: your dad or mum might have special tools for their work, right? Maybe a builder has hammers and saws, or a doctor has stethoscopes. Well, Pakistan makes special tools for armies.\n\nThese special tools can be things like strong vehicles that can drive in tricky places, or special uniforms that keep soldiers safe, or even smart communication radios so soldiers can talk to each other over long distances. They are all designed to help keep a country safe and sound.\n\nPakistan makes these things very well. So well, in fact, that other countries want to buy them! When a country sells things it makes to another country, we call that 'exporting'. So, Pakistan 'exports' its special defence equipment.\n\nDid you know? Many countries around the world are very good at making certain things! Like some countries are famous for making cars, and others for making delicious chocolate, or even beautiful clothes. Pakistan is good at making things for armies!\n\n<h3>Friends Who Need Help: The Middle East</h3>\n\nSo, where does Pakistan send these special tools? It sends many of them to countries in a part of the world called the Middle East. The Middle East is another big region, just like our amazing continent of Africa is a region.\n\nCountries in the Middle East also want to keep their homes and people very safe. They want their soldiers to have the best equipment to do their important job. So, they look to countries like Pakistan to help them get these special tools.\n\nIt’s a bit like when you have a friend who is really good at drawing, and you ask them to help you draw a beautiful picture for school. Countries help each other out by sharing what they are good at.\n\n<h3>Pakistan's Big Dream: Selling Safety</h3>\n\nHere's where it gets even more interesting! Pakistan doesn't just want to sell special tools. It has an even bigger dream. Pakistan wants to 'sell security'. Now, can you really 'sell' safety? That sounds a bit funny, doesn't it?\n\n'Selling security' means Pakistan wants to help other countries become safer and more peaceful places. It's not about handing over a packet of safety! It's about sharing knowledge and training.\n\nImagine you want to learn how to ride a bicycle. Someone doesn't just give you 'bicycle riding'. They teach you how to balance, how to pedal, and how to steer. They help you *become* good at riding.\n\nIn the same way, Pakistan wants to teach other countries' soldiers how to be really good at protecting their people. They want to share smart ideas on how to keep peace and how to build strong armies that can protect their nation.\n\nIt's like being a very helpful big brother or sister who teaches a younger one how to be strong and careful. Pakistan wants to be that kind of helper for other countries in the world.\n\nDid you know? When countries help each other to become safer, it helps the whole world become a more peaceful and happy place for everyone! That’s why teamwork between countries is so important.\n\n<h3>Little Bumps on Pakistan's Road: Problems at Home</h3>\n\nBut even big, strong countries sometimes have their own challenges. Like when you want to run really fast, but you have a tiny stone in your shoe, right? It makes it a bit harder to run your best.\n\nPakistan also has some 'little bumps on its road'. We call these 'internal insecurity'. 'Internal' means inside the country itself. 'Insecurity' means sometimes things are not as peaceful or safe as everyone would like them to be.\n\nThis might mean there are sometimes disagreements between people, or small problems in some parts of the country. It's not that Pakistan is a bad country, no! It's just that, like any big family or community, there can be challenges that need fixing.\n\nWhen a country has problems inside its own borders, it needs to spend a lot of time and energy fixing those problems. It's like if you have a little tummy ache, you might not feel like playing your best game of football.\n\nDid you know? Every country in the world, no matter how big or small, has to work hard to keep its people happy, safe, and get along with each other! It's a continuous journey.\n\n<h3>How Bumps Affect Big Dreams</h3>\n\nSo, how do these 'little bumps' or problems inside Pakistan affect its big dream of selling safety to other countries? Well, it can make it a bit harder.\n\nIf Pakistan's leaders and soldiers are very busy trying to make things peaceful and safe inside their own country, they might not have as much time or energy to help other countries.\n\nIt's like our example: if you're busy taking care of your tummy ache, you can't teach your friend how to ride a bike as well as you'd like to. Your own problems come first.\n\nPakistan really wants to be a great helper to its friends in the Middle East and beyond. It wants to share its special tools and its clever ways of keeping safe. But to do that really, really well, Pakistan needs to be super strong and peaceful within its own home first.\n\nIts dream to 'sell security' is a wonderful dream, but it needs a very strong foundation – peace and safety inside Pakistan itself.\n\n<h3>Why This Matters to Us in Africa</h3>\n\nNow, you might be thinking, \"Uncle Kofi, why are we learning about a country so far away?\" That's a great question!\n\nLearning about countries like Pakistan helps us understand that everyone, everywhere, wants the same basic things: peace, safety, and a chance to live happily. We learn that countries, just like people, have big dreams and sometimes face challenges.\n\nWhen countries work to solve their problems and help each other, it makes the whole world a better place for all of us, no matter where we live. It shows us how important it is for everyone to try and live in peace.\n\nDid you know? Countries often learn from each other's experiences, both the good times and the challenging times! It helps everyone grow smarter and stronger.\n\n<h3>Keep Exploring, Brave Kids!</h3>\n\nSo, brave explorers, Pakistan is a country with clever people who make special tools and have a big dream to help other countries stay safe. But just like all of us, they also have to work hard to keep their own home peaceful and strong.\n\nIt's a wonderful lesson in how important it is for everyone, from a small child to a big country, to work on making their own 'house' a happy and safe place. Keep being curious about our amazing world, and I'll see you next time!\n",
    "summary": "Pakistan is a country that makes special tools for armies and wants to help other countries be safe, but it also has its own challenges to keep its people peaceful at home.",
    "whyMatters": "It matters because it shows us that every country, just like every person, has dreams to help others but also needs to be strong and peaceful within itself first.",
    "category": "world",
    "date": "2026-02-09T11:50:18.502Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan's%20Big%20Plans%20to%20Help%20Keep%20the%20World%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistans-big-plans-to-help-keep-the-world-safe",
    "originalLink": "https://www.aljazeera.com/opinions/2026/2/9/pakistan-can-sell-weapons-in-the-middle-east-but-can-it-sell-security?traffic_source=rss"
  },
  {
    "originalTitle": "Italy’s T20 World Cup debut ends with big loss against Scotland",
    "title": "Italy’s T20 World Cup debut ends with big loss against Scotland",
    "content": "World Cup debutants are dominated by Scotland in their first ever T20 World Cup match at Eden Gardens.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:50:23.672Z",
    "image": "https://image.pollinations.ai/prompt/Italy%E2%80%99s%20T20%20World%20Cup%20debut%20ends%20with%20big%20loss%20against%20Scotland%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "italys-t20-world-cup-debut-ends-with-big-loss-against-scotland",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/9/italys-t20-world-cup-debut-ends-with-big-loss-against-scotland?traffic_source=rss"
  },
  {
    "originalTitle": "Hong Kong court jails media tycoon and British citizen Jimmy Lai for 20 years",
    "title": "Hong Kong court jails media tycoon and British citizen Jimmy Lai for 20 years",
    "content": "Lai's supporters say this amounts to a death sentence, but authorities say it demonstrates the rule of law.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:50:29.299Z",
    "image": "https://image.pollinations.ai/prompt/Hong%20Kong%20court%20jails%20media%20tycoon%20and%20British%20citizen%20Jimmy%20Lai%20for%2020%20years%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hong-kong-court-jails-media-tycoon-and-british-citizen-jimmy-lai-for-20-years",
    "originalLink": "https://www.bbc.com/news/articles/c8d5pl34vv0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Japanese stocks surge as Takaichi secures historic election victory",
    "title": "Japanese stocks surge as Takaichi secures historic election victory",
    "content": "Prime Minister Sanae Takaichi's Liberal Democratic Party  secured 316 out of 465 seats in Sunday's election.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T11:50:34.456Z",
    "image": "https://image.pollinations.ai/prompt/Japanese%20stocks%20surge%20as%20Takaichi%20secures%20historic%20election%20victory%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "japanese-stocks-surge-as-takaichi-secures-historic-election-victory",
    "originalLink": "https://www.bbc.com/news/articles/cjd9k852zdjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Seahawks dominate Patriots to win Super Bowl",
    "title": "Seahawks dominate Patriots to win Super Bowl",
    "content": "The Seattle Seahawks produce a devastating defensive display to beat the New England Patriots and claim their second Super Bowl victory.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-09T11:50:39.620Z",
    "image": "https://image.pollinations.ai/prompt/Seahawks%20dominate%20Patriots%20to%20win%20Super%20Bowl%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "seahawks-dominate-patriots-to-win-super-bowl",
    "originalLink": "https://www.bbc.com/sport/american-football/articles/cjen2n5ql3zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "I'd resign if I wasn't still right for job - Howe",
    "title": "I'd resign if I wasn't still right for job - Howe",
    "content": "Eddie Howe says there is \"no doubt in my mind\" he is still the right manager for Newcastle despite one win in eight games.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-09T11:50:45.303Z",
    "image": "https://image.pollinations.ai/prompt/I'd%20resign%20if%20I%20wasn't%20still%20right%20for%20job%20-%20Howe%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "id-resign-if-i-wasnt-still-right-for-job-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxl8rnnneo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "title": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "content": "Manchester City's win at Liverpool ended in complete chaos - but did the referee and the VAR get Dominik Szoboszlai's red card right?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "entertainment",
    "date": "2026-02-09T11:50:50.476Z",
    "image": "https://image.pollinations.ai/prompt/'Killjoy'%20-%20did%20VAR%20get%20late%20drama%20in%20Liverpool%20v%20Man%20City%20right%3F%20realistic%20news%20photography%20context%20Entertainment%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killjoy-did-var-get-late-drama-in-liverpool-v-man-city-right",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yjkgyxk2mo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham in relegation battle, says Rooney",
    "title": "Tottenham in relegation battle, says Rooney",
    "content": "Tottenham Hotspur are in a relegation battle, says former England captain Wayne Rooney.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-09T11:50:55.645Z",
    "image": "https://image.pollinations.ai/prompt/Tottenham%20in%20relegation%20battle%2C%20says%20Rooney%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tottenham-in-relegation-battle-says-rooney",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn5gr167x3yo?at_medium=RSS&at_campaign=rss"
  }
]