[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Shiny Money Bouquets: A Special Gift with a Little Story!",
    "content": "<h3>Hello, Little Superstars of Africa!</h3>\n\nHi everyone! It's your friendly news reporter, here to tell you about something super interesting happening in Kenya. Have you ever seen beautiful flowers given as a gift? Of course! But imagine flowers made out of *money*! Yes, real money! These are called 'cash bouquets'. They look like a bunch of pretty flowers, but instead of petals, they have colourful banknotes folded up nicely. People in Kenya have been loving to give these special money-flower gifts, especially around holidays like Valentine's Day. It's a very sparkly and surprising way to give someone money.\n\n<h3>What Are Cash Bouquets?</h3>\n\nImagine a big bunch of roses or lilies. Now, imagine those roses are made from crisp, new banknotes! That's what a cash bouquet is. People carefully fold paper money, like Kenyan shillings, into shapes that look like flowers. Then, they put them all together with some real leaves or colourful ribbons to make a beautiful bouquet. It's like a special art project that holds a big surprise inside!\n\nDid you know? In Kenya, the money is called 'shillings'! Just like some countries have dollars or pounds, Kenya has shillings. They come in different colours and sizes, which makes them perfect for these money flowers!\n\n<h3>Why Do People Love Them?</h3>\n\nWell, giving a cash bouquet is super exciting! It’s a very creative way to give someone money. Instead of just putting money in an envelope, you give them a beautiful, surprising gift that looks amazing. Imagine seeing a friend's face light up when they get a bouquet, then they realize it's full of money! It's like getting two gifts in one – a pretty decoration and helpful money.\n\nPeople often give cash bouquets for birthdays, weddings, or even Valentine's Day to show love. It's a way to give a gift that the person can use for whatever they need or want, like new school supplies, a special treat, or saving up for something big. It makes giving money feel much more special and thoughtful.\n\nDid you know? Gifts are a way to show someone you care! Whether it's a drawing, a hug, or a special present, giving makes people happy.\n\n<h3>Uh Oh! A Little Warning!</h3>\n\nNow, here's where our story gets a little bit serious, but don't worry, we'll make it super simple! Some grown-ups, like people who work in the bank or for the government, have started to say we need to be careful with these cash bouquets. It's not because the bouquets themselves are bad, but because sometimes, bad people can use good things for wrong reasons. They want to make sure everyone is safe and fair when giving and receiving money.\n\nThese grown-ups are worried about two big things: something called 'money washing' and making sure everyone pays their 'fair share' to help our country. Let's learn a little bit about these big words!\n\nDid you know? Banks are like super safe houses for money! They help keep our money safe and help people save up for important things.\n\n<h3>What's 'Money Washing'? (Super Simple!)</h3>\n\nImagine someone has money that they got in a bad way, like from stealing or doing something against the rules. We call this 'dirty money.' Now, they want to make this dirty money look clean and normal, so no one asks questions. Using a cash bouquet is one way some bad people might try to 'wash' their dirty money. They might pretend it's a gift from someone good, so it looks like it came from a safe place.\n\nThis is not fair to everyone else who works hard for their money. The police and banks want to stop this 'money washing' so that bad people can't hide their wrong actions. They want to make sure all money used for gifts is good, clean money that came from honest work.\n\nDid you know? Honesty is super important! When you are honest, everyone trusts you, and it makes the world a better place.\n\n<h3>What About Taxes? (Super Simple Too!)</h3>\n\nOkay, another big word: 'taxes'. What are taxes? Think about all the wonderful things in our country: schools where you learn, roads where cars drive, hospitals where doctors help us, and even people who keep our streets clean. All these things cost money, right? The government collects a tiny bit of money from grown-ups who earn it, and that money is called 'tax'. It's like everyone putting a little bit of money into a big jar to help make our country better for everyone.\n\nWhen people give very, very big gifts of money, sometimes there are rules about telling the government. This is so the government knows how much money is moving around and can collect the right amount of 'tax' to help build more schools or fix more roads. If too many big cash bouquets are given without anyone knowing, it means the government might not get enough money to help everyone, and that's not fair.\n\nDid you know? When you save money in a piggy bank, you're learning how to be responsible with money! It's a great habit.\n\n<h3>What Should We Do?</h3>\n\nSo, what does all this mean for our lovely cash bouquets? It means we need to be smart and careful. The warnings are not to stop people from giving thoughtful gifts, but to make sure everyone follows the rules and stays safe. If someone wants to give a big money gift, it's often better to send it through a bank account, where everything is clear and recorded. This way, banks can keep an eye on things and make sure no 'money washing' is happening.\n\nIt's like playing a game with rules – everyone needs to follow them so the game is fair and fun for all. Grown-ups are simply reminding everyone about the rules of money.\n\nDid you know? Learning about money, even simple things like saving and spending wisely, is a very important life skill!\n\n<h3>Other Super Fun Ways to Show Love!</h3>\n\nEven with these warnings, there are so many amazing ways to show love and kindness! You don't always need a cash bouquet to make someone happy. Think about it:\n\n*   **Make a beautiful drawing:** A picture from the heart is priceless!\n*   **Help with chores:** Doing something kind for someone, like helping clean up, is a wonderful gift.\n*   **Give a real flower:** A fresh, sweet-smelling flower is always lovely.\n*   **Spend time together:** Playing games, reading a book, or just talking is a fantastic way to show you care.\n*   **Bake a special treat:** Yummy cookies or a cake can make anyone smile.\n\nDid you know? The best gifts often come from the heart and don't cost any money at all!\n\n<h3>Let's Be Smart and Kind!</h3>\n\nSo, my little friends, cash bouquets are a very interesting way to give a gift in Kenya. They look super cool, but it's good to know the whole story. We learned that giving money needs to be done in a way that is safe and fair for everyone. Always remember to be kind, be thoughtful, and follow the rules, whether it's with money or anything else. That way, everyone can be happy and safe!\n\nKeep shining, superstars!",
    "summary": "People in Kenya love giving special 'cash bouquets' made of money, but grown-ups are giving warnings to make sure everyone is safe and fair with how money is given as gifts.",
    "whyMatters": "This matters because it teaches us that even fun ways of giving gifts, like cash bouquets, need to follow rules to stop bad people from doing wrong things with money and to help our country by making sure everyone contributes fairly.",
    "category": "world",
    "date": "2026-02-14T14:22:05.493Z",
    "image": "https://image.pollinations.ai/prompt/Shiny%20Money%20Bouquets%3A%20A%20Special%20Gift%20with%20a%20Little%20Story!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "shiny-money-bouquets-a-special-gift-with-a-little-story",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:22:10.614Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "Africa's Big Voice in a Changing World!",
    "content": "Hello, my wonderful friends all over Africa! I'm your friendly news reporter, and I have some exciting news to share with you today. We live on the most amazing continent, Africa, full of sunshine, incredible animals, and super smart kids like you!\n\n<h3>A Big Country Far Away</h3>\nDid you know that there are many, many countries in the world? One very big country is called America. It is far away across the ocean. America has a special leader, just like your country has a president or a king. This leader helps America make important choices.\n\nSometimes, the leaders of big countries do things that change how all the countries in the world talk to each other. It's a bit like when you and your friends on the playground decide to play a new game. Everyone needs to learn the new rules!\n\n<h3>New Ways to Talk</h3>\nSo, the leader of America has made some new ideas about how countries should be friends and work together. This means that sometimes, things that used to be one way are now a little bit different. It's like changing the rules of a game you already know. Other countries need to figure out how to play by these new ideas.\n\nDid you know? The world has almost 200 countries! Each country has its own special people and culture.\n\nThis is called \"international relations,\" which just means how all the countries in the world get along and talk to each other. It's like a really big family of countries, and sometimes families have new ways of doing things.\n\n<h3>Africa Matters So Much!</h3>\nNow, you might be thinking, \"How does this affect me or my family in Africa?\" Well, Africa is a super important continent! We have 54 amazing countries, all with their own special stories and people.\n\nDid you know? Africa is the second-largest continent in the whole world! That's a lot of land and a lot of people!\n\nBecause Africa is so big and important, when things change in the world, Africa needs to make sure its voice is heard. We want to make sure that these new ways of talking between countries are good for Africa and all its people.\n\n<h3>Africa Wants to Speak!</h3>\nImagine you and your friends are deciding what game to play. Would you like to just listen to one friend decide everything? Or would you like to share your own ideas? Africa wants to share its ideas!\n\nThis is what we mean when we say Africa wants a \"seat at the table.\" It means Africa wants to be part of the grown-up talks where important decisions are made. Africa doesn't just want to be told what to do. Africa wants to help decide what happens!\n\nDid you know? The United Nations is a big group where almost all countries in the world meet to talk about peace and big problems. Africa has many voices there!\n\nOur leaders in Africa are working very hard to make sure that our continent is strong. They want to make sure that other countries listen to what Africa needs and wants. They want to make sure Africa is safe and happy.\n\n<h3>Working Together is Best</h3>\nTo make sure Africa's voice is extra strong, many African countries are working together. They are holding meetings and talking to each other. When many countries speak together, their voice becomes very powerful!\n\nIt's like when you and your friends all agree on something. Your teacher is more likely to listen to all of you together! African countries are doing this to help each other and to make the continent even better.\n\nDid you know? There is a special group called the African Union, which is like a big team for all the countries in Africa. They work together for a better Africa!\n\nThey talk about things like making sure everyone has enough food, going to school, and having good hospitals. They also talk about how to trade things with other countries around the world fairly.\n\n<h3>New Friends, Old Friends</h3>\nAfrica has many friends all over the world. We are friends with countries in Europe, Asia, and other places. It's important to have many friends because friends help each other.\n\nSometimes, the way leaders of countries talk can change. But Africa is strong and will keep making new friends and talking to its old friends. We want to be a friend to everyone who wants to be a friend to us!\n\nDid you know? Africa has some of the fastest-growing economies in the world. This means our countries are getting stronger and making more things!\n\n<h3>Building a Strong Africa</h3>\nOur African leaders are not just waiting to see what other countries do. They are busy building a stronger Africa! They are helping our own schools, building new roads, and making sure our farms grow lots of food.\n\nThey want to make sure that all the children in Africa, like you, have a super bright future. A future where you can grow up healthy, learn amazing things, and follow your biggest dreams.\n\nDid you know? Africa is home to incredible inventions and brilliant minds! Many amazing things have come from Africa, and many more will!\n\nSo, even though things in the world might be changing a little bit, remember that Africa is strong. We have smart leaders, amazing people, and the most beautiful land. Africa will keep shining brightly and speaking up for itself! You are part of this amazing future!\n",
    "summary": "Africa, our big and important continent, is working to make sure its voice is heard when leaders of faraway countries like America make big changes in how countries talk and work together, so that Africa can help decide its own bright future.",
    "whyMatters": "This is important because when countries talk to each other, it can change how we learn, how we trade, and how safe we are, so Africa wants to make sure its voice is heard loud and clear to make our lives even better!",
    "category": "world",
    "date": "2026-02-14T14:22:27.843Z",
    "image": "https://image.pollinations.ai/prompt/Africa's%20Big%20Voice%20in%20a%20Changing%20World!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "africas-big-voice-in-a-changing-world",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "England beat Scotland to get T20 World Cup bid back on track",
    "title": "England beat Scotland to get T20 World Cup bid back on track",
    "content": "England beat Scotland by five wickets in India to recover position in group at 2026 T20 World Cup.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:22:33.212Z",
    "image": "https://image.pollinations.ai/prompt/England%20beat%20Scotland%20to%20get%20T20%20World%20Cup%20bid%20back%20on%20track%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "england-beat-scotland-to-get-t20-world-cup-bid-back-on-track",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/england-beat-scotland-to-get-t20-world-cup-bid-back-on-track?traffic_source=rss"
  },
  {
    "originalTitle": "Swear words fly as cheating allegations made in curling at Winter Olympics",
    "title": "Swear words fly as cheating allegations made in curling at Winter Olympics",
    "content": "Two of curling's best men's teams, Sweden and Canada, involved in fiery and controversial match at Winter Olympics.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:22:38.329Z",
    "image": "https://image.pollinations.ai/prompt/Swear%20words%20fly%20as%20cheating%20allegations%20made%20in%20curling%20at%20Winter%20Olympics%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "swear-words-fly-as-cheating-allegations-made-in-curling-at-winter-olympics",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/curse-words-fly-as-cheating-allegations-made-in-curling-at-winter-olympics?traffic_source=rss"
  },
  {
    "originalTitle": "ICU patients’ lives at risk in Gaza’s Al-Aqsa Hospital amid Israel’s war",
    "title": "A Very Important Hospital Needs Our Hopes!",
    "content": "<h3>Hello from Africa!</h3>\nHi everyone! It's your kid-friendly news reporter here, coming to you from our amazing continent of Africa! Today, we're going to talk about something very important happening far, far away. It's about a hospital and how it helps people, and a big problem it's facing. Let's learn together!\n\n<h3>Hospitals: Places of Help and Hope</h3>\nDo you know what a hospital is? It's a very special building! When we feel sick, or if we get a little hurt, sometimes our parents take us to see a doctor. Hospitals are like super big doctor's offices. They have lots of doctors and nurses who help people feel better.\n\nHospitals have many special rooms. Some rooms are for kids, and some are for grown-ups. They have beds where people can rest and get strong again. Doctors and nurses work very hard all day and night to care for everyone.\n\nDid you know? The very first hospitals were built many, many years ago! People have always tried to help others who are sick or hurt.\n\n<h3>Meet Al-Aqsa Hospital in Gaza</h3>\nToday, we're talking about a hospital called Al-Aqsa Hospital. It's not in Africa, but in a place far away called Gaza. Gaza is a place where many families and children live. Just like us, kids in Gaza love to play, learn, and be happy.\n\nAl-Aqsa Hospital is like a hero for the people of Gaza. It helps so many boys, girls, moms, and dads when they are not feeling well. It is a place where hope lives, because people go there to get better.\n\nImagine if your friend was sick, and they needed help. The hospital would be the place they go. That's what Al-Aqsa Hospital does for its community. It's a big, busy place, always trying to heal.\n\n<h3>The Power of Electricity</h3>\nNow, let's talk about something super important: electricity! Do you know what electricity is? It's the special power that makes things work. It makes our lights turn on when it gets dark. It charges our phones or tablets so we can play games or watch videos.\n\nIn hospitals, electricity is even more important! It makes all the big, clever machines work. These machines help doctors and nurses do their jobs. They can help see inside your body or help you breathe.\n\nDid you know? Electricity travels super fast, almost like magic! It comes from big power stations and travels through wires to our homes and to hospitals.\n\n<h3>Machines That Help Us Breathe</h3>\nSome people in the hospital are very, very sick. They might have trouble breathing on their own. For these special patients, doctors use big machines called ventilators. These machines gently help people take breaths.\n\nThese very sick people are often in a special part of the hospital called the ICU. ICU stands for Intensive Care Unit. It's where the most careful help is given. Patients in the ICU need their machines to work all the time, day and night.\n\nImagine your favourite toy needing batteries to work. These hospital machines are like super-important batteries for people who are too sick to manage on their own. They need constant power to keep going.\n\n<h3>A Big Problem: Not Enough Power</h3>\nBut here's the sad news from Al-Aqsa Hospital in Gaza. There's a big problem. Because of a big fight, or a war, in their area, it's very hard for the hospital to get enough electricity. It's like a huge power cut, but even worse.\n\nThe hospital might soon have to \"ration\" its electricity. What does \"ration\" mean? It means they have to be super, super careful with the little power they have. They can't let every light or every machine stay on all the time.\n\nIt's like sharing a very small piece of cake with many friends. You have to give tiny bits to everyone, or some friends might not get any. The hospital has to decide which parts of the hospital get the power first.\n\n<h3>Making Hard Choices</h3>\nThis is a very, very hard choice for the doctors and nurses. They want to help everyone. But if they don't have enough electricity, they have to choose. They might have to pick which \"wards,\" or hospital rooms, get the precious power.\n\nAnd guess who needs the power the most? Yes, the very sick patients in the ICU. Their special breathing machines must stay on. If the power goes off for these machines, the sick people could be in big danger. Their lives could be \"at risk,\" which means they could get much, much worse.\n\nThis makes everyone at the hospital very worried. They work so hard to save lives, and this problem makes their job much harder. They need help to make sure all their machines can keep running.\n\nDid you know? Many hospitals around the world have backup generators, which are like big emergency power machines. But even those need fuel to run, and sometimes that fuel is hard to find in a war.\n\n<h3>Wishing for Peace and Help</h3>\nWhen we hear news like this, it makes us feel a little sad. We want all children and all people everywhere to be safe and healthy. Hospitals should always be safe places, full of light and hope, not darkness and worry.\n\nWe hope that Al-Aqsa Hospital gets the help it needs very, very soon. We hope they find a way to get enough electricity so all the machines can work. And we hope that peace can come to Gaza, so no one has to worry about these kinds of problems anymore.\n\nWe can all send kind thoughts and wishes for the doctors, nurses, and patients at Al-Aqsa Hospital. Let's hope they can keep helping everyone who needs them.\n\nDid you know? Doctors and nurses are heroes! They often work for very long hours to care for people, sometimes even sleeping at the hospital to be close to their patients.\n\n<h3>Standing Together (Even Far Apart)</h3>\nEven though Gaza is far from Africa, we are all part of one big world family. When one part of our family is hurting, we all feel it. It reminds us to be kind to each other every day, and to appreciate the safe and happy places we live in.\n\nLet's remember that even small acts of kindness can make a big difference. And let's always hope for peace, so all hospitals can keep their lights on and help everyone get well.",
    "summary": "A hospital in a place called Gaza might not have enough electricity for very sick people because of a war, and we hope they get help soon.",
    "whyMatters": "It matters because hospitals help people get better and stay alive, and everyone deserves to be safe and healthy, especially when they are very sick and need special machines to help them.",
    "category": "world",
    "date": "2026-02-14T14:23:02.017Z",
    "image": "https://image.pollinations.ai/prompt/A%20Very%20Important%20Hospital%20Needs%20Our%20Hopes!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-very-important-hospital-needs-our-hopes",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/icu-patients-lives-at-risk-in-gazas-al-aqsa-hospital-amid-israels-war?traffic_source=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:23:07.407Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Police activity under way near Nancy Guthrie's home",
    "content": "A search has been carried out in Tuscon, Arizona, close to where the 84-year-old was abducted nearly two weeks ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:23:12.512Z",
    "image": "https://image.pollinations.ai/prompt/Police%20activity%20under%20way%20near%20Nancy%20Guthrie's%20home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-activity-under-way-near-nancy-guthries-home",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T14:23:17.626Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:23:22.904Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Villa are still relying on old guard - and can it last?",
    "title": "Why Villa are still relying on old guard - and can it last?",
    "content": "Aston Villa's old guard have taken the club to new heights - but how long can it last?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:23:28.025Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Villa%20are%20still%20relying%20on%20old%20guard%20-%20and%20can%20it%20last%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-villa-are-still-relying-on-old-guard-and-can-it-last",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dny1gjde8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Guimaraes set to be out for two months with injury",
    "title": "Guimaraes set to be out for two months with injury",
    "content": "Newcastle United captain Bruno Guimaraes is expected to be out for a couple of months after sustaining a hamstring injury.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T14:23:33.145Z",
    "image": "https://image.pollinations.ai/prompt/Guimaraes%20set%20to%20be%20out%20for%20two%20months%20with%20injury%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guimaraes-set-to-be-out-for-two-months-with-injury",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj320gmz40no?at_medium=RSS&at_campaign=rss"
  }
]