[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Giant Fish and Big Smiles in Nigeria!",
    "content": "<h3>Hello, Super Kids!</h3>\nHello, super kids! Are you ready for some exciting news from Africa? Today, we are zooming to a wonderful country called Nigeria! Nigeria is a big country in West Africa, full of amazing people and stories.\n\nIn Nigeria, something super special just happened. It was a giant party and a big fish competition all rolled into one! Imagine a place where lots of people gather by the water, all excited to catch the biggest fish. That's exactly what happened at the Argungu Fishing Festival!\n\nIt's an old and very famous festival. People came from all over to join in the fun. Boys and girls, moms and dads, grandmas and grandpas – everyone was there! It was a time for fun, laughter, and making new friends.\n\n<h3>What is This Festival All About?</h3>\nA festival is like a big celebration! People come together to have fun, play games, and sometimes eat yummy food. This festival in Nigeria is extra special because it's mostly about fishing!\n\nIt's called the Argungu Fishing Festival. Can you say that? Ar-gun-gu! For many days, people get ready. They get their fishing nets ready, and they practice their fishing skills.\n\nThen, on the special day, everyone runs into the river to catch fish! It's not just any fish. They are looking for the biggest, most amazing fish in the water. It’s like a treasure hunt, but with fish!\n\n<h3>The Big Fishing Race!</h3>\nImagine hundreds of people standing by the river. The sun is shining brightly, making the water sparkle! Everyone is super excited, waiting for the signal.\n\nThen, a loud sound goes off – maybe a big drum or a whistle! WHOOSH! Everyone jumps into the water at the same time! It’s a giant splash!\n\nThey don't use fancy fishing rods like you might see on TV. Instead, they use special, traditional fishing nets and gourds. Gourds are like big dried fruits that can be used as scoops or floats.\n\nThey move quickly in the water, trying to find the best spots where the big fish hide. It's a big race to see who can find the biggest fish first! It looks like a giant splashy party, but everyone is very serious about catching fish!\n\nDid you know? Nigeria is a very big country in West Africa, and it has many different kinds of people and cultures! It's known for its vibrant music, art, and delicious food.\n\n<h3>More Than Just Fish! It's About Friendship!</h3>\nNow, here's the most wonderful part about this festival. It's not *just* about catching fish. This festival is also about making friends and helping everyone live together happily.\n\nLong, long ago, people in this area sometimes had arguments or disagreements. So, wise leaders thought of a clever way to bring everyone together, to laugh and play and forget about arguments.\n\nThey started this fishing festival! When people come to the festival, they meet old friends and make new ones. They share stories, they eat together, and they celebrate together.\n\nThis helps them be friendly and peaceful, like one big happy family. It helps \"cement local peace,\" which means it helps people stay friends and not fight. It builds strong bonds between communities.\n\n<h3>What Do Winners Get?</h3>\nAfter some time, people start coming out of the water with their catches. Some have small fish, some have medium fish, and then… WOW! Someone catches a really, really big fish!\n\nImagine a fish almost as big as you! Or even bigger! The person who catches the biggest fish is the winner! They don't just get a prize, they get lots of cheers and applause from everyone watching.\n\nIt's a big honor to win the Argungu Fishing Festival. Everyone respects them and their amazing fishing skills. It shows they are a very skilled fisher, and they get to feel very proud!\n\nDid you know? Some of the biggest fish caught at this festival can weigh more than 70 kilograms! That's heavier than a grown-up! Imagine trying to carry a fish that big!\n\n<h3>Fun and Food for Everyone!</h3>\nThe festival is not just about the fishing competition. Oh no! There's so much more! There's music playing loudly! People dance to happy rhythms and sing joyful songs. The air is filled with excitement and happiness.\n\nThere are yummy foods to eat. Imagine delicious snacks and meals made with fresh ingredients, often cooked over open fires. The smells are just wonderful!\n\nSometimes, there are other fun activities too, like boat races where people paddle very fast, or traditional wrestling competitions. It's a vibrant and joyful time for the whole community.\n\nA \"community\" means all the people who live in one place, like your town or village. Everyone in the community comes together to celebrate and have fun.\n\nDid you know? Festivals like this help keep old traditions alive! Traditions are special ways of doing things that have been passed down for many, many years, from grandmas and grandpas to their children and grandchildren.\n\n<h3>Why This Festival is So Special for Africa</h3>\nThis festival in Nigeria is a shining example of African culture. It shows how important community is, how people love to come together and celebrate.\n\nIt shows that even a fun activity like fishing can help people be kind and peaceful with each other. It teaches us that playing together and celebrating together can help us forget our differences and become friends.\n\nIt reminds us that our traditions are precious and help us understand where we come from. So, the next time you hear about a festival, remember the Argungu Fishing Festival in Nigeria.\n\nIt's a place where big fish and big smiles come together to make big friendships! Hip hip hooray for Nigeria and its amazing fishing festival!",
    "summary": "The Argungu Fishing Festival in Nigeria is a big, exciting party where people catch giant fish and come together to make friends and keep peace in the community.",
    "whyMatters": "This festival is important because it brings people together, helps them live peacefully by building friendships, and celebrates their culture and traditions in a fun and exciting way.",
    "category": "world",
    "date": "2026-02-22T10:20:01.361Z",
    "image": "https://image.pollinations.ai/prompt/Giant%20Fish%20and%20Big%20Smiles%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "giant-fish-and-big-smiles-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Big News from Cameroon: Rules Are for Everyone!",
    "content": "<h3>Hello, Super Friends!</h3>\nHello, super friends! It's me, your kid-friendly news reporter, coming to you from beautiful Africa! Today, we have some very important news from a country called Cameroon. It's a place with sunny skies and lots of amazing animals, just like many parts of our big continent.\n\n<h3>What Happened in Cameroon?</h3>\nSometimes, in different places, things can get a little tricky. In Cameroon, there was a time when some people were very sad and worried. Sadly, some soldiers, who are supposed to keep everyone safe, hurt many people. These people were not soldiers; they were just regular people, like you and me, or your family. We call them \"civilians.\"\n\n<h3>What is a Soldier?</h3>\nDid you know that soldiers are usually very important helpers? They wear uniforms and train hard to protect their country and the people who live there. Their job is to keep everyone safe from danger. They have very important rules to follow, just like you have rules at school or at home.\n\n<h3>What is a Civilian?</h3>\nA civilian is someone who does not work in the army. They are everyday people. They can be grandmas, grandpas, moms, dads, brothers, sisters, or even little kids like you! Civilians go to school, play games, work in shops, or farm the land. They are just trying to live their lives peacefully.\n\n<h3>The Sad Part</h3>\nBut sadly, in Cameroon, a few soldiers forgot their important rules. Instead of protecting civilians, they hurt many of them very badly. Sadly, some even died. This made many, many people very, very sad. It’s never okay to hurt innocent people. Everyone deserves to be safe and happy in their homes and communities.\n\n<h3>Justice Steps In!</h3>\nNow, here is the important news! For a long time, people wondered if anything would happen to these soldiers. But guess what? Something very important just happened! Three of these soldiers, who hurt the civilians, have now been told they must go to a special place. This special place is like a school for people who have broken very big rules. It’s called a \"prison.\"\n\n<h3>What is a Prison?</h3>\nDid you know that a prison is a place where people go when they have done something very wrong? It's not a happy place. People go there so they can think about what they did, learn from their mistakes, and understand why rules are so important. It’s a way to make sure that everyone follows the rules and that bad things don’t happen again.\n\n<h3>Why This News is Special</h3>\nThis news is very special because it doesn't happen very often. Usually, it can be very hard for soldiers to get into trouble for doing bad things. But this time, it shows that *everyone* must follow the rules. It shows that even people in important jobs, like soldiers, will be asked to be fair and kind. It means that rules are for everyone, no matter who you are.\n\n<h3>Did you know? Fact about Rules!</h3>\nDid you know that rules help us all stay safe and happy? Imagine if there were no rules for games like soccer or hide-and-seek! It would be very messy and no fun at all. Rules help us play fair and get along!\n\n<h3>A Step Towards Fairness</h3>\nThis decision means that the people of Cameroon are taking a big step towards being fair. It tells everyone that hurting innocent people is always wrong. It tells everyone that there are consequences for bad actions. And it tells the civilians who were hurt that their voices are heard and that justice is important.\n\n<h3>About Cameroon</h3>\nCameroon is a wonderful country in West Africa. It's sometimes called \"Africa in miniature\" because it has so many different kinds of landscapes, like beaches, mountains, and rainforests!\n\n<h3>Languages in Cameroon</h3>\nDid you know that in Cameroon, many people speak French, and many other people speak English? Sometimes, because of these two different languages, people can have different ideas and sometimes feel upset. The part of Cameroon where these sad events happened is a place where many people speak English. We call it the \"Anglophone region.\"\n\n<h3>Hopes for the Future</h3>\nThis news gives hope that things can get better. It shows that leaders want to make sure everyone is safe and treated fairly. It's like when you have a problem with a friend, and then you both talk about it and find a way to be friends again. It takes time, but it's important to try.\n\n<h3>Why Justice Matters</h3>\nJustice is like making sure that everyone gets what they deserve, and that fairness wins. If someone does something wrong, like taking your toy without asking, it's fair that they say sorry and give it back. If someone hurts others, it's fair that they learn why that was wrong and face consequences. This helps everyone feel safe.\n\n<h3>Did you know? Fact about Africa!</h3>\nDid you know Africa is the second-largest continent in the world? It has 54 different countries, each with its own special stories and people! Cameroon is one of those amazing countries!\n\n<h3>A Message of Hope</h3>\nSo, even though the news started with something sad, the end of the story today is about hope and fairness. It means that people are working hard to make sure everyone in Cameroon, especially the civilians, can feel safe and happy again. It reminds us all to be kind, follow the rules, and stand up for what is right. We want all children in Africa to grow up in a world where everyone is treated with love and respect.",
    "summary": "In good news for fairness, some soldiers in Cameroon who hurt regular people will now go to a special place called a prison because rules are for everyone.",
    "whyMatters": "This is important because it shows that even people in big jobs like soldiers must follow rules, and that hurting innocent people is always wrong, helping everyone feel safer and know that justice will be served.",
    "category": "technology",
    "date": "2026-02-22T10:20:23.426Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Cameroon%3A%20Rules%20Are%20for%20Everyone!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-cameroon-rules-are-for-everyone",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "Oh No! Our Farm Animals Need Help in South Africa!",
    "content": "Hello, super friends! It's your kid-friendly news reporter from beautiful Africa! Today, I have a story to tell you about some of our important farm animals in a place called South Africa. Some of our lovely cows, sheep, and goats are feeling a bit poorly. They have a sickness called Foot-and-Mouth Disease, and it's making them very uncomfortable. Don't worry, lots of grown-ups are working super hard to help them feel better!\n\n<h3> What is Foot-and-Mouth Disease? </h3>\nImagine you had a bad cold, and your mouth felt sore, and your feet hurt a little when you walked. That's a bit like what Foot-and-Mouth Disease is for animals. It's a special kind of germ that makes their mouths and their feet get sore spots. These sore spots make it hard for them to eat their yummy grass or walk around happily in the fields. It's like having tiny blisters.\n\nThis germ can spread very, very quickly from one animal to another. If one cow gets it, its friends might get it too! That's why grown-ups need to be very careful and act fast to stop it from spreading to many farms. It can make a whole lot of animals sick.\n\n<b>Did you know?</b> Foot-and-Mouth Disease is NOT the same as 'Hand, Foot, and Mouth Disease' that little kids sometimes get. It's only for animals like cows, sheep, and pigs. You can't catch Foot-and-Mouth Disease from a cow!\n\n<h3> Who is Getting Sick? </h3>\nThe animals most affected are those we see on farms, like cattle (that's another word for cows!), sheep, goats, and sometimes pigs. These animals are really important to us and to the farmers who care for them. Cows give us milk, which we drink and use to make cheese and yogurt. Sheep give us wool to make warm clothes, and they also give us meat. Goats give us milk and meat too. Pigs are also an important source of food.\n\nWhen these animals get sick, they don't grow big and strong. They might not give as much milk, or their wool might not be as good. Farmers love their animals very much, and it makes them sad to see their animals suffer. It also means they might not have as much food or other things to sell, which can make things hard for their families. Many, many animals have become sick in different parts of South Africa, and farmers are very worried.\n\n<h3> Why is This a Problem for Farmers? </h3>\nFarmers are special people who work very hard every day to look after their animals and grow food for us. They wake up early and go to bed late, making sure their animals are fed, safe, and happy. When Foot-and-Mouth Disease comes to their farm, it's a very big problem. The sick animals need extra care, just like when you're sick and your mom or dad takes special care of you.\n\nIf many animals get sick, farmers might not be able to sell their milk or meat. This means they lose money that they need to buy food for their own families, or to buy more animal food, or to fix things on their farm. It's like if you had a toy shop and all your toys suddenly broke – it would be very difficult to sell them, right?\n\nSometimes, to stop the sickness from spreading even more, very tough decisions have to be made. Animals that are very sick might need to be kept separate, or in very sad cases, they might even have to be put to sleep so that the disease doesn't spread to other farms and other healthy animals. This is a very hard thing for farmers to do.\n\n<b>Did you know?</b> Farmers are sometimes called the 'backbone' of a country because they provide us with so much essential food and resources!\n\n<h3> What is Being Done to Help? </h3>\nOkay, so what are the grown-ups doing to fix this big problem? The grown-ups who work for the 'government' (these are the people who help run the country and make sure everyone is safe and healthy) are working very hard. They have started a special plan to help the animals. This plan is called a 'vaccination programme'.\n\nWhat is a vaccination? It's like giving the animals a special tiny shield! The grown-ups give the animals a 'shot' or an injection, which has a special medicine called a vaccine inside. This vaccine helps the animal's body learn how to fight off the Foot-and-Mouth germ. It makes them stronger and helps them not get sick, or at least not get as sick.\n\nImagine you're going to play a game, and someone gives you special armour to wear so you don't get hurt. That's what a vaccine does for animals! It protects them. They are giving these shots to many, many animals on the farms in South Africa right now.\n\n<b>Did you know?</b> Scientists work very hard to make vaccines! They study germs and find ways to help bodies fight them off. Vaccines have helped save millions of lives, both animal and human!\n\n<h3> A Little Bit of Trouble </h3>\nSometimes, even grown-ups can make mistakes or be a bit slow. Some people are saying that the grown-ups in charge were a little bit slow to start giving these special vaccine shots to the animals. This means the disease might have spread to more animals before they could stop it.\n\nBut now, everyone is working as fast as they can! They are trying their very best to make sure every animal that needs it gets a vaccine. It's important to learn from what happened so that next time, everyone can act even faster to protect our amazing farm animals. We hope they can catch up quickly and protect all the animals.\n\n<h3> How Can We Help (Even Little Kids)? </h3>\nEven though we are kids, we can still help in our own ways! We can learn about what's happening and understand why farmers and their animals are so important. We can talk to our parents and teachers about it. We can be thankful for the food we eat and the clothes we wear that come from these animals.\n\nWe can also send happy thoughts and wishes for the animals to get well soon! When we learn about things like this, we become smarter and more caring citizens of our beautiful Africa. Every little bit of understanding helps us to be better friends to our planet and its creatures.\n\n<b>Did you know?</b> Many kids in Africa live on farms or have family members who are farmers! They learn how to care for animals from a very young age. It's a very important job!\n\nSo, even though our farm animals are facing a tough time in South Africa with Foot-and-Mouth Disease, we know that many wonderful people are working super hard to help them. With vaccines and lots of care, we hope our animal friends will be healthy and happy again very soon. Let's send them all our positive energy! Thanks for listening, and keep being curious about the world around you!",
    "summary": "Farm animals like cows and sheep in South Africa are getting sick with Foot-and-Mouth Disease, but grown-ups are giving them special medicine shots called vaccines to help them get better.",
    "whyMatters": "This matters because farm animals give us important food like milk and meat, and when they are sick, farmers are sad and can't make enough money to take care of their families, so helping the animals keeps everyone healthy and happy.",
    "category": "world",
    "date": "2026-02-22T10:20:51.482Z",
    "image": "https://image.pollinations.ai/prompt/Oh%20No!%20Our%20Farm%20Animals%20Need%20Help%20in%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oh-no-our-farm-animals-need-help-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ryan Garcia defeats Mario Barrios to win WBC welterweight title",
    "title": "Ryan Garcia defeats Mario Barrios to win WBC welterweight title",
    "content": "Garcia is the new world champion after a unanimous points decision victory against title holder.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:20:56.821Z",
    "image": "https://image.pollinations.ai/prompt/Ryan%20Garcia%20defeats%20Mario%20Barrios%20to%20win%20WBC%20welterweight%20title%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ryan-garcia-defeats-mario-barrios-to-win-wbc-welterweight-title",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/22/ryan-garcia-defeats-mario-barrios-to-win-wbc-welterweight-title?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan ‘kills dozens’ in air strikes on Afghanistan",
    "title": "Planes in the Sky: A Story About Neighbors Far Away",
    "content": "Hello, my wonderful friends! It's your kid-friendly news reporter from Africa here, ready to tell you a story about some countries far, far away. We always want to know what's happening in our big world, even if it's not right here in Africa. Today, we're talking about two countries that are neighbors, just like you might have a neighbor next door.\n\n<h3>A Story About Neighbors Far Away</h3>\nImagine your house, and then imagine your friend's house right next to yours. You are neighbors! Well, countries can be neighbors too. Our story today is about two countries called Pakistan and Afghanistan. They are big countries, and they share a border, which is like an invisible line on the ground that shows where one country ends and another begins.\n\nThese countries are not in Africa. They are very far away, in a big continent called Asia. So, while they are far from our homes, they are still part of our big, wonderful world. And just like sometimes friends or neighbors might have a disagreement, sometimes countries do too.\n\nDid you know? The world has nearly 200 countries! Each one is special and has its own people, languages, and stories.\n\n<h3>What Happened? Planes in the Sky!</h3>\nNow, here's the news part. Something happened between Pakistan and Afghanistan. Pakistan sent some special planes into the sky. These planes flew over parts of Afghanistan.\n\nAnd what did these planes do? They hit some places on the ground. When we say 'hit places,' it means they made loud noises, like a big boom, in certain spots. It's a very serious thing when planes do this.\n\nPakistan said they sent these planes because they believed some people who were causing trouble – we can call them 'bad people' or 'troublemakers' – were hiding in those spots in Afghanistan. Pakistan said these troublemakers were causing problems for their country, and they wanted to stop them.\n\nDid you know? Planes can fly really, really high, sometimes even above the clouds! Some planes are used to carry people, and some are used by countries for special missions.\n\n<h3>Why Did This Happen? Looking for Safety</h3>\nEvery country wants its people to be safe. Just like your mommy and daddy want you to be safe at home and at school, the leaders of countries want all the people in their country to be safe from any harm or bad things.\n\nPakistan said that these 'bad people' hiding in Afghanistan were making things unsafe for the people in Pakistan. So, they decided to send their planes to try and get rid of those troublemakers.\n\nIt's a bit like if someone keeps taking your toys and your grown-ups try to stop them to keep your toys safe. Countries try to keep their people safe from dangers.\n\nDid you know? One of the most important jobs of a country's leader is to make sure everyone who lives there is safe and happy!\n\n<h3>What Are \"Air Strikes\"?</h3>\nYou might hear grown-ups use a big word like 'air strikes.' That's what happened here. An 'air strike' is when airplanes or special flying machines are used to hit specific targets on the ground. Think of it like a very, very serious game of hitting a target, but it's not a game at all. It's real, and it's done by a country's army to try and stop what they see as a threat.\n\nWhen planes do an air strike, they drop things that explode when they reach the ground. This is done to destroy buildings or places where bad people might be hiding. It's a way some countries try to solve very big and serious problems, especially when they think people are dangerous.\n\nDid you know? Not all planes are used for air strikes! Most planes you see in the sky carry people for holidays or bring important goods like food and clothes to different places.\n\n<h3>Wishing for Peace and Talking</h3>\nWhen people have problems with their neighbors, what's the best thing to do? Talk! When you have a disagreement with a friend, you talk about it, right? You try to find a way to make things better so everyone can be happy again.\n\nIt's the same for countries. When neighbor countries have problems, the best way to solve them is usually by talking to each other. Talking can help them understand each other and find a peaceful solution, which means no more fighting or sending planes to hit places.\n\nEveryone wants peace. Peace means being safe, happy, and not having to worry about fighting. We hope that Pakistan and Afghanistan can talk and find a way to have peace for all their people.\n\nDid you know? Many wise people believe that talking and listening are the best tools for solving almost any problem, big or small!\n\n<h3>Why This Matters, Even Far Away</h3>\nEven though Pakistan and Afghanistan are far from our homes in Africa, what happens there still matters. We are all people who share this amazing planet. When there's trouble in one part of the world, we wish for things to get better, just like we would for our own family and friends.\n\nWe want all children, everywhere, to be safe and to live in peace. So, we hope the leaders of these countries can work together, talk to each other, and find a way to stop the troublemakers and make sure everyone can live safely and happily.\n\nDid you know? The whole world is like one big, connected village! What happens far away can sometimes affect us all, which is why it's good to learn about the world.\n\nWe will keep watching and hoping for peace for everyone in our big world!",
    "summary": "Pakistan sent planes to hit some places in Afghanistan, saying bad people who were causing trouble for them were hiding there, and we hope the countries can talk to each other to find peace and keep everyone safe.",
    "whyMatters": "This matters because everyone wants to be safe, and when countries argue and send planes, it can make people scared, so it's important to hope for peace and for countries to talk to solve their problems.",
    "category": "technology",
    "date": "2026-02-22T10:21:17.149Z",
    "image": "https://image.pollinations.ai/prompt/Planes%20in%20the%20Sky%3A%20A%20Story%20About%20Neighbors%20Far%20Away%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "planes-in-the-sky-a-story-about-neighbors-far-away",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/22/pakistan-kills-dozens-in-air-strikes-on-afghanistan?traffic_source=rss"
  },
  {
    "originalTitle": "Sean Strickland ends Anthony Hernandez’s win streak with TKO victory",
    "title": "Sean Strickland ends Anthony Hernandez’s win streak with TKO victory",
    "content": "The third-ranked Strickland hands Hernandez his first UFC defeat in more than five years.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:22.315Z",
    "image": "https://image.pollinations.ai/prompt/Sean%20Strickland%20ends%20Anthony%20Hernandez%E2%80%99s%20win%20streak%20with%20TKO%20victory%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sean-strickland-ends-anthony-hernandezs-win-streak-with-tko-victory",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/22/sean-strickland-ends-anthony-hernandezs-win-streak-with-tko-victory?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:28.071Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan launches strikes on Afghanistan, with Taliban saying dozens killed",
    "title": "Pakistan launches strikes on Afghanistan, with Taliban saying dozens killed",
    "content": "Pakistan says the strikes were retaliation for recent suicide bombings in the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:33.254Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20launches%20strikes%20on%20Afghanistan%2C%20with%20Taliban%20saying%20dozens%20killed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-launches-strikes-on-afghanistan-with-taliban-saying-dozens-killed",
    "originalLink": "https://www.bbc.com/news/articles/cdxgln3gnd6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "title": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "content": "The announcement by the head of Venezuela's National Assembly comes amid US pressure following the capture of ex-President Nicolás Maduro.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:38.417Z",
    "image": "https://image.pollinations.ai/prompt/More%20than%201%2C500%20Venezuelan%20political%20prisoners%20apply%20for%20amnesty%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-than-1500-venezuelan-political-prisoners-apply-for-amnesty",
    "originalLink": "https://www.bbc.com/news/articles/c93w9g2dvn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "O'Reilly scores twice as Man City beat Newcastle",
    "title": "O'Reilly scores twice as Man City beat Newcastle",
    "content": "Manchester City move to within two points of Premier League leaders Arsenal with a tense victory against Newcastle United at Etihad Stadium.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:43.883Z",
    "image": "https://image.pollinations.ai/prompt/O'Reilly%20scores%20twice%20as%20Man%20City%20beat%20Newcastle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oreilly-scores-twice-as-man-city-beat-newcastle",
    "originalLink": "https://www.bbc.com/sport/football/videos/cre09v8yglqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "title": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "content": "Chelsea make it 17 points dropped from winning positions in the Premier League this season as Zian Flemming's 93rd-minute header gives Burnley a 1-1 draw, after Wesley Fofana is sent off at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T10:21:49.045Z",
    "image": "https://image.pollinations.ai/prompt/Ten-man%20Chelsea%20drop%20points%20again%20as%20Burnley%20score%20stoppage-time%20equaliser%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ten-man-chelsea-drop-points-again-as-burnley-score-stoppage-time-equaliser",
    "originalLink": "https://www.bbc.com/sport/football/videos/cedz2v0edpgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late Abraham goal rescues point for Villa against Leeds",
    "title": "Late Abraham goal rescues point for Villa against Leeds",
    "content": "Tammy Abraham comes off the bench to score an 88th minute equaliser to cancel out Anton Stach's spectacular freekick, as Aston Villa rescue a 1-1 draw against Leeds United at Villa Park in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T10:21:54.205Z",
    "image": "https://image.pollinations.ai/prompt/Late%20Abraham%20goal%20rescues%20point%20for%20Villa%20against%20Leeds%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-abraham-goal-rescues-point-for-villa-against-leeds",
    "originalLink": "https://www.bbc.com/sport/football/videos/cy8gn54mr0jo?at_medium=RSS&at_campaign=rss"
  }
]