[
  {
    "originalTitle": "Girl, 14, shot dead as South Africa's 'taxi wars' hit school",
    "title": "Girl, 14, shot dead as South Africa's 'taxi wars' hit school",
    "content": "Violence has plagued South Africa's highly competitive and lucrative taxi industry for decades.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T17:54:43.515Z",
    "image": "https://image.pollinations.ai/prompt/Girl%2C%2014%2C%20shot%20dead%20as%20South%20Africa's%20'taxi%20wars'%20hit%20school%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "girl-14-shot-dead-as-south-africas-taxi-wars-hit-school",
    "originalLink": "https://www.bbc.com/news/articles/c62gz17999eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Is Ethiopia heading back to war in Tigray?",
    "title": "Keeping Our Friends in Tigray Safe and Happy!",
    "content": "<h3>Hello From Your Kid Reporter!</h3>\nHello, wonderful friends! It's me, Zola the Zebra Reporter, your kid-friendly news pal from right here in Africa! I'm so excited to chat with you today about something very important. We're going to talk about a special place in a beautiful country called Ethiopia. Ethiopia is a big, sunny land in Africa, full of amazing animals, tall mountains, and kind people. It's a place where children love to play and learn, just like you! Today, we're going to learn about a part of Ethiopia called Tigray. Sometimes, when we learn about the world, we hear about people moving from their homes. We want to understand why and wish them all the very best, don't we?\n\n<h3>Meet Our Friends in Tigray</h3>\nTigray is a region in the north of Ethiopia. Think of it like a very big neighborhood or a state within a country. Lots and lots of families live there. They have lovely homes, green farms, and busy towns. Children in Tigray go to school, help their parents, and love to play games with their friends under the African sun. They might play with handmade toys, kick a ball, or tell stories to each other. Their parents work very hard, perhaps growing food like grains or raising animals. It's a place full of life and laughter, just like where you live.\n\n<h3>Why Do People Sometimes Move From Their Homes?</h3>\nImagine your very own cozy bed and all your favorite toys in your room. You feel safe and happy there, right? You know where everything is, and you feel comfortable. But sometimes, families need to move from their homes. Maybe they move to a new house in the same town, or even to a different city far away. Why do they do this? Most often, it's because they want to find a place where they feel even safer. Or maybe they want to find a place where it's easier to get yummy food for their family every day. Sometimes, they move for a new job, or to be closer to their family members. Everyone wants their family to be happy and to have everything they need.\n\n**Did you know?** Ethiopia is famous for its delicious coffee! Many people say coffee was first discovered there a very, very long time ago. So, the next time an adult is drinking coffee, you can tell them it might have come from Ethiopia! Yum!\n\n<h3>A Time for Peace and Smiles</h3>\nA few years ago, in Tigray, things were not very easy for a while. It was a sad and challenging time for many families. It was like when friends have a big disagreement, and everyone feels a bit sad and worried. People found it hard to get enough food, and sometimes it was not very safe to go outside. But then, something wonderful happened! Everyone decided they wanted peace more than anything. Peace means everyone is safe, everyone is kind to each other, and everyone can live happily together without worries. So, big leaders and many people talked and talked. They worked very, very hard to bring peace back to Tigray. And for a while, things started to get much better. Children could go to school, families could farm their land, and everyone felt much happier and safer. It was a time for big smiles and hopeful hearts!\n\n<h3>Why Are Some People Moving Again Now?</h3>\nNow, we hear some news that a few more people are moving from Tigray again. You might wonder why, especially after everyone worked so hard for peace. Well, sometimes, even after a big problem is solved, there are still little bits that are tricky. Imagine you're building a tower with your favorite blocks. You finish it, and it looks super strong! But then, you notice one block feels a little bit wobbly. You want to make sure your tower is super-duper strong so it won't fall down, right? It's a bit like that in Tigray. People are still trying to make sure everything is super strong and super safe for everyone, all the time. Sometimes, they still worry about how to get enough food or if their homes are completely safe. So, some families decide to move to a different place where they feel more certain about these important things.\n\n**Did you know?** Ethiopia is one of the oldest countries in the world! It has a very long and interesting history, full of ancient kingdoms and brave people who have built amazing things over thousands of years!\n\n<h3>Making Sure Everyone Has Enough Yummy Food</h3>\nOne of the biggest reasons people worry or decide to move is if it's hard to get enough food. Imagine feeling very hungry all the time. That's not nice at all, is it? To grow big and strong like a superhero, children need healthy food every single day. They need bread, milk, fruits, and vegetables to have energy to play and learn. So, if families in Tigray find it hard to get enough yummy food for their children, they might look for places where it's easier to find food. Everyone wants their tummy to be full and happy so they can grow up healthy and strong.\n\n<h3>The Importance of Feeling Safe and Sound</h3>\nAnother super important thing is feeling safe and sound. When you are in your home, you want to feel like a big, warm hug is around you, protecting you from any worries. You want to know that you can play outside with your friends without any fear, or sleep soundly in your bed at night. If people in Tigray feel like they are not completely safe, or if they hear things that make them a little bit scared, they might decide it's best to move to a place where they feel more protected and secure. It's like finding a super cozy blanket when you're a bit chilly, or a strong umbrella when it's raining – you want to feel protected.\n\n**Did you know?** There are over 80 different languages spoken in Ethiopia! That's like having friends from all over the world, right in one country! Imagine trying to learn to say hello in 80 different ways!\n\n<h3>Working Towards a Brighter Day</h3>\nEven though some people are moving, it doesn't mean that everyone has given up on peace! Oh no! Lots of wonderful people, big and small, are still working very, very hard to make sure Tigray is a peaceful and happy place for all its children. They are like busy bees, trying to make sure there's enough food for everyone and that everyone feels super safe in their homes. Leaders, helpers, and even just kind neighbors are all trying their best to fix those wobbly blocks and make the tower of peace super strong. We all want all the children in Tigray to have happy smiles and full tummies every day, so they can grow up to be amazing people.\n\n<h3>What Can We Do, My Little Friends?</h3>\nSo, what can we do, my little friends, from wherever we are in the world? We can send our kindest thoughts and biggest wishes to the children and families in Tigray. We can hope with all our hearts that they find safe places to live and plenty of food to eat. We can remember that everywhere in the world, people want to live in peace and be kind to each other. When we are kind to our friends at school, when we share our toys, and when we help our family at home, we are helping to make the world a more peaceful place, one little bit at a time. Every act of kindness is like planting a tiny seed for a big, beautiful garden of peace that can grow all over the world!\n\n**Did you know?** The capital city of Ethiopia is called Addis Ababa. It's a very big and busy city, full of exciting things to see and do, like markets, museums, and beautiful parks!\n\n<h3>Let's Share Our Hopes for Peace!</h3>\nLet's keep hoping that all the families in Tigray can soon return to their homes, or find new, happy homes, where they can live with big smiles and no worries. Let's hope that peace grows strong like a giant baobab tree in Africa, sheltering everyone under its kindness and strength. We send our love and best wishes to all the children and families of Ethiopia! Remember, we are all one big family on this amazing planet, and we all want the same things: safety, food, and lots of happiness!",
    "summary": "Some families in Tigray, Ethiopia, are moving from their homes again because they want to feel safe and make sure they have enough food, even though many people are working hard to keep peace after a difficult time a few years ago.",
    "whyMatters": "It's important because everyone, especially children, deserves to live in a safe home with enough food and without worries, and we hope all our friends in Tigray can find that peace and happiness.",
    "category": "technology",
    "date": "2026-02-26T17:55:19.004Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Our%20Friends%20in%20Tigray%20Safe%20and%20Happy!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-our-friends-in-tigray-safe-and-happy",
    "originalLink": "https://www.bbc.com/news/articles/cwygrnjz9wro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nigeria to hold inquest into death of Chimamanda Ngozi Adichie's toddler",
    "title": "Asking Questions to Help Everyone Get Better Care!",
    "content": "<h3>Hello, Super Friends!</h3>\n\nHello, super friends! It's your friendly news reporter, here from our amazing continent, Africa! We have some important news to share today from a country called Nigeria. Sometimes, sad things happen, but when they do, it's really good to ask questions and learn. That's what's happening right now in our wonderful Nigeria.\n\nToday, we are talking about a very special lady. Her name is Chimamanda Ngozi Adichie. Can you say that? Chi-ma-man-da Ngo-zi A-di-chie! She is a famous storyteller! She writes amazing books that people all over the world love to read. Her stories teach us about life and about Nigeria. She is like a magic word painter, using words to make us see, feel, and understand so many things.\n\n<h3>Who is Chimamanda? A Special Storyteller!</h3>\n\nImagine someone who can make up whole worlds with just words! That's what Chimamanda does. She writes books for grown-ups and sometimes even for young people. Her books are so good that they have won many, many big awards! People in Nigeria are very proud of her, and so are people all around the world. She helps people understand what it's like to live in Nigeria and other places.\n\nShe travels to different countries to talk about her stories and her ideas. She encourages everyone, especially girls and boys, to be smart, to read, and to use their voices. So, when something happens to someone so special, everyone wants to know more and to help.\n\n<h3>A Very Sad Thing Happened</h3>\n\nBut Chimamanda is also a mummy. She has children she loves very much. And sadly, something very, very sad happened to her tiny baby. Her baby got very sick. Hospitals are places where doctors and nurses work super hard to help sick people get better. They have special machines and medicines. The baby was taken to a hospital called Euracare to get help.\n\nEven with all the doctors and nurses trying their very best, the baby didn't get better. It's very sad to say, but Chimamanda's baby sadly passed away. When something like this happens, it makes everyone very, very sad. It’s okay to feel sad when we hear about sad news. Everyone feels sad when a little baby can't stay with their family.\n\nChimamanda, like any mummy, was very heartbroken. She wants to understand why her baby got so sick and why the doctors couldn't save her baby. She believes that maybe the hospital, Euracare, did not take good enough care of her baby. She thinks maybe they made some mistakes. But the hospital says, “No, we tried our very, very best to help the baby.”\n\n<h3>What is an \"Inquest\"? Asking Lots of Questions!</h3>\n\nSo, because of this very sad story, the grown-ups in charge in Nigeria are going to do something called an \"inquest.\" What's an inquest? It's like being super-duper detectives! It's a special meeting where people ask lots and lots of questions. They will try to find all the pieces of the puzzle to understand exactly what happened.\n\nThey will talk to the doctors and nurses who took care of the baby at the Euracare hospital. They will look at all the papers that show what kind of care the baby got. They want to hear from everyone involved – from Chimamanda and from the hospital. Their job is to find out the truth.\n\nAn inquest is not about saying someone is bad. It's about finding out facts. It's about learning. Imagine if you lost your favourite toy, and you wanted to know where it went. You would ask questions, look everywhere, and try to remember everything, right? An inquest is like that, but for very serious things. They want to gather all the information to understand the full story.\n\n<h3>Why Are These Questions Important?</h3>\n\nThis is a super important job! Why? Because when we ask questions and find answers, it helps us learn. It helps us make sure that hospitals are the safest places they can be for all the babies and grown-ups who need help when they are sick or hurt. It’s about making sure everyone gets the very best care possible.\n\nIf the inquest finds out that something could have been done better, then the hospital can learn from it. They can change things so that no other baby or person gets sick in the same way. It's about making sure our hospitals in Africa are the best they can be. It's about making sure we protect our future – all the children who will need care.\n\nWhen we know more, we can make things better for the future. It’s a way for our leaders and doctors to say, \"We care about everyone, and we want to do our very best to keep you healthy and safe.\" This helps bring peace to families like Chimamanda's, knowing that their sad experience can help others.\n\n<h3>Did You Know? Amazing Facts!</h3>\n\n*   **Did you know?** Nigeria is a very big country in Africa! Lots and lots of people live there. It's famous for its delicious food like jollof rice, beautiful music, and incredible stories!\n*   **Did you know?** Doctors and nurses are like real-life superheroes! They work so hard, day and night, to help people feel better when they are sick or hurt. They study for many years to learn how to do their important jobs.\n*   **Did you know?** Chimamanda writes stories that are so good, they win big awards all over the world! Her books are read by children and grown-ups, teaching everyone about kindness, bravery, and important life lessons.\n*   **Did you know?** An inquest is a special kind of meeting where people look very, very closely at how something happened, especially if it was a sad accident or something unexpected. They want to learn so it doesn't happen again.\n*   **Did you know?** Staying healthy is super important! Eating yummy fruits and vegetables, drinking lots of water, playing outside, and washing your hands often can help you stay strong and avoid getting sick!\n\n<h3>Making Things Better for the Future</h3>\n\nSo, remember, even when sad things happen, people work together to understand why and to make things better. That's what Nigeria is doing now – looking for answers with kindness and care. They want to make sure that our hospitals are the best and safest places for everyone, especially for our tiny babies and children.\n\nBy asking questions and learning from what happened, we can help all hospitals be even safer and better places for everyone in Africa. We hope that this inquest helps bring comfort to Chimamanda and her family and makes things better for all families in Nigeria.\n\nStay safe, be kind, and keep asking questions, my friends! See you next time for more important news from our wonderful Africa!",
    "summary": "Nigeria is holding a special meeting, called an inquest, to understand what happened to the baby of famous writer Chimamanda Ngozi Adichie, who sadly passed away, with Chimamanda saying the hospital didn't care for her baby well, which the hospital denies.",
    "whyMatters": "This is important because by asking questions and finding answers, everyone hopes to make sure hospitals are very safe and give the best care to all babies and people who get sick in the future.",
    "category": "technology",
    "date": "2026-02-26T17:55:42.227Z",
    "image": "https://image.pollinations.ai/prompt/Asking%20Questions%20to%20Help%20Everyone%20Get%20Better%20Care!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "asking-questions-to-help-everyone-get-better-care",
    "originalLink": "https://www.bbc.com/news/articles/cwygr2nzdp9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Afghanistan says it launches attacks against Pakistan",
    "title": "Friends Far Away: Helping Countries Be Kind Neighbours!",
    "content": "Jambo everyone! That means 'hello' in Swahili, a language many of us speak here in Africa! I'm your friendly news reporter, and I'm here to share some exciting news from far, far away. We love to learn about different places and people, don't we? It's like exploring a big, wonderful map! Today, we are going to learn about two countries that are neighbours. They are far from us, in a place called Asia. But even though they are far, we care about them, just like we care about our own friends and family here. We always hope for peace and happiness for everyone, everywhere in the world.\n\n<h3> Meet Our Neighbours Far Away! </h3>\nOur story today is about two countries called Afghanistan and Pakistan. Can you say those names? Afghanistan and Pakistan. They share a border, which is like a very long line on the ground that shows where one country stops and another begins. Imagine your garden and your neighbour's garden – there's a fence or a line, right? That's a bit like a border, but much, much bigger for countries! These countries are full of beautiful mountains, lovely rivers, and many, many people who live there. People in these countries have homes, go to school, play games, and eat yummy food, just like us!\n\nDid you know? Afghanistan is famous for its beautiful carpets and delicious pomegranates! Pakistan has very tall mountains, even some of the highest in the world!\n\n<h3> What's This Big News About? </h3>\nSometimes, even good neighbours or friends might have a little disagreement. Maybe about a toy, or who gets to play first. Well, sometimes countries have big disagreements too. They might have different ideas about things that happen near their shared border. Recently, there has been some big news because the country of Afghanistan said it was talking very strongly to its neighbour, Pakistan. This means they are trying to sort out a problem they have. It's like when you have a problem with a friend, and you need to talk it through to make things better. The grown-ups in charge of the countries want to find a way to make everything peaceful and safe for everyone.\n\nDid you know? Talking is often the best way to solve problems, even for big countries!\n\n<h3> Why Do Countries Talk? </h3>\nWhen countries have problems, they don't always know what to do. But wise grown-ups know that talking is the best way to make things better. So, leaders from Afghanistan and Pakistan are trying to talk to each other. They want to understand each other better. They want to find fair solutions so that all the people living in both countries can be safe and happy. It's like when your teacher helps two friends solve a problem. The teacher listens to both sides and helps them find a happy way forward. That's what grown-ups in countries try to do! They want everyone to feel safe and have a good life.\n\nDid you know? Many countries have special people called diplomats, whose job it is to talk to other countries and solve problems peacefully!\n\n<h3> What Do People Want? </h3>\nGuess what? No matter where you live in the world, most people want the same things! People in Afghanistan want to be safe in their homes. They want their children to go to school and learn. People in Pakistan want peace too. They want to play outside without worrying and live happy lives. Everyone wants their families to be healthy and to have enough food to eat. When countries have disagreements, it can sometimes make people feel worried. That's why it's so important for the leaders to talk and make things good again. So everyone can feel safe and live their best lives, playing, learning, and growing strong.\n\nDid you know? The United Nations is a very big group of countries that work together to help keep peace around the world!\n\n<h3> Being Good Neighbours </h3>\nBeing a good neighbour is important, whether it's next door or between two countries! Good neighbours help each other. They talk nicely. They try to understand each other's feelings. When Afghanistan and Pakistan talk, they are trying to be good neighbours. They are trying to find ways to make sure their shared border is a safe and friendly place. This helps trade happen, so people can buy and sell things. It helps families visit each other if they live on different sides of the border. It helps everyone feel more secure. When countries are good neighbours, everyone benefits, and the whole world feels a little bit friendlier.\n\nDid you know? Many families live across borders, with relatives in both countries! Good relations help them visit each other.\n\n<h3> Let's Hope for Friendship! </h3>\nSo, this news is about countries talking, trying to solve problems, and hoping for peace. It's a reminder that even when things are a bit tricky, talking and trying to understand each other is always the best way. We hope that the leaders of Afghanistan and Pakistan will find a good way forward. We hope that peace and friendship will grow between them. Just like we want peace and friendship in our homes and schools, we want it for countries too. Let's send our happy thoughts and wishes for a bright and peaceful future for all the children and families in Afghanistan and Pakistan! It’s important to remember that even big problems can be solved with kind hearts and lots of talking.\n\nDid you know? Children all over the world learn about being kind and sharing, which are very important lessons for countries too!",
    "summary": "Leaders from Afghanistan and Pakistan are having important talks to solve a disagreement and hope for peace and friendship between their countries.",
    "whyMatters": "It's important because when countries talk and solve problems peacefully, everyone, especially children, can live safely, go to school, and play without worries, making the world a friendlier place.",
    "category": "world",
    "date": "2026-02-26T17:56:05.428Z",
    "image": "https://image.pollinations.ai/prompt/Friends%20Far%20Away%3A%20Helping%20Countries%20Be%20Kind%20Neighbours!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-far-away-helping-countries-be-kind-neighbours",
    "originalLink": "https://www.aljazeera.com/news/2026/2/26/afghanistan-says-it-launches-attacks-against-pakistan?traffic_source=rss"
  },
  {
    "originalTitle": "India beat Zimbabwe by 72 runs to chase T20 World Cup semifinal spot",
    "title": "India beat Zimbabwe by 72 runs to chase T20 World Cup semifinal spot",
    "content": "India knocked out a defiant Zimbabwe in a high-scoring match in Chennai to keep alive their chances of making the semis.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T17:56:10.616Z",
    "image": "https://image.pollinations.ai/prompt/India%20beat%20Zimbabwe%20by%2072%20runs%20to%20chase%20T20%20World%20Cup%20semifinal%20spot%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "india-beat-zimbabwe-by-72-runs-to-chase-t20-world-cup-semifinal-spot",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/26/india-beat-zimbabwe-by-72-runs-to-chase-t20-world-cup-semifinal-spot?traffic_source=rss"
  },
  {
    "originalTitle": "Trump U-turn: Is Venezuelan oil really available to Cuba again?",
    "title": "Trump U-turn: Is Venezuelan oil really available to Cuba again?",
    "content": "The US says it will licence entities to sell the oil to Cuba except those linked to the Cuban government and military.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-26T17:56:15.797Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20U-turn%3A%20Is%20Venezuelan%20oil%20really%20available%20to%20Cuba%20again%3F%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-u-turn-is-venezuelan-oil-really-available-to-cuba-again",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/26/trump-u-turn-is-venezuela-oil-really-available-to-cuba-again?traffic_source=rss"
  },
  {
    "originalTitle": "Danish PM calls snap election with Greenland issue centre-stage",
    "title": "Danish PM calls snap election with Greenland issue centre-stage",
    "content": "The issue of Greenland, which Donald Trump wants to annex, is likely to dominate the election campaign.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-26T17:56:21.403Z",
    "image": "https://image.pollinations.ai/prompt/Danish%20PM%20calls%20snap%20election%20with%20Greenland%20issue%20centre-stage%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "danish-pm-calls-snap-election-with-greenland-issue-centre-stage",
    "originalLink": "https://www.bbc.com/news/articles/ckg3e63jwj8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US and Iran hold talks seen as crucial to prevent conflict",
    "title": "US and Iran hold talks seen as crucial to prevent conflict",
    "content": "The indirect negotiations in Geneva are seen as a last-ditch effort, but the chances of a nuclear agreement are unclear.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T17:56:26.595Z",
    "image": "https://image.pollinations.ai/prompt/US%20and%20Iran%20hold%20talks%20seen%20as%20crucial%20to%20prevent%20conflict%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-and-iran-hold-talks-seen-as-crucial-to-prevent-conflict",
    "originalLink": "https://www.bbc.com/news/articles/cvg1vd95nl9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Four convicted over spyware scandal that shook Greece",
    "title": "Four convicted over spyware scandal that shook Greece",
    "content": "In what became known as \"Greece's Watergate\", surveillance software called Predator was used to target 87 people.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T17:56:31.811Z",
    "image": "https://image.pollinations.ai/prompt/Four%20convicted%20over%20spyware%20scandal%20that%20shook%20Greece%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "four-convicted-over-spyware-scandal-that-shook-greece",
    "originalLink": "https://www.bbc.com/news/articles/cj6dx4886rpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A 'normal guy' doing 'brilliant' things - Lammens on life at Man Utd",
    "title": "A 'normal guy' doing 'brilliant' things - Lammens on life at Man Utd",
    "content": "Manchester United goalkeeper Senne Lammens says he is \"just a normal guy\", but his reputation is growing in an impressive debut season at Old Trafford.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T17:56:37.429Z",
    "image": "https://image.pollinations.ai/prompt/A%20'normal%20guy'%20doing%20'brilliant'%20things%20-%20Lammens%20on%20life%20at%20Man%20Utd%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-normal-guy-doing-brilliant-things-lammens-on-life-at-man-utd",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2l01g40ygo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How have Chelsea made biggest loss in English football history?",
    "title": "How have Chelsea made biggest loss in English football history?",
    "content": "Chelsea recorded a pre-tax loss of £355m for 2024-25 - the highest loss ever made by an English football club - according to financial figures released by Uefa. How did it happen?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-26T17:56:42.607Z",
    "image": "https://image.pollinations.ai/prompt/How%20have%20Chelsea%20made%20biggest%20loss%20in%20English%20football%20history%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-have-chelsea-made-biggest-loss-in-english-football-history",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxjyk54zpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Fans of richest PL clubs pay £74 per match as ticket revenue soars",
    "title": "Fans of richest PL clubs pay £74 per match as ticket revenue soars",
    "content": "Fans of the Premier League's six wealthiest clubs are paying an average of £74 per ticket for each match they attend, while ticket revenues are soaring, according to data from a new report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-26T17:56:47.812Z",
    "image": "https://image.pollinations.ai/prompt/Fans%20of%20richest%20PL%20clubs%20pay%20%C2%A374%20per%20match%20as%20ticket%20revenue%20soars%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fans-of-richest-pl-clubs-pay-pound74-per-match-as-ticket-revenue-soars",
    "originalLink": "https://www.bbc.com/sport/articles/c2lrxyw4p02o?at_medium=RSS&at_campaign=rss"
  }
]