[
  {
    "originalTitle": "Flights delayed for up to 20 hours as  Kenya airport staff strike for second day",
    "title": "Flights delayed for up to 20 hours as  Kenya airport staff strike for second day",
    "content": "Airlines are urging travellers to check their flight status before heading to the crowded airport.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-17T10:40:02.828Z",
    "image": "https://image.pollinations.ai/prompt/Flights%20delayed%20for%20up%20to%2020%20hours%20as%20%20Kenya%20airport%20staff%20strike%20for%20second%20day%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "flights-delayed-for-up-to-20-hours-as-kenya-airport-staff-strike-for-second-day",
    "originalLink": "https://www.bbc.com/news/articles/c363096kd5po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Fake funeral suspects allegedly used hearse to smuggle charcoal in Malawi",
    "title": "The Tricky Car and the Secret Bags!",
    "content": "Hello, my amazing friends! I'm your special news reporter from beautiful Africa! Today, I have a story that sounds a little bit like a mystery, but don't worry, we'll solve it together. It happened in a wonderful country called Malawi, which is right here in Africa!\n\n<h3>A Special Car with a Secret</h3>\nImagine a very long, special car. This car is called a 'hearse' (say 'herse'). It's usually used for very, very sad times when someone has passed away, and it carries a big box called a coffin. But in our story, this special car was used for something else!\n\nOne day, some grown-ups were driving this special car in Malawi. It looked like they were going to a sad event, because there was a big, empty box inside, like a coffin. But guess what? It was a trick!\n\n<h3>What Was the Trick?</h3>\nUnderneath that big, empty box, hidden very carefully, were lots and lots of bags! What was inside these bags? It wasn't toys or sweets. It was something called charcoal. Have you heard of charcoal before?\n\n**Did you know?** Charcoal is black, burnt wood! People make it by burning wood in a special way until it turns black and hard. It's often used to make fires for cooking food.\n\n<h3>What is Charcoal For?</h3>\nMany, many families in Malawi and other parts of Africa use charcoal every single day! They use it to cook their yummy food. It makes a fire that helps pots get hot, so they can cook delicious meals like nsima, which is a popular food in Malawi. So, charcoal is super important for many homes.\n\n<h3>Why Was This a Problem?</h3>\nNow, you might think, \"Why is carrying charcoal a problem if people need it?\" That's a great question! It's not the charcoal itself that's the problem. The problem was how these grown-ups were carrying it.\n\nThere are rules for everything, right? Like rules for playing safely, or rules for sharing toys. Well, there are also rules for carrying things like charcoal, especially when you carry a lot of it from one place to another. You need special permission and you need to follow all the steps.\n\nThese grown-ups were trying to carry the charcoal secretly. They put the big, empty box on top to hide the bags of charcoal. This is called 'smuggling' (say 'smug-ling'). Smuggling means trying to move things without asking for permission, or without paying the right money (like taxes) that helps build schools and hospitals. It's like trying to sneak something past the rules.\n\n<h3>Why Do We Have Rules?</h3>\nRules are there to help everyone! When people move charcoal properly, they pay a little bit of money to the government. This money helps Malawi become a better place for everyone. It helps build roads, schools where you learn, and even hospitals where doctors help people get better.\n\nWhen people smuggle charcoal, they don't pay that money. This means there's less money to help everyone in Malawi. It's like someone trying to get extra sweets without sharing or without paying for them. It's not fair to everyone else in the country.\n\n**Did you know?** Malawi is a beautiful country in Africa, known for its big lake, Lake Malawi! It's one of the largest lakes in Africa, and it has lots of colourful fish!\n\n<h3>Who Found the Secret?</h3>\nLuckily, there are special helpers who make sure everyone follows the rules. They are called 'officials' or sometimes 'police officers'. These clever helpers saw the special car. Maybe something looked a little bit strange, or they had a good feeling something wasn't quite right.\n\nThey stopped the car and looked inside. And that's when they found the secret! The big, empty box was there, but underneath it were all those bags of charcoal, hidden away! The grown-ups were caught because they tried to hide what they were doing.\n\n<h3>What Happens Next?</h3>\nWhen the clever helpers found the secret, they talked to the grown-ups who were driving the car. They explained that what they did was against the rules. It's like when you accidentally break a rule at school, and a teacher talks to you about it. The grown-ups will have to learn from their mistakes.\n\nIt's important for everyone to follow the rules so that our communities are fair and safe. These grown-ups will learn that trying to trick people or hide things is not the best way to do things. Everyone should be honest and follow the rules to help their country.\n\n<h3>Why Trees are Important</h3>\nAnd here's another very important thing about charcoal: it comes from trees! People cut down trees to make charcoal. Trees are super important for our planet! They give us fresh air to breathe, and homes for many animals. Trees also help make the soil healthy and stop it from washing away when it rains.\n\nIf too many trees are cut down without planting new ones, our forests get smaller. This can hurt the environment. So, when people try to get charcoal secretly, sometimes it means they are not thinking about how many trees are being cut down, or if new ones are being planted to replace them. It's important to protect our trees!\n\n**Did you know?** Planting new trees after old ones are cut down is called \"reforestation\"! It helps keep our Earth green and healthy for all living things.\n\n<h3>Let's Learn to Be Honest</h3>\nThis story reminds us that being honest and following the rules is always the best way. Even if it seems like a quick way to do something, trying to hide things or trick people can cause problems for everyone. It can stop a country from getting the money it needs to help its people.\n\nIt's better to be open and do things the right way. That way, everyone can be happy, and countries like Malawi can use the money from rules to help all the children and families grow strong and healthy! They can build more schools, bigger hospitals, and even better roads for everyone.\n\nSo, remember, my friends, always be honest, follow the rules, and help make our world a fair and wonderful place for everyone! See you next time for more news from Africa!",
    "summary": "In Malawi, some grown-ups tried to hide bags of charcoal under an empty coffin in a special car, pretending it was a funeral, but clever helpers found their secret.",
    "whyMatters": "This story teaches us that following rules and being honest helps everyone in our country, making sure there's money for schools and hospitals, and protecting our environment, which is important for all of us.",
    "category": "world",
    "date": "2026-02-17T10:40:25.936Z",
    "image": "https://image.pollinations.ai/prompt/The%20Tricky%20Car%20and%20the%20Secret%20Bags!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-tricky-car-and-the-secret-bags",
    "originalLink": "https://www.bbc.com/news/articles/cwygdq11jwlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How the tide turned against the leader of South Africa's second-biggest party",
    "title": "How the tide turned against the leader of South Africa's second-biggest party",
    "content": "John Steenhuisen will not seek re-election as DA leader, leaving the race wide open for a successor.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-17T10:40:31.082Z",
    "image": "https://image.pollinations.ai/prompt/How%20the%20tide%20turned%20against%20the%20leader%20of%20South%20Africa's%20second-biggest%20party%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-the-tide-turned-against-the-leader-of-south-africas-second-biggest-party",
    "originalLink": "https://www.bbc.com/news/articles/c6209vqv3nlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran and US open second round of nuclear talks in Switzerland",
    "title": "Iran and US open second round of nuclear talks in Switzerland",
    "content": "A second round of nuclear talks between the US and Iran is underway in Geneva. Al Jazeera’s Osama Bin Javaid explains.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T10:40:36.361Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20and%20US%20open%20second%20round%20of%20nuclear%20talks%20in%20Switzerland%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-and-us-open-second-round-of-nuclear-talks-in-switzerland",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/17/iran-and-us-open-second-round-of-nuclear-talks-in-switzerland?traffic_source=rss"
  },
  {
    "originalTitle": "Lunar New Year: Global celebrations welcome Year of the Fire Horse",
    "title": "Lunar New Year: Global celebrations welcome Year of the Fire Horse",
    "content": "From Beijing to Hong Kong to Moscow, people celebrate Lunar New Year with cultural events and vibrant displays.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T10:40:41.461Z",
    "image": "https://image.pollinations.ai/prompt/Lunar%20New%20Year%3A%20Global%20celebrations%20welcome%20Year%20of%20the%20Fire%20Horse%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lunar-new-year-global-celebrations-welcome-year-of-the-fire-horse",
    "originalLink": "https://www.aljazeera.com/gallery/2026/2/17/global-celebrations-welcome-the-year-of-the-horse-with-fireworks?traffic_source=rss"
  },
  {
    "originalTitle": "US civil rights leader Jesse Jackson dies aged 84",
    "title": "US civil rights leader Jesse Jackson dies aged 84",
    "content": "The civil rights leader and US presidential hopeful 'died peacefully' on Tuesday, his family said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-17T10:40:46.559Z",
    "image": "https://image.pollinations.ai/prompt/US%20civil%20rights%20leader%20Jesse%20Jackson%20dies%20aged%2084%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-civil-rights-leader-jesse-jackson-dies-aged-84",
    "originalLink": "https://www.aljazeera.com/news/2026/2/17/us-civil-rights-leader-jesse-jackson-dies-aged-84?traffic_source=rss"
  },
  {
    "originalTitle": "Hillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview",
    "title": "Hillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview",
    "content": "\"Get the files out. They are slow-walking it,\" the former US secretary of state says. The White House says it has done \"more for the victims than Democrats ever did\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T10:40:51.991Z",
    "image": "https://image.pollinations.ai/prompt/Hillary%20Clinton%20accuses%20Trump%20administration%20of%20Epstein%20files%20'cover-up'%20in%20BBC%20interview%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hillary-clinton-accuses-trump-administration-of-epstein-files-cover-up-in-bbc-interview",
    "originalLink": "https://www.bbc.com/news/articles/czx47k34yqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "New nuclear talks between US and Iran begin in Geneva",
    "title": "New nuclear talks between US and Iran begin in Geneva",
    "content": "The US president says he thinks Iran wants to make a deal, while Tehran believes Washington is moving to a more realistic position.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-17T10:40:57.095Z",
    "image": "https://image.pollinations.ai/prompt/New%20nuclear%20talks%20between%20US%20and%20Iran%20begin%20in%20Geneva%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "new-nuclear-talks-between-us-and-iran-begin-in-geneva",
    "originalLink": "https://www.bbc.com/news/articles/cwyknjnd706o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US build-up of warships and fighter jets tracked near Iran",
    "title": "US build-up of warships and fighter jets tracked near Iran",
    "content": "BBC Verify has seen US aircraft carrier USS Abraham Lincoln near Iran ahead of talks between the two countries",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T10:41:02.196Z",
    "image": "https://image.pollinations.ai/prompt/US%20build-up%20of%20warships%20and%20fighter%20jets%20tracked%20near%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-build-up-of-warships-and-fighter-jets-tracked-near-iran",
    "originalLink": "https://www.bbc.com/news/articles/c1d64p3q2d0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "FA Cup heroes Macclesfield make memories to last a lifetime",
    "title": "Macclesfield's Big Football Adventure!",
    "content": "Hello, amazing kids in Africa! Your friendly news reporter is here with a super exciting story from very far away. It's a story about a small football team that showed us all how important it is to dream big and try your very best!\n\n<h3>Hello from Your Reporter!</h3>\n\nGuess what? There's a special football game called the FA Cup. It's played in a country far away, but the message from this story is for everyone, everywhere! Imagine lots and lots of football teams, big and small, all playing together to win a shiny cup. It's like a big party for football!\n\n<h3>What is the FA Cup?</h3>\n\nThe FA Cup is a very, very old and famous football competition. Think of it like a giant tournament where even the smallest village team can play against the biggest, most famous teams. It’s super exciting because sometimes, the small teams surprise everyone and win against the big ones! People love to watch these games because anything can happen. It's full of surprises and happy moments.\n\nDid you know? Football is the most popular sport in the whole wide world! So many kids, just like you, love to kick a ball around.\n\n<h3>Meet Macclesfield!</h3>\n\nOur story is about a team called Macclesfield. They are not one of the super-duper famous teams that everyone knows. They are a smaller team, maybe like a local team in your town. But they have hearts full of courage and a dream to play amazing football! Their players are just ordinary people who love to play and work together.\n\nThey started their journey in the FA Cup like many other small teams. Nobody thought they would go very far. But they had a secret weapon: their teamwork and their big, big dreams!\n\n<h3>Their Amazing Football Journey</h3>\n\nMacclesfield started playing their games. One by one, they kept winning! They beat one team, then another, and another! Everyone was so surprised. The fans, the people who love watching them play, cheered very loudly. They wore colourful scarves and shouted for Macclesfield.\n\nEvery time they won, the players felt so happy and proud. They hugged each other and smiled from ear to ear. It was like a magical journey. This long and exciting trip in the FA Cup is what we call an 'odyssey'. It means they travelled far and had many adventures!\n\nDid you know? When football players work together like a team, they can do amazing things! Just like when you and your friends work together at school or home.\n\n<h3>Playing Against Bigger Teams</h3>\n\nAs Macclesfield kept winning, they had to play against bigger and stronger teams. These teams had more famous players and more money. But Macclesfield didn't give up! They played with all their might, running fast, passing the ball, and trying to score goals. Every game was a big challenge, but they faced it with brave hearts.\n\nImagine the excitement! People who never knew about Macclesfield suddenly started watching their games. They wanted to see if the small team could keep surprising everyone. It was like a fairy tale coming true on the football field!\n\n<h3>The Big Match: Macclesfield vs. Brentford</h3>\n\nFinally, Macclesfield played a very big game against a team called Brentford. Brentford is a much bigger and stronger team. They are very good at football. It was a very hard game for Macclesfield.\n\nMacclesfield played their very, very best. They ran and chased the ball. They tried their hardest to score goals. The fans cheered so loud that the stadium felt like it was shaking! Every kick, every pass was important.\n\nIn the end, Macclesfield did not win that game. Brentford was too strong. But even though they lost, everyone agreed that Macclesfield had played with incredible courage and skill. They never gave up, right until the final whistle.\n\n<h3>Memories Forever and Ever</h3>\n\nEven though their FA Cup journey ended, the people who write about football said something very important. They said Macclesfield had made 'memories to last a lifetime'. What does that mean?\n\nIt means that all the happy moments, the big wins, the cheering fans, and the feeling of trying your best will stay in their hearts forever. The players will always remember the excitement, the teamwork, and how proud they made everyone. These are super special, happy times that they will never, ever forget.\n\nDid you know? Even if you don't win, trying your very best and having fun with your friends can be the best part of any game!\n\n<h3>What We Learn from Macclesfield</h3>\n\nThis story of Macclesfield teaches us something very special, no matter where we live in the world. It tells us that even if you are small, you can have big dreams. It tells us that trying your very best is always important, even if you don't win every time.\n\nIt also shows us the power of teamwork and how wonderful it feels to make people happy and proud. Macclesfield's players showed everyone that with hard work and a brave heart, you can make amazing memories. They showed us that the journey itself, full of effort and joy, is sometimes even more important than the final win.\n\nSo, my friends, keep playing, keep dreaming, and keep trying your best in everything you do! You can make your own amazing memories, just like Macclesfield did! Bye for now!",
    "category": "sports",
    "date": "2026-02-17T10:41:20.771Z",
    "image": "https://image.pollinations.ai/prompt/Macclesfield's%20Big%20Football%20Adventure!%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "macclesfields-big-football-adventure",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgjz52exvy3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We really messed up' - does European football need more balance?",
    "title": "'We really messed up' - does European football need more balance?",
    "content": "One set of clubs dominate the Champions League, another win their domestic title every year but cannot compete - does European football have a problem?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T10:41:25.880Z",
    "image": "https://image.pollinations.ai/prompt/'We%20really%20messed%20up'%20-%20does%20European%20football%20need%20more%20balance%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "we-really-messed-up-does-european-football-need-more-balance",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgmzylx4004o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Is facing a Champions League play-off really that bad?",
    "title": "Is facing a Champions League play-off really that bad?",
    "content": "The Champions League returns this week and some of Europe's biggest teams will be back in action a lot earlier than they would have hoped.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T10:41:30.987Z",
    "image": "https://image.pollinations.ai/prompt/Is%20facing%20a%20Champions%20League%20play-off%20really%20that%20bad%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "is-facing-a-champions-league-play-off-really-that-bad",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5y2y7y2pwwo?at_medium=RSS&at_campaign=rss"
  }
]