[
  {
    "originalTitle": "At least 21 dead after boat sinks on Sudan's River Nile ",
    "title": "Sad News from the Big River in Sudan",
    "content": "<h3>Hello, Friends!</h3>\nHello, everyone. We have some sad news to share with you today from our amazing continent, Africa. It is about a country called Sudan.\n\nSomething difficult happened there. A boat was on a very big river, and it sank. This means it went under the water.\n\nMany people were on the boat. Some children were there too, just like some of you.\n\nWe are sad because some people did not make it out of the water. And some people are still missing. This makes many hearts heavy.\n\nBut many kind and brave people are working very hard to find everyone. They are searching everywhere.\n\n<h3>Where is Sudan?</h3>\nSudan is a big and beautiful country. It is in the northern part of Africa. You can find it on a map if you look closely!\n\nPeople in Sudan have warm smiles and rich stories. They live in towns and cities, and some live in the countryside.\n\nSudan is known for its amazing history and deserts. It is a very important country in Africa.\n\nDid you know? The capital city of Sudan is called Khartoum! It's where two big rivers meet.\n\n<h3>The Mighty River Nile</h3>\nThe river where the boat sank is called the River Nile. The River Nile is not just any river. It is a super, super long river!\n\nIt is one of the longest rivers in the whole world! Imagine a river that flows through many, many countries in Africa.\n\nThe Nile is like a lifeline for the people of Sudan. They use its water for many things. It helps their farms grow food.\n\nThey also use the Nile to travel from one place to another. People use different kinds of boats, from small fishing boats to bigger ones that carry people and goods.\n\nDid you know? The River Nile flows from the south of Africa all the way to the north! It’s like a giant watery highway.\n\n<h3>What Happened to the Boat?</h3>\nWe don't know exactly why the boat sank yet. Sometimes boats can have problems. It might have been too windy, or the river could have been rough.\n\nMaybe the boat had too many people on it. Or perhaps something else went wrong.\n\nWhen a boat sinks, it means it cannot float anymore. It fills with water and goes down. This is why it is very, very dangerous.\n\nBoats are like floating cars on water. They are built to stay on top of the water. But if too much water gets inside, they can't float anymore.\n\nIt is a very sad and big problem when a boat has an accident like this. Everyone becomes very worried.\n\n<h3>Heroes Are Helping</h3>\nRight now, many brave people are helping. They are like real-life heroes.\n\nThese people are called rescue teams. They are using smaller boats and special tools to look for the missing people in the big river.\n\nPolice officers are helping. And many local fishermen, who know the River Nile very well, are also helping the search.\n\nThey are working day and night. They want to find everyone and help their families.\n\nThis shows how much people care for each other in Sudan. When something sad happens, everyone comes together to help.\n\nDid you know? Rescuers sometimes use big lights at night to help them see in the dark while searching for people.\n\n<h3>Staying Safe on Boats</h3>\nThis sad news reminds us how important it is to be safe on boats. Safety is the most important thing when you are near or on water.\n\nAlways, always wear a life jacket! A life jacket is a special puffy jacket that helps you float in the water.\n\nIt has air inside that makes you buoyant. \"Buoyant\" means you can float easily! It helps you stay on top of the water even if you can't swim.\n\nDid you know? Life jackets come in many bright colors like orange or yellow. This helps rescuers see you easily in the water!\n\nAlso, make sure there are not too many people on a boat. If a boat has too many people, it becomes too heavy. A heavy boat can tip over or sink easily.\n\nAlways listen to the grown-ups who are in charge of the boat. They know the rules to keep everyone safe. Don't stand up or run around in a boat, stay seated and hold on tight.\n\nDid you know? Even very good swimmers should wear life jackets on boats. Accidents can happen to anyone!\n\n<h3>Thinking of Sudan</h3>\nOur hearts go out to the people in Sudan. We are thinking of all the families who are missing their loved ones right now.\n\nWe hope the brave rescuers find everyone soon and that they are safe. We wish for comfort for those who are sad.\n\nLet's remember to be kind to each other and always help when we can. That's what makes our big African family strong and special.\n\nAnd let's always remember to be safe when we are near big rivers or on boats. Stay safe, little friends!",
    "summary": "A boat sank on the River Nile in Sudan, and rescue teams are working hard to find missing people, including children, reminding us about the importance of boat safety.",
    "whyMatters": "This is important because it is very sad when people get hurt, and it teaches us how important it is to be safe on boats by wearing life jackets and not overcrowding them, and also how communities come together to help each other in difficult times.",
    "category": "world",
    "date": "2026-02-12T12:56:55.324Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20the%20Big%20River%20in%20Sudan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-the-big-river-in-sudan",
    "originalLink": "https://www.bbc.com/news/articles/cp851zp41m5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Powerful cyclone kills at least 31 as it tears through Madagascar port",
    "title": "Powerful cyclone kills at least 31 as it tears through Madagascar port",
    "content": "Madagascar's disaster management says roads are inaccessible with trees uprooted, power poles down and ninety percent of roofs ripped off.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:00.440Z",
    "image": "https://image.pollinations.ai/prompt/Powerful%20cyclone%20kills%20at%20least%2031%20as%20it%20tears%20through%20Madagascar%20port%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "powerful-cyclone-kills-at-least-31-as-it-tears-through-madagascar-port",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "title": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "content": "Juliette Bryant has called on the Palace to \"act\" on revelations about Andrew's relationship with Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:05.546Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20Epstein%20survivor%20calls%20on%20UK%20Royal%20Family%20to%20search%20Andrew's%20files%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-epstein-survivor-calls-on-uk-royal-family-to-search-andrews-files",
    "originalLink": "https://www.bbc.com/news/articles/cvg5ww8lq9zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "In Aleppo, art bridges Syria’s war divisions",
    "title": "In Aleppo, art bridges Syria’s war divisions",
    "content": "In Aleppo, Syria, an artists’ collective is bringing Syrians from different religious and political backgrounds together",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:10.894Z",
    "image": "https://image.pollinations.ai/prompt/In%20Aleppo%2C%20art%20bridges%20Syria%E2%80%99s%20war%20divisions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "in-aleppo-art-bridges-syrias-war-divisions",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/12/in-aleppo-art-bridges-syrias-war-divisions?traffic_source=rss"
  },
  {
    "originalTitle": "Ex-Pakistan PM Imran Khan left with 15% vision in right eye, court told",
    "title": "Looking After Our Eyes: A Story from Pakistan",
    "content": "Hello, my wonderful friends! Your news reporter from Africa is here! Today, we are going to talk about something super important: our eyes!\n\n<h3>Our Amazing Eyes!</h3>\nDid you know your eyes are like two tiny cameras? They help you see all the beautiful colours of the world.\n\nYou can see your mom's smile, the green trees, and your friends playing. Your eyes work very hard every day.\n\nIt is so important to take good care of them. We need our eyes to learn and play!\n\nSo, what happens if someone's eyes are not working so well? Let's find out.\n\n<h3>A Story from Far Away</h3>\nFar, far away, across the big blue ocean, there is a country called Pakistan.\n\nIn Pakistan, there was a grown-up named Mr. Imran Khan. He used to be a very important leader there.\n\nDo you know what a leader is? Imagine your head teacher at school. They help everyone and make sure things run smoothly.\n\nWell, a country's leader, like a Prime Minister, helps lead the whole country! They make big decisions for all the people.\n\nMr. Imran Khan was once a Prime Minister. That means he was a very important person who helped his country.\n\nNow, he needs a little bit of help with his health, especially with his eyes.\n\nDid you know that leaders, just like us, can sometimes get sick or need a doctor? Yes, they are people too!\n\n<h3>What Happened to His Eyes?</h3>\nRecently, Mr. Imran Khan had a problem with one of his eyes.\n\nIt's his right eye, which is the one on the side of your right hand.\n\nThe grown-ups who checked his eye said he can only see a little bit with it.\n\nImagine trying to read a book, but the words are very blurry. Or trying to see a ball, but it looks like a fuzzy blob.\n\nThat's a bit like what it means to have \"low vision.\" It means your eyes can't see as clearly as they used to.\n\nThey said he only has about 15% vision in that eye. That's a very small amount!\n\nDid you know that percentages help us understand how much of something we have? Like if you have 10 sweets and eat 5, you have 50% left! So, 15% is not much for seeing.\n\nIt's a bit sad when someone can't see well, isn't it? It can make everyday things quite difficult.\n\nThat's why it's so important for doctors to help people who have problems with their eyes.\n\n<h3>Doctors Are Helpers</h3>\nWhen someone has a problem with their eyes, or any part of their body, where do they go?\n\nThey go to see a doctor! Doctors are very clever people who know a lot about how our bodies work.\n\nThey are like special detectives for our bodies, trying to find out what's wrong and how to fix it.\n\nFor Mr. Imran Khan, the big court in Pakistan said, \"Let's make sure doctors check him again!\"\n\nThis is called a \"medical review.\" It means doctors will look at his eye very, very carefully.\n\nThey will do tests to understand exactly what is happening. They want to know why his eye is not seeing well.\n\nThen, they can figure out the best way to help him. Maybe he needs special glasses, or medicine, or something else.\n\nDid you know that there are special doctors called Ophthalmologists? They are eye doctors!\n\nThey spend many years learning all about eyes so they can help people see better.\n\nIt's good to know that doctors are always there to help us when we are not feeling well, no matter who we are.\n\n<h3>Being Fair to Everyone</h3>\nNow, who made sure that Mr. Imran Khan gets to see more doctors?\n\nIt was the \"Supreme Court\" in Pakistan! This is like the biggest referee or umpire for fairness in a country.\n\nImagine you are playing a game with your friends, and someone says, \"That's not fair!\"\n\nA grown-up might come and listen to everyone and make a decision to make things fair again.\n\nThe Supreme Court is like those grown-ups, but for very big problems in a country.\n\nThey listen to all sides and make sure everyone gets treated properly and fairly.\n\nThey heard that Mr. Imran Khan's eyes were not good, and they said, \"He needs to be checked by doctors properly!\"\n\nThis is very important because it shows that everyone, even a leader who is in a difficult situation, deserves to be cared for.\n\nDid you know that every country has rules and courts to make sure people are treated fairly? It's a way to keep things safe and just for everyone.\n\nIt teaches us that helping people and making sure they are well is a big deal, even for big courts.\n\n<h3>Why This Matters</h3>\nSo, what can we learn from this story all the way from Pakistan?\n\nFirst, our eyes are precious! We must protect them. Don't look at the sun directly. Eat healthy food like carrots!\n\nSecond, doctors are wonderful helpers. If you ever feel sick or your eyes hurt, tell a grown-up so you can see a doctor.\n\nThird, it's important to be fair to everyone. No matter who they are or where they come from.\n\nEveryone deserves care and help when they need it, especially when it comes to their health.\n\nThis story shows us that even big leaders need care, and big courts make sure they get it.\n\nLet's all remember to be kind and help others, just like the doctors and the court are helping Mr. Imran Khan.\n\nAnd most importantly, take good care of your own amazing eyes! They help you explore the world every single day.",
    "summary": "A former leader in Pakistan named Mr. Imran Khan has problems seeing with one of his eyes, and a big court has asked doctors to check him again to make sure he gets proper care.",
    "whyMatters": "This story is important because it shows us that everyone, even a country's leader, needs help from doctors when they are sick, and that big courts make sure everyone is treated fairly and gets the care they need for their health.",
    "category": "government",
    "date": "2026-02-12T12:57:35.175Z",
    "image": "https://image.pollinations.ai/prompt/Looking%20After%20Our%20Eyes%3A%20A%20Story%20from%20Pakistan%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "looking-after-our-eyes-a-story-from-pakistan",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/ex-pakistan-pm-imran-khan-left-with-15-vision-in-right-eye-court-told?traffic_source=rss"
  },
  {
    "originalTitle": "Counting begins as polls close in landmark Bangladesh election",
    "title": "Counting begins as polls close in landmark Bangladesh election",
    "content": "Vote counting is under way in Bangladesh after polls closed, with officials reporting turnout just under 48%.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:40.279Z",
    "image": "https://image.pollinations.ai/prompt/Counting%20begins%20as%20polls%20close%20in%20landmark%20Bangladesh%20election%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "counting-begins-as-polls-close-in-landmark-bangladesh-election",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/12/counting-begins-as-polls-close-in-landmark-bangladesh-election?traffic_source=rss"
  },
  {
    "originalTitle": "Police identify 18-year-old as suspect in Tumbler Ridge shooting ",
    "title": "Police identify 18-year-old as suspect in Tumbler Ridge shooting ",
    "content": "A candlelit vigil was held on Wednesday night in the remote British Columbia town where six people were killed and dozens injured.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:45.771Z",
    "image": "https://image.pollinations.ai/prompt/Police%20identify%2018-year-old%20as%20suspect%20in%20Tumbler%20Ridge%20shooting%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-identify-18-year-old-as-suspect-in-tumbler-ridge-shooting",
    "originalLink": "https://www.bbc.com/news/articles/ce8w95knp55o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kim Jong Un chooses teen daughter as heir, says Seoul ",
    "title": "Kim Jong Un chooses teen daughter as heir, says Seoul ",
    "content": "South Korea's spy agency says Ki Ju Ae's prominent public presence indicates she is the chosen heir.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:50.871Z",
    "image": "https://image.pollinations.ai/prompt/Kim%20Jong%20Un%20chooses%20teen%20daughter%20as%20heir%2C%20says%20Seoul%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kim-jong-un-chooses-teen-daughter-as-heir-says-seoul",
    "originalLink": "https://www.bbc.com/news/articles/cn0e1g7kwglo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Polls close in first election since Gen Z protests ousted Bangladesh leader",
    "title": "Polls close in first election since Gen Z protests ousted Bangladesh leader",
    "content": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:57:55.970Z",
    "image": "https://image.pollinations.ai/prompt/Polls%20close%20in%20first%20election%20since%20Gen%20Z%20protests%20ousted%20Bangladesh%20leader%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "polls-close-in-first-election-since-gen-z-protests-ousted-bangladesh-leader",
    "originalLink": "https://www.bbc.com/news/articles/cy7jdmvn3l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I didn't hesitate' - Tuchel extends stay in England 'dream job'",
    "title": "'I didn't hesitate' - Tuchel extends stay in England 'dream job'",
    "content": "Thomas Tuchel commits to two more years as England manager, which will take him through to Euro 2028.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-12T12:58:01.407Z",
    "image": "https://image.pollinations.ai/prompt/'I%20didn't%20hesitate'%20-%20Tuchel%20extends%20stay%20in%20England%20'dream%20job'%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-didnt-hesitate-tuchel-extends-stay-in-england-dream-job",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dnl94750zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham are 'not a big club' - Postecoglou",
    "title": "Tottenham are 'not a big club' - Postecoglou",
    "content": "Former head coach Ange Postecoglou criticises Tottenham's transfer strategy in the wake of Thomas Frank's sacking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:58:06.511Z",
    "image": "https://image.pollinations.ai/prompt/Tottenham%20are%20'not%20a%20big%20club'%20-%20Postecoglou%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tottenham-are-not-a-big-club-postecoglou",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwyx18287k9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Lucky break that changed Alexander-Arnold's Real future",
    "title": "Lucky break that changed Alexander-Arnold's Real future",
    "content": "Trent Alexander-Arnold endured a difficult start at Real Madrid but his prospects are looking up - and it might earn him a ticket to the World Cup.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T12:58:11.616Z",
    "image": "https://image.pollinations.ai/prompt/Lucky%20break%20that%20changed%20Alexander-Arnold's%20Real%20future%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lucky-break-that-changed-alexander-arnolds-real-future",
    "originalLink": "https://www.bbc.com/sport/football/articles/c0q3dwkq01go?at_medium=RSS&at_campaign=rss"
  }
]