[
  {
    "originalTitle": "Is Ethiopia heading back to war in Tigray?",
    "title": "Big News from Tigray: Why Families Are Moving!",
    "content": "Hello, wonderful kids of Africa! Your friendly reporter is here with some important news from a place called Tigray. It's a special part of a big, beautiful country called Ethiopia. We want to tell you about some families there and what's happening to them right now.\n\n<h3>Meet Tigray!</h3>\nImagine a really big neighborhood where lots of families live. Tigray is like a super big neighborhood, but it's called a 'region'. It's way up in the north of Ethiopia, which is a fantastic country in Africa. Ethiopia is famous for its delicious food, its very old stories and buildings, and its amazing runners who win races all over the world! It's a place with many kind people and lots of warm sunshine.\n\nDid you know? Ethiopia is one of the oldest countries in the whole world! It has a very long history, and it has always been a free country, making its own rules and choices.\n\n<h3>Why Are People Moving?</h3>\nSometimes, when things are not safe or there's not enough food to eat, people have to move. It's like when your family moves to a new house on a new street, but these families are moving further away from their old homes and everything they know. We heard that many people in Tigray are moving away again from their houses and villages. This is happening just a few years after a big fight that was happening there finally stopped.\n\nDid you know? When people move away from their homes because of trouble, like a big fight or not enough food, it's called being \"displaced.\" It means they need to find a new, safe place to live for a while, until it's safe to go back.\n\n<h3>A Big Fight Stopped</h3>\nA few years ago, there was a big fight in Tigray. It wasn't like a small argument on the playground; it was a very serious fight that made many people sad and scared. Sometimes, when a big fight happens between people in the same country, it's called a 'civil war'. But here's some good news! That big fight stopped about three years ago. Everyone hoped that peace and happiness would come back quickly to Tigray.\n\nDid you know? Peace means a time of quiet and calm, where people can live together happily without any fighting. It's like when everyone in your classroom is friends, plays nicely, and helps each other!\n\n<h3>What Happens When People Move?</h3>\nWhen families have to move from their homes, it can be very tough and sad. They might have to leave their houses, their schools, and their best friends behind. Children might miss their favorite toys or the special tree they used to climb every day. It's not easy at all to pack up and start all over again in a brand new place, far from what you know.\n\nDid you know? When people have to move because of trouble, they often can only take a few things with them. They might carry a small bag with just a change of clothes, a warm blanket, or a very special toy.\n\n<h3>Why Do People Need Peace?</h3>\nPeace is super, super important for everyone! When there is peace, kids can go to school every single day. They can learn new things, play games with their friends, and dream big dreams about what they want to be when they grow up. Families can plant food in their gardens, go to work to earn money, and stay healthy and strong. Everyone feels safe in their own homes and knows they won't be scared by fights.\n\nDid you know? Going to school and learning is like getting a superpower! When you learn, you can do amazing things and help your family and your community grow stronger and happier.\n\n<h3>Challenges Even After the Fight Stops</h3>\nEven after the big fight stopped, things are still a bit tricky in Tigray. Sometimes there isn't enough food for everyone, or it's hard to get clean water to drink. Some schools and hospitals might still need fixing after the trouble. That's why some families feel they still need to move to find a safer place where they can get more help and have more food.\n\nDid you know? Many kind people and groups from all over the world try to help places like Tigray. They send food, medicine, and even help to build new schools and houses. They want everyone to be safe and happy.\n\n<h3>Hoping for a Brighter Future</h3>\nWe all want the people in Tigray to be safe and happy again very soon. We want kids to laugh and play without any worries, and families to live in peace in their own homes. It's important to remember that the people in Tigray are very strong and brave. They are trying their very best to build a happy life again, even when it's hard.\n\nDid you know? There are many different languages spoken in Ethiopia! People from Tigray often speak a special language called Tigrinya, which sounds beautiful.\n\n<h3>What Can We Do?</h3>\nEven if we are far away, we can still help in our hearts. We can think good thoughts for all the children and families in Tigray. We can learn about what's happening and hope with all our might that peace stays forever. We can also be extra kind to everyone around us, because kindness helps to make the whole world a better, more peaceful place for everyone to live.\n\nDid you know? One small act of kindness, like sharing your toy or saying a friendly word, can make a huge difference in someone's day and help them feel happy!\n\n<h3>Let's Keep Hoping!</h3>\nSo, our friends in Tigray are facing some challenges, and some are moving to find safety. But we know they are strong and brave, and we hope that peace will come quickly and stay for good. We hope they can soon go back to their homes, go to school every day, and play with all their friends under the beautiful African sun. We'll keep thinking about them!\n\nDid you know? The African continent is home to some of the most beautiful places and diverse cultures in the world! Every country has its own special traditions, music, and wonderful stories to share.",
    "summary": "Families in Tigray, Ethiopia, are moving from their homes again, even after a big fight stopped a few years ago, because they are still looking for peace, safety, and enough food.",
    "whyMatters": "This is important because everyone, especially children, deserves to live in a safe home, go to school, and have enough food, and we want lasting peace for all the families in Tigray.",
    "category": "technology",
    "date": "2026-02-26T11:36:44.890Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Tigray%3A%20Why%20Families%20Are%20Moving!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-tigray-why-families-are-moving",
    "originalLink": "https://www.bbc.com/news/articles/cwygrnjz9wro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nigeria to hold inquest into death of Chimamanda Ngozi Adichie's toddler",
    "title": "Learning to Make Hospitals Super Safe for Everyone!",
    "content": "Hello, my wonderful little friends across beautiful Africa! It's your friendly reporter, Sunny Stories, here with some important news. Today, we're going to talk about something very special: how we can make sure our hospitals are the safest places ever for all our little brothers and sisters, and for everyone who gets sick. \n\nWe love our doctors and nurses, don't we? They work so hard to make us feel better when we're not well. Today's story is about how we learn from everything that happens, to make sure hospitals keep getting better and better at helping people.\n\n<h3>A Very Special Writer</h3>\n\nThere's a very clever lady from Nigeria. Her name is Chimamanda Ngozi Adichie. That's a long name, isn't it? She is a super-duper writer! She writes amazing stories and books that people all over the world read. She makes us think and imagine wonderful things.\n\nShe loves Nigeria very much and she loves children. Just like you love your family, she loved her little baby very, very much. Her baby was very precious to her, just like you are precious to your parents.\n\n<h3>Something Sad Happened</h3>\n\nSometimes, even when we try our very best, sad things happen. A while ago, something very, very sad happened to Chimamanda's baby. Her baby became unwell and went to a hospital called Euracare in Nigeria to get help. \n\nSadly, her baby passed away. This made Chimamanda and her family very, very sad. Losing a baby is one of the saddest things that can happen to a mommy or a daddy. They missed their baby terribly.\n\n<h3>What is an 'Inquest'? It's like a Big Question Time!</h3>\n\nWhen something very sad or confusing happens, especially in a hospital, sometimes we need to ask a lot of questions to understand exactly what happened. This is called an 'inquest'. Can you say 'in-quest'? It's like a very important meeting where people ask questions, listen to answers, and try to learn everything they can.\n\nIt's not about being angry, but about finding out the truth. Think of it like a detective story, but a real-life one! Everyone involved wants to know the full story so they can learn from it.\n\nDid you know? In Nigeria, just like in many places around the world, there are special rules and people to help find out what happened when sad things occur. This helps everyone feel safe and understand better.\n\n<h3>Why Do We Ask Big Questions?</h3>\n\nChimamanda, the clever writer, believes that the hospital made some big mistakes while taking care of her baby. She thinks these mistakes caused her baby to get worse. This is sometimes called 'negligence' – which just means making a big mistake that causes harm because someone wasn't careful enough.\n\nThe hospital, Euracare, says they did not make any mistakes and that they tried their very best to help the baby. So, you see, we have two different ideas about what happened. That's why the 'inquest' is so important!\n\nThis meeting will help everyone listen to both sides. It will help to look at all the facts, like what medicines were given, what tests were done, and what the doctors and nurses did. It’s like putting together a giant puzzle to see the whole picture.\n\n<h3>Hospitals Are Our Friends!</h3>\n\nHospitals are amazing places! They have super doctors, kind nurses, and lots of special machines that help people when they are sick or hurt. They are there to make us better. \n\nWe all want hospitals to be the best and safest places they can be. When we learn from sad events, it helps hospitals improve. It helps them to train their doctors and nurses even better, and to make sure they have all the right tools to help every single child and grown-up.\n\nDid you know? The first hospitals in Africa were often started a very, very long time ago by communities who wanted to care for their sick and elderly. They believed in helping each other!\n\n<h3>Learning Helps Us All</h3>\n\nThe people in charge in Nigeria have decided that this inquest will happen. This means they will have the big 'question time' to find out what truly happened. It's a very important step.\n\nThis is not just for Chimamanda and her family, but for all families in Nigeria and beyond. When we understand how things happen, we can make sure similar sad things don't happen again. It helps hospitals become even stronger and more trustworthy.\n\n<h3>Keeping Africa Strong and Healthy</h3>\n\nSo, my dear friends, remember that even from sad stories, we can find ways to make things better. The inquest is a way for people to learn, grow, and make sure that our hospitals continue to be places of healing and hope for everyone.\n\nIt shows that we care about every person, every child, and we want to make sure everyone gets the best care possible. Let's hope that this inquest helps everyone learn important lessons and makes our wonderful African hospitals even safer for all of us!\n\nThat's all for today from Sunny Stories. Keep smiling and learning, my friends!",
    "summary": "Nigeria will hold a special meeting, called an inquest, to ask questions and learn what happened when famous writer Chimamanda Ngozi Adichie's baby sadly passed away in a hospital, so we can make hospitals safer for all children.",
    "whyMatters": "This is important because when we ask questions and learn from sad events, it helps hospitals understand how to be even better and safer for every child and every person who needs help in Africa.",
    "category": "technology",
    "date": "2026-02-26T11:37:04.029Z",
    "image": "https://image.pollinations.ai/prompt/Learning%20to%20Make%20Hospitals%20Super%20Safe%20for%20Everyone!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "learning-to-make-hospitals-super-safe-for-everyone",
    "originalLink": "https://www.bbc.com/news/articles/cwygr2nzdp9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pope Leo to visit four African countries in April",
    "title": "Pope Leo to visit four African countries in April",
    "content": "This is the first time that a pope will visit Algeria, whose population is mostly Muslim.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:37:09.221Z",
    "image": "https://image.pollinations.ai/prompt/Pope%20Leo%20to%20visit%20four%20African%20countries%20in%20April%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pope-leo-to-visit-four-african-countries-in-april",
    "originalLink": "https://www.bbc.com/news/articles/cvg1vdgl3ymo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Real Madrid ban club member who did Nazi salute during Benfica match",
    "title": "Real Madrid ban club member who did Nazi salute during Benfica match",
    "content": "Game already overshadowed by alleged racial abuse aimed at Vinicius Jr by Benfica's Gianluca Prestianni in first-leg.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-26T11:37:14.499Z",
    "image": "https://image.pollinations.ai/prompt/Real%20Madrid%20ban%20club%20member%20who%20did%20Nazi%20salute%20during%20Benfica%20match%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "real-madrid-ban-club-member-who-did-nazi-salute-during-benfica-match",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/26/real-madrid-ban-club-member-who-did-nazi-salute-during-benfica-match?traffic_source=rss"
  },
  {
    "originalTitle": "Mosques attacked, children racially abused as hard right rises in UK",
    "title": "Mosques attacked, children racially abused as hard right rises in UK",
    "content": "As hatred is increasingly normalised and assaults rise, ethnic minorities are becoming hypervigilant.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:37:19.687Z",
    "image": "https://image.pollinations.ai/prompt/Mosques%20attacked%2C%20children%20racially%20abused%20as%20hard%20right%20rises%20in%20UK%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mosques-attacked-children-racially-abused-as-hard-right-rises-in-uk",
    "originalLink": "https://www.aljazeera.com/news/2026/2/26/mosques-attacked-children-racially-abused-as-hard-right-rises-in-uk?traffic_source=rss"
  },
  {
    "originalTitle": "LIVE: India vs Zimbabwe – T20 World Cup",
    "title": "LIVE: India vs Zimbabwe – T20 World Cup",
    "content": "Follow our live build-up, toss and team news, score, photo updates and text commentary stream from the Super 8 match.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:37:24.875Z",
    "image": "https://image.pollinations.ai/prompt/LIVE%3A%20India%20vs%20Zimbabwe%20%E2%80%93%20T20%20World%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "live-india-vs-zimbabwe-t20-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/2/26/live-india-vs-zimbabwe-t20-world-cup-commentary-stream-playing-11-score?traffic_source=rss"
  },
  {
    "originalTitle": "US and Iran begin talks seen as crucial to prevent conflict",
    "title": "US and Iran begin talks seen as crucial to prevent conflict",
    "content": "The indirect negotiations in Geneva are seen as a last-ditch effort, but the chances of a nuclear agreement are unclear.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:37:30.642Z",
    "image": "https://image.pollinations.ai/prompt/US%20and%20Iran%20begin%20talks%20seen%20as%20crucial%20to%20prevent%20conflict%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-and-iran-begin-talks-seen-as-crucial-to-prevent-conflict",
    "originalLink": "https://www.bbc.com/news/articles/cvg1vd95nl9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Fear is everywhere': BBC reports from Mexican city turned into war zone by drug cartel feud",
    "title": "A Story from Far Away: Big Trouble in a City Called Culiacán",
    "content": "<h3>Hello from Africa!</h3>\nHello, my dear friends from Africa! I am so happy to talk to you today. I am your friendly reporter, and I am here to share important stories from all over our big, beautiful world. Today, we are going to travel very, very far away. We are going on an imaginary trip to a country called Mexico.\n\n<h3>A City Far, Far Away</h3>\nImagine a place that is very, very far from where you live. It is across big oceans! This country is called Mexico. It is in a place called North America.\n\nDid you know? North America is one of the seven big land masses on Earth! It is home to many different animals and people.\n\nIn Mexico, there is a city. A city is like a very, very big town. Lots of people live there. This city has a special name. It is called Culiacán. Can you say that with me? Culiacán! It's a fun word to say, isn't it?\n\n<h3>Why People Are Scared</h3>\nBut today, I have a little bit of a sad story to tell you about Culiacán. Right now, in this city, some people are feeling very, very scared. They are scared to go outside. They are scared to play.\n\nThis is because there is a lot of \"violence\" there. Violence means when people fight in a very bad way. It makes everyone feel unsafe and sad.\n\nImagine if two friends were fighting over a toy, but much, much bigger and scarier. That's a little bit like what is happening, but with grown-ups and much bigger problems.\n\n<h3>Who is Fighting?</h3>\nSo, who is making people scared? It is not just one person. It is two big groups of people. These groups are not friends. They are like rivals. That means they don't like each other, and they want to be in charge.\n\nThese groups are called \"cartels.\" That's a big word! A cartel is a group of people who do bad things. They try to get money in bad ways. They break the rules and make trouble.\n\nDid you know? A \"cartel\" is a special name for a group of people who work together to do bad things. They try to trick people or sell things they shouldn't.\n\nIn Culiacán, there is a very big cartel. It is called the Sinaloa Cartel. It's a very famous group, but for not-so-good reasons. Now, this big cartel has split into two parts. It's like a big family that has broken into two groups.\n\n<h3>Two Groups, One Big Fight</h3>\nThese two parts of the Sinaloa Cartel are now fighting each other. They both want to be the \"boss.\" They both want to be in charge of everything in Culiacán. This is called battling for \"control.\"\n\nWhen they battle for control, it means they are trying to show who is stronger. They are trying to make sure everyone listens to them. But they are doing it in a very, very scary way.\n\nImagine if you and your brother or sister both wanted to be the leader of a game, but instead of talking about it, you started to push and shove. That's a little bit like what's happening, but much, much more serious.\n\n<h3>What Happens When There is Trouble?</h3>\nWhen these big groups fight, many sad things happen. It is not safe for people to walk on the streets. Children cannot go to school sometimes. They cannot play outside in their gardens or parks.\n\nParents get very worried about their children. They want to keep them safe inside their homes. It is a very scary time for everyone living in Culiacán.\n\nDid you know? When there is lots of fighting, sometimes shops close. This means it can be hard for people to buy food or other important things.\n\nThe BBC, which is a news place from far away, has said that \"fear is everywhere.\" This means that almost everyone in Culiacán feels afraid. They are worried about what might happen next.\n\n<h3>Why Do They Fight?</h3>\nYou might wonder, why do these groups fight? They fight because they want power. They want to be the ones who decide everything. They want to make a lot of money, even if it means doing bad things.\n\nThey want to be powerful, like the biggest lion in the jungle. But instead of being good leaders, they are making people sad and scared.\n\nDid you know? Lions are very powerful animals, but they are good leaders for their pride. These cartels are not good leaders for their city.\n\nIt is important to remember that most people in Mexico are good and kind. They just want to live in peace. It's only these bad groups that are causing all this trouble.\n\n<h3>Did You Know Fun Facts About Mexico?</h3>\nEven though there is a sad story today, Mexico is a wonderful country!\n\nDid you know? Mexico is famous for delicious food like tacos and burritos! They are very yummy!\n\nDid you know? Mexico has beautiful beaches with warm sand and blue water. People love to visit them.\n\nDid you know? Mexico has very old buildings called pyramids. These were built a long, long time ago by ancient people. They are amazing to see!\n\nSo, you see, Mexico is a land of many wonderful things, even if a small part of it is having a big problem right now.\n\n<h3>Hoping for Peace</h3>\nEveryone in Culiacán wants the fighting to stop. They want peace. Peace means when everyone is friendly and safe. When there is peace, children can play, and grown-ups can go to work without fear.\n\nPeople hope that the police and the government can help make the fighting stop. They want to bring safety back to their city. They want children to laugh and play again.\n\nWe should always hope for peace in the world, everywhere. It is important to be kind to each other and not fight.\n\nDid you know? When we are kind to others, it makes the world a happier place for everyone!\n\nSo, my friends, remember this story from Mexico. It reminds us that being kind and peaceful is the best way to live. And it reminds us to wish for peace for all the children and grown-ups in Culiacán.\n\nThank you for listening to my story today. Until next time, stay safe and be kind!",
    "summary": "In a city called Culiacán in Mexico, people are scared because two bad groups of grown-ups are fighting for power, making it unsafe for everyone, especially children.",
    "whyMatters": "This story matters because every child and every person in the world deserves to live in a safe place where they can play, learn, and live without being scared by fighting or bad grown-ups.",
    "category": "world",
    "date": "2026-02-26T11:37:57.010Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20from%20Far%20Away%3A%20Big%20Trouble%20in%20a%20City%20Called%20Culiac%C3%A1n%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-from-far-away-big-trouble-in-a-city-called-culiacan",
    "originalLink": "https://www.bbc.com/news/articles/cx2g3vmde0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli soldiers shot a Palestinian boy and stood around as he bled to death, video shows",
    "title": "Israeli soldiers shot a Palestinian boy and stood around as he bled to death, video shows",
    "content": "Israeli forces blocked Palestinian ambulances while a 14-year-old lay bleeding for at least 45 minutes.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:38:02.199Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20soldiers%20shot%20a%20Palestinian%20boy%20and%20stood%20around%20as%20he%20bled%20to%20death%2C%20video%20shows%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-soldiers-shot-a-palestinian-boy-and-stood-around-as-he-bled-to-death-video-shows",
    "originalLink": "https://www.bbc.com/news/articles/cpqwv9vvzx9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Real Madrid win 'for everyone who stands against racism'",
    "title": "Real Madrid win 'for everyone who stands against racism'",
    "content": "Real Madrid's win against Benfica was a \"victory for everyone who stands against racism\", midfielder Aurelien Tchouameni says.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-26T11:38:07.790Z",
    "image": "https://image.pollinations.ai/prompt/Real%20Madrid%20win%20'for%20everyone%20who%20stands%20against%20racism'%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "real-madrid-win-for-everyone-who-stands-against-racism",
    "originalLink": "https://www.bbc.com/sport/football/articles/cewzn4leyx1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bizarre VAR? Why Kelly's second yellow card became 'awful' straight red",
    "title": "Bizarre VAR? Why Kelly's second yellow card became 'awful' straight red",
    "content": "An 'awful' decision, or 'always going to be a red'? Why Juventus' Lloyd Kelly's second yellow card became a straight red in his side's Champions League exit at the hands of Galatasaray.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-26T11:38:12.969Z",
    "image": "https://image.pollinations.ai/prompt/Bizarre%20VAR%3F%20Why%20Kelly's%20second%20yellow%20card%20became%20'awful'%20straight%20red%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bizarre-var-why-kellys-second-yellow-card-became-awful-straight-red",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj32yy0vn3xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ronaldo becomes co-owner of Spanish side Almeria",
    "title": "Ronaldo becomes co-owner of Spanish side Almeria",
    "content": "Cristiano Ronaldo becomes part-owner of Spanish second division side Almeria after acquiring a 25% share in the Saudi Arabian-owned club.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-26T11:38:18.144Z",
    "image": "https://image.pollinations.ai/prompt/Ronaldo%20becomes%20co-owner%20of%20Spanish%20side%20Almeria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ronaldo-becomes-co-owner-of-spanish-side-almeria",
    "originalLink": "https://www.bbc.com/sport/football/articles/c39wry03jvmo?at_medium=RSS&at_campaign=rss"
  }
]