[
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Treasures Can Now Be Shared!",
    "content": "<h3>Hello, Little News Friends!</h3>\n\nHi everyone! It's your kid-friendly news reporter from Africa here! I have some super interesting news for you today. It's all about a very, very special hero from our continent. Can you guess who it is? It's Nelson Mandela!\n\nToday we are talking about some things that belonged to him. These things are very special. They are a prison key, some cool sunglasses, and a shirt. Amazing, right?\n\n<h3>Who Was Nelson Mandela?</h3>\n\nNelson Mandela was a true hero for all of Africa, and the whole world! He lived in a country called South Africa. He loved people very much. He wanted everyone to be treated fairly.\n\nHe wanted everyone, no matter their skin color, to live together in peace. He fought for freedom and kindness. Because of his brave fight, he had to go to prison for a very long time.\n\nBut even in prison, he never stopped believing in a better world. He taught us to be brave and to never give up. He became the first black president of South Africa! What a superstar!\n\nDid you know? People loved Nelson Mandela so much that they called him 'Madiba'. It was a special name for him!\n\n<h3>A Very Special Key</h3>\n\nNow, let's talk about the first special thing: a prison key! What is a prison? It's a place where people stay when they have done something wrong. But Nelson Mandela was put in prison because he fought for good things.\n\nHe was in prison for 27 years. That's a super long time! Imagine being away from your family and friends for so many years.\n\nThis key is not just any key. It is the key to his prison cell! It's the key that kept him locked away. It reminds us of his bravery, even when he was not free.\n\nDid you know? A key can open doors. But Nelson Mandela opened the door to freedom for many people with his courage and his words!\n\n<h3>Mandela's Cool Sunglasses</h3>\n\nNext, we have Nelson Mandela's sunglasses! Do you like wearing sunglasses on a sunny day? They make you look cool, right?\n\nMandela wore his sunglasses often. These sunglasses saw so many important moments. They saw him walk out of prison. They saw him smile at big crowds.\n\nThey saw the world change, little by little, because of his hard work. Imagine all the things those sunglasses saw! They are a part of his amazing journey.\n\nDid you know? Sunglasses protect our eyes from the sun. But Nelson Mandela helped protect people's rights and their hopes for a bright future!\n\n<h3>His Own Shirt</h3>\n\nAnd the last special item is one of his shirts! Just a shirt, you might think? No, not just any shirt. This was a shirt that Nelson Mandela wore. It was part of his everyday life.\n\nThis shirt was with him as he met important people. It was with him as he made big speeches. It was with him as he worked to make South Africa a better place for everyone.\n\nThese items are like tiny pieces of history that tell a big story. They remind us of the great man he was. It's like having a superhero's cape!\n\n<h3>What Was the Big Fight About?</h3>\n\nSo, why are we talking about these things now? Well, Nelson Mandela's daughter, who loves him very much, wanted to sell these special items. She wanted to share them with the world, maybe so people could see them in a museum, or to do good things with the money.\n\nBut some people who work for the country said, \"No! You cannot sell these! These things are part of our country's heritage!\" What does 'heritage' mean?\n\n'Heritage' means important old things that tell the story of a country and its people. Like old buildings, old songs, or very special items from heroes. They felt these things were too important to leave the country.\n\nThey felt these items should stay in South Africa. They wanted everyone in South Africa to always be able to see them. They are like national treasures!\n\n<h3>A Daughter's Wish</h3>\n\nNelson Mandela's daughter believed that she should be able to decide what happens to her father's things. She wanted to honor her father's memory in her own way.\n\nShe wanted to share his story and the meaning of these items with more people. She had a good reason in her heart.\n\n<h3>She Won!</h3>\n\nSo, what happened? There was a big 'court battle'. This is like asking a very important judge to listen to both sides and make a decision.\n\nAnd guess what? Nelson Mandela's daughter won! The judge said that she can now sell her father's key, sunglasses, and shirt. This is very big news!\n\nThis means these special items can go to a new home. Maybe they will go to a museum far away. Or maybe they will help someone do good things in the world.\n\nDid you know? Even important leaders like Nelson Mandela have families who keep their memories alive!\n\n<h3>Why These Things Are Important</h3>\n\nThis news reminds us how important Nelson Mandela was. His life and everything connected to him tell us a story of courage, hope, and freedom.\n\nThese items are like little pieces of a very big puzzle. The puzzle is Nelson Mandela's life story. They help us remember him and all the good he did.\n\nThey teach us that even small things can hold big meaning. They remind us to always be kind, be brave, and fight for what is right, just like Madiba did!\n\nLet's remember Nelson Mandela, our African hero! He taught us to love one another and to never give up on our dreams for a peaceful world. Bye for now, little news friends!",
    "summary": "Nelson Mandela's prison key, sunglasses, and shirt can now be sold after his daughter won a court battle against the government, who wanted to keep the items as national heritage.",
    "whyMatters": "This news is important because it is about special things from a great hero, Nelson Mandela, and it reminds us about how much he fought for freedom and fairness for everyone.",
    "category": "world",
    "date": "2026-01-24T04:32:15.148Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Treasures%20Can%20Now%20Be%20Shared!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-treasures-can-now-be-shared",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:32:20.326Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "title": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "content": "Reinforcements are sent to the town of Bor, a strategic staging post on the way to the capital, Juba.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:32:25.494Z",
    "image": "https://image.pollinations.ai/prompt/South%20Sudan%20army%20chief%20gives%20soldiers%20seven%20days%20to%20crush%20rebellion%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-sudan-army-chief-gives-soldiers-seven-days-to-crush-rebellion",
    "originalLink": "https://www.bbc.com/news/articles/cj0nn0dvg6jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Turkiye’s FM Fidan says Israel ‘looking for opportunity’ to attack Iran",
    "title": "Turkiye’s FM Fidan says Israel ‘looking for opportunity’ to attack Iran",
    "content": "Turkish Foreign Minister Hakan Fidan says he has conveyed concerns of possible Israeli attack to leadership in Tehran.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:32:30.812Z",
    "image": "https://image.pollinations.ai/prompt/Turkiye%E2%80%99s%20FM%20Fidan%20says%20Israel%20%E2%80%98looking%20for%20opportunity%E2%80%99%20to%20attack%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "turkiyes-fm-fidan-says-israel-looking-for-opportunity-to-attack-iran",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/turkiyes-fm-fidan-says-israel-looking-for-opportunity-to-attack-iran?traffic_source=rss"
  },
  {
    "originalTitle": "Russian ‘shadow fleet’ tanker diverted to French port by naval forces",
    "title": "A Big Boat Gets a Surprise Stop!",
    "content": "Jambo, super friends! It's me, your friendly news reporter from Africa! Today, I have a big story about a very big boat. It's like a sea adventure, but with real-life rules!\n\n<h3>A Big Boat Gets a Surprise Stop!</h3>\nImagine a giant boat, super, super big, like a floating building! It was sailing in a big, blue sea. This big boat has a funny name, 'Grinch'. But guess what? Some strong boats, like sea police, stopped it!\n\nThey made the Grinch boat go to a different place. It was a big surprise for the Grinch boat, we think!\n\n<h3>What is a Tanker?</h3>\nThe boat named Grinch is a special kind of boat called a 'tanker'. Can you guess what a tanker does? It carries lots and lots of liquid stuff! Think of a giant juice box, but for oil or gas.\n\nThese liquids help make cars go, and lights turn on. So, tankers are very important for many countries all around the world.\n\nDid you know? Some tankers are so long, they are bigger than three football fields put together! Wow! They carry a huge amount of liquid on their journeys across the ocean.\n\n<h3>Who Stopped the Grinch Boat?</h3>\nThe boats that stopped Grinch were from a special group called the 'Navy'. Think of the Navy as brave people who drive strong boats. They are like police for the sea!\n\nThese naval forces work hard to make sure everyone follows the rules on the big ocean. Just like how your teachers make sure everyone follows rules in school. Or how traffic police make sure cars follow rules on the road.\n\nThey stopped the Grinch boat near a country called France. France is very far from us, across the big sea in Europe.\n\nDid you know? Navies do many important jobs, like rescuing people at sea, helping when there are big storms, and making sure other boats are sailing safely.\n\n<h3>Where Did This Happen?</h3>\nThis whole thing happened in a beautiful sea called the Mediterranean Sea. Can you say that? Med-it-er-ra-ne-an Sea!\n\nThis sea is like a big watery highway between the land of Europe and the land of Africa. Many boats travel there every day.\n\nIt's a very busy place, just like a big market full of people and cars. So, rules are super important there to keep everyone safe!\n\nDid you know? The Mediterranean Sea touches many countries, including some in Africa like Egypt and Tunisia! It's like a big, blue neighbour to our continent.\n\n<h3>What is a 'Shadow Fleet'?</h3>\nNow, this is where it gets a little tricky, but I'll make it simple for you!\n\nThe Grinch boat was part of something called a 'shadow fleet'. What does 'shadow' mean? It means something is trying to hide, like your shadow that follows you.\n\nSo, a 'shadow fleet' is like a secret club of boats. They try to keep secrets. They don't want everyone to know where they are going or exactly what they are doing.\n\nMaybe they try to hide where they got their oil from. Or maybe they try to hide who really owns them. It's like a mystery!\n\nCountries have rules for all boats. These rules help everyone be safe and fair. But 'shadow fleet' boats try to get around these rules.\n\nIt's like playing a game where some players don't want to follow the rules. That's not fair, right? That's why the Navy stepped in.\n\nDid you know? Boats have to show flags and special numbers so everyone knows who they are and where they come from. It's like having an ID card for a boat!\n\n<h3>Why Do Boats Have Rules?</h3>\nJust like we have rules for playing games or going to school, boats have rules too! And for a very good reason!\n\nThese rules help keep everyone safe on the big, big ocean. Imagine if cars just drove anywhere on the road! It would be very messy and dangerous, wouldn't it?\n\nBoat rules help prevent accidents. They also make sure that countries know who is sailing in their waters. This helps protect the sea itself and the animals that live in it.\n\nAnd sometimes, there are rules about what kinds of things boats can carry and where they can take them. These rules help make sure everything is fair for all countries.\n\nDid you know? There are international rules for boats, which means rules that almost all countries agree on! This helps all boats sail safely and fairly around the world.\n\n<h3>What Happens Next for Grinch?</h3>\nAfter the Navy stopped the Grinch boat, they made it go to a port in France. A 'port' is like a special parking lot for big boats. It's where boats can stop and unload their stuff or take a rest.\n\nNow, special people called 'prosecutors' are looking into everything. They are like detectives for big boat rules. They work for the French government.\n\nThey are asking questions: Why was the Grinch boat trying to hide? Was it following all the rules? Where was it really going?\n\nThis is called an 'investigation'. It means they are finding out all the facts. Just like when your parents ask you questions if something unusual happens at home.\n\nIt's important to find out the truth, so everyone can learn and make sure rules are followed in the future. The Grinch boat will stay at the port while they investigate.\n\n<h3>Keeping Our Seas Safe</h3>\nSo, this story about the Grinch boat reminds us that our big, blue seas need to be kept safe. It's a huge job, but navies and countries work together to make sure that all boats follow the rules.\n\nBecause when everyone follows the rules, our oceans are safer for fish, for people, and for trade. And that's good news for everyone, even for us here in Africa!\n\nPhew! That was a big story about a big boat! Thank you for listening, my wonderful friends. Stay curious and keep learning! Kwaheri!",
    "summary": "A big boat named Grinch, which was part of a secret group of boats, was stopped by sea police near France because it might not have been following important rules.",
    "whyMatters": "This is important because everyone needs to follow rules on the big sea to keep people safe and make sure things are fair for all countries, just like following rules at school or on the road.",
    "category": "world",
    "date": "2026-01-24T04:32:56.469Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Boat%20Gets%20a%20Surprise%20Stop!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-boat-gets-a-surprise-stop",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/russian-shadow-fleet-tanker-diverted-to-french-port-by-naval-forces?traffic_source=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,430",
    "title": "Russia-Ukraine war: List of key events, day 1,430",
    "content": "These are the key developments from day 1,430 of Russia’s war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:33:01.651Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C430%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1430",
    "originalLink": "https://www.aljazeera.com/news/2026/1/23/russia-ukraine-war-list-of-key-events-day-1430?traffic_source=rss"
  },
  {
    "originalTitle": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "title": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "content": "The US president's comments have been condemned by international allies, including UK veterans and politicians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T04:33:07.608Z",
    "image": "https://image.pollinations.ai/prompt/Harry%20says%20sacrifices%20by%20Nato%20troops%20in%20Afghanistan%20deserve%20'respect'%20%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "harry-says-sacrifices-by-nato-troops-in-afghanistan-deserve-respect",
    "originalLink": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "content": "Brits, Canadians and Danes were among those who saw the toughest fighting, writes the BBC's security correspondent.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:33:12.777Z",
    "image": "https://image.pollinations.ai/prompt/Frank%20Gardner%3A%20Not%20only%20Americans%20risked%20life%20and%20limb%20to%20serve%20in%20Afghanistan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "frank-gardner-not-only-americans-risked-life-and-limb-to-serve-in-afghanistan",
    "originalLink": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "High stakes but low expectations for Ukraine talks with Russia and US",
    "title": "High stakes but low expectations for Ukraine talks with Russia and US",
    "content": "Donald Trump is pushing hard for a peace deal - but major issues between Russia and Ukraine are still unresolved, writes Sarah Rainsford.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:33:17.954Z",
    "image": "https://image.pollinations.ai/prompt/High%20stakes%20but%20low%20expectations%20for%20Ukraine%20talks%20with%20Russia%20and%20US%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "high-stakes-but-low-expectations-for-ukraine-talks-with-russia-and-us",
    "originalLink": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Euros abuse made me not want to leave hotel - Carter",
    "title": "Euros abuse made me not want to leave hotel - Carter",
    "content": "England defender Jess Carter says abuse of female footballers is getting worse and that she has had to step back from social media after receiving racist messages during Euro 2025.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-24T04:33:23.395Z",
    "image": "https://image.pollinations.ai/prompt/Euros%20abuse%20made%20me%20not%20want%20to%20leave%20hotel%20-%20Carter%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "euros-abuse-made-me-not-want-to-leave-hotel-carter",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd0y353v2x5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spurs open talks to sign Liverpool's Robertson",
    "title": "Big News! A Football Star Might Move Teams!",
    "content": "Hey there, amazing football friends! It's your kid-friendly reporter here, bringing you super exciting news from the big world of football, far away in a country called England. We know how much you love kicking a ball around with your friends, so get ready to hear about something cool happening with some very famous football teams!\n\n<h3>A Big Football Secret!</h3>\nTwo very famous football teams are talking. One team is called Tottenham Hotspur, but many people just call them 'Spurs'. The other team is Liverpool. Both teams are super good at playing football and have millions of fans all over the world, even right here in Africa!\n\nSpurs want to ask a player from Liverpool to join their team. Imagine if your friend from another school's football team was so good, you wanted them to play for your school! That's a bit like what is happening now.\n\n<h3>Who is Andy Robertson?</h3>\nThe special player everyone is talking about is called Andy Robertson. He is a fantastic football player! Right now, he plays for the Liverpool team. He is known for being super fast and for running up and down the side of the football field all game long.\n\nAndy is what we call a 'left-back'. Do you know what that means? It's a special job on the team! A left-back helps to stop the other team from scoring goals. They also run forward to help their own team score goals. It's like being a super speedy protector and helper all at once!\n\nDid you know? In football, every player has a special job or 'position'! There are goalkeepers who guard the net, defenders who stop the other team, midfielders who play in the middle, and strikers who try to score goals!\n\n<h3>Why Do Teams Talk?</h3>\nWhen the news says Tottenham 'enter into talks' with Liverpool, it means they are having important discussions. It's like when grown-ups have a meeting to talk about something very important. They are trying to agree on how Andy Robertson could leave Liverpool and join Tottenham.\n\nIf they agree, Andy would 'sign a deal'. This means he would put his name on a paper, and then he would become a player for Tottenham! It's a very big decision for a player, and for both teams too.\n\nDid you know? Players move teams all the time in football! It's called a 'transfer'. Sometimes they want to play with new friends, or maybe a new team thinks they can help them win a big trophy!\n\n<h3>Why Do Teams Want New Players?</h3>\nTeams always want to be the best! They want to win games, score lots of goals, and win big shiny trophies. To do this, they always try to find the very best players. They look for players who are fast, strong, clever, and good at kicking the ball.\n\nTottenham thinks that Andy Robertson is a fantastic player who can make their team even stronger. They believe he can help them win more games and make their fans very happy. Every team wants to build a super team, just like you want to pick the best players for your own team when you play with friends.\n\nDid you know? A 'trophy' is a special prize, usually a big cup or shield, that a team gets for winning a competition, like a championship! Winning a trophy is one of the happiest moments for any football team.\n\n<h3>About Tottenham and Liverpool</h3>\nLiverpool Football Club has bright red shirts. They have won many, many big trophies over the years. Tottenham Hotspur wears white shirts. They are also a very successful team with lots of history and exciting players.\n\nBoth teams play in huge stadiums, which are like giant outdoor arenas, filled with thousands of cheering fans. Imagine hearing all those people cheering for your favourite team! It's a very exciting atmosphere.\n\nDid you know? Football is the most popular sport in the whole wide world! Billions of people watch and play football. It brings so many people together, no matter where they are from!\n\n<h3>Imagine You Are Playing!</h3>\nThink about when you play football with your friends in your village or school. You want everyone to play their best, right? And sometimes, you might ask a new friend who is really good at dribbling or scoring to join your team. That's what these big teams are doing.\n\nThey are trying to make their team super, super strong so they can have the most fun and win the most games. It's all part of the big, exciting game of football that we all love so much. It teaches us about teamwork, fairness, and having fun!\n\nDid you know? In some countries, like America, football is called 'soccer'! But it's the same wonderful game with a ball and two goals!\n\n<h3>What Happens Next?</h3>\nNow, we will have to wait and see what happens. Will Andy Robertson join Tottenham? Or will he stay with his team, Liverpool? The teams will keep talking, and soon, we will know the answer. It's like waiting to see the end of a very exciting story!\n\nThis kind of news shows us how much excitement there is in the world of football, even when players are just moving between teams. It keeps everything interesting and fun!\n\nSo, keep playing, keep kicking that ball, and keep smiling! Football is a game for everyone, and it brings so much joy. Your kid-friendly reporter signing off for now!",
    "category": "world",
    "date": "2026-01-24T04:33:42.589Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News!%20A%20Football%20Star%20Might%20Move%20Teams!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-a-football-star-might-move-teams",
    "originalLink": "https://www.bbc.com/sport/football/articles/c79rr2440elo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palmer 'very, very happy' at Chelsea, says Rosenior",
    "title": "Palmer 'very, very happy' at Chelsea, says Rosenior",
    "content": "Reports suggest Chelsea forward Cole Palmer is homesick amid links to Manchester United.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T04:33:47.798Z",
    "image": "https://image.pollinations.ai/prompt/Palmer%20'very%2C%20very%20happy'%20at%20Chelsea%2C%20says%20Rosenior%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palmer-very-very-happy-at-chelsea-says-rosenior",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy8ylx03yqqo?at_medium=RSS&at_campaign=rss"
  }
]