[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Ghana's Heart Aches: Sad News from Far Away",
    "content": "<h3>Hello, Friends from Africa!</h3>\nHello, amazing boys and girls! It's your kid-friendly news reporter here, bringing you important stories from our big continent, Africa, and beyond. Today, we have some news that makes our hearts feel a little heavy. It's about some special people from our very own Ghana.\n\n<h3>A Faraway Fight</h3>\nImagine our beautiful Ghana, full of sunshine, music, and friendly smiles. Now, imagine two countries far, far away from Africa. One is called Ukraine, and the other is called Russia. These two countries have been having a very big, sad fight. This kind of big fight is called a war.\n\nDid you know? Ukraine is a country in Europe, known for its wide, open fields where sunflowers grow tall and bright! Russia is the biggest country in the whole world, so big it touches two continents!\n\nWhen countries fight, it's very serious and can be dangerous for everyone living there. It's not like a small argument between friends; it's a really big, scary thing that no one wants to happen.\n\n<h3>Our Ghanaian Friends in Ukraine</h3>\nNow, you might wonder, why are we talking about a fight so far away? Well, sometimes, people from Ghana travel to other countries. They might go to study at a big university, or to work and send money back home to their families. It's a way for them to learn new things and help their loved ones.\n\nMany young people from Ghana, especially students, were living in Ukraine when this big fight started. They were there, learning and hoping to build a brighter future for themselves and for Ghana.\n\nDid you know? Ghana is famous for its delicious cocoa beans, which are used to make yummy chocolate! Maybe you've eaten some chocolate made from Ghanaian cocoa!\n\n<h3>Very Sad News from Our Leaders</h3>\nOur country Ghana has special helpers called ministers. A minister is like a very important leader who helps the President look after different parts of our country. This minister helps look after all the Ghanaians who live in other parts of the world.\n\nThis minister shared some very sad news with everyone. They told us that 55 Ghanaians have lost their lives because of this big fight in Ukraine. When we say 'lost their lives,' it means they are no longer with us. They have passed away because of the war.\n\nThink about 55 people. Imagine your classroom, maybe there are 30 children. Now, imagine almost two classrooms full of people. That's how many of our Ghanaian brothers and sisters we are talking about. It's a very big and very sad number for our country.\n\n<h3>The Highest Number</h3>\nThis news is extra sad because the minister said that these 55 Ghanaians are the most people lost from any single African country in this war. That means that out of all the countries in Africa, Ghana has had the most people affected in this faraway fight.\n\nThis makes our hearts feel very heavy for Ghana. It means many families in Ghana are now feeling very, very sad because they have lost a loved one who was far away.\n\nDid you know? Africa is a very big continent, home to 54 different countries, each with its own special cultures and traditions!\n\n<h3>Remembering Our Friends</h3>\nEven though these people were far away, they were still a part of our big Ghanaian family. They had dreams, just like you have dreams. They had families who loved them very much.\n\nWhen something sad like this happens, it's important to remember the people we've lost. We think about their families, their friends, and everyone who cared for them. We send our love and prayers to them from here in Africa.\n\n<h3>Why Peace is So Important</h3>\nThis sad news reminds us all about how important peace is. When people and countries live in peace, everyone is safe. Children can go to school, parents can go to work, and families can be together without fear.\n\nWar brings so much sadness and danger. That's why leaders all over the world, and all of us, should always try to make peace. We should try to solve problems by talking, not by fighting.\n\nDid you know? The Adinkra symbol 'Sankofa' from Ghana means to 'go back and get it,' reminding us to learn from the past to build a better future.\n\nLet's all try to be kind to each other in our homes, in our schools, and in our communities. When we are kind and peaceful, we help make the whole world a better and safer place for everyone. Let's hope for peace everywhere, so no more hearts have to feel this kind of sadness.",
    "summary": "Ghana is sad because 55 of its people lost their lives in a big fight far away in Ukraine, which is the most from any African country.",
    "whyMatters": "This news matters because it shows how a big fight far away can still make people in our home, Ghana, very sad, and it reminds us how important it is for everyone to live in peace.",
    "category": "world",
    "date": "2026-02-28T03:50:36.792Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Heart%20Aches%3A%20Sad%20News%20from%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-heart-aches-sad-news-from-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Big News from Burkina Faso: Justice for Two Young Girls!",
    "content": "Jambo, amazing kids of Africa! It's your friendly news reporter, here to share a very important story from a beautiful country called Burkina Faso. It’s a story about how grown-ups work together to make sure everyone is safe and happy, especially children. Sometimes, grown-ups do very, very wrong things, but it's important to know that there are always good people who will help make things right. Let's talk about what happened.\n\n<h3>What Happened in Burkina Faso?</h3>\nImagine a sunny country where people are kind and families live together. In Burkina Faso, there were two young girls. They should have felt safe and loved, just like you. But sadly, a grown-up who was supposed to be a helper and a good person did some very, very bad things to them. This grown-up was a visitor from another country, from far away, called America. He was supposed to be a diplomat, which is like a special messenger who helps different countries talk to each other. But instead of helping, he hurt these two girls.\n\n<h3>When Helpers Do Harm</h3>\nThis grown-up was very unkind. He took advantage of a time when the girls’ family was feeling very worried and sad. Their mother was very, very sick, and the family needed a lot of help. Instead of being kind and supportive, this grown-up chose to be mean and do bad things that made the girls feel scared and unhappy. He broke their trust, which is like breaking a very important promise. When someone you trust does something bad, it can make you feel very confused and sad. But remember, it is NEVER a child’s fault if a grown-up does bad things.\n\n<h3>\"Did You Know?\" Fact!</h3>\nDid you know that Burkina Faso is famous for its beautiful fabrics and its love for music and arts? It's a country with a lot of sunshine and warm, welcoming people!\n\n<h3>Getting Help and Speaking Up</h3>\nEven though these bad things happened, something very important also happened: the girls and their family were brave enough to tell other grown-ups what was going on. This is super important! If anyone ever makes you feel uncomfortable, scared, or sad, or if they do things that are not right, it is always, always okay to tell a trusted grown-up. This could be your mom, dad, grandma, grandpa, a teacher, or another family member. Speaking up is very, very brave, and it helps good people know when someone needs help.\n\n<h3>What Happens Next? The Court Steps In!</h3>\nBecause the girls were brave and told someone, other good grown-ups, like police officers and lawyers, started to work to help them. This story went to a very special place called a court. A court is a place where a very important grown-up called a judge listens to what happened. The judge looks at all the information and decides if someone did something wrong and what should happen next. It's like a very serious classroom where grown-ups learn about rules and fairness.\n\n<h3>\"Did You Know?\" Fact!</h3>\nDid you know that a judge's job is to make sure everyone is treated fairly and that the rules (called laws) are followed? They listen very carefully to everyone before making a big decision.\n\n<h3>Justice for the Girls</h3>\nIn this story, the judge listened very carefully. They decided that the grown-up who hurt the girls did something terribly wrong. Because his actions were so bad and made the girls so unhappy and unsafe, the judge decided that he would have to stay in a special place for a very, very long time, for the rest of his life. This is called a sentence. It means he cannot hurt anyone else ever again, and the girls and their community can feel safer.\n\n<h3>Why This Is Important for All Kids</h3>\nThis news might sound a little bit sad because something bad happened. But it's also very good news because it shows that justice works! It shows that: \n\n1.  **Bad people get caught:** Even if someone tries to hide their bad actions, good people will find out.\n2.  **Justice happens:** Grown-ups in courts work hard to make sure that people who do wrong things face consequences.\n3.  **Kids are protected:** There are many, many grown-ups who care about children and want to keep them safe.\n4.  **Speaking up helps:** When you tell a trusted adult about something that feels wrong, you are helping yourself and maybe even helping others.\n\nAlways remember, dear friends, that you are important, you are loved, and you deserve to feel safe and happy every single day. If you ever need help, please, please tell a trusted grown-up. They are there to listen and protect you. Keep smiling, and keep being amazing, brave kids!\n\n<h3>\"Did You Know?\" Fact!</h3>\nDid you know that there are special hotlines and helpers in many countries, including African countries, where kids can call or talk to someone if they feel unsafe or need help? You are never alone!\n\nThis story from Burkina Faso reminds us that even when bad things happen, good people work hard to make things right, and justice will always try to shine brightly. Be safe, be kind, and remember to always tell a trusted grown-up if something makes you feel worried!",
    "summary": "A bad grown-up who hurt two young girls in Burkina Faso has been caught and will stay away for a very long time, showing that justice helps keep everyone safe.",
    "whyMatters": "It's important to know that if someone does bad things, they will face consequences, and there are always good grown-ups who will help children and make sure they are safe and happy.",
    "category": "world",
    "date": "2026-02-28T03:50:53.858Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Burkina%20Faso%3A%20Justice%20for%20Two%20Young%20Girls!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-burkina-faso-justice-for-two-young-girls",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "content": "The disgraced financier was in talks to buy luxury abode Bin Ennakhi - but the purchase was never completed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T03:50:58.983Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20tried%20to%20buy%20a%20palace%20in%20Morocco%20days%20before%20his%20arrest%20in%202019%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-tried-to-buy-a-palace-in-morocco-days-before-his-arrest-in-2019",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump administration charges 30 more people for Minnesota church protest",
    "title": "Trump administration charges 30 more people for Minnesota church protest",
    "content": "The expanded indictment targets protesters who rallied at Cities Church in St Paul against Trump's immigration surge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-28T03:51:04.251Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20administration%20charges%2030%20more%20people%20for%20Minnesota%20church%20protest%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-administration-charges-30-more-people-for-minnesota-church-protest",
    "originalLink": "https://www.aljazeera.com/news/2026/2/28/trump-administration-charges-30-more-people-for-minnesota-church-protest?traffic_source=rss"
  },
  {
    "originalTitle": "Trump, Iran and geopolitical mind games",
    "title": "Trump, Iran and geopolitical mind games",
    "content": "Incoherent messaging and inconsistent policy positions - Trump’s chaotic Iran gambit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-28T03:51:09.373Z",
    "image": "https://image.pollinations.ai/prompt/Trump%2C%20Iran%20and%20geopolitical%20mind%20games%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-iran-and-geopolitical-mind-games",
    "originalLink": "https://www.aljazeera.com/video/the-listening-post/2026/2/28/trump-iran-and-geopolitical-mind-games?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan-Afghanistan live: Iran, EU urge dialogue amid deadly clashes",
    "title": "Pakistan-Afghanistan live: Iran, EU urge dialogue amid deadly clashes",
    "content": "Pakistan said it targeted Taliban forces in Afghanistan's Kabul, border regions; UN chief says civilians also impacted.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T03:51:14.498Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan-Afghanistan%20live%3A%20Iran%2C%20EU%20urge%20dialogue%20amid%20deadly%20clashes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-afghanistan-live-iran-eu-urge-dialogue-amid-deadly-clashes",
    "originalLink": "https://www.aljazeera.com/news/liveblog/2026/2/28/pakistan-afghanistan-live-calls-for-dialogue-amid-deadly-border-clashes?traffic_source=rss"
  },
  {
    "originalTitle": "Bill Clinton asked about hot tub photo and testifies he knew 'nothing' of Epstein crimes",
    "title": "Bill Clinton asked about hot tub photo and testifies he knew 'nothing' of Epstein crimes",
    "content": "The former president told the committe that he would never have flown on Epstein's plane if he \"had any inkling of what he was doing\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-28T03:51:20.224Z",
    "image": "https://image.pollinations.ai/prompt/Bill%20Clinton%20asked%20about%20hot%20tub%20photo%20and%20testifies%20he%20knew%20'nothing'%20of%20Epstein%20crimes%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bill-clinton-asked-about-hot-tub-photo-and-testifies-he-knew-nothing-of-epstein-crimes",
    "originalLink": "https://www.bbc.com/news/articles/cvg345qvld5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump 'not thrilled' with Iran after latest talks on nuclear programme",
    "title": "Trump 'not thrilled' with Iran after latest talks on nuclear programme",
    "content": "President Trump said he was not happy with Iran's stance, but had not yet decided whether to attack.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-28T03:51:25.406Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20'not%20thrilled'%20with%20Iran%20after%20latest%20talks%20on%20nuclear%20programme%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-not-thrilled-with-iran-after-latest-talks-on-nuclear-programme",
    "originalLink": "https://www.bbc.com/news/articles/c309vz0z893o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At least 11 killed after military plane carrying banknotes crashes in Bolivia",
    "title": "At least 11 killed after military plane carrying banknotes crashes in Bolivia",
    "content": "The cargo plane crashed while landing in the city of El Alto, reportedly hitting vehicles on a motorway.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T03:51:30.521Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2011%20killed%20after%20military%20plane%20carrying%20banknotes%20crashes%20in%20Bolivia%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-11-killed-after-military-plane-carrying-banknotes-crashes-in-bolivia",
    "originalLink": "https://www.bbc.com/news/articles/c0rjpxxpp49o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Emery's title 'dream' over - but will Villa salvage top-five hopes?",
    "title": "Emery's title 'dream' over - but will Villa salvage top-five hopes?",
    "content": "Aston Villa boss Unai Emery concedes his Premier League title \"dreams\" are over, but will the club resurrect their Champions League hopes?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T03:51:35.811Z",
    "image": "https://image.pollinations.ai/prompt/Emery's%20title%20'dream'%20over%20-%20but%20will%20Villa%20salvage%20top-five%20hopes%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "emerys-title-dream-over-but-will-villa-salvage-top-five-hopes",
    "originalLink": "https://www.bbc.com/sport/football/articles/c78x13vvnv5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chelsea to face holders PSG in Champions League last 16",
    "title": "Chelsea to face holders PSG in Champions League last 16",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League last 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-28T03:51:40.926Z",
    "image": "https://image.pollinations.ai/prompt/Chelsea%20to%20face%20holders%20PSG%20in%20Champions%20League%20last%2016%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chelsea-to-face-holders-psg-in-champions-league-last-16",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T03:51:46.060Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20needs%20to%20stay%20'fully%20focused'%20after%20Arsenal%20talk%20-%20Howe%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss"
  }
]