[
  {
    "originalTitle": "People cling to treetops as 'worst floods in a generation' sweep Mozambique",
    "title": "Big Water Story in Mozambique!",
    "content": "<h3>Hello from Africa!</h3>\nHello, amazing friends! Your friendly news reporter is here with an important story from a country called Mozambique. Can you say \"Mo-zam-beek\"? It's a wonderful country right here in Africa, with lots of sunshine and happy people. But something very big happened there recently. We want to tell you about it in a simple way.\n\n<h3>What Happened? Too Much Rain!</h3>\nImagine a huge water tap turned on and on, for days and days! That's what happened in Mozambique. Lots and lots of rain fell from the sky. We all know rain is good for plants and trees, and it helps fill our water tanks. But sometimes, too much rain can be a problem. In Mozambique, the rain was so much that it made big, big puddles everywhere.\n\n<h3>What is a Flood?</h3>\nWhen there is too much rain, and the ground cannot drink all the water, it starts to fill up. Like when you fill your bathtub too much, and the water spills over! This giant spilling of water over land is called a **flood**. The water covers roads, fields, and even houses. It can make rivers much bigger and stronger too. This flood in Mozambique was a very, very big one. Some people say it was the biggest flood they have seen in a whole \"generation.\" That means it's the biggest flood in a very, very long time – perhaps even since your parents were little kids!\n\n<h3>People Needed Help Fast!</h3>\nCan you imagine water reaching up to your house? In Mozambique, the water went so high that it covered many homes. People had to run to find safe places. Some brave people had to climb up tall trees! They sat in the tree branches, high above the water, waiting for someone to come and help them. They were trying to be safe from the big water. It was a bit scary for them, but they were very strong and brave.\n\n<h3>Did You Know?</h3>\nDid you know that Mozambique is famous for its beautiful beaches and yummy seafood? It has a very long coastline along the Indian Ocean. It's a sunny place most of the time!\n\n<h3>Friends From Far Away Come to Help</h3>\nWhen something big and difficult happens, people often help each other. And guess what? People from other countries came to help Mozambique! Brave helpers from a country called Brazil, which is very, very far away across the ocean, came to lend a hand. Our neighbours from South Africa, which is very close to Mozambique, also sent help. And even friends from the United Kingdom, which is a very distant country, came to help too!\n\n<h3>How Do They Help?</h3>\nThese helpers are called **rescue teams**. They have special boats and even helicopters. Imagine a helicopter flying over the water, looking for people in trees or on rooftops! They use these boats and helicopters to find people who are stuck. Then, they carefully take them to safe places, where there is no water. They also bring food, clean water, and blankets to help everyone stay warm and healthy.\n\n<h3>Did You Know?</h3>\nDid you know that a \"rescue team\" is like a group of superheroes? They train very hard to help people when there is danger. They are very brave!\n\n<h3>Why Is Helping So Important?</h3>\nWhen a flood happens, people can lose their homes. They can lose their clothes and their toys. They might not have food or clean water. So, all this help is super important! It shows that people all around the world care about each other. It shows that even when big troubles happen, we can work together to make things better. It’s like when your friend falls, you help them up!\n\n<h3>What Happens After the Water Goes Down?</h3>\nAfter some time, the big water will slowly go down. Then, the people in Mozambique will start to clean up. It will be a very big job! They will need to fix their houses and clean their villages. It will take a long time, but with the help of their friends and family, and the help from other countries, they will make their homes safe and happy again. They are strong and will work hard to rebuild.\n\n<h3>Did You Know?</h3>\nDid you know that even a small act of kindness, like sharing your toys or helping a friend, makes a big difference? Helping others makes us all feel good!\n\n<h3>A Message of Hope</h3>\nSo, even though this was a very big flood and a bit scary, we know that the people of Mozambique are brave. And they have many friends helping them. We send our love and good thoughts to everyone in Mozambique. Let's remember to always be kind and help each other, just like the rescue teams are helping the people there. Be safe and be kind, everyone!",
    "summary": "Big rain caused a very bad flood in Mozambique, making people climb trees for safety, but many helpers from other countries are working hard to rescue them and keep them safe.",
    "whyMatters": "This is important because it shows how nature can be powerful, and how people from all over the world can come together to help each other when big troubles happen, reminding us to be kind and caring.",
    "category": "world",
    "date": "2026-01-26T01:25:29.223Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Water%20Story%20in%20Mozambique!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-water-story-in-mozambique",
    "originalLink": "https://www.bbc.com/news/articles/cddgq9z4899o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenya's ex-deputy president alleges assassination attempt in church attack",
    "title": "Police are Helping Keep Everyone Safe in Kenya!",
    "content": "Jambo, amazing kids of Africa! Today, we have some important news from our lovely country, Kenya. Grown-ups are working hard to keep everyone safe, especially our leaders and important places like churches.\n\n<h3>What Happened in Kenya?</h3>\nSomething not so nice happened recently. A very important person, our former Deputy President, Mr. William Ruto, was visiting a church. A church is a special place where people go to pray and feel peaceful. It's a place for everyone to be together and feel safe.\n\nBut during his visit, something bad happened outside the church. Someone tried to cause trouble. This made many people feel worried. Mr. Ruto said that someone tried to hurt him and others. But do not worry, because the police are on the job!\n\n<h3>Who is Mr. William Ruto?</h3>\nMr. William Ruto is a very important leader in Kenya. He used to be the Deputy President. Think of him like a very helpful big brother to the President! He helped the President run our country and make important decisions for all of us. Leaders like him work hard to make Kenya a better place for everyone, including you!\n\nDid you know? Kenya's capital city is Nairobi! It's a big, beautiful city with tall buildings and lovely parks.\n\n<h3>What Does 'Assassination Attempt' Mean?</h3>\nThis is a big word, but let's make it simple. An 'assassination attempt' means that someone tried to hurt a leader very badly, or even try to make them stop being alive. It's a very serious thing. But the most important part is that Mr. Ruto is safe! No one was badly hurt. This is thanks to quick action and the watchful eyes of people around.\n\nIt's like when you're playing, and someone tries to push you, but your friend catches you before you fall. It's a bad try, but you are okay!\n\n<h3>What Did the Minister Say?</h3>\nAfter this happened, a very important grown-up called the 'Interior Minister' spoke up. His name is Mr. Kithure Kindiki. An Interior Minister is like the head helper for keeping everyone safe and sound in the whole country. He works with the police and other safety people.\n\nMr. Kindiki said that what happened was very, very wrong. He 'condemned' the attack. When someone 'condemns' something, it means they say it is bad and unacceptable. He was sad and angry that someone tried to cause trouble, especially in a church.\n\nDid you know? The Maasai people of Kenya are famous for their beautiful colourful clothes and jumping dances! They are a wonderful part of Kenya's culture.\n\n<h3>The Police Are Investigating!</h3>\nThe most important thing is that our brave police officers are working very hard! They are 'investigating'. When police 'investigate', it means they are looking for clues. They are asking questions, looking at everything carefully, and trying to find out exactly what happened and who did it.\n\nThey want to make sure that the people who tried to cause trouble are found. They want to make sure such a bad thing does not happen again. Our police are heroes who protect us all every day!\n\nDid you know? Police officers wear uniforms so you can easily spot them if you ever need help! Their uniform often has special badges too.\n\n<h3>Why Are Churches Special?</h3>\nChurches, like other places of worship such as mosques or temples, are very special. They are places where people go to feel happy, to learn good things, and to be with their community. Everyone should feel safe and peaceful when they are in such a place.\n\nIt's like your school or your home – places where you expect to be safe and happy. That's why it's extra sad when something bad happens near a church.\n\nDid you know? Kenya is home to many amazing animals like lions, elephants, giraffes, and zebras! Many tourists come to Kenya just to see them in the wild.\n\n<h3>Keeping Kenya Safe for Everyone</h3>\nThis news might sound a little scary, but remember, the grown-ups are in charge. Our leaders, the police, and everyone working together want to make sure Kenya stays a safe and wonderful place for all of us.\n\nEven when bad things try to happen, there are always good people, like our police, who stand up to protect us. They are working to find answers and to make sure everyone can feel safe, whether they are in a church, at school, or playing in their backyards.\n\nSo, let's all remember to be kind to each other and help our grown-ups keep our communities strong and peaceful. Stay safe, little explorers, and keep learning about our amazing continent!\n",
    "summary": "Kenya's former Deputy President, Mr. William Ruto, was safe after an alleged attempt to cause trouble at a church, and the police are working hard to investigate what happened and keep everyone safe.",
    "whyMatters": "This is important because it shows that our leaders and police are working hard to protect important people and places like churches, making sure everyone in Kenya can feel safe and peaceful.",
    "category": "politics",
    "date": "2026-01-26T01:25:46.292Z",
    "image": "https://image.pollinations.ai/prompt/Police%20are%20Helping%20Keep%20Everyone%20Safe%20in%20Kenya!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-are-helping-keep-everyone-safe-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cpqyxew338po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "content": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:25:51.456Z",
    "image": "https://image.pollinations.ai/prompt/'Half%20of%20my%20friends%20were%20killed'%20-%20the%20girls%20returning%20to%20a%20school%20caught%20up%20in%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "half-of-my-friends-were-killed-the-girls-returning-to-a-school-caught-up-in-war",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Minnesota governor wants federal immigration agents out after Pretti killed",
    "title": "A Sad Story in America: Why the Big Boss in Minnesota Wants Changes",
    "content": "<h3>Hello from Your African News Friend!</h3>\n\nHello, my wonderful friends! It's your friendly news reporter here, bringing you stories from all over the world. Today, we're going on a little trip to a faraway place called Minnesota in America. It's a big country, just like our wonderful African countries are big and full of different places. We're going to talk about something important that happened there, and why some grown-ups are feeling very sad and want to make things better.\n\n<h3>What Happened Far Away in Minnesota?</h3>\n\nImagine a busy town, full of people going about their day. In this town, something very, very sad happened. A person named Mr. Pretti, who was a grown-up, got hurt very badly by some special helpers. Sadly, Mr. Pretti passed away. This made many people, especially Mr. Pretti's family and friends, very, very sad.\n\nThese special helpers are called 'federal immigration agents'. That's a big name, right? Don't worry, we'll talk more about what they do in a moment. But because of what happened to Mr. Pretti, many people are asking questions and feeling upset. They want to know why this happened and how to stop sad things like this from happening again.\n\nDid you know? America is very far away from Africa, but we can still learn about what happens there and understand how people feel!\n\n<h3>Who Are the Special Country Helpers?</h3>\n\nSo, who are these 'federal immigration agents'? Imagine your country has a front door, like your house. These special helpers are like the people who stand at the door to make sure everyone who comes in has a special ticket. They help check passports and make sure people have permission to live and work in the country.\n\nTheir job is usually to keep the country safe and to make sure everyone follows the rules about who can come and stay. Sometimes, people come into a country without a special ticket. These helpers are then asked to find those people. They are like a special kind of police, but just for people moving between countries.\n\nDid you know? Every country has rules about who can visit or live there. It's like having rules in your home or school to keep everyone safe and happy!\n\n<h3>Why Is the Big Boss Upset?</h3>\n\nIn Minnesota, there is a very important leader called the 'governor'. You can think of him like the big boss of that part of America. His name is Governor Walz. When he heard about what happened to Mr. Pretti, he was very, very upset. He said it was a terrible thing.\n\nBecause he was so upset, Governor Walz wants these special country helpers to leave his state. He feels that what they did was wrong and that they are not making the people in Minnesota feel safe. He wants them to pack their bags and go, so he can try to make things better for everyone there.\n\nHe believes that everyone, no matter where they come from, should be treated with kindness and respect. And he believes that what happened to Mr. Pretti was not kind or respectful. The governor is working very hard to protect the people in his state.\n\nDid you know? A 'governor' is like the main leader for a part of a country, making sure the people there are looked after, just like the president or prime minister leads the whole country!\n\n<h3>What Are 'Immigration Rules'?</h3>\n\nLet's talk a little more about 'immigration rules'. This simply means the rules about how people move from one country to another. Sometimes, people move to a new country to find a new home, to work, or to be with their family. It's like going to live in a different town, but much further away!\n\nTo do this, you usually need special permission, like a special stamp in your passport or a piece of paper. If you don't have these, you might be called an 'undocumented immigrant'. This just means you don't have the right papers to be there.\n\nThe special country helpers' job is to find people who don't have these papers. But even when doing their job, everyone agrees that helpers should always be careful and kind. That's why many people are upset about Mr. Pretti.\n\nDid you know? Many people in the world live in a different country from where they were born! They are called immigrants or visitors, and they often bring new ideas and cultures with them.\n\n<h3>Why Is Everyone Talking About This?</h3>\n\nThis sad story has made many people talk. The big boss of all of America is called the President, and the people who work with him are called the 'Trump administration'. They are also being asked a lot of questions. People want to know why these special helpers acted the way they did.\n\nIt's like when something goes wrong at school, and the teachers and headmaster have to talk about it and decide how to make sure it doesn't happen again. Many grown-ups in America want the rules about how these special helpers do their job to change. They want to make sure everyone is safe, and that no one gets hurt like Mr. Pretti did.\n\nDid you know? When many people talk about something important, it helps leaders understand what people want and need to change!\n\n<h3>Making Things Better</h3>\n\nThis story is a bit sad, but it's important to know that many good people, like Governor Walz, are trying to make things better. They want to make sure that everyone living in America, no matter where they come from, feels safe and is treated fairly.\n\nIt's a reminder that we should all try to be kind to each other, listen to each other, and help everyone feel welcome. Even though this happened far away, it teaches us that rules are important, but so is being kind and making sure everyone is safe.\n\nWe hope that the leaders in America can find a way to make sure everyone is protected and that sad things like this don't happen again. And that's your news from your friendly reporter, reminding you to always be kind! Bye for now!\n\nDid you know? Being kind to others is one of the best ways to make the world a happier and safer place for everyone!\n",
    "summary": "The leader of Minnesota, Governor Walz, is upset and wants special country helpers to leave his state after a person named Mr. Pretti sadly passed away during an interaction with them.",
    "whyMatters": "It's important because it reminds us that everyone deserves to be safe and treated fairly, and leaders are working to make sure rules about who lives in a country are handled with kindness and care.",
    "category": "world",
    "date": "2026-01-26T01:26:09.527Z",
    "image": "https://image.pollinations.ai/prompt/A%20Sad%20Story%20in%20America%3A%20Why%20the%20Big%20Boss%20in%20Minnesota%20Wants%20Changes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-sad-story-in-america-why-the-big-boss-in-minnesota-wants-changes",
    "originalLink": "https://www.aljazeera.com/news/2026/1/25/minnesota-governor-wants-federal-immigration-agents-out-after-pretti-killed?traffic_source=rss"
  },
  {
    "originalTitle": "Israel says Rafah crossing to open after search for last captive body ends",
    "title": "Israel says Rafah crossing to open after search for last captive body ends",
    "content": "Netanyahu's office says the border crossing with Egypt will reopen after search for soldier Ran Gvili's remains is over.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-26T01:26:14.705Z",
    "image": "https://image.pollinations.ai/prompt/Israel%20says%20Rafah%20crossing%20to%20open%20after%20search%20for%20last%20captive%20body%20ends%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israel-says-rafah-crossing-to-open-after-search-for-last-captive-body-ends",
    "originalLink": "https://www.aljazeera.com/news/2026/1/25/hamas-says-gave-israel-mediators-details-about-last-gaza-captives-remains?traffic_source=rss"
  },
  {
    "originalTitle": "What’s behind the recent shift in US defence strategy?",
    "title": "What’s behind the recent shift in US defence strategy?",
    "content": "Washington has revealed its new national defence strategy.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:19.879Z",
    "image": "https://image.pollinations.ai/prompt/What%E2%80%99s%20behind%20the%20recent%20shift%20in%20US%20defence%20strategy%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "whats-behind-the-recent-shift-in-us-defence-strategy",
    "originalLink": "https://www.aljazeera.com/video/inside-story/2026/1/25/whats-behind-the-recent-shift-in-us-defence?traffic_source=rss"
  },
  {
    "originalTitle": "Video shows moments around fatal shooting of Alex Pretti in Minneapolis",
    "title": "Video shows moments around fatal shooting of Alex Pretti in Minneapolis",
    "content": "Bystander footage has captured the seconds before the killing of 37-year-old Alex Pretti.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:25.687Z",
    "image": "https://image.pollinations.ai/prompt/Video%20shows%20moments%20around%20fatal%20shooting%20of%20Alex%20Pretti%20in%20Minneapolis%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "video-shows-moments-around-fatal-shooting-of-alex-pretti-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/videos/cp372pqq2rlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "content": "He has been described as an avid outdoorsman who loved mountain biking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:30.856Z",
    "image": "https://image.pollinations.ai/prompt/Who%20was%20Alex%20Pretti%2C%20the%20intensive%20care%20nurse%20shot%20dead%20in%20Minneapolis%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-was-alex-pretti-the-intensive-care-nurse-shot-dead-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russia using Interpol's wanted list to target critics abroad, leak reveals",
    "title": "Russia using Interpol's wanted list to target critics abroad, leak reveals",
    "content": "A leak exposes for the first time the extent of Russia’s misuse of Interpol to request the arrest of critics.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:36.022Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20using%20Interpol's%20wanted%20list%20to%20target%20critics%20abroad%2C%20leak%20reveals%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-using-interpols-wanted-list-to-target-critics-abroad-leak-reveals",
    "originalLink": "https://www.bbc.com/news/articles/c20gg729y1yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "title": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "content": "As Michael Carrick's perfect start at Manchester United continues, is he building a case for the job longer term?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:41.626Z",
    "image": "https://image.pollinations.ai/prompt/Hardly%20anyone%20would%20have%20picked%20Carrick%20to%20be%20Man%20Utd%20boss%20-%20but%20now%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hardly-anyone-would-have-picked-carrick-to-be-man-utd-boss-but-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxjdk4rk1xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "title": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "content": "Arsenal's winless run may normally be cause for concern - but the stats suggest they are still in control of the Premier League title race.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:46.790Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Arsenal's%20wobble%20may%20not%20even%20matter%20-%20despite%20'feeling%20pressure'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-arsenals-wobble-may-not-even-matter-despite-feeling-pressure",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2xvq5ng0xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Another unbelievable result' - but what's different about Man Utd now?",
    "title": "'Another unbelievable result' - but what's different about Man Utd now?",
    "content": "MOTD pundit Danny Murphy explains how Manchester United earned their impressive win at Premier League leaders Arsenal, and how he feels the Gunners will react.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T01:26:51.968Z",
    "image": "https://image.pollinations.ai/prompt/'Another%20unbelievable%20result'%20-%20but%20what's%20different%20about%20Man%20Utd%20now%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "another-unbelievable-result-but-whats-different-about-man-utd-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62vk5l68x3o?at_medium=RSS&at_campaign=rss"
  }
]