[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "content": "Days of competition culminate in a fishing contest rooted in efforts to cement local peace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:19:42.139Z",
    "image": "https://image.pollinations.ai/prompt/Catch%20of%20the%20day%3A%20Pictures%20from%20spectacular%20Nigerian%20fishing%20festival%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "catch-of-the-day-pictures-from-spectacular-nigerian-fishing-festival",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Good News for Fairness: Rules for Everyone in Cameroon!",
    "content": "<h3>Hello from Africa!</h3>\nHi everyone! It's your friendly reporter, ready to tell you an important story from our beautiful continent, Africa! Today, we're going on an adventure to learn about fairness and rules in a country called Cameroon. Cameroon is a land of amazing animals, tall mountains, and kind people. Sometimes, even in wonderful places, things can get a little tricky, but guess what? Good things can happen too, showing us that rules are important for everyone!\n\n<h3>What Happened in Cameroon?</h3>\nIn Cameroon, there's a special part of the country where many people speak English. Sometimes, people in this part of Cameroon have had some disagreements and problems. When there are problems, soldiers usually come to help keep everyone safe and sound. Soldiers wear special uniforms and have a very important job to protect their country and its people.\n\n<h3>A Very Big Mistake</h3>\nBut sometimes, even people with important jobs can make big mistakes. In this story, three soldiers in Cameroon made a very, very big mistake. They hurt some regular people, people who were not fighting and were just trying to live their lives. This made many, many people sad, confused, and worried. It's never okay to hurt innocent people, especially when your job is to protect them.\n\n<h3>What Are Soldiers Supposed to Do?</h3>\nSoldiers have special rules they must follow, just like you have rules at school or at home. Their main job is to keep their country safe from danger and to protect all the people who live there. They are taught to be brave and strong, but also to be kind and respectful. They are definitely not supposed to hurt regular people. Rules help us all know what is right and wrong, and they help us stay safe. Imagine if there were no rules for playing games; it would be very messy!\n\n<b>Did you know?</b> Rules are like invisible helpers that keep us safe and help us play fair in games and in life!\n\n<h3>Looking for Justice</h3>\nWhen someone does something wrong, like these soldiers did, it's very important to find out what happened and to make things fair again. This is called 'seeking justice.' Grown-ups, called judges, listen to everyone involved. They look at all the clues and evidence, just like a detective. They want to understand everything so they can make a fair decision. This is a very important job because it helps everyone trust that rules will be followed.\n\n<h3>What is Justice?</h3>\nJustice means making things fair and right. It means that if someone does something wrong, they need to take responsibility for it. It also means that people who were hurt get to feel that their safety and rights are important. When justice happens, it helps everyone feel a bit better, knowing that rules are important and apply to everyone, no matter who they are. It’s like when someone breaks a toy, and they say sorry and help fix it – that’s a small bit of justice!\n\n<b>Did you know?</b> Every country in Africa has laws, which are very important rules, to protect all its citizens and make sure everyone is treated fairly!\n\n<h3>The Judges Make a Decision</h3>\nAfter looking at all the clues and listening carefully, the judges made a very important decision. They found that the three soldiers had indeed broken very serious rules and had hurt regular people. Because of this, the judges decided that the soldiers had to go to prison. Prison is a place where grown-ups go if they break big laws and do bad things. This shows everyone that no one is above the law, not even soldiers.\n\n<h3>Why This News is Important for Africa</h3>\nThis news is very important, not just for Cameroon, but for all of Africa! It tells everyone that leaders and soldiers must always protect their people and follow the rules. It shows that even when very sad and bad things happen, there are grown-ups who work hard to make things right and fair. This gives hope that rules are there to keep everyone safe and that justice can happen.\n\n<b>Did you know?</b> Cameroon is sometimes called \"Africa in Miniature\" because it has so many different beautiful landscapes like mountains, beaches, and forests, just like many other parts of Africa!\n\n<h3>Learning About Peace and Safety</h3>\nThis story reminds us that we all want to live in peace. We want to feel safe in our homes, at school, and when we play outside. When people follow rules, it helps everyone feel safe and happy. This decision in Cameroon is a big step towards showing that peace and safety are for everyone, and that people will be held accountable if they break these important trusts.\n\n<h3>A Message of Hope</h3>\nSo, remember, even when things are tough and sometimes sad things happen, there are always people working for fairness and peace. This big decision for the soldiers in Cameroon is a sign that rules are for everyone, and everyone deserves to be safe. Let's always try to be kind, follow rules, and hope for peace and happiness everywhere in Africa and beyond! Thank you for listening to this important story!",
    "summary": "Three soldiers in Cameroon were sent to prison for hurting regular people, showing that everyone, even soldiers, must follow the rules and that justice is important for safety and fairness.",
    "whyMatters": "This is important because it shows that even people with big jobs, like soldiers, must follow rules. It means that everyone deserves to be safe and that bad actions have consequences, helping to make things fair for everyone in Cameroon and across Africa.",
    "category": "technology",
    "date": "2026-02-21T15:20:02.639Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News%20for%20Fairness%3A%20Rules%20for%20Everyone%20in%20Cameroon!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-for-fairness-rules-for-everyone-in-cameroon",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:20:07.747Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russian attack on Kharkiv kills two, Ukraine hits missile plant",
    "title": "Russian attack on Kharkiv kills two, Ukraine hits missile plant",
    "content": "Kharkiv regional administration head, Oleh Syniehubov, reported that 175 'combat clashes' were recorded.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:20:13.008Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20attack%20on%20Kharkiv%20kills%20two%2C%20Ukraine%20hits%20missile%20plant%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-attack-on-kharkiv-kills-two-ukraine-hits-missile-plant",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/russian-attack-on-kharkiv-kills-two-ukraine-hits-missile-plant?traffic_source=rss"
  },
  {
    "originalTitle": "India vs South Africa: T20 World Cup Super Eights – teams, start, lineups",
    "title": "Get Ready for a Big Cricket Match!",
    "content": "Hello, amazing kids of Africa! It's your friendly news reporter here, bringing you some super exciting news! We are going to talk about a really big sports game that is happening soon. It's a game of cricket! Do you know cricket? It's a fun game played with a bat and a ball. People all over the world love to watch it!\n\n<h3>What is Cricket?</h3>\nCricket is a game played by two teams. Each team tries to score more points than the other. These points are called \"runs.\" To score runs, players hit a ball with a special wooden bat. After hitting the ball, they run between two sets of sticks called wickets.\n\nOne team's job is to bat and score as many runs as they can. The other team's job is to bowl the ball and try to get the batters \"out.\" When a batter is out, a new player comes to bat. It's a game that needs speed, strength, and smart thinking!\n\n<p>\"Did you know?\": Cricket is one of the oldest sports in the world, played for hundreds of years!</p>\n\n<h3>The T20 World Cup: A Big Party!</h3>\nRight now, there is a very, very special cricket party happening! It's called the T20 World Cup. Imagine many, many teams from different countries playing together. They all want to win a shiny trophy! It’s like a big festival where the best cricket players show their skills.\n\nT20 is a special kind of cricket game. It means the game is shorter and super-fast! Each team gets to bat for 20 \"overs.\" An over is when one player bowls the ball six times. So, there are lots of big hits and quick runs, making it very exciting to watch!\n\n<h3>Meet Team India: The Champions!</h3>\nOne of the super teams playing in this big World Cup is from a country called India. India is a very big country far away in Asia. Team India is a really strong team! Guess what? They were the champions from the last big T20 World Cup game!\n\nThis means they won the shiny trophy before! So, they are trying extra hard to win it again this year. They have amazing players who can hit the ball very, very far, and some who can bowl super-fast balls that are hard to hit. Many, many people in India cheer for their team with all their hearts!\n\n<p>\"Did you know?\": India has more than a billion people! That's like having almost 15 friends for every one person in South Africa!</p>\n\n<h3>Meet Team South Africa: Our Home Team!</h3>\nThe other amazing team playing in this super game is from our very own continent, Africa! It's Team South Africa! Yay, let's cheer for them very loudly! South Africa is a beautiful country right here, famous for its incredible animals like lions, elephants, and friendly penguins!\n\nTeam South Africa is also a super good cricket team. They play with so much passion and strength. They have never won this big T20 World Cup trophy before. So, they are really, really trying their absolute best to win it this time. They want to make all their fans, especially us kids in Africa, super proud!\n\n<p>\"Did you know?\": South Africa is home to the \"Big Five\" animals: lions, leopards, elephants, rhinos, and buffaloes!</p>\n\n<h3>A Big Rematch Game!</h3>\nNow, here's why this game is extra, extra special! Do you know what a \"rematch\" is? It's like when you play a fun game with your friend, and then you want to play again to see who wins this time. Well, India and South Africa played each other in the very last big World Cup final!\n\nSo, this game is a rematch! Both teams remember that last game. They have been practicing very hard for this moment. It makes the game even more exciting because both teams are eager to prove they are the best! It's going to be a thrilling match to watch!\n\n<h3>The \"Super Eights\" Stage</h3>\nThe T20 World Cup has different parts, like climbing up a ladder. First, many teams play, but only the very best ones get to move to the next step. This next important step is called the \"Super Eights.\"\n\nIt means that only eight super good teams are left in the whole World Cup. India and South Africa are two of these amazing eight teams! They have played so well to get this far. Now, every single game is super important because winning means they get closer to the very, very final game, where only two teams will fight for the big trophy!\n\n<p>\"Did you know?\": The T20 World Cup games usually last about three hours, making them much quicker than other types of cricket games!</p>\n\n<h3>When Does the Game Start and Who Plays?</h3>\nThis big game is going to start very soon! Everyone is getting ready to watch. When we say \"start,\" we mean the time when the first ball is bowled. The players will walk onto the field, wave to the crowds, and then the fun begins!\n\nThe \"lineups\" are just the names of the players who will be on the field for each team. Each team has eleven players who are chosen because they are the very best at batting, bowling, and catching. We don't know the exact names yet, but we know they will be incredible athletes! Both teams will choose their strongest players to try and win this important match.\n\n<h3>Who Will Win? Let's Cheer!</h3>\nSo, who do you think will win this time? Will it be India, who wants to keep their title as champions? Or will it be Team South Africa, who wants to win the trophy for the very first time for our continent? It's going to be a super fun game to watch!\n\nBoth teams will try their absolute hardest. The batters will try to hit big sixes and fours (that's when the ball goes to the boundary for four runs!). The bowlers will try to bowl tricky balls to get the batters out quickly. And the fielders will try to catch every ball and run super fast to stop the runs.\n\nIt's all about teamwork, skill, and playing fair. No matter who wins, it will be a fantastic game of cricket filled with excitement. Everyone will be cheering loudly for their favorite team! So, pick your team and get ready to shout!\n\n<p>\"Did you know?\": When a bowler takes three wickets in three balls, it's called a \"hat-trick\" and it's very special!</p>\n\n<h3>Let's Enjoy the Game!</h3>\nImagine the players on the field, wearing their bright team colors. Imagine the fans in the stadium, waving flags and making lots of happy noise! It's going to be a real party atmosphere for everyone who loves cricket.\n\nThis game is more than just a game; it's a big celebration of sportsmanship and friendly competition between countries. We learn how important it is to try your best, to play fair, and to be happy for whoever wins. These are wonderful lessons for all of us, kids and grown-ups!\n\nSo get ready to cheer, cheer, cheer! Find your favorite comfy spot, gather your family and friends, and let's watch this incredible cricket match unfold. Who will make it to the next stage of the World Cup? We will find out soon! Let's wish both teams good luck and lots of fun as they play this big game!",
    "summary": "Get ready for a super exciting cricket match in the T20 World Cup where defending champions India will play against Team South Africa, who are hoping to win the big trophy for the very first time!",
    "whyMatters": "This game is important because it's a big step towards winning the T20 World Cup trophy, and it's a thrilling rematch between two very strong teams, making it fun for everyone to watch and cheer!",
    "category": "world",
    "date": "2026-02-21T15:20:44.416Z",
    "image": "https://image.pollinations.ai/prompt/Get%20Ready%20for%20a%20Big%20Cricket%20Match!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "get-ready-for-a-big-cricket-match",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/21/india-vs-south-africa-t20-world-cup-super-eights-teams-start-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "Two soldiers killed during military operation in Pakistan’s northwest: Army",
    "title": "Two soldiers killed during military operation in Pakistan’s northwest: Army",
    "content": "An explosive-laden motorcycle rammed vehicle in security forces convoy, military says.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:20:49.532Z",
    "image": "https://image.pollinations.ai/prompt/Two%20soldiers%20killed%20during%20military%20operation%20in%20Pakistan%E2%80%99s%20northwest%3A%20Army%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-soldiers-killed-during-military-operation-in-pakistans-northwest-army",
    "originalLink": "https://www.aljazeera.com/news/2026/2/21/2-soldiers-dead-5-militants-killed-in-pakistans-bannu?traffic_source=rss"
  },
  {
    "originalTitle": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
    "title": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
    "content": "The Supreme Court decision striking down some of Trump's most sweeping tariffs injects new uncertainty into global trade.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:20:55.249Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20brings%20in%20new%2010%25%20tariff%20as%20Supreme%20Court%20rejects%20his%20global%20import%20taxes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-brings-in-new-10percent-tariff-as-supreme-court-rejects-his-global-import-taxes",
    "originalLink": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump lashes out at Supreme Court justices over tariffs ruling ",
    "title": "Trump lashes out at Supreme Court justices over tariffs ruling ",
    "content": "The six justices who voted against the tariffs, dealing a major blow to his signature economic policy, should be \"absolutely ashamed\", Trump said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-21T15:21:00.364Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20lashes%20out%20at%20Supreme%20Court%20justices%20over%20tariffs%20ruling%20%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-lashes-out-at-supreme-court-justices-over-tariffs-ruling",
    "originalLink": "https://www.bbc.com/news/articles/cd9g0e7zd8wo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "title": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "content": "Far-left militants are suspected of being behind Quentin Deranque's death and the party of Jean-Luc Mélenchon is being widely condemned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-21T15:21:05.474Z",
    "image": "https://image.pollinations.ai/prompt/Killing%20of%20nationalist%20student%20leaves%20French%20far%20left%20in%20deep%20trouble%20as%20elections%20loom%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killing-of-nationalist-student-leaves-french-far-left-in-deep-trouble-as-elections-loom",
    "originalLink": "https://www.bbc.com/news/articles/cnv61zv534eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Milner breaks Premier League appearance record",
    "title": "Milner breaks Premier League appearance record",
    "content": "Brighton's James Milner starts against Brentford to break the all-time Premier League appearance record of 653.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-21T15:21:11.022Z",
    "image": "https://image.pollinations.ai/prompt/Milner%20breaks%20Premier%20League%20appearance%20record%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "milner-breaks-premier-league-appearance-record",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjrqdnj2199o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What's eating Arsenal? North London derby now a test of Gunners' 'bottle'",
    "title": "What's eating Arsenal? North London derby now a test of Gunners' 'bottle'",
    "content": "What's eating Arsenal? Sunday's North London derby is now a test of the Gunners' \"bottle\", says chief football writer Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-21T15:21:16.138Z",
    "image": "https://image.pollinations.ai/prompt/What's%20eating%20Arsenal%3F%20North%20London%20derby%20now%20a%20test%20of%20Gunners'%20'bottle'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "whats-eating-arsenal-north-london-derby-now-a-test-of-gunners-bottle",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjwzqn3e193o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Losing the dressing room' - what does it mean and how can it happen?",
    "title": "'Losing the dressing room' - what does it mean and how can it happen?",
    "content": "\"Losing the dressing room\" is now part of football's vocabulary. Chief football writer Phil McNulty asks what it means, how it happens and can it be solved?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-21T15:21:21.233Z",
    "image": "https://image.pollinations.ai/prompt/'Losing%20the%20dressing%20room'%20-%20what%20does%20it%20mean%20and%20how%20can%20it%20happen%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "losing-the-dressing-room-what-does-it-mean-and-how-can-it-happen",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy9gvle2n5qo?at_medium=RSS&at_campaign=rss"
  }
]