[
  {
    "originalTitle": "Nigeria remembers master wood carver",
    "title": "Our Friend Who Carved Wood Stories",
    "content": "Hello, my little friends across Africa! I have a very special story for you from a wonderful country called Nigeria.\n\nIt's about a kind and clever man named Kasali Akangbe Ogun. You can call him Grandpa Kasali.\n\nGrandpa Kasali was like a magic artist! He could take a simple piece of wood and turn it into something absolutely amazing. He made beautiful statues, masks, and many other wonderful things.\n\nSadly, Grandpa Kasali became a little bit sick. And now, he has gone to rest. But Nigeria is remembering him with so much love and thanks. He was buried with his family and friends around.\n\nWe want to tell you all about why Grandpa Kasali was so special and why his art will live on forever.\n\n<h3>Meet Grandpa Kasali</h3>\nImagine a grandpa who always had little bits of wood dust on his clothes and a big, friendly smile! That was Grandpa Kasali.\n\nHe loved wood. Not just any wood, but wood that could become art in his skillful hands. He lived in a country called Nigeria. It's a very big and beautiful country in Africa, full of different people and cultures.\n\nPeople loved Grandpa Kasali because he was kind and his hands were super clever. He didn't just carve wood; he told stories with it. Every piece he made had a meaning, a feeling, or an old tale hidden inside.\n\nDid you know? Nigeria is known as the \"Giant of Africa\" because it has so many people and different cultures living together in peace and harmony!\n\n<h3>What is Wood Carving?</h3>\nWood carving is like drawing, but with wood! Instead of a pencil and paper, carvers use special tools. They use little sharp knives and tiny hammers to gently chip away at the wood.\n\nIt takes a lot of patience and a very steady hand. You have to be careful not to chip too much!\n\nFirst, they pick the right piece of wood. Some wood is soft and easy to carve, while other wood is hard and needs more strength. Then, they think of what they want to make. Maybe a roaring lion, a gentle elephant, or a happy person!\n\nSlowly, slowly, the wood starts to change. It gets a shape. It gets a face! It's like magic, turning something plain into something alive and beautiful. Grandpa Kasali was a true master at this magic.\n\nDid you know? Many countries in Africa have amazing wood carvers who make beautiful art for homes, special ceremonies, and telling old stories passed down through generations!\n\n<h3>A Special Family Skill</h3>\nGrandpa Kasali wasn't the *first* wood carver in his family. Oh no! This skill was a very old and precious secret that had been passed down.\n\nHis grandpa was a carver. And his grandpa's grandpa was a carver too! It was like a super special family talent that got passed down from father to son, for many, many years.\n\nImagine your dad teaching you how to ride a bicycle, or your mom teaching you how to bake a special cake. That's a bit like it. But for Grandpa Kasali, it was learning how to hold the carving tools just right, how to feel the wood, and how to make it sing with his art.\n\nHe learned from his elders. They taught him the old designs and the special meanings behind each carving. This made his art even more special because it carried the wisdom and history of many generations of artists.\n\n<h3>Keeping Old Stories Alive</h3>\nWhat are \"traditions\"? They are special ways of doing things that families and communities have done for a very long time. Maybe it's a special dance, or a special song, or cooking a unique food on a holiday. These traditions help us remember who we are and where we come from. They are like happy memories we share together.\n\nGrandpa Kasali loved these old ways. He wanted to make sure they didn't disappear, like a story fading away. When he carved, he wasn't just making pretty things. He was making things that told stories.\n\nStories about his people, about brave heroes, about amazing animals, and about important events from the past. His carvings helped people remember their culture and their history. They were like frozen storybooks made of wood!\n\nHe taught younger people too, sharing his knowledge and skills. This way, they could also learn and help keep the wonderful traditions alive for the future.\n\nDid you know? In some parts of Africa, masks carved from wood are used in special festivals and dances to celebrate different seasons, important harvests, or big moments in life!\n\n<h3>His Art Lives On!</h3>\nEven though Grandpa Kasali is no longer with us, his beautiful art will live forever. His carvings are in many homes, in museums for everyone to see, and maybe even in places far away across the world.\n\nThey are like little pieces of Grandpa Kasali, still sharing his stories and his love for art. When you see a beautiful carving made from wood, think of Grandpa Kasali. Think of the patient hands that made it.\n\nThink of the stories whispered into the wood as it was shaped. His art reminds us that old ways are important and very beautiful. It tells us that our culture is a treasure.\n\n<h3>Why We Remember</h3>\nIt's very important to remember special people like Grandpa Kasali. When we remember them, we keep their spirit and their good work alive in our hearts and minds.\n\nWe remember their kindness, their amazing talents, and all the wonderful things they did for their community and for art. Grandpa Kasali taught us that our history and our traditions are like precious treasures.\n\nHe showed us that with our hands and our hearts, we can create amazing things that last a very, very long time. He helped us understand the beauty of wood and the power of art to tell stories and keep memories alive.\n\n<h3>Goodbye, Grandpa Kasali</h3>\nSo, as Nigeria says goodbye to this wonderful wood carver, we also say a big \"thank you.\"\n\nThank you, Grandpa Kasali, for all the beautiful art you gave us. Thank you for keeping our traditions shining brightly for everyone to see and learn from. You will always be a hero of art and culture in Africa.\n\nRest well, dear Grandpa Kasali. We will never forget you and the amazing stories you carved into wood.",
    "summary": "Nigeria is remembering a very special wood carver named Kasali Akangbe Ogun, who came from a family of carvers and helped keep old traditions alive through his beautiful art.",
    "whyMatters": "It matters because Grandpa Kasali showed us how important it is to remember our old traditions and stories, and how art can keep them alive for a very long time for everyone to enjoy and learn from.",
    "category": "world",
    "date": "2026-01-20T04:41:08.279Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Friend%20Who%20Carved%20Wood%20Stories%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-friend-who-carved-wood-stories",
    "originalLink": "https://www.bbc.com/news/articles/cgqelez1kwwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 160 churchgoers kidnapped in twin Nigeria attacks - clergy",
    "title": "Sad News in Nigeria: Our Friends Need Help",
    "content": "<h3>Hello, My Little Friends!</h3>\nHi everyone! It's your friendly news reporter here, bringing you important news from our big, beautiful continent of Africa. Today, we have some sad news to share from a country called Nigeria. It's a very big country in West Africa, full of amazing people, yummy food, and vibrant cultures. Sometimes, sad things happen, but we talk about them so we can understand and hope for a better tomorrow.\n\n<h3>What Happened in Nigeria?</h3>\nImagine you are at a very special place, like a big meeting hall, where people go to sing songs and learn good things. In Nigeria, many people go to places called churches. On a Sunday morning, which is a day many families spend together, lots of people were at their churches. They were singing and praying, just like many of us might do on a special day.\n\n<h3>Oh No! What Went Wrong?</h3>\nSadly, some not-so-good people, who we call 'gangs,' came into two of these churches. These gangs were armed, which means they had things that can hurt people. They came during the Sunday service, which is like a special meeting time in the church.\n\n<h3>People Were Taken Away</h3>\nThese bad people, the gangs, did a very wrong thing. They took many of the churchgoers away with them. We call this being 'kidnapped.' It means someone is taken away without their permission, and it's a very scary thing. More than 160 people were taken. That's a lot of people! Imagine if all the kids in your class, and many more classes, were all taken at once. It's very sad.\n\n<h3>Where Did This Happen?</h3>\nThis sad event happened in a place called Kurmin Wali. It's a town in Kaduna State, which is like a big area, or a province, inside Nigeria. Nigeria is a very big country, with many states.\n\n**Did You Know?** Nigeria is the most populated country in Africa! It has more people than any other country on our continent. Many people speak English there, and also many other languages like Yoruba, Igbo, and Hausa.\n\n<h3>Who Are These 'Gangs'?</h3>\nGangs are groups of people who do bad things. They don't follow rules and they often make people scared. The police and good people everywhere are working hard to stop gangs and keep everyone safe. It's important for everyone to feel safe in their homes and communities.\n\n<h3>What Are Churches For?</h3>\nChurches are special buildings where Christians go to worship God, learn about kindness, and be together as a community. People go there to feel peace and hope. It's a place where friends and families meet.\n\n**Did You Know?** Many different religions are practiced in Africa! People go to churches, mosques, and other special places to pray and learn about their faith. Everyone has a right to feel safe when they are practicing their religion.\n\n<h3>What Are People Doing Now?</h3>\nWhen something sad like this happens, many people work to help. The police in Nigeria are working very, very hard to find the people who were taken. They are looking for clues and trying to bring everyone back home safely. Families and friends are praying for their loved ones to return.\n\n<h3>Why Is Safety Important?</h3>\nIt's very important that everyone, everywhere, feels safe. Our homes, our schools, and our places of worship should always be safe spaces. When bad things happen, it reminds us how important it is for everyone to work together to protect each other.\n\n**Did You Know?** The police are like superheroes in our communities! They help keep us safe, find lost things, and make sure everyone follows the rules. They are always ready to help people in need.\n\n<h3>Let's Send Our Love to Nigeria</h3>\nEven though we might feel sad about this news, it's important to remember that most people in the world are kind and good. We can send our love and good wishes to the people of Nigeria. We hope that all the people who were taken will be found very soon and can go back to their families.\n\n<h3>Be Kind and Help Others</h3>\nThis story reminds us that we should always try to be kind to everyone. If you see someone who looks sad or needs help, maybe you can offer a smile or a kind word. When we are kind to each other, we make our world a happier and safer place for everyone.\n\n**Did You Know?** Africa is home to many amazing animals, like lions, elephants, giraffes, and zebras! It's a continent full of wonders, and its people are strong and resilient.\n\n<h3>Hope for Tomorrow</h3>\nWe will keep hoping and praying for the people in Nigeria. We believe that with hard work and kindness, good things will happen. Let's all remember to be good neighbors and friends, not just in our own homes, but across our big, beautiful continent of Africa and the whole world.",
    "summary": "More than 160 people were sadly taken from churches in Nigeria by bad gangs, and everyone is working hard to bring them home safely.",
    "whyMatters": "This matters because everyone deserves to feel safe, especially in places where they go to pray and be with family, and we all hope for the quick return of the people taken.",
    "category": "world",
    "date": "2026-01-20T04:41:28.470Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20in%20Nigeria%3A%20Our%20Friends%20Need%20Help%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-in-nigeria-our-friends-need-help",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "title": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "content": "The Ethiopian Orthodox festival of Timket, or Epiphany, commemorates the baptism of Jesus in the Jordan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:41:33.655Z",
    "image": "https://image.pollinations.ai/prompt/Drums%2C%20chants%20and%20celebrations%20as%20Ethiopians%20mark%20the%20baptism%20of%20Jesus%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "drums-chants-and-celebrations-as-ethiopians-mark-the-baptism-of-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cr4k3p6x1q5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "North Korea’s Kim Jong Un fires vice premier, publicly rebukes officials",
    "title": "North Korea’s Kim Jong Un fires vice premier, publicly rebukes officials",
    "content": "Kim condemns 'incompetent' party members for delays in government projects in advance of key ruling party meeting.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:41:38.960Z",
    "image": "https://image.pollinations.ai/prompt/North%20Korea%E2%80%99s%20Kim%20Jong%20Un%20fires%20vice%20premier%2C%20publicly%20rebukes%20officials%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "north-koreas-kim-jong-un-fires-vice-premier-publicly-rebukes-officials",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/north-koreas-kim-jong-un-fires-vice-premier-publicly-rebukes-officials?traffic_source=rss"
  },
  {
    "originalTitle": "Denmark sends more troops to Greenland amid tensions with Trump",
    "title": "Denmark sends more troops to Greenland amid tensions with Trump",
    "content": "Nordic country dispatches 'substantial contribution' of troops to the Arctic territory amid standoff with Washington.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:41:44.133Z",
    "image": "https://image.pollinations.ai/prompt/Denmark%20sends%20more%20troops%20to%20Greenland%20amid%20tensions%20with%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "denmark-sends-more-troops-to-greenland-amid-tensions-with-trump",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/denmark-sends-more-troops-to-greenland-amid-tensions-with-trump?traffic_source=rss"
  },
  {
    "originalTitle": "UK to consider Australia-style ban on social media for children",
    "title": "UK to consider Australia-style ban on social media for children",
    "content": "UK ministers will visit Australia to gather information on the social media ban for under-16s implemented last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:41:49.289Z",
    "image": "https://image.pollinations.ai/prompt/UK%20to%20consider%20Australia-style%20ban%20on%20social%20media%20for%20children%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-to-consider-australia-style-ban-on-social-media-for-children",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/uk-to-consider-australia-style-ban-on-social-media-for?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "title": "Big Talk About an Icy Island!",
    "content": "Hello, my dear friends from Africa and all around our beautiful world! I am your friendly African news reporter. Today, we have a very interesting story to share with you. It's about a big, icy island, a person who used to be a president, and a team of many countries. Let's learn together!\n\n<h3>Meet Mr. Trump</h3>\nDo you know who Mr. Trump is? He used to be the president of a very big country called the United States of America. That's a country far away across the ocean. Presidents are like the leaders of a country. They help make important decisions for everyone living there. Mr. Trump was a very important leader for a long time.\n\n<h3>What is Greenland?</h3>\nNow, let's talk about Greenland. Imagine a huge, huge island! It's so big that it's the largest island in the whole world. Greenland is also very, very cold. It's covered in lots of ice and snow! You might find polar bears and other amazing animals living there. Even though it's so cold, it's a very beautiful place with amazing landscapes.\n\nDid you know? Greenland is so big that if you put many small countries together, they would fit inside it! It's truly a giant island.\n\nGreenland is not its own country. It is part of another country called Denmark. Denmark is in Europe. So, even though Greenland is far away and icy, it belongs to Denmark.\n\n<h3>Mr. Trump's Idea</h3>\nOne day, Mr. Trump had a very big idea. He thought it would be a good idea for the United States to buy Greenland. Yes, like buying a toy or a book, but much, much bigger! He thought it would be a special and helpful piece of land for his country. But remember, Greenland is part of Denmark. So, Denmark said, \"No, thank you. Greenland is not for sale!\"\n\nIt's like when you have a favorite toy, and someone asks to buy it, but you love it too much to sell. Denmark felt the same way about Greenland.\n\n<h3>What are Tariffs?</h3>\nNow, this part can be a little tricky, but we can learn it together! When Mr. Trump heard that Denmark would not sell Greenland, he got a bit upset. He said he might put something called \"tariffs\" on things that Denmark sells to the United States.\n\nWhat are tariffs? Imagine you have a friend who makes the most delicious cookies. Everyone wants to buy your friend's cookies! Now, imagine someone gets angry with your friend. They might say, \"Okay, I will make everyone pay extra money when they buy your cookies!\" This extra money is a tariff.\n\nSo, if Mr. Trump put tariffs on Denmark, it would mean that things made in Denmark (like toys, clothes, or yummy food) would cost *more money* for people in America to buy. This would make it harder for Denmark to sell their things. It's like making those yummy cookies more expensive so fewer people buy them.\n\nDid you know? Tariffs can sometimes make the things you want to buy cost more money for everyone!\n\n<h3>Meet the EU Team</h3>\nOkay, let's meet another important group. Have you heard of the European Union, or the EU? It's like a big, big team of many countries in Europe. Think of it as a super group of friends who work together. Countries like France, Germany, Italy, and many more are all part of this team.\n\nThey help each other with important things like trade (which means buying and selling things) and making sure their countries are safe and happy. Denmark, the country that owns Greenland, is a very important member of this EU team.\n\nDid you know? The EU has almost 30 countries working together! That's a lot of friends!\n\n<h3>The EU's Important Message</h3>\nBecause Denmark is part of the EU team, the EU also cares about what happens to Denmark. A kind and wise leader from the EU, a lady named Kaja Kallas, spoke up. She said something very important:\n\n\"We don't want to start any big arguments or 'pick a fight.' But we will stand strong for our team! We will 'hold our ground'.\"\n\nWhat does \"hold our ground\" mean? It means they want to be friends and solve problems peacefully. But it also means they will be brave and protect their friends and their interests. They won't let anyone push them around or make unfair rules that hurt their team members, like Denmark.\n\nIt's like playing a game with your friends. You want to play fair and have fun. But if someone tries to cheat or hurt your team, you will stand up for your friends and make sure everyone plays nicely and fairly. That's what the EU means!\n\nDid you know? Standing your ground means being strong and protecting what is important to you and your friends!\n\n<h3>Why is This News Important?</h3>\nThis story shows us how countries around the world talk to each other. Sometimes they agree, and sometimes they disagree, just like friends can. But it is always important for leaders to talk and try to find fair ways to get along. It's about respecting each other and working together, even when things are difficult.\n\nWe learn that being part of a team, like the EU, means you have many friends who will support you. And it reminds us that being fair and respectful is important for everyone, from small kids to big country leaders.\n\nSo, my friends, that's our news for today! Remember, it's good to learn about the world and how everyone works together. Keep being curious and asking questions! Until next time, stay happy and keep shining!",
    "summary": "Former US President Mr. Trump wanted to buy the icy island of Greenland, but Denmark (who owns it) said no; he then threatened to put extra taxes (tariffs) on Danish goods, but the EU (a team of European countries) said they would stand strong and protect their member, Denmark.",
    "whyMatters": "This story matters because it shows how different countries talk and sometimes disagree, teaching us that countries need to be fair and friendly to each other, and that being part of a team (like the EU) means you have friends who will help protect you.",
    "category": "world",
    "date": "2026-01-20T04:42:12.809Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Talk%20About%20an%20Icy%20Island!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-talk-about-an-icy-island",
    "originalLink": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
    "title": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
    "content": "Transatlantic relations aren't broken, though they are damaged. And if Europeans want to try to cut through with Trump, they'll have to stick together, writes Europe Editor Katya Adler",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:42:17.978Z",
    "image": "https://image.pollinations.ai/prompt/Confronted%20over%20Greenland%2C%20Europe%20is%20ditching%20its%20softly-softly%20approach%20to%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "confronted-over-greenland-europe-is-ditching-its-softly-softly-approach-to-trump",
    "originalLink": "https://www.bbc.com/news/articles/c0lx7j1lrwro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spanish PM vows to find cause of deadly high-speed train crash",
    "title": "Spanish PM vows to find cause of deadly high-speed train crash",
    "content": "Pedro Sanchez announces three days of mourning after at least 40 people died in Sunday's collision in  southern Spain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:42:23.149Z",
    "image": "https://image.pollinations.ai/prompt/Spanish%20PM%20vows%20to%20find%20cause%20of%20deadly%20high-speed%20train%20crash%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spanish-pm-vows-to-find-cause-of-deadly-high-speed-train-crash",
    "originalLink": "https://www.bbc.com/news/articles/c2d7rk0865go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "title": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "content": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:42:29.050Z",
    "image": "https://image.pollinations.ai/prompt/Saved%20by%20'special%20talent'%20-%20but%20did%20penalty%20award%20wrong%20Brighton%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "saved-by-special-talent-but-did-penalty-award-wrong-brighton",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Under-pressure Frank 'feeling trust' of Spurs board",
    "title": "Under-pressure Frank 'feeling trust' of Spurs board",
    "content": "Tottenham head coach Thomas Frank says lunch with board members is an \"extremely good sign\" despite pressure mounting on him during an underwhelming season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T04:42:34.226Z",
    "image": "https://image.pollinations.ai/prompt/Under-pressure%20Frank%20'feeling%20trust'%20of%20Spurs%20board%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "under-pressure-frank-feeling-trust-of-spurs-board",
    "originalLink": "https://www.bbc.com/sport/football/articles/czjgp2x072po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City sign Guehi from Palace - what will he bring?",
    "title": "Man City sign Guehi from Palace - what will he bring?",
    "content": "Man City sign Crystal Palace captain Marc Guehi for £20m - but what will the England defender add to Pep Guardiola's side?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-20T04:42:39.396Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20sign%20Guehi%20from%20Palace%20-%20what%20will%20he%20bring%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-sign-guehi-from-palace-what-will-he-bring",
    "originalLink": "https://www.bbc.com/sport/articles/cwy8lve847eo?at_medium=RSS&at_campaign=rss"
  }
]