[
  {
    "originalTitle": "The king's speech - and why it has foreigners in South Africa worried",
    "title": "A King's Words: Let's All Be Friends!",
    "content": "<h3>Hello, Little Explorers!</h3>\nWelcome, super friends! Get ready for a special story from South Africa.\nAfrica is a huge continent, full of amazing people, animals, and stories.\nToday, we're going to learn about a king and why his words are important.\nIt's all about being kind and understanding each other, no matter where we come from.\n\n<h3>Meet King Misuzulu!</h3>\nIn South Africa, there's a very special group of people called the Zulu people.\nThey have a king, just like in some fairy tales! His name is King Misuzulu KaZwelithini.\nA king is like a very important leader for his people. He helps guide them and keeps old traditions alive.\nHe is like a wise grandfather figure to many, full of wisdom and stories.\n\nDid you know? The Zulu kingdom is one of the most famous kingdoms in Africa! Their history is super rich and interesting, full of brave warriors and beautiful customs.\n\n<h3>What's Happening in South Africa?</h3>\nSouth Africa is a beautiful country at the bottom of Africa.\nIt has sunny beaches, tall mountains, and big cities. You can see many different animals there too, like lions and elephants!\nMany different kinds of people live in South Africa. They speak many languages and have many traditions.\nIt's like a big, colourful quilt with many different patches, all sewn together to make something beautiful!\n\n<h3>Friends from Far Away</h3>\nImagine you live in one town, but then your family moves to a new town to find a new school or a fun job.\nSometimes, people do this from one country to another country! They pack their bags and go on a big adventure.\nThese people are called \"foreigners\" or \"migrants.\" It just means they came from a different country to live in a new one.\nThey might move to South Africa for work, to be with family, to find a new adventure, or to find a safer place to live.\nThey bring their own special foods, music, and stories with them. This makes South Africa even more colourful and exciting!\n\nDid you know? People move all over the world! It's how new ideas and cultures spread and make places more interesting. It's like sharing toys with new friends!\n\n<h3>The King's Big Speech</h3>\nKing Misuzulu recently gave a very important speech. A speech is when a leader talks to many people, sharing important messages.\nHe was talking about the people who come from other countries to live in South Africa.\nThe King wanted everyone to live together happily and safely. He wanted people to be good neighbours.\nHe was trying to make sure that everyone understood the importance of peace and getting along.\n\n<h3>Words Matter A Lot!</h3>\nWhen we talk, our words are like little seeds. They can grow into happy flowers or sad thorns.\nThe King was trying to say that everyone should be treated fairly and kindly.\nHe wanted to calm down any worries some people had about friends who came from other countries.\n\"Calm down feelings\" means to help people feel less upset or angry about something.\n\nDid you know? Kind words can make someone's whole day brighter! Try saying something nice to someone today and see how happy they become.\n\n<h3>Why Some People Felt Worried</h3>\nBut sometimes, even grown-ups can make mistakes with their words. It happens to everyone.\nIn his speech, the King used a phrase that was not very kind. A \"phrase\" is just a group of words.\nThis phrase made some people from other countries feel very sad and unwelcome. They felt a little bit hurt.\nIt made them feel like they didn't belong, even though they were trying to be good neighbours and good citizens.\nWhen someone uses \"derogatory\" words, it means they are using words that make others feel small, bad, or not important. It's like calling someone a mean name.\nEven when trying to help, choosing the wrong words can accidentally hurt feelings, and that's something we should always try to avoid.\n\n<h3>Being Kind to Everyone</h3>\nThis story teaches us a very important lesson: we must always be kind to everyone.\nNo matter where someone comes from, what language they speak, or how they look.\nEvery person has a heart, and every heart deserves to feel welcome and safe. Everyone wants to be loved.\nWhen we are kind, we make the world a happier place for everyone. It's like sharing your favourite toy or helping a friend tie their shoelace.\n\nDid you know? Being kind isn't just good for others; it makes you feel happy too! When you help someone, your heart feels warm and bubbly. It's a win-win!\n\n<h3>South Africa, a Rainbow Nation</h3>\nSouth Africa is often called the \"Rainbow Nation.\"\nDo you know why? Because it has so many different people, like all the beautiful colours in a rainbow! All these colours mix together to make something wonderful and unique.\nThe idea is that people from all backgrounds can live together in peace and friendship, just like all the colours live together in a rainbow.\nIt's a place where everyone can learn from each other and share their unique gifts and traditions.\n\nDid you know? A real rainbow needs sunshine and rain to appear! Just like how different people can come together to make something beautiful and strong.\n\n<h3>What Can We Do?</h3>\nEven though we are small, we can make a big difference!\nWe can always choose to be friendly to new kids at school or in our neighbourhood.\nWe can share our snacks and play games together, no matter where our friends come from.\nWe can use kind words when we talk to everyone, always thinking before we speak.\nIf we hear someone saying unkind things, we can gently say, \"That's not very nice,\" or tell a grown-up.\n\n<h3>Let's Be Good Neighbours!</h3>\nThis story from South Africa reminds us that kings, leaders, and all of us need to think about our words.\nLet's always try to use words that build bridges of friendship, not walls of sadness or hurt.\nLet's make sure everyone, everywhere, feels welcome and loved, like they belong.\nBecause when we are all kind to each other, our world becomes a much happier place to live, full of smiles and laughter!\nThank you for listening, little reporters! Keep spreading kindness and making friends!",
    "summary": "The Zulu King of South Africa gave a speech trying to promote kindness towards people from other countries, but he used words that made some people feel sad and unwelcomed.",
    "whyMatters": "It's important for leaders to use kind words because words can make people feel happy or sad, and we should always try to make everyone feel welcome and safe, no matter where they come from.",
    "category": "world",
    "date": "2026-02-01T15:20:08.342Z",
    "image": "https://image.pollinations.ai/prompt/A%20King's%20Words%3A%20Let's%20All%20Be%20Friends!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-kings-words-lets-all-be-friends",
    "originalLink": "https://www.bbc.com/news/articles/cd6we3009dgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 200 killed in mine collapse in DR Congo",
    "title": "Sad News from Our Friends in DR Congo",
    "content": "<h3>Hello, Super Friends!</h3>\n\nHello, super friends! It's your kid-friendly news reporter from Africa here. I have some very sad news to share with you today from a country called the Democratic Republic of Congo. That's a very long name, so we often just call it DR Congo. It's a beautiful, big country right here on our amazing continent of Africa.\n\n<h3>What Happened in DR Congo?</h3>\n\nSomething very, very sad happened there recently. There was a big hole in the ground called a mine. People work inside these mines to find special rocks and metals. But the ground inside this mine suddenly fell in. We call this a 'collapse.' It's like when a sandcastle falls down, but much, much bigger and more serious.\n\nSadly, more than 200 people were working in the mine when the ground collapsed. That's a very, very big number of people, more than all the children in many schools put together. It makes us feel very sad to hear about this accident.\n\n<h3>Why Did the Mine Collapse?</h3>\n\nThis happened after a lot of rain. Not just a little sprinkle, but really, really heavy rains. Imagine water falling from the sky for a long, long time. When too much rain falls, the ground gets very soft and weak. Think about playing with sand at the beach; when it's dry, it's strong, but when it gets super wet, it can easily fall apart.\n\nThe ground in the mine became too soft because of all this water. It just couldn't hold itself up anymore, and that's why it collapsed. This sad event happened on a day called Wednesday.\n\n<h3>Where is DR Congo?</h3>\n\nDR Congo is a very large country located in central Africa. It's so big, it's actually the second-largest country in all of Africa! It has amazing jungles, huge rivers, and many different kinds of animals, like gorillas and elephants. It's a land full of natural beauty.\n\nDid you know? The Congo River, which runs through DR Congo, is the second-longest river in Africa! It's very deep and powerful.\n\n<h3>What is a Mine and Why Do People Work There?</h3>\n\nA mine is like a giant, deep hole or tunnel that people dig into the earth. They do this to find special things hidden deep inside the ground. These special things are called minerals. Minerals are super important!\n\nPeople find minerals like copper, cobalt, and even gold in mines. We use these minerals to make so many things that are part of our daily lives. They help make the batteries for our mobile phones, parts for computers, and even some of the wires that bring electricity to our homes.\n\nMany people in DR Congo work in mines because it's a way for them to earn money. They need money to buy food for their families, send their children to school, and buy clothes. Working in mines can be hard work and sometimes it can be dangerous, too.\n\nDid you know? DR Congo produces most of the world's cobalt, which is a very important mineral for making rechargeable batteries for many of our electronic devices, like phones and electric cars!\n\n<h3>The Danger of Too Much Rain</h3>\n\nHeavy rains can be a big problem, especially for mines. When the ground gets soaked with water, it can become unstable. This means it's not strong enough to stay in place. Imagine trying to build a tower with very wet mud; it would easily crumble.\n\nThis is why places like mines need to be very carefully built and checked all the time, especially when there's a lot of rain. The safety of the people who work there is always the most important thing. Sometimes, even with great care, accidents can still happen when nature is very powerful.\n\n<h3>Who is Helping?</h3>\n\nWhen sad accidents like this happen, many brave people come forward to help. There are special people called 'rescue workers.' These heroes go into dangerous places to try and find people who are stuck or hurt. They work very hard and are very brave.\n\nDoctors and nurses are also ready to help anyone who is injured. A kind person who speaks for a group of people in that area told us this sad news, so everyone could know and send help. People from the local community and even people from far away want to help the families affected by this terrible accident. It shows how much we care for each other, even when we don't know each other.\n\nDid you know? Many African cultures have a word called 'Ubuntu.' It means 'I am because we are,' which teaches us that we are all connected and should always help each other!\n\n<h3>Our Hopes and Kind Thoughts</h3>\n\nIt's very normal to feel sad when we hear news like this. We can send our kindest thoughts and hopes to all the people and families in DR Congo who are affected by this sad event. We hope that everyone can get the help and support they need.\n\nWe also hope that people working in mines can always be safe, and that accidents like this can be prevented in the future. Safety is so important, everywhere and for everyone.\n\n<h3>Let's Be Kind</h3>\n\nRemember, super friends, we are all part of one big family, here in Africa and all around the world. When sad things happen, it's important to be kind and think of others. Let's hope for brighter and safer days for all our friends in DR Congo. Stay kind, stay curious, and always remember to care for one another!\n",
    "summary": "More than 200 people sadly died in a mine in DR Congo when the ground collapsed after heavy rains, making the earth too soft and weak.",
    "whyMatters": "This is important because many people lost their lives, and it reminds us how important safety is for people who work in mines, especially when there's a lot of rain, so we must care for those affected.",
    "category": "technology",
    "date": "2026-02-01T15:20:35.417Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Our%20Friends%20in%20DR%20Congo%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-our-friends-in-dr-congo",
    "originalLink": "https://www.bbc.com/news/articles/cly381dvnvzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "title": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "content": "The Ugandan president’s son, notorious for explosive remarks on X, has ambitions to  succeed his father.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-01T15:20:40.589Z",
    "image": "https://image.pollinations.ai/prompt/This%20army%20chief%20threatened%20to%20castrate%20opposition%20leader%20and%20claimed%20descent%20from%20Jesus%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-army-chief-threatened-to-castrate-opposition-leader-and-claimed-descent-from-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan to boycott T20 World Cup match against India on February 15",
    "title": "Pakistan to boycott T20 World Cup match against India on February 15",
    "content": "This is a breaking news story, more details to follow.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-01T15:20:46.073Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20to%20boycott%20T20%20World%20Cup%20match%20against%20India%20on%20February%2015%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-to-boycott-t20-world-cup-match-against-india-on-february-15",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/1/pakistan-to-boycott-t20-world-cup-match-against-india-on-february-15?traffic_source=rss"
  },
  {
    "originalTitle": "Khartoum airport receives first scheduled flight since start of Sudan war",
    "title": "Khartoum airport receives first scheduled flight since start of Sudan war",
    "content": "Celebrations as flight carries dozens of passengers from Port Sudan to Sudanese capital.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-01T15:20:51.260Z",
    "image": "https://image.pollinations.ai/prompt/Khartoum%20airport%20receives%20first%20scheduled%20flight%20since%20start%20of%20Sudan%20war%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "khartoum-airport-receives-first-scheduled-flight-since-start-of-sudan-war",
    "originalLink": "https://www.aljazeera.com/news/2026/2/1/khartoum-airport-receives-first-scheduled-flight-since-start-of-sudan-war?traffic_source=rss"
  },
  {
    "originalTitle": "Trilateral Ukraine talks to resume in Abu Dhabi on Wednesday: Zelenskyy",
    "title": "Big Chats for Peace in Ukraine!",
    "content": "<h3>Hello, Friends! Your Africa News Reporter is Here!</h3>\n\nHello, hello, my amazing friends all across Africa! It's me, your super kid-friendly news reporter, here to share some exciting news from around the world. I hope you are all having a wonderful day, playing, learning, and making new friends. Today, we are going to talk about something very important: grown-ups talking together to make the world a happier place. \n\nWe love to play and have fun, right? Sometimes, even when we play, we might have a little disagreement. Maybe about whose turn it is, or which game to play. When that happens, what do you do? You talk about it! You share your ideas, you listen to your friends, and you find a way to play together happily again. Grown-ups do that too, especially when there are big problems to solve.\n\n<h3>Big Talk Time for Peace!</h3>\n\nGuess what? Some important grown-ups are going to meet very soon. They are going to meet in a far-away city called Abu Dhabi. They are meeting to have some very important talks. These talks are about helping a country called Ukraine. The people there want to live in peace, just like we do.\n\nThey had some talks before, last month. It's like they played a game, but they didn't finish it yet. So, they are going to play (or talk!) again! They want to try and make things better. They want to find a way for everyone in Ukraine to be safe and happy. \n\nDid you know? Talking is a superpower! It helps us understand each other and find good ways to solve problems without any fighting. When we talk, we use our words to build bridges, not walls.\n\n<h3>What is Ukraine?</h3>\n\nUkraine is a country, just like our countries in Africa! It has cities, towns, schools, and lots of lovely people. Imagine your own town or village. It's a special place, full of life and laughter. People in Ukraine want their homes and schools to be safe and full of joy too. \n\nSometimes, things are not peaceful there, and that makes people sad. So, these talks are super important. They are trying to help Ukraine find its way back to being a very peaceful and happy place for everyone, especially for the children.\n\nDid you know? The sunflower is a very famous flower in Ukraine! It follows the sun all day long. Isn't that beautiful? Sunflowers remind us of hope and brightness, just like we hope for peace to shine brightly in Ukraine.\n\n<h3>Where Are They Meeting? Abu Dhabi!</h3>\n\nThe talks will happen in a city called Abu Dhabi. Abu Dhabi is very, very far away from Ukraine, and it's also far from many places in Africa. It's a big, sunny city. It has tall buildings and warm weather. It's a place where people from all over the world sometimes meet to talk about important things.\n\nImagine flying in a big aeroplane over many lands and oceans to get there! It's a very special place to hold these kinds of important meetings because it's a neutral spot. That means it’s a friendly place that welcomes everyone to talk fairly.\n\nDid you know? Abu Dhabi is in a place called the United Arab Emirates. It's a country that has a lot of sand and desert, but also amazing, green parks thanks to clever ways of watering plants! It's like magic!\n\n<h3>Why Talk Is Super Strong</h3>\n\nThese grown-ups are meeting because they believe that talking is the best way to solve big problems. When people fight, everyone gets hurt and sad. But when people talk, they can listen to each other's ideas and try to find a solution that works for everyone.\n\nThink about when you build a tower with blocks. If you just push someone else's blocks, the tower falls down. But if you talk about where each block should go, you can build a super-tall, strong tower together! That's what these talks are trying to do for Ukraine – build a strong tower of peace.\n\nDid you know? Even animals in a group communicate! They make sounds or special movements to tell each other things. Talking is a very natural and important way to live together.\n\n<h3>Working Together for a Better World</h3>\n\nMany different countries are interested in these talks. They want to help Ukraine. It shows us that countries can be like good friends. When one friend has a problem, other friends come to help. This is what 'working together' means on a very big scale.\n\nWhen leaders from different countries sit down to talk, they are showing that they care. They care about the people of Ukraine, and they care about making the whole world a safer and more peaceful place for everyone, including all of us here in Africa.\n\nDid you know? Every country has its own special flag! It's like a country's uniform or special symbol. When leaders meet, you often see all their flags together, showing that many different friends are working as a team.\n\n<h3>What Happens in These Important Talks?</h3>\n\nDuring these talks, the grown-ups will sit together. They will listen very carefully to each other. They will share their thoughts and ideas on how to bring peace to Ukraine. It's not always easy, because big problems can be tricky to solve. But they keep trying, because helping people is very important.\n\nThey want to find fair ways to solve problems. They will talk about land and places where people live. They want to make sure everyone agrees on how to make Ukraine a safe and happy home again. It’s a bit like solving a giant puzzle, piece by piece.\n\nDid you know? Even small steps forward are still progress! Just like when you are learning to ride a bike, every little push helps you get closer to riding all by yourself. These talks are taking small steps for a big goal!\n\n<h3>Hoping for Happiness and Peace</h3>\n\nWe all hope that these new talks in Abu Dhabi will help a lot. We hope that the grown-ups will find really good solutions. We want the children in Ukraine to be able to play safely, go to school, and live without worry, just like you do. \n\nPeace means everyone can smile, learn, and grow strong. It means no loud noises, no fear, just quiet happiness and friendly neighbours. That’s what these talks are aiming for, and it’s a wonderful thing to wish for.\n\nDid you know? Many people all over the world, including in Africa, always wish for peace. It's a wish that connects us all, no matter where we live or what language we speak. Peace makes the world go 'round happily!\n\n<h3>Let's All Be Friends!</h3>\n\nSo, my lovely friends, let's keep our fingers crossed and send our happy thoughts to these grown-ups meeting in Abu Dhabi. Let's hope they find the best ways to bring peace to Ukraine. Remember, talking and being kind are the best superpowers we all have! And that's your news for today. Keep smiling!",
    "summary": "Important grown-ups are meeting in Abu Dhabi to talk about bringing peace and happiness to the country of Ukraine, hoping to solve problems by talking instead of fighting.",
    "whyMatters": "These talks are important because they are trying to help the people in Ukraine live safely and happily again, showing that talking is the best way for countries to solve big problems and make the world peaceful for everyone.",
    "category": "world",
    "date": "2026-02-01T15:21:18.793Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Chats%20for%20Peace%20in%20Ukraine!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-chats-for-peace-in-ukraine",
    "originalLink": "https://www.aljazeera.com/news/2026/2/1/trilateral-ukraine-talks-set-to-resume-in-abu-dhabi-on-wednesday-zelenskyy?traffic_source=rss"
  },
  {
    "originalTitle": "Epstein sent $75,000 to accounts linked to Mandelson, files suggest",
    "title": "Epstein sent $75,000 to accounts linked to Mandelson, files suggest",
    "content": "Lord Mandelson says he has no record or recollection of receiving the sums and does not know if the documents are authentic.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-01T15:21:24.551Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20sent%20%2475%2C000%20to%20accounts%20linked%20to%20Mandelson%2C%20files%20suggest%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-sent-dollar75000-to-accounts-linked-to-mandelson-files-suggest",
    "originalLink": "https://www.bbc.com/news/articles/cn82elvzpz7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran's supreme leader warns of regional war if US attacks",
    "title": "Iran's supreme leader warns of regional war if US attacks",
    "content": "Trump earlier said Iran - which is due to begin a live-fire naval exercise in a key shipping route - was in \"serious discussions\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-01T15:21:29.722Z",
    "image": "https://image.pollinations.ai/prompt/Iran's%20supreme%20leader%20warns%20of%20regional%20war%20if%20US%20attacks%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "irans-supreme-leader-warns-of-regional-war-if-us-attacks",
    "originalLink": "https://www.bbc.com/news/articles/cx20z5nv9jxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israel to ban MSF from working in Gaza over refusal to provide staff list",
    "title": "Israel to ban MSF from working in Gaza over refusal to provide staff list",
    "content": "Medical charity Medicine Sans Frontières said it would not share the list as it had not been able to ensure staff would remain safe.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-01T15:21:34.891Z",
    "image": "https://image.pollinations.ai/prompt/Israel%20to%20ban%20MSF%20from%20working%20in%20Gaza%20over%20refusal%20to%20provide%20staff%20list%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israel-to-ban-msf-from-working-in-gaza-over-refusal-to-provide-staff-list",
    "originalLink": "https://www.bbc.com/news/articles/cvg1ymmkpkro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Wolves accept reduced £48m offer for Strand Larsen",
    "title": "Wolves accept reduced £48m offer for Strand Larsen",
    "content": "Wolves have accepted a reduced offer worth £48m for striker Jorgen Strand Larsen from Crystal Palace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-01T15:21:40.348Z",
    "image": "https://image.pollinations.ai/prompt/Wolves%20accept%20reduced%20%C2%A348m%20offer%20for%20Strand%20Larsen%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wolves-accept-reduced-pound48m-offer-for-strand-larsen",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy59zngnxd1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watford boss Gracia resigns after three months",
    "title": "Watford boss Gracia resigns after three months",
    "content": "Javi Gracia resigns as Watford manager after just over three months in job.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-01T15:21:45.507Z",
    "image": "https://image.pollinations.ai/prompt/Watford%20boss%20Gracia%20resigns%20after%20three%20months%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "watford-boss-gracia-resigns-after-three-months",
    "originalLink": "https://www.bbc.com/sport/football/articles/c931vkqy2ygo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bartley becomes Livingston boss as Martindale moves upstairs",
    "title": "Bartley becomes Livingston boss as Martindale moves upstairs",
    "content": "Marvin Bartley becomes Livingston manager with David Martindale taking up a new role as sporting director at the Scottish Premiership bottom club.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-01T15:21:50.671Z",
    "image": "https://image.pollinations.ai/prompt/Bartley%20becomes%20Livingston%20boss%20as%20Martindale%20moves%20upstairs%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bartley-becomes-livingston-boss-as-martindale-moves-upstairs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce8rem3g4j4o?at_medium=RSS&at_campaign=rss"
  }
]