[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Big Fish, Big Fun in Nigeria!",
    "content": "Hello everyone! It's your friend from Africa, here with exciting news just for you! We are going on a special trip to Nigeria today. Nigeria is a very big country in Africa, full of happy people and amazing stories.\n\nGuess what? They just had a super fun festival there! It was all about catching fish. Can you imagine a whole party just for fishing? It sounds like so much fun!\n\n<h3>A Festival of Fun!</h3>\nThis big party is called a fishing festival. A festival is like a very special celebration. Everyone comes together to have a good time. There is lots of music, dancing, and delicious food.\n\nBut the most exciting part of this festival was the fishing! People showed off their best fishing skills. They wanted to catch the biggest fish in the river.\n\nDid you know? A river is like a long, flowing road of water where fish love to swim!\n\n<h3>Getting Ready to Catch!</h3>\nThe festival was not just one day of fun. Oh no! It was many, many days of excitement. People got ready for the big fishing contest for days.\n\nThey cleaned their boats. They checked their fishing nets. They talked about who would catch the biggest fish this year. Everyone was so excited!\n\nBoys and girls, men and women, all looked forward to the special day. They waited for the signal to jump into the water.\n\nDid you know? Fishing is one of the oldest jobs in the world! People have been catching fish for food for a very, very long time.\n\n<h3>The Big Fishing Day!</h3>\nThen came the biggest day! It was the day of the fishing competition. Lots and lots of people gathered near the river. The air was buzzing with excitement.\n\nThey were all ready to catch fish. But not with a fishing rod like you might think! In this festival, people use special, traditional nets and sometimes even their bare hands!\n\nImagine hundreds of people rushing into the water at the same time! It must have looked like a big, happy splash! Everyone wanted to be the first to find a giant fish.\n\nThey searched in the sparkling water. They threw their nets wide. They laughed and cheered for their friends. It was a wonderful sight!\n\nDid you know? The fish they catch can be very big! Some fish, like catfish or Nile perch, can be as long as a small child!\n\n<h3>Who Will Catch the Biggest Fish?</h3>\nThe goal was simple: catch the biggest fish. Imagine the surprise when someone pulled out a truly giant fish! Everyone would cheer loudly.\n\nThey brought their big catches to a special place. Judges would weigh them carefully. The person with the heaviest fish was the winner!\n\nWinners get special prizes! Maybe a new bicycle, or a radio, or even some money. But the best prize is often the proud feeling of being the champion.\n\nThis kind of competition is called a contest. It's when people try their best to win something. But it's also about having fun together.\n\nDid you know? Nigeria has many beautiful rivers and lakes, which are home to lots of different types of fish!\n\n<h3>Fishing for Friendship!</h3>\nNow, here is the most important part of this festival. It's not just about catching fish or winning prizes. This festival has a very special job.\n\nIt helps people be friends. Long, long ago, some people in different towns or villages might have argued. They might have had problems with each other.\n\nSo, wise leaders came up with an idea. Let's have a big fishing festival! Everyone from all the towns can come. They can play together and laugh together.\n\nWhen people celebrate together, they forget their arguments. They remember that they are all part of one big family. This is called creating peace.\n\nPeace means everyone is friendly, kind, and no one is fighting. It means sharing and helping each other. This festival helps make sure everyone is happy together.\n\nDid you know? Festivals like this are a wonderful way to teach children about their history and why it's important to be kind to everyone!\n\n<h3>More Than Just Fish!</h3>\nSo, this Nigerian fishing festival is much more than just a game. It's about togetherness. It's about remembering old stories. It's about making new friends.\n\nIt shows that even a simple activity like fishing can bring lots of people together. It reminds everyone that peace is very important. Everyone in the community works together.\n\nCommunity means all the people living in a place, like your neighborhood or village. They help each other and have fun together.\n\nIt's a beautiful way to celebrate the rivers, the fish, and most importantly, the people of Nigeria! What a fantastic way to enjoy nature and build friendships.\n\n<h3>See You Soon!</h3>\nThat's all the exciting news from Africa for today! Isn't it wonderful how a fishing festival can bring so much joy and peace? I hope you learned something new. Bye for now!",
    "category": "world",
    "date": "2026-02-22T11:17:27.242Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Fish%2C%20Big%20Fun%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-fish-big-fun-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rules for Everyone: Important News from Cameroon!",
    "content": "Hello, amazing friends all over Africa! I'm your friendly news reporter, here to share some important news from our beautiful continent. Today, we're going to talk about something really important: rules!\n\nRules help us live together happily and safely. They are like special guides that tell us what to do and what not to do. Everyone needs to follow rules.\n\n<h3>A Story About Rules and Fairness</h3>\nIn a country called Cameroon, which is part of our big African family, something sad happened. Some people called \"civilians\" were hurt.\n\nCivilians are just regular people like you and me. They are not soldiers. Soldiers usually wear uniforms and help keep people safe. That is their very important job!\n\nBut sometimes, people make mistakes. Sometimes, people do things that are against the rules. And this happened with some soldiers in Cameroon.\n\nSadly, these soldiers hurt 21 regular people. This was a very sad thing to happen. It was not what soldiers are supposed to do. Soldiers are meant to protect everyone.\n\n<h3>Why We Have Rules</h3>\nImagine playing a game without any rules. It would be confusing, right? And maybe someone would get hurt. Rules make games fun and fair.\n\nIt's the same in our towns and villages. Rules help everyone know how to behave. They help us stay safe and be kind to each other.\n\nWhen everyone follows the rules, our communities are strong and happy. We feel safe when we know rules are there to protect us.\n\nDid you know? Following rules helps everyone feel important and safe. It makes our homes and schools better places to be!\n\n<h3>What Soldiers Are Supposed To Do</h3>\nSoldiers have a very important job. Their job is to protect people and their country. They train very hard to do this.\n\nThey wear special uniforms and learn how to be brave. They promise to keep people safe from harm. That is their main goal.\n\nBut even soldiers must follow rules. Just like a referee in a football game makes sure everyone plays fair, there are rules for soldiers too. These rules keep everyone safe.\n\nDid you know? Many countries in Africa have brave soldiers who work hard every day to protect their people and keep the peace.\n\n<h3>What is Justice?</h3>\nWhen someone breaks a rule, especially a very big and important rule, there is a way to make things right. This is called \"justice.\"\n\nJustice means that everyone is treated fairly. It means that if someone does something wrong, there are consequences. Consequences mean what happens after an action.\n\nIn Cameroon, judges and a court looked at what happened. A court is like a big room where people talk about rules that were broken. Judges are like special teachers who know all the rules.\n\nThey decided that the three soldiers had broken very important rules. So, the soldiers were sent to \"jail.\" Jail is a place where people go when they break big rules. This is called a \"prison sentence.\"\n\nThis shows that rules are for everyone, even soldiers. No one is above the rules, no matter how important they are.\n\n<h3>Good News About Justice</h3>\nThis news is good because it shows that justice works! It means that when sad things happen, people try to make things right.\n\nIt shows that breaking rules has consequences. This helps to keep everyone safer in the future. It reminds us all that rules are serious.\n\nWhen people see that rules are followed, it helps build trust. Trust means believing that people will do the right thing.\n\nDid you know? When justice happens, it helps everyone feel more secure and happy in their communities.\n\n<h3>What We Can All Learn</h3>\nSo, what can we learn from this? We can learn that rules are super important. We should always try our best to follow them.\n\nWe can also learn to be kind to everyone around us, whether they are civilians or soldiers. Everyone deserves respect.\n\nIf you ever see something that is not right, it's good to tell a trusted adult. An adult like a parent or a teacher can help.\n\nAnd remember, we are all part of one big family in Africa. We want everyone to be safe and happy.\n\nThis news from Cameroon reminds us that rules help make our world fair and safe. Let's all do our part to make Africa a place where everyone feels protected and happy! Thank you for listening!",
    "summary": "Three soldiers in Cameroon were sent to jail for hurting 21 regular people, showing that everyone, even soldiers, must follow important rules to keep everyone safe and to ensure justice.",
    "whyMatters": "This is important because it shows that rules are for everyone, helping to make sure that people are safe and that bad actions have consequences, which helps make our communities fair and trustworthy.",
    "category": "technology",
    "date": "2026-02-22T11:17:47.025Z",
    "image": "https://image.pollinations.ai/prompt/Rules%20for%20Everyone%3A%20Important%20News%20from%20Cameroon!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rules-for-everyone-important-news-from-cameroon",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:17:52.130Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland minister says US may access its minerals, military bases: Report",
    "title": "Somaliland's Big Idea: Making Friends for the Future!",
    "content": "<h3>Hello from Somaliland!</h3>\nHi everyone! Your friendly news reporter from Africa is here! Today, we have exciting news from a special place called Somaliland. It's in the eastern part of Africa, a land of sunshine and friendly faces. Somaliland wants to make new friends all around the world. They have a big idea to help them do just that! Let's find out what it is.\n\n<h3>Meet Somaliland: A Special Place</h3>\nSomaliland is a beautiful place. It has a long coast along the sea and mountains too. Many wonderful people live there. For a long time, Somaliland has been working hard to be its very own country. They have their own government and their own plans. But they want other big countries to say, \"Yes, Somaliland, you are a country!\" This is called \"recognition.\"\nDid you know? Somaliland has ancient rock art that is thousands of years old!\n\n<h3>Making Friends with America (The US)</h3>\nNow, Somaliland has a big plan to make more friends. They are talking to a very big country called America. Sometimes we call America \"the US.\" America is far, far away across the ocean. Somaliland hopes that if they work with America, more countries will see them as a real country. It's like inviting a new friend to play, hoping everyone else will then want to play with them too!\n\n<h3>What are Minerals? Shiny Treasures!</h3>\nWhat is Somaliland offering to America? One thing is \"minerals.\" Minerals are special treasures found deep in the ground. They can be shiny metals like gold, or other important things. We use minerals to make many things! They are in your mobile phones, your cars, and even some toys. Somaliland has many of these special rocks. They are saying America can help get these minerals from the ground.\nDid you know? Africa has many precious minerals like diamonds and gold!\n\n<h3>What are Military Bases? Places for Heroes!</h3>\nAnother thing Somaliland is talking about is \"military bases.\" A military base is a special place where soldiers live and train. Soldiers are brave men and women who help keep people safe. They protect their country and sometimes help other countries too. Somaliland might let America build a military base there. This base would be a place for American soldiers to stay and work. It's like sharing your backyard so a friend can play there.\n\n<h3>Why is Somaliland Doing This? Making New Friends!</h3>\nWhy is Somaliland offering these things? It's all about making friends and getting that \"recognition\" we talked about. They want the whole world to know that Somaliland is a separate, special country. If America agrees to work with them, it will be a big step. Other countries might see this and think, \"Hmm, if America sees Somaliland as important, maybe we should too!\" It's like getting a thumbs-up from a popular friend.\n\n<h3>What Does \"Recognition\" Mean?</h3>\nLet's talk more about \"recognition.\" Imagine you have a new drawing. You want everyone to see it and say, \"Wow, that's a great drawing!\" That's like recognition. For a country, recognition means other countries say, \"Yes, you are a real country with your own rules and your own land.\" If Somaliland gets more recognition, it can join more important meetings, trade more goods, and get more help for its people. It helps them grow stronger.\n\n<h3>Good Things for Somaliland</h3>\nSo, what are the good things for Somaliland? If America works with them, it can bring many good things. Maybe America will help build better roads or new schools. It could mean more jobs for people in Somaliland. It could also mean more safety, with soldiers helping to keep the peace in the area. It's a way for Somaliland to get stronger and better for everyone living there.\nDid you know? When countries are friends, they often help each other with building new things!\n\n<h3>Good Things for America Too!</h3>\nAnd what about America? Why would they want to help Somaliland? Well, America needs minerals for its factories and products. Having a military base in Somaliland could also help them keep peace and safety in that part of the world. It's a win-win situation, where both countries help each other and become good partners.\n\n<h3>Working Together for a Better Future</h3>\nSo, Somaliland is making a big move! They are showing the world they are ready to be a full partner. By offering to share their special minerals and places for soldiers, they hope to get the respect and recognition they have worked so hard for. It's all about working together, making friends, and building a brighter future for the children of Somaliland and for Africa! We hope this big idea brings lots of good things!",
    "summary": "Somaliland, a place in Africa, is offering America the chance to use its special minerals and places for soldiers, hoping that this friendship will help other countries see Somaliland as its own country.",
    "whyMatters": "This is important because it could help Somaliland become a stronger, more recognized country, bringing new friends, jobs, and safety to its people.",
    "category": "world",
    "date": "2026-02-22T11:18:13.871Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland's%20Big%20Idea%3A%20Making%20Friends%20for%20the%20Future!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somalilands-big-idea-making-friends-for-the-future",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/somaliland-minister-says-us-may-access-its-minerals-military-bases-report?traffic_source=rss"
  },
  {
    "originalTitle": "LIVE: India vs South Africa – T20 World Cup",
    "title": "LIVE: India vs South Africa – T20 World Cup",
    "content": "Follow our live build-up, team news, score, toss and full text and photo stream from today's Super Eight match.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:18.970Z",
    "image": "https://image.pollinations.ai/prompt/LIVE%3A%20India%20vs%20South%20Africa%20%E2%80%93%20T20%20World%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "live-india-vs-south-africa-t20-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/2/22/live-india-vs-south-africa-t20-world-cup?traffic_source=rss"
  },
  {
    "originalTitle": "Elderly men beaten up ‘for being Muslim’ in India",
    "title": "Elderly men beaten up ‘for being Muslim’ in India",
    "content": "Three elderly men were slapped and chased by a passerby in India after he reportedly targeted them for being Muslim.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:24.065Z",
    "image": "https://image.pollinations.ai/prompt/Elderly%20men%20beaten%20up%20%E2%80%98for%20being%20Muslim%E2%80%99%20in%20India%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "elderly-men-beaten-up-for-being-muslim-in-india",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/22/elderly-men-beaten-up-for-being-muslim-in-india?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:29.551Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan launches deadly strikes on Afghanistan",
    "title": "Pakistan launches deadly strikes on Afghanistan",
    "content": "Pakistan says the strikes were retaliation for recent suicide bombings in the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:34.647Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20launches%20deadly%20strikes%20on%20Afghanistan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-launches-deadly-strikes-on-afghanistan",
    "originalLink": "https://www.bbc.com/news/articles/cdxgln3gnd6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "title": "More than 1,500 Venezuelan political prisoners apply for amnesty",
    "content": "The announcement by the head of Venezuela's National Assembly comes amid US pressure following the capture of ex-President Nicolás Maduro.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:39.749Z",
    "image": "https://image.pollinations.ai/prompt/More%20than%201%2C500%20Venezuelan%20political%20prisoners%20apply%20for%20amnesty%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-than-1500-venezuelan-political-prisoners-apply-for-amnesty",
    "originalLink": "https://www.bbc.com/news/articles/c93w9g2dvn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Educate yourself and your kids' - Fofana and Mejbri racially abused",
    "title": "'Educate yourself and your kids' - Fofana and Mejbri racially abused",
    "content": "Burnley midfielder Hannibal Mejbri and Chelsea defender Wesley Fofana have spoken out on social media after being sent racist abuse in the aftermath of the clubs' Premier League match on Saturday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T11:18:45.194Z",
    "image": "https://image.pollinations.ai/prompt/'Educate%20yourself%20and%20your%20kids'%20-%20Fofana%20and%20Mejbri%20racially%20abused%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "educate-yourself-and-your-kids-fofana-and-mejbri-racially-abused",
    "originalLink": "https://www.bbc.com/sport/football/articles/c24dv38q224o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Guardiola tells team to chill with cocktails as Man City pile pressure on Arsenal",
    "title": "Guardiola tells team to chill with cocktails as Man City pile pressure on Arsenal",
    "content": "As Manchester City continue to crank up the pressure on Arsenal, Pep Guardiola tells his players to take three days off to \"enjoy life\" with \"caipirinhas and daiquiris\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T11:18:50.290Z",
    "image": "https://image.pollinations.ai/prompt/Guardiola%20tells%20team%20to%20chill%20with%20cocktails%20as%20Man%20City%20pile%20pressure%20on%20Arsenal%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guardiola-tells-team-to-chill-with-cocktails-as-man-city-pile-pressure-on-arsenal",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckgl393k2l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Football quiz: Name the north London derby's top scorers",
    "title": "Football quiz: Name the north London derby's top scorers",
    "content": "With the north London derby coming up on Sunday, can you name the top scorers across Arsenal and Tottenham's Premier League meetings?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T11:18:55.393Z",
    "image": "https://image.pollinations.ai/prompt/Football%20quiz%3A%20Name%20the%20north%20London%20derby's%20top%20scorers%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "football-quiz-name-the-north-london-derbys-top-scorers",
    "originalLink": "https://www.bbc.com/sport/football/articles/cpw0zx2y8g1o?at_medium=RSS&at_campaign=rss"
  }
]