[
  {
    "originalTitle": "Nigeria denies report it paid 'huge' ransom to free pupils in mass abduction",
    "title": "Nigeria denies report it paid 'huge' ransom to free pupils in mass abduction",
    "content": "The rebuttal was followed by news the police chief was resigning a year before the end of his term.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-24T20:29:15.187Z",
    "image": "https://image.pollinations.ai/prompt/Nigeria%20denies%20report%20it%20paid%20'huge'%20ransom%20to%20free%20pupils%20in%20mass%20abduction%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nigeria-denies-report-it-paid-huge-ransom-to-free-pupils-in-mass-abduction",
    "originalLink": "https://www.bbc.com/news/articles/cewzyqjq2ygo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ramaphosa thanks Putin for release of South Africans lured into Russia-Ukraine war",
    "title": "Good News! Our Friends Are Home Safe!",
    "content": "Hello, amazing kids of Africa! It's your friendly news reporter here, ready to share some important news with you. We have some happy news from far away that tells us how important it is to be careful and trust our leaders!\n\n<h3>A Big Hello from Your African News Reporter!</h3>\nMy name is Kipepeo, and I love sharing stories that help you learn about the world. Today, we have a story about some grown-ups from our very own South Africa. They went on a very, very long trip to a country called Russia. It’s a country that is super, super far away from us, across big oceans and many lands.\n\n<h3>Our Friends Were Far Away</h3>\nImagine going on an airplane for many, many hours! That's how far these grown-ups travelled. They left their homes and families here in sunny South Africa. They were hoping to start a new job in a new place. It’s always exciting to think about new adventures, isn't it? But sometimes, adventures can take unexpected turns.\n\n<h3>Thinking About a Job</h3>\nThese South African men thought they were going to Russia to get a special job. They believed they would become 'bodyguards'. Do you know what a bodyguard does? A bodyguard is a brave person who protects other people. They make sure important people are safe from harm. It sounds like a very important and helpful job, right?\n\n**Did you know?** There are many different kinds of jobs in the world! Some people are teachers, some are doctors, some are farmers, and some protect people like bodyguards. Every job helps our communities!\n\n<h3>A Different Kind of Place</h3>\nBut something very different happened when they got to Russia. Instead of training to be bodyguards, they found themselves in a place where there was a big problem. There was a war happening between Russia and another country called Ukraine. A war is when countries fight with each other, and it can be a very scary and dangerous time for everyone.\n\nWe don't like fighting, do we? We like peace and playing together. So, it was not good that our South African friends ended up in a place where people were fighting. They were tricked into going to this dangerous place.\n\n<h3>Where is Russia and Ukraine?</h3>\nLet's think about a map of the world. South Africa is at the very bottom of our big continent, Africa. Russia and Ukraine are way up north, in a different part of the world called Europe and Asia. They are very, very far away. It would take a very long time to travel there by airplane or boat!\n\n**Did you know?** The Earth is very, very big! There are many countries and many people all over the world. Even though we are far apart, we are all part of the big human family.\n\n<h3>What is the 'Front Line'?</h3>\nWhen there is a war, there is a place called the 'front line'. This is the place where all the fighting is happening. It's the most dangerous place of all. Our South African friends, who thought they were going for a bodyguard job, found themselves right in the middle of this dangerous front line. Imagine how scared they must have felt!\n\nThey were not trained to be soldiers or to fight in a war. They were just regular people looking for a job. It was a very confusing and scary situation for them. We are very sad when people are put in danger when they didn't expect it.\n\n<h3>Our President Helped!</h3>\nBut here is the good news part of the story! Our wonderful President of South Africa, President Cyril Ramaphosa, heard about our friends. He is the leader of our country, and he cares about all the people who live here, even when they are far away.\n\nPresident Ramaphosa knew he had to help. So, he spoke to the President of Russia, President Vladimir Putin. Talking to other leaders is how big problems get solved. Our President asked President Putin to let our South African friends come home, away from the dangerous war.\n\n**Did you know?** Presidents are like the 'head teachers' of their countries. They work very hard to keep everyone safe and happy, and they talk to other 'head teachers' from other countries to solve big problems!\n\n<h3>Coming Home Safe</h3>\nAnd guess what? President Putin listened to President Ramaphosa! The South African men were 'released'. This means they were let go and allowed to leave the dangerous place. They could finally start their journey back home to South Africa!\n\nIsn't that wonderful news? We are so happy that they are safe and sound now. It shows that when leaders work together, they can bring good things to people. We are thankful that our President worked so hard to bring our friends home.\n\n**Did you know?** Saying 'thank you' is a very important way to show that you appreciate someone's help. President Ramaphosa said thank you to President Putin for helping our people come home.\n\n<h3>Why This Story is Important for You</h3>\nThis story teaches us something very important, my young friends. It teaches us to always be careful. If someone promises you something that sounds too good to be true, or if you feel unsure about something, always talk to a trusted grown-up.\n\nYour mom, dad, teacher, or any other grown-up you trust can help you understand things better and keep you safe. Never go with strangers or agree to do something big without talking to your grown-ups first.\n\n**Did you know?** Your grown-ups love you very much and always want to keep you safe. They are always there to help you make good choices and protect you from danger.\n\n<h3>Staying Safe and Smart</h3>\nSo, remember this story. It’s a story about hope, about leaders helping people, and about being smart and safe. We are so glad our South African friends are back home where they belong. Keep playing, keep learning, and always remember to be safe and smart!\n\nThat’s all for your African news today! See you next time, super kids!",
    "summary": "Our President Cyril Ramaphosa helped bring South African men home safely from a far-away war in Russia, where they were tricked into going instead of doing a bodyguard job.",
    "whyMatters": "This is important because it shows that our leaders care about us and work to keep us safe, and it reminds us to always be careful and talk to grown-ups about big decisions.",
    "category": "world",
    "date": "2026-02-24T20:29:39.825Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Our%20Friends%20Are%20Home%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-our-friends-are-home-safe",
    "originalLink": "https://www.bbc.com/news/articles/c2d1j7klzpgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghana drops coup leader's name from main airport on putsch anniversary",
    "title": "Ghana drops coup leader's name from main airport on putsch anniversary",
    "content": "Supporters of the move said the Kotoka name contradicted the country’s democratic values.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:29:44.965Z",
    "image": "https://image.pollinations.ai/prompt/Ghana%20drops%20coup%20leader's%20name%20from%20main%20airport%20on%20putsch%20anniversary%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghana-drops-coup-leaders-name-from-main-airport-on-putsch-anniversary",
    "originalLink": "https://www.bbc.com/news/articles/c178n9yxk10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Warner Bros gets new offer from Paramount but still recommends Netflix bid",
    "title": "Big Movie News! Who Will Team Up with Warner Bros?",
    "content": "<h3>Hello, Amazing Movie Lovers!</h3>\nHello, amazing movie lovers! It's your friendly reporter from Africa, here to share some super exciting news! Today, we are talking about some very big companies that make the movies and shows you love. It's like a big game where these companies are trying to team up. Let's find out what's happening!\n\nThis news is about three big names: Warner Bros, Netflix, and Paramount. They all want to make sure you get to watch the best stories ever. Get ready for a story about big companies making big choices!\n\n<h3>Meet Warner Bros!</h3>\nFirst, let's talk about Warner Bros. Have you ever seen movies with superheroes like Batman or Wonder Woman? Or maybe funny cartoons like Bugs Bunny? Well, Warner Bros is the amazing company that helps make these stories come alive! They make lots and lots of movies and TV shows for children and grown-ups.\n\nWarner Bros has been around for a very, very long time. They are known for creating magical worlds and exciting adventures. They are a super important part of the movie world.\n\nDid you know? Warner Bros is over 100 years old! Imagine all the stories they have told!\n\n<h3>Meet Netflix!</h3>\nNext, let's talk about Netflix. Netflix is like a giant, magical library of movies and shows. You can watch them on your TV, a tablet, or a computer. It's called 'streaming.' This means you don't need to go to a movie shop. You can watch your favorite stories right at home, any time you want!\n\nNetflix makes its own special shows and movies too. They have many fun shows just for kids. It’s a wonderful place to find new adventures to watch. Many families love Netflix because there is always something new and exciting to see.\n\nDid you know? Netflix has millions and millions of friends all around the world who watch their shows! That's a lot of happy viewers!\n\n<h3>Meet Paramount!</h3>\nNow, let's meet Paramount. Paramount is another very big company, just like Warner Bros. They also make many wonderful movies and TV shows. Maybe you have seen some movies that Paramount made too! They have a big mountain logo you might recognise.\n\nParamount makes all kinds of stories, from action-packed movies to funny comedies. They bring talented people together to create amazing entertainment for everyone. They are a strong and old company in the world of movies.\n\nDid you know? The mountain on Paramount's logo is called 'Paramount Mountain'! It's a famous symbol in movies!\n\n<h3>What's This About 'Offers'?</h3>\nNow, imagine you have a very special toy. Two friends want to play with it or maybe even buy it from you. They would make you an 'offer.' An offer is like saying, 'I want this, and I will give you this much for it.'\n\nIn our big movie story, Warner Bros is like that special toy. Netflix wants to team up with Warner Bros. So, Netflix made an 'offer' to Warner Bros. This means Netflix said, 'We want to join with you, and here is how we can do it!'\n\nBut guess what? Paramount also wants to team up with Warner Bros! So, Paramount made an 'offer' too. It’s like both friends want to play with the same cool toy, Warner Bros.\n\n<h3>Who Makes the Big Decisions?</h3>\nEvery big company has a group of very smart grown-ups called a 'board.' This board is like the head of a family. They make all the important decisions for the company. They think about what is best for everyone involved.\n\nThe board members at Warner Bros are looking at all the offers. They need to choose which offer is the best for their company. It is a very big job because their decision will affect many, many movies and shows, and all the people who work at Warner Bros.\n\nThey have to think very carefully about which offer will help Warner Bros make even more amazing stories for you.\n\n<h3>Netflix's First Offer</h3>\nAt first, the smart grown-ups on the Warner Bros board looked at Netflix's offer. They thought it was a very good plan. They felt that Netflix's idea to team up would be great for Warner Bros.\n\nThey were happy with what Netflix put on the table. It seemed like a good way forward for creating more entertainment. So, for a while, it looked like Warner Bros and Netflix would be teaming up.\n\n<h3>Then Came Paramount's New Offer!</h3>\nBut then, something exciting happened! Paramount came along with a *new* offer for Warner Bros. And this new offer from Paramount might be even better!\n\nImagine you chose a flavour of ice cream, but then someone showed you an even more delicious flavour you hadn't seen before! That's a bit like what happened. Paramount's new offer made the grown-ups at Warner Bros stop and think again.\n\nNow, the Warner Bros board has to look at Paramount's new offer very, very closely. They want to see if it is 'superior.' This means they want to know if Paramount's offer is even better or more helpful than Netflix's first offer.\n\n<h3>What Happens Next?</h3>\nSo, what happens next in this big movie adventure? The smart grown-ups on the Warner Bros board will meet again. They will talk and think hard about Paramount's new offer. They will ask, 'Is this offer truly better for Warner Bros?'\n\nIf the Warner Bros board decides that Paramount's offer is 'superior' (meaning better!), then Netflix gets a chance to 'revise its bid.' This means Netflix can change its offer! They can say, 'Okay, we can offer something even better too!'\n\nIt's like a friendly competition to see who can make the best team-up. Everyone wants to make the most wonderful movies and shows for you to enjoy!\n\n<h3>Why Is This Important?</h3>\nThis big news is important because it means more wonderful movies and shows for all of us! When big companies team up, they can make even bigger and more amazing stories. They can bring us more superheroes, more cartoons, and more fun adventures.\n\nIt shows how busy and exciting the world of movies and TV shows is. These companies are always trying to find the best ways to bring joy and entertainment to homes all around Africa and the world.\n\n<h3>That's All For Now!</h3>\nThat's all the exciting news from the movie world for today! It’s like a real-life movie unfolding right before our eyes. We will keep watching to see who Warner Bros decides to team up with. Until next time, keep dreaming big and enjoying your favourite stories! Bye for now!",
    "summary": "Warner Bros, a big movie company, is getting new offers from Netflix and Paramount, and their grown-up board is deciding who to team up with to make even more exciting movies and shows.",
    "whyMatters": "This is important because these big decisions mean more awesome movies and shows for kids and grown-ups to watch from companies like Warner Bros, Netflix, and Paramount.",
    "category": "world",
    "date": "2026-02-24T20:30:06.345Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Movie%20News!%20Who%20Will%20Team%20Up%20with%20Warner%20Bros%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-movie-news-who-will-team-up-with-warner-bros",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/24/warner-bros-gets-new-offer-from-paramount-but-still-recommends-netflix-bid?traffic_source=rss"
  },
  {
    "originalTitle": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
    "title": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
    "content": "Generations of refugees in Aden endure poverty, lack identity, and cling to fading memories of Somalia's distant shores.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:30:11.476Z",
    "image": "https://image.pollinations.ai/prompt/Yemen%E2%80%99s%20%E2%80%98Mogadishu%E2%80%99%3A%20Somali%20refugees%20face%20poverty%2C%20instability%20in%20Aden%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden",
    "originalLink": "https://www.aljazeera.com/features/2026/2/24/yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden?traffic_source=rss"
  },
  {
    "originalTitle": "Ex-UK ambassador Peter Mandelson arrested over alleged Epstein links",
    "title": "Ex-UK ambassador Peter Mandelson arrested over alleged Epstein links",
    "content": "Ex-UK ambassador to the US Peter Mandelson was arrested for alleged misconduct tied to sex offender Jeffrey Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:30:16.630Z",
    "image": "https://image.pollinations.ai/prompt/Ex-UK%20ambassador%20Peter%20Mandelson%20arrested%20over%20alleged%20Epstein%20links%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ex-uk-ambassador-peter-mandelson-arrested-over-alleged-epstein-links",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/24/ex-uk-ambassador-peter-mandelson-arrested-over-alleged-epstein-links?traffic_source=rss"
  },
  {
    "originalTitle": "Russian soldiers tell BBC they saw fellow troops executed on commanders' orders",
    "title": "Russian soldiers tell BBC they saw fellow troops executed on commanders' orders",
    "content": "Four men expose the horror and brutality of conditions in the Ukraine war, with two saying they saw soldiers being shot for refusing orders.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:30:22.283Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20soldiers%20tell%20BBC%20they%20saw%20fellow%20troops%20executed%20on%20commanders'%20orders%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-soldiers-tell-bbc-they-saw-fellow-troops-executed-on-commanders-orders",
    "originalLink": "https://www.bbc.com/news/articles/cz7gw3l395ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ukraine remembers its dead as war enters a fifth year",
    "title": "Ukraine's Big Memory Day: Remembering and Hoping for Peace",
    "content": "Hello everyone! I'm your friendly news reporter from Africa, here to tell you about something important happening far away in a country called Ukraine. It's a place with lots of kind people, just like us. Right now, people in Ukraine are having a very special day. It’s a day to remember. Let’s learn all about it together!\n\n<h3>What is Happening Far Away in Ukraine?</h3>\nImagine two big playgrounds, and sometimes, the children in one playground start a big, noisy fight with the children from another playground. That's a little bit like what a war is, but much, much bigger and more serious between countries. Four years ago, a big country called Russia started fighting with Ukraine. This fighting is called a 'war'. It has been going on for a very long time, and it makes many people sad and scared.\n\nDid you know? Ukraine is a very big country in Europe. It's famous for its beautiful fields of sunflowers! Sunflowers are so cheerful and bright.\n\n<h3>Four Years is a Long, Long Time</h3>\nCan you remember when you started school? Maybe you were in kindergarten or Class 1. Well, this fighting in Ukraine has been going on since before that! It’s been going on for four whole years. That’s a super long time, isn’t it? It means many children in Ukraine have grown up with this big trouble around them. And now, it's starting its fifth year. Wow!\n\nWhen something big and difficult like this happens for a long time, people need to stop and think. They need to remember everything that has happened.\n\n<h3>Remembering Friends and Family</h3>\nOn this special day, people in Ukraine are remembering all the friends, family, and kind people who have been hurt or have died because of the war. When we remember someone, it means we think about them, their smiles, their stories, and how much we love them. It's a way to keep them in our hearts, even if they are not with us anymore.\n\nThey hold special gatherings, sometimes lighting candles or sharing quiet moments. It’s like when we remember a special birthday or a happy holiday, but this time, it’s a sadder memory, mixed with a lot of hope for peace.\n\nDid you know? The capital city of Ukraine is called Kyiv (pronounced Kee-yev). It's a very old and beautiful city with amazing buildings!\n\n<h3>Life for Children in Ukraine</h3>\nWhen there is a war, life can become very tricky, especially for children. Many children in Ukraine have had to leave their homes because it wasn't safe anymore. Imagine leaving all your toys, your bed, and your friends to go to a new place. It can be very scary.\n\nSometimes, schools have to close, or children have to learn in special safe places underground. It's not like going to school every day with your friends. But even with all these difficulties, children in Ukraine are very brave and strong. They still try to learn, play, and help each other.\n\n<h3>What Does 'Peace' Mean?</h3>\nPeace is when everyone is friendly, no one is fighting, and everyone feels safe and happy. It's like when you and your friends play nicely together, sharing your toys and laughing a lot. That’s what people in Ukraine, and all around the world, are wishing for right now: peace.\n\nOn this memory day, people are not just remembering; they are also hoping. They are hoping that the fighting will stop soon, that everyone can go back to their homes, and that children can play safely in their parks and go to school every day without worry.\n\nDid you know? Many people from other countries, far away like us, are helping Ukraine. They send food, clothes, medicines, and toys to help the children and families who need them. It shows that kindness can travel all around the world!\n\n<h3>Hoping for a Brighter Tomorrow</h3>\nSo, as we think about Ukraine on their special memory day, let's also send them our good wishes. We can hope for peace. We can be kind to everyone we meet, because kindness is a small step towards making the whole world a more peaceful place. Every little bit of kindness helps! We can remember that even though big problems happen, people are strong, and they always hope for a brighter, peaceful tomorrow. And that's a very important thing to remember.\n",
    "summary": "People in Ukraine are remembering those who died in a war that started four years ago and are now hoping for peace as the fighting continues.",
    "whyMatters": "This is important because it helps us understand that people in other countries can have big problems, and it teaches us about remembering those who are hurt and wishing for peace and kindness everywhere.",
    "category": "world",
    "date": "2026-02-24T20:30:38.572Z",
    "image": "https://image.pollinations.ai/prompt/Ukraine's%20Big%20Memory%20Day%3A%20Remembering%20and%20Hoping%20for%20Peace%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ukraines-big-memory-day-remembering-and-hoping-for-peace",
    "originalLink": "https://www.bbc.com/news/articles/clyg7r3nd3ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mexico hunts 23 inmates sprung from jail during wave of violence ",
    "title": "Mexico hunts 23 inmates sprung from jail during wave of violence ",
    "content": "The prisoners escaped from a jail in Puerto Vallarta after armed men rammed one of the gates.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:30:43.707Z",
    "image": "https://image.pollinations.ai/prompt/Mexico%20hunts%2023%20inmates%20sprung%20from%20jail%20during%20wave%20of%20violence%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mexico-hunts-23-inmates-sprung-from-jail-during-wave-of-violence",
    "originalLink": "https://www.bbc.com/news/articles/c07jpx7kkvpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Prestianni trains at Bernabeu despite match ban over racism allegation",
    "title": "Prestianni trains at Bernabeu despite match ban over racism allegation",
    "content": "Benfica winger Gianluca Prestianni trained alongside his team-mates at Real Madrid's stadium on Wednesday, despite being provisionally banned for Wednesday's Champions League match between the sides.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-24T20:30:49.330Z",
    "image": "https://image.pollinations.ai/prompt/Prestianni%20trains%20at%20Bernabeu%20despite%20match%20ban%20over%20racism%20allegation%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "prestianni-trains-at-bernabeu-despite-match-ban-over-racism-allegation",
    "originalLink": "https://www.bbc.com/sport/football/articles/cze0r6zw2e6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It would be catastrophic' - are Spurs too big to go down?",
    "title": "'It would be catastrophic' - are Spurs too big to go down?",
    "content": "Tottenham's heavy north London derby defeat against Arsenal on Sunday just confirmed what everyone already knew - Igor Tudor's team are in serious trouble. BBC Sport assesses their precarious situation, what relegation might bring and asks if they are too big to go down?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T20:30:54.463Z",
    "image": "https://image.pollinations.ai/prompt/'It%20would%20be%20catastrophic'%20-%20are%20Spurs%20too%20big%20to%20go%20down%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-would-be-catastrophic-are-spurs-too-big-to-go-down",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx24x48232vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Williamson 'wouldn't rule out' striking over scheduling",
    "title": "Williamson 'wouldn't rule out' striking over scheduling",
    "content": "England captain Leah Williamson says she would \"never rule out\" strike action to get players' messaging across to governing bodies about schedule concerns.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-24T20:30:59.608Z",
    "image": "https://image.pollinations.ai/prompt/Williamson%20'wouldn't%20rule%20out'%20striking%20over%20scheduling%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "williamson-wouldnt-rule-out-striking-over-scheduling",
    "originalLink": "https://www.bbc.com/sport/football/articles/cwyke2k1eryo?at_medium=RSS&at_campaign=rss"
  }
]