[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News for Our Ghanaian Family Far Away",
    "content": "<h3>Hello, My Wonderful Friends!</h3>\nHello, my wonderful friends! It's me, your friendly African news reporter! Today, I have some news to share with you. It's a little bit sad, but it's important for us to know and understand. Our story is about our brothers and sisters from a beautiful country called Ghana.\n\nGhana is right here in Africa, just like many of our homes. It's a place full of friendly people and sunny skies. But sometimes, far, far away, in other parts of the world, people are not getting along. They are having a big fight, which we call a war.\n\n<h3>About a Sad Story from Far Away</h3>\nOur news today is about this big fight that is happening very far from Africa. It is a war between two countries called Russia and Ukraine. They are very, very far away, like going on a very, very long trip across many oceans and lands.\n\nA special helper for Ghana, whom we call a minister, told us something important. He said that some of our dear people from Ghana have sadly passed away. They were far away, in the place where this war is happening.\n\nDid you know? A minister is like a very important leader who helps run a country. They take care of its people, like a big helper for everyone in the country!\n\n<h3>Our Ghanaian Family and the War</h3>\nSadly, 55 people from Ghana have died because of this war. That is a big number of people. It means that 55 families in Ghana are feeling very, very sad right now. They have lost someone they loved very much.\n\nThis is a very important piece of news. It means that from all the countries in Africa, Ghana has had the most people who have died in this far-away war. It makes our hearts feel heavy.\n\nDid you know? Africa is a huge continent! It has 54 different countries, and Ghana is one of the most amazing and special ones! It is in West Africa.\n\n<h3>Why Were Our Friends There?</h3>\nYou might be wondering, \"Why were people from Ghana so far away in a place with a war?\" That's a good question.\n\nMany people from Ghana travel to other countries for different reasons. Some go to study at big schools, like universities. They want to learn new things to help Ghana grow even stronger and smarter. They want to be doctors, teachers, or engineers for their home country.\n\nOthers go to find jobs and work hard. They send money back home to their families here in Ghana so their children can go to school and have food to eat. They are brave people, working or studying to make their lives and their families' lives better.\n\nDid you know? The capital city of Ghana is Accra, a very busy and exciting place where many people work and live!\n\n<h3>What is a War and Why is it Sad?</h3>\nA war is when countries or groups of people fight each other. They use weapons, and it is very dangerous and sad. Many people get hurt, and many homes get broken. It causes a lot of pain and makes everyone feel scared.\n\nIt is never a good thing, and everyone wishes for peace. Peace means everyone is getting along, playing together, and helping each other. It means no fighting, only smiling and sharing.\n\nDid you know? Most people in the world want peace, not war. They want everyone to be happy, safe, and live together as friends.\n\n<h3>Thinking of Our Friends and Families</h3>\nThis sad news makes us think of all the families in Ghana who have lost someone they love. We send our love and our prayers to them. We hope they find comfort and strength during this difficult time.\n\nIt's important to remember that we are all part of one big African family. When one part of our family hurts, we all feel a little bit of that hurt too. We stand together, even when things are sad.\n\nDid you know? Ghana is famous for its warm, friendly people, its beautiful Kente cloth, and its delicious jollof rice! Yum!\n\n<h3>What Can We Do to Help?</h3>\nEven though the war is far away, we can still do things. We can hope for peace. We can wish very hard for the fighting to stop. Every little bit of hope helps.\n\nWe can also be extra kind to the people around us every day. We can share our toys with our friends, help our parents with chores, and listen to our teachers. Being kind and peaceful in our own lives helps spread good feelings everywhere, like ripples in a pond.\n\nDid you know? Even small acts of kindness, like sharing a smile, can make a big difference in someone's day and make the world a happier place!\n\n<h3>A Message of Hope and Peace</h3>\nOur leaders in Ghana are working hard to help our people who are still in those far-away places. They are trying their best to bring them home safely and make sure everyone is okay. They are thinking of our people.\n\nWe must always remember to love each other and work for peace. Let's all hope for a world where no one has to fight, and everyone can live safely and happily, no matter where they are from.\n\nThank you for listening, my dear friends. Let's keep our hearts full of hope and kindness. See you next time with more news from our amazing continent, Africa!",
    "summary": "Ghana has sadly lost 55 of its people in a far-away war between Russia and Ukraine, making it the African country with the most reported losses.",
    "whyMatters": "This news is important because it shows us that sad things like war can affect people from our own African family, even when it's happening very far away, reminding us that we should always hope for peace and be kind to everyone.",
    "category": "world",
    "date": "2026-02-27T13:56:59.600Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20for%20Our%20Ghanaian%20Family%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-for-our-ghanaian-family-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "content": "He used the girls' mother's life-threatening illness as an opportunity to demand sex, said the US Office of Public Affairs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:57:04.747Z",
    "image": "https://image.pollinations.ai/prompt/Former%20US%20diplomat%20sentenced%20to%20life%20for%20abusing%20two%20girls%20in%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "former-us-diplomat-sentenced-to-life-for-abusing-two-girls-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "A Man, a Palace, and What Happened Next in Morocco!",
    "content": "<h3>Hello, Amazing Kids! Welcome to Your African News!</h3>\n\nHello, hello, everyone! It’s your friendly African news reporter here, ready to share an interesting story with you. We're going to travel all the way to a beautiful country in Africa called Morocco! Have you ever heard of Morocco? It’s a land of sunshine, incredible history, and very friendly people. It's a place many people dream of visiting, just like a character in our story.\n\nToday, we have a tale about a man who wanted to buy a very, very special house in Morocco. It wasn't just any house; it was like a dream palace! But sometimes, dreams don't come true, especially when people do wrong things. Let's find out what happened!\n\n<h3>Who Was This Man?</h3>\n\nOur story is about a man named Mr. Epstein. Now, Mr. Epstein was a very rich man. This means he had a lot of money, more than most people you know. With lots of money, people can buy many big and exciting things, like fancy cars, toys, or even big houses.\n\nBut having a lot of money doesn't mean you can do anything you want. Mr. Epstein did some very, very wrong things. He broke important rules that keep everyone safe and happy. Because he did these bad things, he was in big trouble. We call people who break rules and do bad things 'disgraced'. It means people are not happy with them because of what they did.\n\nDid you know? Every country in the world has rules, sometimes called laws. These rules help everyone live together nicely and keep our communities safe. It's like the rules you have at school or at home – they are there to help us!\n\n<h3>A Dream Palace Named Bin Ennakhi</h3>\n\nMr. Epstein loved the idea of having a grand place in Morocco. He found a very special house that he wanted to buy. This house had a beautiful name: Bin Ennakhi. Can you imagine a house with a special name like that? It sounds magical, doesn't it?\n\nBin Ennakhi was not a regular house like yours or mine. It was more like a palace! A palace is a super-duper big and fancy house, often where kings, queens, or very important people live. They usually have many rooms, huge gardens, and incredible decorations. Think of a castle, but maybe even more beautiful and grand on the inside!\n\nMr. Epstein was 'in talks' to buy this amazing palace. Being 'in talks' means he was talking to the people who owned the palace. They were discussing the price and all the important things you talk about when you want to buy something big, like a house. He was very close to making this dream come true.\n\n<h3>Morocco: A Land of Wonders in Africa</h3>\n\nLet's take a quick trip back to beautiful Morocco! Morocco is a country in North Africa, just across the water from Europe. It's famous for its warm weather, stunning beaches, and tall Atlas Mountains. People who live there are known for their hospitality, which means they are very welcoming and kind to visitors.\n\nMorocco is also known for its vibrant markets, called souks, where you can find colorful carpets, delicious spices, and unique crafts. Imagine walking through a market filled with bright colors and amazing smells! It's truly a land of wonders, and it's easy to see why someone would want to have a beautiful home there.\n\nDid you know? The capital city of Morocco is Rabat, but Marrakech and Fes are also very famous for their history and beautiful buildings, including palaces!\n\n<h3>What Happened Before the Purchase Was Finished?</h3>\n\nSo, Mr. Epstein was almost ready to sign the papers and buy his dream palace, Bin Ennakhi. He was just days away from making it his very own. But then, something very important happened that changed everything.\n\nBefore he could finish buying the palace, the police came. The police are the people who help keep us safe and make sure everyone follows the rules. They came and took Mr. Epstein away because he had done those very bad things we talked about earlier. This happened in the year 2019.\n\nBecause the police arrested him, Mr. Epstein could not finish buying the palace. The 'purchase was never completed'. This means he didn't get the keys, he didn't own Bin Ennakhi, and his dream of living in a palace in Morocco didn't come true. His talks with the palace owners stopped right there.\n\n<h3>Why Following Rules is So Important!</h3>\n\nThis story might seem like it's just about a big house, but it teaches us a very important lesson. It reminds us that no matter how much money someone has, or how big their dreams are, everyone must follow the rules.\n\nWhen people do bad things and break the rules, there are 'consequences'. Consequences mean what happens after you do something. For Mr. Epstein, one of the consequences of his bad actions was that he couldn't buy his dream palace. He also faced very serious trouble with the law.\n\nIt's always, always better to be kind, honest, and follow the rules. Being a good person is much more important than having lots of money or the biggest house. Our actions have a big impact, and choosing to do good helps make our world, and our amazing continent of Africa, a better place for everyone.\n\nDid you know? Being honest and kind makes you a true leader, because people trust and respect you! That's a super power everyone can have.\n\n<h3>Our African News Message for You!</h3>\n\nSo, remember this story, amazing kids. A rich man wanted a palace in beautiful Morocco, but his dream never came true because he chose to do wrong things. Always choose to do good, follow the rules, and treat others with kindness. That's the best way to make all your good dreams come true!\n\nThank you for listening to our African news today! Keep smiling, keep learning, and keep being awesome! Bye for now!",
    "summary": "A rich man named Mr. Epstein tried to buy a beautiful palace in Morocco called Bin Ennakhi, but he couldn't finish the purchase because the police arrested him for doing very bad things.",
    "whyMatters": "This story matters because it teaches us that it's important to follow rules and be a good person, no matter how much money you have, because doing bad things has big consequences.",
    "category": "world",
    "date": "2026-02-27T13:57:25.629Z",
    "image": "https://image.pollinations.ai/prompt/A%20Man%2C%20a%20Palace%2C%20and%20What%20Happened%20Next%20in%20Morocco!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-man-a-palace-and-what-happened-next-in-morocco",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Has India’s influence in Afghanistan grown under the Taliban?",
    "title": "Has India’s influence in Afghanistan grown under the Taliban?",
    "content": "Pakistan has accused Afghanistan of becoming 'a colony of India' but India's relations with Kabul predate the Taliban.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:57:30.869Z",
    "image": "https://image.pollinations.ai/prompt/Has%20India%E2%80%99s%20influence%20in%20Afghanistan%20grown%20under%20the%20Taliban%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "has-indias-influence-in-afghanistan-grown-under-the-taliban",
    "originalLink": "https://www.aljazeera.com/news/2026/2/27/has-indias-influence-in-afghanistan-grown-under-the-taliban?traffic_source=rss"
  },
  {
    "originalTitle": "Air attacks on Kabul push Pakistan-Taliban crisis into uncharted territory",
    "title": "Air attacks on Kabul push Pakistan-Taliban crisis into uncharted territory",
    "content": "Analysts warn escalation may embolden armed groups and destabilise both Afghanistan and Pakistan. What happens next?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:57:36.010Z",
    "image": "https://image.pollinations.ai/prompt/Air%20attacks%20on%20Kabul%20push%20Pakistan-Taliban%20crisis%20into%20uncharted%20territory%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "air-attacks-on-kabul-push-pakistan-taliban-crisis-into-uncharted-territory",
    "originalLink": "https://www.aljazeera.com/news/2026/2/27/air-attacks-on-kabul-push-pakistan-taliban-crisis-into-uncharted-territory?traffic_source=rss"
  },
  {
    "originalTitle": "Deadly journeys: Refugees, migrants risk everything to reach Europe",
    "title": "Brave Hearts Seek New Homes: A Story of Hope and Safety",
    "content": "Hello, my amazing friends! It's your friendly African reporter here! Today, we're going to talk about something important. It's about people who go on very, very long trips. They are looking for a new, safe home. It's a bit of a sad story sometimes, but it's also about hope and bravery.\n\n<h3>Why Do People Go On Long Trips?</h3>\n\nImagine if your home wasn't safe anymore. Maybe there wasn't enough food for your family, or maybe there were bad fights happening near your village. Sometimes, people have to leave their homes to find a better place.\n\nThey want a place where they can be safe. They want a place where there is enough food to eat. They dream of a place where kids can go to school and learn. They hope for a happy future, far away from trouble.\n\nThese people are sometimes called 'migrants' or 'refugees'. They are just like us, but they have to leave everything behind to find peace.\n\nDid you know? A 'refugee' is someone who has to leave their home because it's not safe, often because of war or danger.\n\n<h3>Hoping for Europe</h3>\n\nMany people from different countries, including some in Africa, want to go to a far-away place called Europe. Europe has many different countries, like France, Italy, and Germany.\n\nThey hope that in Europe, they will find peace and safety. They hope for good schools for their children. They hope for jobs for their parents, so they can buy food and clothes.\n\nIt's a big dream, a dream for a better life where they don't have to worry about danger every day. They believe Europe can offer them this new start.\n\nDid you know? Europe is a continent, just like Africa! It's across a big sea called the Mediterranean Sea.\n\n<h3>The Dangerous Journey</h3>\n\nBut the trip to Europe is very, very dangerous. It's not like getting on a comfortable bus or a safe train. Many people try to cross a huge sea. This sea is called the Mediterranean Sea.\n\nThey often get on small boats. These boats are usually old and not very strong. Sometimes, too many people get on one boat, which makes it very unsafe. If the boat has too many people, it can even sink.\n\nThe waves on the sea can be very big and scary. It's a long way to go, and the weather can change very fast. It is a super risky journey.\n\nDid you know? The Mediterranean Sea is so big, it connects many countries across Africa, Europe, and Asia!\n\n<h3>Trouble in Libya</h3>\n\nOn their way to the sea, many people have to travel through a country called Libya. Libya is a country in North Africa. Sadly, in Libya, there are some bad people.\n\nThese bad people are sometimes called 'militia'. They are like big bullies who hurt people. They might take people's money. They might take their precious things. They might even stop them from moving forward on their journey.\n\nThis makes the trip even more scary and unsafe for these brave people. It's a very sad part of their difficult journey. They face danger even before they reach the sea.\n\nImagine a bully who takes your lunch money – but much, much worse. These militia are like very big, mean bullies who hurt grown-ups and stop them from going where they need to go to be safe.\n\nDid you know? Libya is a country in North Africa, and it's famous for its beautiful deserts!\n\n<h3>Risks on the Sea</h3>\n\nEven if they get past the bad people in Libya, the sea journey is still super risky. The small boats are not built for such a long trip across a big sea. The sea can be very rough, with huge waves.\n\nMany people get sick on the boat. Sometimes, there isn't enough water to drink or enough food to eat for everyone. It's a very hard and tiring trip that can last for many days.\n\nPeople risk everything they have, even their own lives, just to try and reach safety. They are so brave because they want a better future for their families.\n\nDid you know? It can take many days to cross the sea in a small boat, depending on how far they need to go and how fast the boat can move!\n\n<h3>Who Helps These Brave People?</h3>\n\nBut there are also good people in the world who try to help. Big ships from different countries and special rescue boats look for these small, unsafe boats out in the sea.\n\nThey try to save people who are in trouble. They give them water, food, and clothes. They bring them to safe places where they can finally rest. These helpers are very brave and kind.\n\nMany groups, like the Red Cross, also help these people when they arrive. They give them comfort and look after them. It's good to know there are heroes helping during such hard times.\n\nDid you know? Many kind groups and people work together to help those on difficult journeys, wanting everyone to be safe.\n\n<h3>What Can We Do?</h3>\n\nIt's important to remember these people. They are looking for a safe place to live, just like you have a safe home with your family. We can be kind in our hearts and minds.\n\nWe can wish for them to be safe. We can hope that one day, everyone in the world can live in peace and have a safe home. We can learn about different countries and people, and always choose kindness.\n\nSo, my amazing friends, remember that every person deserves a safe place to live and a happy life. Let's send our love and wishes for safety to all the brave hearts on these long journeys. Until next time, stay kind and curious!",
    "summary": "Many people from Africa take dangerous trips across the sea to Europe, hoping to find a safe home and a better life, but they face many risks, including bad people in Libya and dangerous boat journeys.",
    "whyMatters": "This is important because everyone deserves to be safe and have a home, and we should understand why some people have to take big risks to find peace and help them if we can.",
    "category": "world",
    "date": "2026-02-27T13:57:57.622Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Hearts%20Seek%20New%20Homes%3A%20A%20Story%20of%20Hope%20and%20Safety%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-hearts-seek-new-homes-a-story-of-hope-and-safety",
    "originalLink": "https://www.aljazeera.com/news/2026/2/27/deadly-journeys-refugees-migrants-risk-everything-to-reach-europe?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "title": "Pakistan defence minister says country in 'open war' with Afghanistan after strikes",
    "content": "The latest attacks by Pakistan follow months of clashes between the two countries. despite agreeing to a fragile ceasefire in October.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:58:03.113Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20defence%20minister%20says%20country%20in%20'open%20war'%20with%20Afghanistan%20after%20strikes%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-defence-minister-says-country-in-open-war-with-afghanistan-after-strikes",
    "originalLink": "https://www.bbc.com/news/articles/cvgjd7pv4y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "title": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "content": "Bombings by Pakistan are the most significant development in tensions between the two neighbours - though the physical impact remains unclear.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:58:08.257Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20know%20after%20latest%20escalation%20in%20Pakistan-Afghanistan%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-know-after-latest-escalation-in-pakistan-afghanistan-tensions",
    "originalLink": "https://www.bbc.com/news/articles/cj32zx48xvxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Trump means the Cuban Revolution faces its biggest threat yet",
    "title": "Why Trump means the Cuban Revolution faces its biggest threat yet",
    "content": "Will a worsening internal crisis create the conditions for the Cuban Revolution to unravel from within?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:58:13.400Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Trump%20means%20the%20Cuban%20Revolution%20faces%20its%20biggest%20threat%20yet%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-trump-means-the-cuban-revolution-faces-its-biggest-threat-yet",
    "originalLink": "https://www.bbc.com/news/articles/c9q5wdeg4j8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chelsea to face holders PSG in Champions League last 16",
    "title": "Chelsea to face holders PSG in Champions League last 16",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League last 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-27T13:58:19.212Z",
    "image": "https://image.pollinations.ai/prompt/Chelsea%20to%20face%20holders%20PSG%20in%20Champions%20League%20last%2016%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chelsea-to-face-holders-psg-in-champions-league-last-16",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-27T13:58:24.362Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20needs%20to%20stay%20'fully%20focused'%20after%20Arsenal%20talk%20-%20Howe%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Don't know what fuss was about' - chaotic Palace season could end in glory",
    "title": "'Don't know what fuss was about' - chaotic Palace season could end in glory",
    "content": "Key players have gone, the manager is leaving and has criticised the club and upset fans - yet Crystal Palace's chaotic campaign could still end in European glory.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-27T13:58:29.497Z",
    "image": "https://image.pollinations.ai/prompt/'Don't%20know%20what%20fuss%20was%20about'%20-%20chaotic%20Palace%20season%20could%20end%20in%20glory%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "dont-know-what-fuss-was-about-chaotic-palace-season-could-end-in-glory",
    "originalLink": "https://www.bbc.com/sport/football/articles/c14mp80157vo?at_medium=RSS&at_campaign=rss"
  }
]