[
  {
    "originalTitle": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "title": "How off-the-shelf drones are changing jihadist warfare in West Africa",
    "content": "Insurgents have carried out a wave of drone strikes on military positions in the region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T12:58:35.976Z",
    "image": "https://image.pollinations.ai/prompt/How%20off-the-shelf%20drones%20are%20changing%20jihadist%20warfare%20in%20West%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-off-the-shelf-drones-are-changing-jihadist-warfare-in-west-africa",
    "originalLink": "https://www.bbc.com/news/articles/cew8vldpzdyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Senegal arrests 14 members of alleged paedophile gang linked to France",
    "title": "Senegal arrests 14 members of alleged paedophile gang linked to France",
    "content": "Police say the \"transnational\" criminal group has been in operation since 2017.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T12:58:41.106Z",
    "image": "https://image.pollinations.ai/prompt/Senegal%20arrests%2014%20members%20of%20alleged%20paedophile%20gang%20linked%20to%20France%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "senegal-arrests-14-members-of-alleged-paedophile-gang-linked-to-france",
    "originalLink": "https://www.bbc.com/news/articles/cy4wy2xy300o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Colossus' of Ghanaian highlife music Ebo Taylor dies at 90",
    "title": "'Colossus' of Ghanaian highlife music Ebo Taylor dies at 90",
    "content": "The guitarist, composer and band leader fused Ghanaian music and funk to create tracks sampled around the world.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T12:58:46.232Z",
    "image": "https://image.pollinations.ai/prompt/'Colossus'%20of%20Ghanaian%20highlife%20music%20Ebo%20Taylor%20dies%20at%2090%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "colossus-of-ghanaian-highlife-music-ebo-taylor-dies-at-90",
    "originalLink": "https://www.bbc.com/news/articles/c1e9p04n8y9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UK PM Starmer’s communications chief quits amid Epstein scandal fallout",
    "title": "UK PM Starmer’s communications chief quits amid Epstein scandal fallout",
    "content": "PM faces criticism for backing Peter Mandelson as ambassador to US despite his known links to Jeffrey Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T12:58:51.574Z",
    "image": "https://image.pollinations.ai/prompt/UK%20PM%20Starmer%E2%80%99s%20communications%20chief%20quits%20amid%20Epstein%20scandal%20fallout%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-pm-starmers-communications-chief-quits-amid-epstein-scandal-fallout",
    "originalLink": "https://www.aljazeera.com/news/2026/2/9/uk-pm-starmers-communications-chief-quits-amid-epstein-scandal-fallout?traffic_source=rss"
  },
  {
    "originalTitle": "‘Tell the truth’: Epstein survivors demand justice in Super Bowl ad",
    "title": "‘Tell the truth’: Epstein survivors demand justice in Super Bowl ad",
    "content": "The advertisement urges US Attorney General Pam Bondi to disclose all remaining files related to the late sex offender.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-09T12:58:56.692Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Tell%20the%20truth%E2%80%99%3A%20Epstein%20survivors%20demand%20justice%20in%20Super%20Bowl%20ad%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tell-the-truth-epstein-survivors-demand-justice-in-super-bowl-ad",
    "originalLink": "https://www.aljazeera.com/news/2026/2/9/tell-the-truth-epstein-survivors-demand-justice-in-super-bowl-ad?traffic_source=rss"
  },
  {
    "originalTitle": "AI video of Indian minister shooting at image of Muslims sparks outrage",
    "title": "AI video of Indian minister shooting at image of Muslims sparks outrage",
    "content": "A video by India’s ruling BJP depicting Assam's chief minister firing a shot at an image of Muslims has sparked outrage.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-09T12:59:01.807Z",
    "image": "https://image.pollinations.ai/prompt/AI%20video%20of%20Indian%20minister%20shooting%20at%20image%20of%20Muslims%20sparks%20outrage%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ai-video-of-indian-minister-shooting-at-image-of-muslims-sparks-outrage",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/9/ai-video-of-indian-minister-shooting-at-image-of-muslims-sparks-outrage?traffic_source=rss"
  },
  {
    "originalTitle": "Hong Kong court jails media tycoon and British citizen Jimmy Lai for 20 years",
    "title": "Meet Jimmy Lai: A Story About Rules and Time in a Faraway City!",
    "content": "<h3>Hello, Super Reporters from Africa!</h3>\n\nHi everyone! It's your friendly news reporter here, bringing you a very important story from a place far, far away from our beautiful continent of Africa. Imagine a super busy city with lots of tall buildings and bright lights, a place called Hong Kong. Today, we're going to talk about a grown-up man named Jimmy Lai and a big decision that was made about him.\n\nIt’s a story about rules, and about what happens when people have different ideas about fairness. Even though Hong Kong is very far away, learning about stories like this helps us understand the world around us. So, let’s dive in!\n\n<h3>Who is Jimmy Lai?</h3>\n\nJimmy Lai is a very important man in Hong Kong. Imagine someone who owns not just one, but many, many newspapers and magazines! That's what Jimmy Lai did. He was like a big boss for places that help share stories, news, and ideas with lots and lots of people. He wanted to make sure people could read and know what was happening in their city and the world.\n\nHe really liked to tell stories and share his thoughts, and he helped other people share their thoughts too. This is a very powerful thing, because sharing ideas helps everyone learn and grow. It's like when you share your ideas in class or with your friends – it helps everyone understand things better and come up with new games!\n\nDid you know? In the old days, before computers and phones, newspapers were one of the main ways people found out the news every single day! People would wait to buy the morning paper to know what was happening. Even today, many people still love to read newspapers!\n\n<h3>What Happened to Jimmy Lai?</h3>\n\nNow for the big news from Hong Kong. A special court there made a very serious decision about Jimmy Lai. They said that he must go to a place called jail for a very, very long time. How long? For 20 years. Can you imagine 20 years?\n\nTwenty years is a super long time! Think about how old you are now. If you are 7 years old, 20 years from now, you will be 27! You would be a grown-up, maybe even have your own job or family, and you would have learned so many new things. That’s how long 20 years is – it’s a whole lot of birthdays, a whole lot of growing up, and a whole lot of changing seasons.\n\nJail is a place where people go if a court decides they have broken very important rules or laws. It’s a very serious place, and people cannot leave until their time is finished. It's a way for cities to make sure big rules are followed.\n\n<h3>Why Did This Happen?</h3>\n\nThis is where the story gets a little bit tricky, but we can understand it! The people who make the rules in Hong Kong said that Jimmy Lai broke some very important laws. They said that what he did was against their rules, and because of this, he needed to go to jail. They call this \"the rule of law,\" which means everyone must follow the rules, no matter who they are, and the rules are there to keep everyone safe and fair.\n\nBut here's the other side: many of Jimmy Lai's friends and people who support him feel very, very sad and worried. They think that 20 years in jail is too long, and that it's not fair. They believe he was just trying to share ideas and speak up, which they think is a good thing to do. They feel like this long time in jail is almost like losing all the rest of his life, because it's such a long, long time to be away from home and family. So, you see, different people have different ideas about what is fair and what the rules really mean.\n\nDid you know? Rules are very important! Just like we have rules at school – like 'no running in the corridors' or 'share your toys' – cities and countries have even bigger rules called laws. These laws help keep everyone safe and make sure things run smoothly. Sometimes, people disagree about how these laws should be used.\n\n<h3>Where is Hong Kong?</h3>\n\nLet’s zoom out on our imaginary map! Hong Kong is a very special city located on the other side of the world, in Asia. It’s a part of a much bigger country called China. It's known for its amazing skyline, with super tall buildings that touch the clouds, and its bustling markets full of delicious food and interesting things to buy. It’s a very vibrant and energetic place, very different from many places we know in Africa, but just as exciting in its own way!\n\nImagine a city where you can see ships sailing in a big harbor, and mountains covered in green all around. It's a place with its own special history and culture, and it has its own ways of doing things, even though it's part of China. So, this big news about Jimmy Lai happened in this exciting, busy city, very far from our homes.\n\nDid you know? Hong Kong is famous for its delicious dim sum! It's a type of small, yummy food like dumplings and buns, often eaten for breakfast or lunch. Many people gather with their families to enjoy dim sum together!\n\n<h3>Why Do We Talk About This Story?</h3>\n\nThis story is important for us to learn about because it shows us that in different parts of the world, people can have very different ideas about rules and freedom. It teaches us that sharing ideas and speaking up is very important, but sometimes, it can also lead to very big challenges and disagreements. It reminds us that fairness is something people think about all over the world, and what one group thinks is fair, another group might not.\n\nIt’s a complex story, meaning it has many parts, but the main thing to remember is that rules are important, but so is being able to share your thoughts and ideas. And sometimes, these two things can create big discussions and even big problems for grown-ups. It helps us understand that the world is a big place with many different ways of seeing things.\n\n<h3>Let's Think About Rules!</h3>\n\nEven though this story is far away and about grown-ups, it reminds us about rules. Rules help us live together, play together, and learn together. They are there to keep us safe and make sure everyone gets a fair chance. It’s always good to think about why we have rules and how we can all be fair to each other every single day, whether we are playing a game or learning in school.\n\nThat’s all for today’s news, super reporters! Keep being curious and keep learning about our amazing world. See you next time!",
    "summary": "Jimmy Lai, a man who owned many newspapers in a faraway city called Hong Kong, has been sent to jail for 20 years because a court said he broke important rules, but his supporters believe this punishment is too long and unfair.",
    "whyMatters": "This story matters because it shows how important rules are in every place, and how people can have very different ideas about what is fair and what happens when someone shares their ideas.",
    "category": "world",
    "date": "2026-02-09T12:59:30.226Z",
    "image": "https://image.pollinations.ai/prompt/Meet%20Jimmy%20Lai%3A%20A%20Story%20About%20Rules%20and%20Time%20in%20a%20Faraway%20City!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "meet-jimmy-lai-a-story-about-rules-and-time-in-a-faraway-city",
    "originalLink": "https://www.bbc.com/news/articles/c8d5pl34vv0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Japanese stocks surge as Takaichi secures historic election victory",
    "title": "Japanese stocks surge as Takaichi secures historic election victory",
    "content": "Prime Minister Sanae Takaichi's Liberal Democratic Party  secured 316 out of 465 seats in Sunday's election.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-09T12:59:35.351Z",
    "image": "https://image.pollinations.ai/prompt/Japanese%20stocks%20surge%20as%20Takaichi%20secures%20historic%20election%20victory%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "japanese-stocks-surge-as-takaichi-secures-historic-election-victory",
    "originalLink": "https://www.bbc.com/news/articles/cjd9k852zdjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Seahawks dominate Patriots to win Super Bowl",
    "title": "Seahawks dominate Patriots to win Super Bowl",
    "content": "The Seattle Seahawks produce a devastating defensive display to beat the New England Patriots and claim their second Super Bowl victory.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-09T12:59:40.468Z",
    "image": "https://image.pollinations.ai/prompt/Seahawks%20dominate%20Patriots%20to%20win%20Super%20Bowl%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "seahawks-dominate-patriots-to-win-super-bowl",
    "originalLink": "https://www.bbc.com/sport/american-football/articles/cjen2n5ql3zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "I'd resign if I wasn't still right for job - Howe",
    "title": "I'd resign if I wasn't still right for job - Howe",
    "content": "Eddie Howe says there is \"no doubt in my mind\" he is still the right manager for Newcastle despite one win in eight games.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-09T12:59:46.043Z",
    "image": "https://image.pollinations.ai/prompt/I'd%20resign%20if%20I%20wasn't%20still%20right%20for%20job%20-%20Howe%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "id-resign-if-i-wasnt-still-right-for-job-howe",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxl8rnnneo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "title": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "content": "Manchester City's win at Liverpool ended in complete chaos - but did the referee and the VAR get Dominik Szoboszlai's red card right?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "entertainment",
    "date": "2026-02-09T12:59:51.173Z",
    "image": "https://image.pollinations.ai/prompt/'Killjoy'%20-%20did%20VAR%20get%20late%20drama%20in%20Liverpool%20v%20Man%20City%20right%3F%20realistic%20news%20photography%20context%20Entertainment%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killjoy-did-var-get-late-drama-in-liverpool-v-man-city-right",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yjkgyxk2mo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham in relegation battle, says Rooney",
    "title": "Tottenham in relegation battle, says Rooney",
    "content": "Tottenham Hotspur are in a relegation battle, says former England captain Wayne Rooney.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-09T12:59:56.286Z",
    "image": "https://image.pollinations.ai/prompt/Tottenham%20in%20relegation%20battle%2C%20says%20Rooney%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tottenham-in-relegation-battle-says-rooney",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn5gr167x3yo?at_medium=RSS&at_campaign=rss"
  }
]