[
  {
    "originalTitle": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria, witnesses say",
    "title": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria, witnesses say",
    "content": "The workers are believed to have collapsed after the gas built up in poorly ventilated tunnels.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T23:25:08.654Z",
    "image": "https://image.pollinations.ai/prompt/Suspected%20carbon-monoxide%20leak%20kills%20at%20least%2030%20miners%20in%20Nigeria%2C%20witnesses%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suspected-carbon-monoxide-leak-kills-at-least-30-miners-in-nigeria-witnesses-say",
    "originalLink": "https://www.bbc.com/news/articles/cwyk6nr80kxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Social media suspended in Gabon for 'spreading of false information'",
    "title": "Gabon Takes a Break from Some Online Fun!",
    "content": "Jambo, amazing kids of Africa! It's your friendly news reporter here, ready to share a cool story from one of our beautiful neighbour countries. Today, we're talking about Gabon! Have you ever heard of Gabon? It’s a wonderful country right here in Africa, with lots of green trees and cool animals.<br><br><h3>What is Social Media?</h3><br>First, let's talk about something called 'social media'. It sounds like a big word, but it's actually super simple! Imagine you have a special magic tool on your phone or computer. With this tool, you can talk to your friends and family, even if they live far away. You can share your drawings, show pictures of your pets, or watch funny videos. Some of these tools are called WhatsApp, Facebook, or TikTok. Lots of grown-ups use them to connect.<br><br>These places online help people chat and share things quickly. It’s like a big, busy playground where everyone can share their thoughts and see what others are doing. It's a fun way to stay in touch!<br><br>Did you know? The internet helps connect people all over the world, just like magic! You can talk to someone living thousands of kilometres away in just a second.<br><br><h3>What Happened in Gabon?</h3><br>So, what's the news from Gabon? Well, a little while ago, some of these special online talking places – the social media ones – took a break in Gabon. It’s like when your teacher asks everyone to put their books away for a little while, or when your favourite TV show has a small break. These social media apps were turned off for a bit.<br><br>It means people in Gabon couldn't use apps like Facebook or WhatsApp to chat and share stories for some time. They had to find other ways to talk to their friends and family, like sending regular text messages or making phone calls.<br><br><h3>Why Did They Take a Break?</h3><br>Now, why would they do this? This is an important part of the story. Sometimes, on these online talking places, people can share stories that are not true. We call these 'false information' or 'fake news'.<br><br>Imagine someone tells you that the sky is purple, even though you know it's blue. That's a story that isn't true. When many untrue stories are shared, it can make people confused, or even scared. It’s hard to know what is real and what isn’t.<br><br>The grown-ups in Gabon who look after the news and online things were worried about these untrue stories. They saw that too many stories that weren't real were being shared. This can cause problems for people and even make them sad or worried for no reason.<br><br>Did you know? It's always good to check if a story is true before you believe it or share it with others. Just like checking if your shoes are on the right feet before you run out to play!<br><br><h3>Who Made This Decision?</h3><br>So, who decided to turn off these social media apps for a while? It was decided by a special group of grown-ups called the 'media regulator'. You can think of them like special helpers who make sure all the news and stories we see on TV and online are fair and true.<br><br>Their job is to help keep things safe and honest for everyone. They want to make sure people are not confused by fake stories. They believe that if lots of untrue stories are spreading, it's better to pause things so everyone can calm down and figure things out.<br><br>They made a rule saying, “Let’s press the pause button on these apps until we can make sure only true and helpful stories are shared.”<br><br><h3>What Does 'Until Further Notice' Mean?</h3><br>The news said the ban would be in place 'until further notice'. That’s another big phrase, but it just means this: the social media apps will stay paused for now, and they will tell everyone when it's time to turn them back on. It’s like when your mom says, 'We'll go to the park later, until I tell you it's time.' You know it will happen, but you don’t know the exact minute.<br><br>So, the grown-ups in Gabon are waiting. They are watching to see if the problem of untrue stories gets better. Once they feel it’s safer for people to share and talk online, they will turn the social media apps back on.<br><br>Did you know? Gabon's capital city is Libreville! It means 'Free City' in French.<br><br><h3>Why is Truth Important?</h3><br>This story from Gabon teaches us something very important: telling the truth is super important! Whether we are talking to our friends at school, sharing a story with our family, or even using the internet, it’s always best to be truthful.<br><br>Untrue stories can cause problems and make people feel bad. True stories help us learn, grow, and trust each other. When we share true things, we help our community and our country stay strong and happy.<br><br>It’s also a good reminder to always think before we share anything online. Is it kind? Is it true? Is it helpful? If the answer is yes to all three, then it’s probably a good thing to share!<br><br>Did you know? There are over 50 different countries in Africa, each with its own special stories and ways of doing things!<br><br>So, for now, people in Gabon are using other ways to connect, waiting patiently for their online talking places to come back. And we, as smart kids, can remember to always seek the truth and be kind online. Keep shining bright, young Africans!",
    "summary": "Some social media websites in Gabon were turned off by grown-ups because too many untrue stories were being shared, and they will be off until things are safer.",
    "whyMatters": "It matters because it helps us remember to always tell the truth and be careful about what we share and believe online, so everyone stays safe and happy.",
    "category": "world",
    "date": "2026-02-18T23:25:31.950Z",
    "image": "https://image.pollinations.ai/prompt/Gabon%20Takes%20a%20Break%20from%20Some%20Online%20Fun!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gabon-takes-a-break-from-some-online-fun",
    "originalLink": "https://www.bbc.com/news/articles/cx2rg2vndk1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Turkey's president rejects Israel's recognition of Somaliland",
    "title": "Turkey's president rejects Israel's recognition of Somaliland",
    "content": "He made the comment on an official visit to Ethiopia, saying it could prove dangerous for a volatile region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-18T23:25:37.078Z",
    "image": "https://image.pollinations.ai/prompt/Turkey's%20president%20rejects%20Israel's%20recognition%20of%20Somaliland%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "turkeys-president-rejects-israels-recognition-of-somaliland",
    "originalLink": "https://www.bbc.com/news/articles/c0lj0plkg09o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Which teams are in the T20 World Cup Super Eight, and what’s the schedule?",
    "title": "Which teams are in the T20 World Cup Super Eight, and what’s the schedule?",
    "content": "Al Jazeera's guide to the next phase of the ICC Men's T20 World Cup 2026 in India and Sri Lanka.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T23:25:42.394Z",
    "image": "https://image.pollinations.ai/prompt/Which%20teams%20are%20in%20the%20T20%20World%20Cup%20Super%20Eight%2C%20and%20what%E2%80%99s%20the%20schedule%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "which-teams-are-in-the-t20-world-cup-super-eight-and-whats-the-schedule",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/18/which-teams-are-in-the-t20-world-cup-super-eight-and-whats-the-schedule?traffic_source=rss"
  },
  {
    "originalTitle": "Meta’s Zuckerberg pushes back on social media youth addiction claims",
    "title": "Meta’s Zuckerberg pushes back on social media youth addiction claims",
    "content": "In a Los Angeles court, the Meta CEO was questioned about whether Instagram’s design contributed to addictive behavior.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-18T23:25:47.521Z",
    "image": "https://image.pollinations.ai/prompt/Meta%E2%80%99s%20Zuckerberg%20pushes%20back%20on%20social%20media%20youth%20addiction%20claims%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "metas-zuckerberg-pushes-back-on-social-media-youth-addiction-claims",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/18/metas-zuckerberg-pushes-back-on-social-media-youth-addiction-claims?traffic_source=rss"
  },
  {
    "originalTitle": "California mulls a billionaire tax, revealing a deeply divided state",
    "title": "Big Money Talk in Sunny California!",
    "content": "Hello, amazing friends! It's your kid-friendly news reporter here, bringing you super interesting stories from all around our big, beautiful world! Today, we're zooming far, far away, across the ocean, to a sunny place called California. It's a state in a country called America. Imagine a place with beautiful beaches, big cities, and even famous movie stars!\n\n<h3>Hello from Sunny California!</h3>\nGuess what? Something really big is happening there, and it’s all about money! Not just a little bit of money, but *super-duper big* money. We're talking about very, very rich people called 'billionaires'. Can you say 'billionaires'? It's a fun word!\n\n<h3>What is a Billionaire, Anyway?</h3>\nNow, you might be thinking, \"What's a billionaire?\" Well, imagine you have a piggy bank. Inside your piggy bank, maybe you have some coins or a few notes. That's great! Now, imagine someone has so much money, so many coins and notes, that it fills not just one piggy bank, but a whole room! And then many, many rooms!\n\nA billionaire is someone who has one thousand million dollars! Can you imagine that? That's a '1' with nine '0's after it! It's a huge number. These people have lots of big houses, fancy cars, and can buy almost anything they want. They have more money than you can count on your fingers and toes, even if you count for a whole year!\n\n<b>Did you know?</b>\nOne billion is such a big number! If you counted one dollar every second, it would take you about 32 years to count to one billion dollars! That's a very long time!\n\n<h3>Why Do We Talk About Money? The Idea of Tax!</h3>\nOkay, so we know what billionaires are. Now let's talk about something called 'tax'. Tax is like a special piggy bank for everyone. When grown-ups earn money, they give a small part of it to the 'government'. The government is like a special team of people who help run the country.\n\nWhy do they do this? Because the government uses this tax money to help *everyone*! They use it to build roads so we can travel safely. They use it to build schools so kids like you can learn. They use it to pay for doctors and hospitals when people get sick. Tax money helps make sure our towns and villages have good things for everyone. It's like sharing!\n\n<b>Did you know?</b>\nIn many places, just like in our African communities, people come together to help each other. Tax is one way a whole country helps all its people, just like we might help a neighbour build a new roof!\n\n<h3>A New Idea for Billionaires in California</h3>\nSo, in sunny California, the people who run the state had a big idea. They looked at all the rich billionaires living there. And they thought, \"Hmm, maybe these super-rich people could help a little bit more!\"\n\nThe idea is to ask the billionaires to pay a *tiny bit extra* tax each year. It's not a lot for them, because they have so much money. But if many billionaires pay this tiny bit extra, it adds up to a lot of money!\n\n<h3>Why Do They Need More Money? To Help People!</h3>\nWhy does California want this extra money? It's for a very kind reason. In America, there's something called 'Medicaid'. It's a special program that helps people who don't have much money. If someone is poor and gets sick, Medicaid helps them go to the doctor or the hospital without having to pay a lot. It makes sure everyone can get help when they are not feeling well.\n\nBut guess what? The big government in America (not just California's government, but the one for the whole country) doesn't have as much money as before to give to Medicaid. So, some people who are sick might not get the help they need. This makes people sad.\n\nSo, California thought: \"If our billionaires pay a little extra tax, we can use that money to help fill the gap! We can make sure sick people still get to see doctors and nurses, even if they don't have a lot of money.\" Isn't that a kind idea? It's like everyone chipping in to make sure no one is left out when they are sick.\n\n<b>Did you know?</b>\nMany countries around the world have ways to help people get medicine and see doctors, even if they don't have a lot of money. It's called healthcare, and it's very important for everyone to stay healthy and strong!\n\n<h3>Oh-Oh! A Big Problem!</h3>\nNow, here's where the story gets a little tricky. When the people in California suggested this extra tax for billionaires, some of the billionaires were not happy. They said, \"No, thank you! We don't want to pay extra tax.\"\n\nAnd guess what they said next? They threatened to *leave California*! Imagine if your best friend said they would move to another town if they had to share their sweets! These billionaires said they would move their big houses and their businesses to a different state in America, or even a different country, so they wouldn't have to pay the extra tax.\n\n<h3>People Are Talking, Talking, Talking!</h3>\nThis made a lot of people in California start talking, talking, talking! Some people think it's a very good idea for the billionaires to pay a little extra. They say, \"Billionaires have so much money, they should help people who are sick and need doctors!\" They think it's fair.\n\nBut other people are worried. They say, \"If the billionaires leave, they will take their money and their businesses with them! Then there might be fewer jobs for people in California, and that would not be good for anyone!\" They think it might cause more problems.\n\nSo, you see, people in California are trying to decide what is the best thing to do. It's like when you and your friends have to decide if you want to play football or go skipping – everyone has different ideas, and you have to talk to find a way forward! This is what the news means when it says California is 'deeply divided'. It means people have very strong different ideas.\n\n<b>Did you know?</b>\nCalifornia is a really big state! It has more people living there than many whole countries! And it's famous for many things, like making amazing movies in Hollywood!\n\n<h3>Why Does This Story Matter to Us?</h3>\nEven though California is far away, this story is important. It helps us think about how we can all help each other, no matter where we live. When some people have a lot, and others don't have enough, it's good to find ways to share and help everyone.\n\nIt reminds us that being kind and helping those who are not well is a very important part of being a community, whether it's in a small village in Africa or a big, sunny state in America.\n\n<h3>A Big Decision for California</h3>\nSo, the people in California are still thinking and talking. They have a big decision to make. Should they ask the super-rich to pay more to help the sick? Or will that make the rich people leave? It's a tricky puzzle!\n\nWe will keep watching this story, my friends, and bring you more news when we know what happens next! For now, remember to share, be kind, and help each other, just like we do in our wonderful communities here in Africa! Bye for now!",
    "summary": "In sunny California, leaders want very rich people called billionaires to pay a little extra tax to help sick people, but some billionaires might move away.",
    "whyMatters": "This story helps us think about how rich people can help others and how countries decide what is fair for everyone in a community.",
    "category": "government",
    "date": "2026-02-18T23:26:14.400Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Money%20Talk%20in%20Sunny%20California!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-money-talk-in-sunny-california",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/18/california-mulls-a-billionaire-tax-revealing-a-deeply-divided-state?traffic_source=rss"
  },
  {
    "originalTitle": "Eight skiers found dead after California avalanche",
    "title": "Eight skiers found dead after California avalanche",
    "content": "Fifteen skiers went missing on Tuesday following a massive avalanche in California's Lake Tahoe region. One person remains missing but is presumed dead.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T23:26:20.008Z",
    "image": "https://image.pollinations.ai/prompt/Eight%20skiers%20found%20dead%20after%20California%20avalanche%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eight-skiers-found-dead-after-california-avalanche",
    "originalLink": "https://www.bbc.com/news/articles/cvg19dp4vxgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal",
    "title": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal",
    "content": "The president's comments come just a day after the US gave its official backing to the UK's Chagos deal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-18T23:26:25.141Z",
    "image": "https://image.pollinations.ai/prompt/Do%20not%20give%20away%20Diego%20Garcia%2C%20Trump%20tells%20UK%20in%20fresh%20attack%20on%20Chagos%20deal%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "do-not-give-away-diego-garcia-trump-tells-uk-in-fresh-attack-on-chagos-deal",
    "originalLink": "https://www.bbc.com/news/articles/c309qqyer8yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Martial law, protests and a president tried for insurrection: How did South Korea get here?",
    "title": "Martial law, protests and a president tried for insurrection: How did South Korea get here?",
    "content": "A court is due to deliver its verdict in the insurrection trial of Yoon Suk Yeol.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-18T23:26:30.262Z",
    "image": "https://image.pollinations.ai/prompt/Martial%20law%2C%20protests%20and%20a%20president%20tried%20for%20insurrection%3A%20How%20did%20South%20Korea%20get%20here%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "martial-law-protests-and-a-president-tried-for-insurrection-how-did-south-korea-get-here",
    "originalLink": "https://www.bbc.com/news/videos/c70kw0nrxreo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UEFA Champions League",
    "title": "UEFA Champions League",
    "content": "Newcastle head to Azerbaijan to take on Qarabag in the Champions League play-offs.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-18T23:26:35.647Z",
    "image": "https://image.pollinations.ai/prompt/UEFA%20Champions%20League%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uefa-champions-league",
    "originalLink": "https://www.bbc.co.uk/iplayer/live/bbcone?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "title": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "content": "A Ricardo Calafiori own goal in the 94th minute gives Wolves a point. as the Premier League's bottom side come back from two goals down against leaders Arsenal at Molineux.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-18T23:26:40.779Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20squander%20two-goal%20lead%20as%20Wolves%20score%20late%20to%20earn%20draw%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-squander-two-goal-lead-as-wolves-score-late-to-earn-draw",
    "originalLink": "https://www.bbc.com/sport/football/videos/cn4gjldn03yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon channels Shearer after breaking his record ",
    "title": "Gordon channels Shearer after breaking his record ",
    "content": "Newcastle's Anthony Gordon only had one thought in his mind as his side faced Qarabag in the Champions League...",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-18T23:26:45.899Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20channels%20Shearer%20after%20breaking%20his%20record%20%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-channels-shearer-after-breaking-his-record",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20z9xqdz2lo?at_medium=RSS&at_campaign=rss"
  }
]