[
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "A Sad Story from Sudan: Wishing for Peace for Our Friends!",
    "content": "<h3>Hello, Wonderful Children of Africa!</h3>\n\nHello, my amazing little news explorers! Your friendly reporter is here, and today we have something important to talk about. Sometimes, in our big, beautiful world, sad things happen. But even when things are sad, we can always hope for kindness and peace.\n\nToday, we're talking about a country called Sudan. Can you say Sudan? It’s a very big country right here in Africa, our wonderful continent! It’s full of beautiful places and many lovely people, just like your own country. Sudan has a very famous river running through it, called the Nile River. It’s a place with rich history and amazing cultures.\n\n<h3>A City Called El-Fasher</h3>\n\nIn Sudan, there is a city named el-Fasher. Imagine your own town or village, full of houses, schools, shops, and places where children play. El-Fasher is just like that – it’s a busy city where many, many families live. Children there used to go to school, play with their friends, and help their parents, just like you do every day.\n\n<h3>What Happened in El-Fasher?</h3>\n\nRecently, something very, very sad happened in el-Fasher. There was a lot of fighting. You know how sometimes children might argue or not get along? Well, imagine grown-ups doing that, but with weapons, like guns. When grown-ups fight with weapons, it is very dangerous and makes everyone unsafe.\n\nThis fighting made many, many people in el-Fasher incredibly scared. So many people had to leave their homes in a hurry, leaving behind all their toys, clothes, and everything they loved. Imagine having to leave your house with nothing! It's a very frightening thought. Many families lost their homes, and many people were hurt. Sadly, a really, really big number of people lost their lives because of the fighting. This means many families are very sad because their loved ones are gone.\n\n<h3>Who Was Doing the Fighting?</h3>\n\nThere are different groups of grown-ups in Sudan who have been fighting for a while. One of these groups is called the Rapid Support Forces, or RSF for short. They are like a type of soldier group. The fighting in el-Fasher involved them, and it caused so much sadness and trouble for the innocent people living there.\n\nWhen these groups fight, it’s not just them who get hurt. It’s the grandmothers, the grandfathers, the mothers, the fathers, and especially the children who suffer the most. Children should never have to live in fear.\n\n<h3>Did You Know? About the United Nations!</h3>\n\nHave you ever heard of the United Nations? We call it the UN for short. The UN is like a huge team of helpers from almost every country in the world! Their main job is to try and make sure everyone on Earth is safe, happy, and treated fairly. They also try to stop fighting and help countries talk to each other to solve problems peacefully.\n\nWhen the UN heard about the terrible things happening in el-Fasher, they were very sad, just like us. They looked into what happened and reported that many awful things took place, and many, many lives were lost. The UN wants to help stop the fighting and make sure that children and families in Sudan can be safe again.\n\n<h3>Why Do Grown-ups Fight?</h3>\n\nIt’s a very difficult question for everyone to understand, even for grown-ups. Sometimes, people have different ideas about how their country should be run, or they want different things. But using violence and fighting with weapons is never, ever a good way to solve problems. It only brings sadness, hurt, and makes life very difficult for everyone, especially for innocent children.\n\n<h3>How Does Fighting Hurt Children?</h3>\n\nThink about your normal day. You wake up, maybe you go to school, you play games, you eat food, and then you sleep safely in your bed. But when there is fighting, all these things can stop. Children might not be able to go to school, which means they can’t learn new things and can’t see their friends.\n\nThey might not be able to play outside because it’s too dangerous. They might not have enough food or clean water. And the worst part is, they often feel very, very scared and sad. They miss their normal life and just want to be safe again. No child should have to go through this.\n\n<h3>Did You Know? We All Want Peace!</h3>\n\nEvery single person, every child, every grown-up, and even animals, want to live in peace. Peace means being safe, being kind to each other, sharing, playing together, and helping one another. When there is peace, everyone can learn, grow strong, laugh loudly, and be happy without any worries. It means sunshine and smiles for everyone.\n\n<h3>Who Is Helping Our Friends in Sudan?</h3>\n\nEven though these sad things are happening, there are many good people working hard to help. The United Nations is helping. Other countries and kind people from all over the world are trying to help too. They are sending brave helpers, like doctors and nurses, to look after the people who are hurt. They are also trying to get food, clean water, and medicine to the families who need it most.\n\nThese helpers are also trying to talk to the groups who are fighting, asking them to stop and make peace. They want to find a way for everyone in Sudan to live together safely and without fighting. It takes a lot of courage and kindness to do this work.\n\n<h3>What Can We Do?</h3>\n\nEven you, as amazing children, can do something! You can be extra kind to your friends and family today. You can share your toys and snacks. You can listen to your teachers and parents. You can learn about other countries, like Sudan, and understand that we are all part of one big global family.\n\nMost importantly, you can hope for peace. Every time you are kind, every time you share, every time you help someone, you are helping to make our world a more peaceful place. You can even draw a picture of peace and share it with someone!\n\n<h3>A Big Wish for Our Friends in Sudan</h3>\n\nWe send all our love, warm thoughts, and wishes for peace to the children and families in el-Fasher and all across Sudan. We hope, with all our hearts, that the fighting stops very, very soon. We hope that everyone can go back to their homes, go to school, play safely with their friends, and live a happy life filled with peace and joy.\n\nRemember, even when there is sadness in the world, there is always hope. And there are always good people working hard to bring peace and happiness to everyone. Let’s keep hoping and wishing for a peaceful and happy Sudan!",
    "summary": "In the city of el-Fasher in Sudan, many people were hurt and lost their homes and lives because of fighting between grown-ups, and the United Nations is working with others to help and bring peace.",
    "whyMatters": "This is important because children and families in Sudan deserve to be safe, go to school, and play without fear, and we should all hope for peace and help those who are hurting.",
    "category": "world",
    "date": "2026-02-13T23:26:24.433Z",
    "image": "https://image.pollinations.ai/prompt/A%20Sad%20Story%20from%20Sudan%3A%20Wishing%20for%20Peace%20for%20Our%20Friends!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-sad-story-from-sudan-wishing-for-peace-for-our-friends",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "Big News from Sunny South Africa! Soldiers to Help Keep Everyone Safe!",
    "content": "Hello, amazing friends from all over Africa! Welcome to your super special news report, just for you! Today, we have some very important news from a beautiful country called South Africa. Have you ever heard of South Africa? It’s a country far, far away, full of amazing animals like lions and elephants, and lots of friendly people. It's a place with sunshine and fun! \n\n<h3>Meet the President!</h3>\nEvery country has a leader, someone who helps make big decisions to keep everyone happy and safe. In South Africa, this special leader is called the President. His name is Mr. Cyril Ramaphosa. He has a very, very important job. He always thinks about what is best for all the people in South Africa, especially for wonderful children like you!\n\nSometimes, even in the nicest places, there can be some tricky problems. There are some grown-ups who do not follow the rules. These grown-ups are sometimes called 'bad guys' because they do things that are not kind or right. They can make people feel a little bit scared or sad. Mr. President Ramaphosa wants to make sure that everyone feels safe and happy, all the time!\n\n<h3>The Army is Coming to Help!</h3>\nSo, guess what? President Ramaphosa has decided to ask for some extra special help! He is asking the brave men and women in the **army** to come and help too! Have you ever seen pictures of soldiers? They wear special uniforms and are very strong and brave. They learn how to protect people and places. Usually, the army helps protect a country from problems with other countries. But sometimes, they can help at home too!\n\nThe army will not be fighting a big war. Oh no, not at all! They will be working **with** another important group of people called the **police**. The police are the people who usually help catch the bad guys and make sure everyone follows the rules in our towns and cities. So, the army and the police will be a big team, working together like best friends!\n\n<h3>Did You Know?</h3>\nDid you know that South Africa has 11 official languages? That means people speak many different languages there, like Zulu, Xhosa, and English! How cool is that?\n\n<h3>What are 'Bad Guys' and 'Crime Gangs'?</h3>\nSometimes, a few grown-ups make poor choices. They might try to take things that don't belong to them, or they might make big messes. When a group of these grown-ups do bad things together, we sometimes call them 'crime gangs'. They don't follow the rules and can cause problems in neighborhoods. They might make people feel unsafe to play outside or walk to school. President Ramaphosa wants to stop these gangs so that everyone can live without worry.\n\n<h3>What is 'Illegal Mining'?</h3>\nMining is when people dig deep, deep into the ground to find special treasures like gold, shiny diamonds, or special rocks called coal. South Africa is famous for having lots of these treasures! This is called 'mining'. But sometimes, some people try to dig for these treasures without asking for permission, or without following the rules. This is called 'illegal mining'.\n\n'Illegal' means it's against the rules, just like cutting in line at school is against the rules! When people do illegal mining, it can be very dangerous. The holes they dig can be unsafe, and they can hurt the land. It also means they are stealing from everyone in South Africa, because those treasures belong to the country. So, the army will help the police stop this illegal mining too.\n\n<h3>How Will the Army Help?</h3>\nImagine you have a big puzzle to solve, and it's taking a long time. Then, your friend comes to help you! Suddenly, it's easier and faster to solve! That's a bit like what the army will do. They will add more brave hands and strong bodies to help the police. They will help look for the bad guys and make sure the rules are followed.\n\nThis means there will be more people to keep an eye out for trouble. They will help protect the places where illegal mining happens, so no one can steal the country's treasures anymore. When the army and police work together, they are a super strong team! Their job is to make sure that towns and villages in South Africa become super safe places where kids can play, learn, and grow up happily.\n\n<h3>Did You Know?</h3>\nDid you know that South Africa is home to the 'Big Five' animals? That's the lion, leopard, elephant, rhino, and buffalo! They are all amazing!\n\n<h3>Why is This Important for You?</h3>\nThis news is important because it means that President Ramaphosa cares very much about your safety and happiness. He wants all the children in South Africa to feel safe when they go to school, safe when they play with their friends, and safe in their homes. When the bad guys are stopped and the rules are followed, everyone can have more peace and joy.\n\nIt's like when your parents or teachers make sure everyone is kind and follows the rules – it makes everyone feel better, right? The army and police working together will help make South Africa a more peaceful and wonderful place for everyone to live. So let's cheer for the army and police, working together to keep South Africa safe and bright! Hooray!\n\nRemember, even grown-up problems get solved when people work together. And that's your super special news report for today! Keep smiling, little leaders!",
    "summary": "South Africa's President Cyril Ramaphosa has asked the country's brave soldiers to work with the police to stop bad guys and illegal mining, making the country safer for everyone.",
    "whyMatters": "This is important because it means more people are working to keep children and families in South Africa safe from harm, so everyone can live happily and without fear.",
    "category": "politics",
    "date": "2026-02-13T23:26:42.061Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Sunny%20South%20Africa!%20Soldiers%20to%20Help%20Keep%20Everyone%20Safe!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-sunny-south-africa-soldiers-to-help-keep-everyone-safe",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:26:47.185Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump says US will send second aircraft carrier to Middle East ‘very soon’",
    "title": "Trump says US will send second aircraft carrier to Middle East ‘very soon’",
    "content": "Trump says he believes negotiations with Iran will be 'successful' as he confirms USS Gerald R Ford deployment.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-13T23:26:52.416Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20US%20will%20send%20second%20aircraft%20carrier%20to%20Middle%20East%20%E2%80%98very%20soon%E2%80%99%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-us-will-send-second-aircraft-carrier-to-middle-east-very-soon",
    "originalLink": "https://www.aljazeera.com/news/2026/2/13/trump-confirms-second-aircraft-carrier-headed-to-middle-east-very?traffic_source=rss"
  },
  {
    "originalTitle": "US Department of Homeland Security to go into shutdown due to funding lapse",
    "title": "America's Safety Helpers Need Money! A Big Puzzle for Leaders",
    "content": "Hello, my wonderful friends all across Africa! It's your friendly news reporter, Jojo, here! I hope you're having a super day, full of laughter and learning. Today, we have a very interesting story from a country far, far away called America. It's like a big puzzle that grown-ups are trying to solve, and it's about something called a 'shutdown' for a special safety team.\n\n<h3>What is a 'Shutdown'?</h3>\n\nImagine your favourite toy shop. Now, imagine one day you go to buy a new toy, but the shop is closed! The lights are off, and the doors are locked. Why? Maybe they ran out of money to buy new toys, or maybe the grown-ups who own the shop can't agree on what toys to sell. This is a bit like a 'shutdown' for some parts of a government.\n\nIt means that some important offices in America might have to close their doors for a little while. And some kind people who work there, doing very important jobs, might have to stay home. They won't be able to do their work until the grown-ups in charge agree on how to pay for things. It's like when your school needs money for new books or a fun trip, and if the money isn't there, the trip might have to wait.\n\nDid you know? Countries need money to run, just like your family needs money for food and clothes! This money often comes from taxes, which are small fees grown-ups pay when they buy things or earn money.\n\n<h3>Who are America's Safety Helpers?</h3>\n\nNow, let's talk about the special team involved. It's called the 'Department of Homeland Security.' Wow, that's a big name! Think of them as America's super-important safety helpers. Their job is to keep everyone in America safe. They help protect the country from dangers and make sure people follow rules when they come in or out of the country.\n\nThey have lots of different jobs. Some of them work at airports, checking passports and making sure everyone who travels is safe. Others help protect the borders, which are like the imaginary lines that show where one country ends and another begins. They are like guardians for their country.\n\nDid you know? In many countries, there are special teams like this that work hard every day to keep people safe, both inside the country and at its borders. It’s a very important job!\n\n<h3>Why is This Happening Now? No Money!</h3>\n\nSo, why might this important safety team have to 'shutdown'? It's because of something called a 'funding lapse.' This just means there is no more money right now for them to do their jobs. It's not that the money is lost, but the grown-up leaders in America can't agree on how much money to give this team, or what rules the team should follow.\n\nImagine you and your friend both want to play with the same toy. You both have different ideas. Until you agree, neither of you can play with the toy. That's a bit like what's happening with the money. The leaders, like President Trump and other important leaders, have different ideas about how to use the country's money.\n\nDid you know? Grown-up leaders in governments often have to talk a lot and have many meetings to agree on important things, especially about money! It can be a very tricky job.\n\n<h3>What Are They Disagreeing About?</h3>\n\nThe main thing they are talking about and disagreeing on is how people come into America. This is called 'immigration.' People from all over the world sometimes want to move to America for different reasons – maybe to find a job, to be with family, or to go to school. The safety helpers have rules for this, to make sure everyone is safe and happy.\n\nSome leaders want to change these rules. They want to make some 'reforms.' This means they want to make things better or change how things are done. They want to make sure that the rules are very clear and that everyone is kept safe. It's like when your parents might change a rule at home to make things fairer or safer for everyone.\n\nDid you know? People travel between countries all the time! Some travel for holidays, some for work, and some move to live in a new country. Every country has rules about who can come in and how.\n\n<h3>Sad News and Wanting Change</h3>\n\nThere was some very sad news in a place called Minnesota, in America. Some scary things happened, and people got hurt. Because of these sad events, many people, including those leaders who don't agree with President Trump, think it's even more important to change the rules for how people come into the country. They want to make sure such sad things don't happen again.\n\nIt's like when something goes wrong at school, and then the teachers and headmaster think about new rules to make sure everyone is even safer. They want to learn from what happened and make sure things are better for the future.\n\nDid you know? When bad things happen, it often makes people think harder about how to prevent them and how to make everyone safer and more secure.\n\n<h3>What Happens Next?</h3>\n\nSo, what happens now? The grown-up leaders in America will keep talking. They will have many more meetings and try their very best to find a way to agree. They want to make sure America's safety helpers can keep doing their important jobs and that the country stays safe. It's like solving a very big, important puzzle together.\n\nThey will try to find a good plan for how to spend the money and what the rules for people coming into America should be. It takes time, patience, and a lot of talking for leaders to agree when they have different ideas. But they are working hard to make sure everything is okay.\n\nDid you know? Talking things through and listening to each other are very important skills, not just for leaders, but for all of us when we have disagreements!\n\n<h3>Why Should We Care in Africa?</h3>\n\nYou might be thinking, 'Jojo, why are you telling us about America?' That's a great question! Even though America is far away, we are all part of one big, beautiful world. What happens in one country can sometimes affect others. Learning about different countries helps us understand the world better. It's like having friends from different villages – you learn about their lives too!\n\nAlso, countries often help each other. So, it's good to know what's happening with our global neighbours. It teaches us about how governments work, and how important it is for people to agree and work together to solve problems.\n\nDid you know? There are almost 200 countries in the world, and each one has its own government and its own special ways of doing things!\n\nSo, that's the story of the big puzzle in America. The leaders are working hard to find an answer, and we hope they find it soon so that America's safety helpers can keep everyone safe. That's all for today from your friend, Reporter Jojo! Stay curious and keep learning!",
    "summary": "America's special safety team, the Department of Homeland Security, might have to stop working because leaders in America can't agree on money and new rules for people coming into the country after some sad events.",
    "whyMatters": "This matters because it shows how grown-ups in charge need to agree to keep important safety teams working and to make rules that keep everyone safe in a country, which is something all countries do.",
    "category": "world",
    "date": "2026-02-13T23:27:12.445Z",
    "image": "https://image.pollinations.ai/prompt/America's%20Safety%20Helpers%20Need%20Money!%20A%20Big%20Puzzle%20for%20Leaders%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "americas-safety-helpers-need-money-a-big-puzzle-for-leaders",
    "originalLink": "https://www.aljazeera.com/news/2026/2/13/us-department-of-homeland-security-to-go-into-shutdown-due-to-funding-lapse?traffic_source=rss"
  },
  {
    "originalTitle": "Court orders Trump administration to facilitate deported student’s return",
    "title": "Court orders Trump administration to facilitate deported student’s return",
    "content": "Any Lucia Lopez Belloza, 19, was deported after attempting to visit her family for Thanksgiving, despite a court order.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-13T23:27:17.567Z",
    "image": "https://image.pollinations.ai/prompt/Court%20orders%20Trump%20administration%20to%20facilitate%20deported%20student%E2%80%99s%20return%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "court-orders-trump-administration-to-facilitate-deported-students-return",
    "originalLink": "https://www.aljazeera.com/news/2026/2/13/court-orders-trump-administration-to-facilitate-deported-students-return?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:27:23.082Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six possible effects of Trump's climate policy change ",
    "title": "Six possible effects of Trump's climate policy change ",
    "content": "The announcement on Thursday removes the legal bedrock for much of US environmental legislation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:27:28.195Z",
    "image": "https://image.pollinations.ai/prompt/Six%20possible%20effects%20of%20Trump's%20climate%20policy%20change%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-possible-effects-of-trumps-climate-policy-change",
    "originalLink": "https://www.bbc.com/news/articles/cd03ee39945o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Orban rival accuses opponents of blackmail plot ahead of Hungary election ",
    "title": "Orban rival accuses opponents of blackmail plot ahead of Hungary election ",
    "content": "Peter Magyar suspects there are plans to release a sex tape of him from August 2024.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:27:33.313Z",
    "image": "https://image.pollinations.ai/prompt/Orban%20rival%20accuses%20opponents%20of%20blackmail%20plot%20ahead%20of%20Hungary%20election%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "orban-rival-accuses-opponents-of-blackmail-plot-ahead-of-hungary-election",
    "originalLink": "https://www.bbc.com/news/articles/c8758xv4eqeo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "title": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "content": "After Igor Tudor agrees to take charge of Tottenham for the remainder of the season, BBC Sport takes a look at what supporters can expect to see from his side.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-13T23:27:38.705Z",
    "image": "https://image.pollinations.ai/prompt/'Intense%2C%20aggressive%2C%20entertaining'%20-%20what%20will%20Tudor%20bring%20to%20Spurs%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "intense-aggressive-entertaining-what-will-tudor-bring-to-spurs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13nkvd2eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Marvellous' Man City set WSL standard in rampant win",
    "title": "'Marvellous' Man City set WSL standard in rampant win",
    "content": "'Marvellous' Manchester City set WSL standard in rampant 6-0 win over bottom side Leicester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:27:43.821Z",
    "image": "https://image.pollinations.ai/prompt/'Marvellous'%20Man%20City%20set%20WSL%20standard%20in%20rampant%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "marvellous-man-city-set-wsl-standard-in-rampant-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxwjjqrxeo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Greedy' Wrexham dream of adding to 'incredible journey'",
    "title": "'Greedy' Wrexham dream of adding to 'incredible journey'",
    "content": "Wrexham are dreaming of adding to their \"incredible journey\" after reaching the FA Cup fifth round for the first time in 29 years with victory over Ipswich Town.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T23:27:48.936Z",
    "image": "https://image.pollinations.ai/prompt/'Greedy'%20Wrexham%20dream%20of%20adding%20to%20'incredible%20journey'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "greedy-wrexham-dream-of-adding-to-incredible-journey",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13qdv793o?at_medium=RSS&at_campaign=rss"
  }
]