[
  {
    "originalTitle": "Nigeria warns against enlisting abroad  after reports of deaths in Ukraine",
    "title": "Nigeria warns against enlisting abroad  after reports of deaths in Ukraine",
    "content": "The authorities say a growing number of citizens are being illegally recruited to fight elsewhere.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:43:18.762Z",
    "image": "https://image.pollinations.ai/prompt/Nigeria%20warns%20against%20enlisting%20abroad%20%20after%20reports%20of%20deaths%20in%20Ukraine%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nigeria-warns-against-enlisting-abroad-after-reports-of-deaths-in-ukraine",
    "originalLink": "https://www.bbc.com/news/articles/cev7e3m04ngo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Motorbike raids on villages kill dozens in Nigeria",
    "title": "Let's Keep Our Villages Safe!",
    "content": "<h3>Hello, Brave Friends!</h3>\nHi everyone! It's your friendly reporter, coming to you from beautiful Africa. Today, we're going to talk about something important that happened in a part of Nigeria called Niger State. Sometimes, big news can sound a bit scary, but don't worry. We will talk about it together, and learn how people help each other. We will also learn how we can all be kind and make our communities strong.\n\nNigeria is a wonderful country, full of amazing people, vibrant cultures, and beautiful places. It's known as the \"Giant of Africa\"! Like any big family, sometimes there are challenges. But we always work together to overcome them.\n\n<h3>What Happened in Some Villages?</h3>\nRecently, in some villages in Niger State, there were some problems. There were men who came on motorbikes. They did not make good choices. These men caused some trouble for people living there. They hurt some grown-ups and damaged some homes. A few people were also taken away from their families.\n\nThis made many people feel sad and worried. It's like when someone in your class takes your toy without asking. It's not fair, and it makes you feel bad. But just like when a teacher helps you, there are people working hard to help everyone in these villages.\n\n<h3>What Are Motorbikes?</h3>\nDo you know what a motorbike is? It's like a bicycle, but it has an engine and goes much faster! Motorbikes are super popular in many parts of Africa, including Nigeria. People use them to travel, carry goods, and sometimes even as taxis called \"okada.\"\n\n**Did you know?** In many African countries, motorbikes are a very important way for people to get around quickly! They can go on roads where cars might not fit easily. They help people go to the market, visit family, or get to work every day. Most motorbike riders are good people who just want to get to where they need to go.\n\n<h3>Why Do People Do Bad Things?</h3>\nSometimes, people make bad choices. They might be confused, or they might not have learned how important it is to be kind and share. These men who came to the villages did not show kindness. They did things that hurt others. It's very sad when people act like this.\n\nIt's important for all of us to learn to be good friends and good neighbours. We should always try to help each other and choose kindness. When we choose kindness, our communities become happier and stronger. Everyone feels safe and loved.\n\n<h3>Who Helps When Things Are Hard?</h3>\nWhen problems like this happen, many brave people come to help. The police are like big helpers who wear uniforms. Their job is to keep everyone safe and make sure everyone follows the rules. They work very hard to find the people who caused trouble.\n\nThere are also soldiers, who are like very strong protectors. They help the police keep the villages safe. Community leaders, who are wise grown-ups in the village, also step in. They help families and make sure everyone gets the care they need. Even doctors and nurses help people who got hurt. They are like superheroes in white coats!\n\nEveryone in the community tries to help each other. They share food, offer hugs, and make sure children feel safe. This is what makes a community strong – people caring for one another.\n\n<h3>How Do We Stay Safe?</h3>\nIt's always good to know how to stay safe. Always listen to your parents, teachers, and other grown-ups who care for you. They give you good advice because they love you very much. If you ever see something that makes you feel scared or confused, tell a trusted adult right away.\n\nRemember, if you feel unsafe, you should always find a grown-up you trust. This could be your mum, dad, a grandparent, a teacher, or a village elder. They are there to protect you. We all work together to make sure our homes and villages are safe places for everyone.\n\n<h3>Nigeria is a Big, Beautiful Place!</h3>\nLet's remember how amazing Nigeria is! It's home to so many different groups of people, speaking many different languages. Imagine a country where you can hear hundreds of different greetings! Nigeria has big cities and beautiful natural parks. It's famous for its music, art, and delicious food.\n\nThis big, diverse country has a lot of good things happening every day. Many people are working hard to build schools, hospitals, and good roads. They want all children in Nigeria to have a happy and bright future.\n\n<h3>\"Did You Know?\" About Nigeria</h3>\n**Did you know?** Nigeria has the largest population of any country in Africa! That means lots and lots of people live there.\n**Did you know?** The capital city of Nigeria is Abuja. It's a very modern and important city.\n**Did you know?** Nigeria is famous for its jollof rice! It's a super tasty dish with rice, tomatoes, and spices. Yum!\n**Did you know?** Nigeria has a lot of talented artists, musicians, and filmmakers. They tell amazing stories through their work!\n\n<h3>Let's All Be Friends and Helpers!</h3>\nEven when sad things happen, it's important to remember that most people in the world are good. They want to help and make things better. We can all be friends and helpers in our own villages and towns. We can share our toys, help our parents, and be kind to our classmates.\n\nEvery little act of kindness helps make the world a better place. When we choose to be kind, we make our communities stronger and happier. We can all be bright lights for each other.\n\n<h3>We Can Make Things Better!</h3>\nThe people in Niger State are strong and brave. They are helping each other, and many people are working to make sure everyone is safe again. The grown-ups in charge are trying very hard to stop these bad things from happening again.\n\nWe believe that with kindness, help, and hard work, communities can heal and grow even stronger. Let’s send our love and good thoughts to everyone in Nigeria. Remember, we are all one big family in Africa, and we look out for each other. Keep smiling and keep being kind, little reporters!",
    "summary": "Some villages in Nigeria faced problems, but many good people are working together to help everyone and make communities safe and kind.",
    "whyMatters": "It's important to understand challenges in our communities, but also to remember that people are working hard to keep everyone safe and teach us to be kind and help each other.",
    "category": "world",
    "date": "2026-02-16T10:43:42.021Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Keep%20Our%20Villages%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-keep-our-villages-safe",
    "originalLink": "https://www.bbc.com/news/articles/ckg1y0nk641o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russian 'pick-up artist' accused of secretly filming women in Ghana",
    "title": "Let's Talk About Asking First!",
    "content": "Hello, everyone! Welcome to our special news report from Africa! Today, we are going to talk about something very important: being kind, respecting others, and always asking for permission.\n\n<h3>What Happened?</h3>\nImagine you are playing with your friends. Suddenly, someone takes your picture or a video of you without asking. How would you feel? Maybe a little surprised? Maybe a little bit sad because you didn't get to say 'yes' or 'no'?\n\nWell, something like that happened. There was a man who came from a country far, far away called Russia. He was visiting our beautiful country, Ghana.\n\nThis man is said to have taken videos of some women without asking them first. This is not a kind thing to do, and it's not fair to people.\n\nIn Ghana, just like in many places around the world, it's very important to respect other people's space and their choices. Taking pictures or videos of someone without them knowing or without their 'yes' is not okay.\n\nOur country, Ghana, wants to make sure everyone is safe and treated with respect. That's why this is big news for us.\n\n<h3>Why is it Important to Ask for Permission?</h3>\nThink about it this way: when you want to borrow a toy from your friend, you always ask, \"Can I please play with your toy?\" Right?\n\nIf your friend says \"yes,\" then it's okay! You can play and have fun together. But if your friend says \"no,\" you understand that the toy is theirs, and they don't want to share right now. That's respecting their choice.\n\nIt's the same when it comes to taking pictures or videos of people. Everyone has a right to decide if they want to be in a picture or a video. It's their own special space, and we should always respect that.\n\nAsking for permission shows that you care about their feelings. It shows that you are a kind and thoughtful person. It makes people feel safe and happy around you.\n\n**Did you know?** Ghana is known for its very warm, friendly, and welcoming people! We love to be kind to each other and to visitors.\n\n<h3>What is \"Permission\"?</h3>\n\"Permission\" is just a big word for \"asking first\" and getting a \"yes.\" It means someone has said it's okay to do something.\n\nSo, if you want to take a picture of your grandma, you say, \"Grandma, can I take your picture?\" If she smiles and says \"yes,\" then you can snap away! That's getting permission.\n\nIf you want to record your friend singing, you ask, \"Can I record you singing?\" If they say \"no,\" then you respect their wish and don't record.\n\nIt's a very simple rule that helps everyone feel comfortable and happy. It helps us to be good friends and good citizens.\n\n<h3>What Does Ghana Want to Do?</h3>\nBecause this man is said to have taken videos without asking, our country, Ghana, believes it's very important to talk to him about it. They want to understand what happened and make sure it doesn't happen again.\n\nGhana has asked the country where the man is from, Russia, to send him back to Ghana. This special request is called \"extradition.\" It's a big word, but it just means asking one country to send someone who has problems back to another country to sort things out.\n\nIt's like if you accidentally left your lunchbox at a friend's house, and your mum calls your friend's mum to ask if she can bring it back home. It's countries talking to each other to solve a problem.\n\nGhana wants to make sure that everyone, especially our women, feel safe and respected in our country. And if someone does something that is not respectful, there are rules to follow.\n\n**Did you know?** Ghana and Russia are two different countries, far apart, but countries often talk to each other to solve problems and be friends!\n\n<h3>Why Are Rules Important?</h3>\nJust like we have rules at school (like no running in the corridors!) and rules at home (like cleaning up your toys!), countries have rules too. These rules are called laws.\n\nLaws help everyone in the country live together safely and happily. They tell us what we should and shouldn't do.\n\nTaking videos of people without asking is against the rules in Ghana. It's against our laws because it takes away people's right to privacy. Privacy means having your own space and being able to choose what others see about you.\n\nWhen someone breaks a rule, it's important to talk about it and understand why the rule is there. It helps everyone learn to follow the rules and keep our community safe.\n\n<h3>Being Safe Online and Offline</h3>\nToday, many people have phones that can take pictures and videos easily. It's fun to share photos of your pets or your drawings, but always remember the most important rule: ASK FIRST!\n\nBefore you take a picture of a friend, ask. Before you share a picture of someone else, ask. If someone takes your picture and you don't like it, you can always tell a grown-up, like your teacher or your parents.\n\nIt's super important to feel safe and happy, both when you're playing outside with your friends and when you're using a tablet or phone.\n\n**Did you know?** Africa is a very big continent with many different countries and cultures! Ghana is one wonderful country in West Africa.\n\n<h3>What We Learn from This</h3>\nThis news story teaches us some very important lessons:\n\n1.  **Always ask for permission:** Before you take a picture, a video, or share something about someone else, always ask them if it's okay. A \"yes\" makes everyone happy!\n2.  **Respect others' feelings:** Think about how others might feel. Would you like it if someone did that to you?\n3.  **Everyone deserves privacy:** Everyone has a right to their own space and to decide what pictures or videos of them are taken and shared.\n4.  **Countries work together:** Even when there's a problem, countries talk to each other to make things right and keep people safe.\n\n**Did you know?** The capital city of Ghana is Accra! It's a busy and exciting city where lots of important things happen.\n\nSo, let's all remember to be kind, be respectful, and always, always ask first! It makes our world a much better and safer place for everyone. Thank you for listening!",
    "summary": "Ghana has asked Russia to send back a man who is accused of secretly taking videos of women without their permission, teaching us the important lesson of always asking for consent and respecting others' privacy.",
    "whyMatters": "This is important because everyone deserves to feel safe and respected, and it teaches us that taking pictures or videos of people without their permission is not kind and goes against the rules.",
    "category": "world",
    "date": "2026-02-16T10:44:03.816Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Talk%20About%20Asking%20First!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-talk-about-asking-first",
    "originalLink": "https://www.bbc.com/news/articles/c9wn5p299eko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "North Korea’s Kim unveils homes for families of fallen soldiers",
    "title": "North Korea’s Kim unveils homes for families of fallen soldiers",
    "content": "North Korea honours fallen soldiers by providing new homes to their families before party congress.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:44:09.088Z",
    "image": "https://image.pollinations.ai/prompt/North%20Korea%E2%80%99s%20Kim%20unveils%20homes%20for%20families%20of%20fallen%20soldiers%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "north-koreas-kim-unveils-homes-for-families-of-fallen-soldiers",
    "originalLink": "https://www.aljazeera.com/gallery/2026/2/16/photos-north-koreas-kim-unveils-homes-for-families-of-fallen-soldiers?traffic_source=rss"
  },
  {
    "originalTitle": "North Korea opens new housing area for families of soldiers killed overseas",
    "title": "North Korea opens new housing area for families of soldiers killed overseas",
    "content": "Kim unveils housing for families of soldiers killed overseas amid North Korea's support for Russia's war in Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:44:14.204Z",
    "image": "https://image.pollinations.ai/prompt/North%20Korea%20opens%20new%20housing%20area%20for%20families%20of%20soldiers%20killed%20overseas%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "north-korea-opens-new-housing-area-for-families-of-soldiers-killed-overseas",
    "originalLink": "https://www.aljazeera.com/news/2026/2/16/north-korea-opens-new-housing-area-for-families-of-soldiers-killed-overseas?traffic_source=rss"
  },
  {
    "originalTitle": "Kyrie Irving wears PRESS shirt for Gaza journalists at NBA All-Star Game",
    "title": "Kyrie Irving wears PRESS shirt for Gaza journalists at NBA All-Star Game",
    "content": "Basketball star honours media workers, nearly 300 of whom have been killed in Israeli attacks since October 2023.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:44:19.319Z",
    "image": "https://image.pollinations.ai/prompt/Kyrie%20Irving%20wears%20PRESS%20shirt%20for%20Gaza%20journalists%20at%20NBA%20All-Star%20Game%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kyrie-irving-wears-press-shirt-for-gaza-journalists-at-nba-all-star-game",
    "originalLink": "https://www.aljazeera.com/news/2026/2/16/kyrie-irving-wears-press-shirt-for-gaza-journalists-at-nba-all-star-game?traffic_source=rss"
  },
  {
    "originalTitle": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove",
    "title": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove",
    "content": "The FBI says it recovered a DNA sample from the glove, which was found in a field a few miles from Guthrie's home.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:44:24.797Z",
    "image": "https://image.pollinations.ai/prompt/'It's%20never%20too%20late'%3A%20Savannah%20Guthrie's%20new%20plea%20for%20mother's%20release%20as%20FBI%20analyses%20glove%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "its-never-too-late-savannah-guthries-new-plea-for-mothers-release-as-fbi-analyses-glove",
    "originalLink": "https://www.bbc.com/news/articles/c5yrv2g16e2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump's new world order has become real and Europe is having to adjust fast",
    "title": "Big Changes for Friends Far Away!",
    "content": "Hello, super star kids! It's your kid-friendly news reporter here, bringing you exciting stories from our amazing continent, Africa! Today, we're going on a little adventure, not to a jungle or a safari, but to talk about friends – very, very big friends called countries!\n\n<h3>Friends All Over the World</h3>\nImagine our world as a giant playground. On this playground, there are many big families, and we call these families \"countries.\" Each country has its own special name, its own unique stories, and its own lovely people. Just like you have your family and friends, countries also have friends!\n\nWhy do countries need friends? Well, it's a bit like why you need your friends at school. Friends help each other. They share toys, they share ideas, and they make sure everyone is safe and happy. When countries are friends, they work together to solve problems, trade things like yummy food or cool gadgets, and help each other grow strong. It's all about teamwork!\n\nDid you know? The world has 7 big land areas called continents! Africa is one of these amazing continents, full of sunshine and incredible people. And far, far away from us, across big oceans, is another continent called Europe. Europe is where our story is happening today.\n\n<h3>A Big Leader and New Ideas</h3>\nNow, imagine a very important leader from a very big country far away. This leader's name was Mr. Trump, and he was the leader of a country called America. America is another very big country, also far away from Africa and Europe. Mr. Trump had lots of new ideas about how countries should be friends and work together.\n\nSometimes, when someone important has new ideas, it makes everyone else stop and think. It’s like when a new kid joins your class and suggests a brand new game to play. Everyone might think, \"Hmm, should we try this new game, or should we stick to our old favourite?\" This is what happened when Mr. Trump shared his new ideas. Countries in Europe started to think deeply about their friendships.\n\nDid you know? Leaders from different countries often meet together to talk about important things! They sit down, just like you might sit with your friends to plan a super fun game, and discuss how to make the world a better place.\n\n<h3>Old Friends and New Friends</h3>\nFor a very, very long time, countries in Europe had special groups of friends. These groups are like super-duper friendship clubs where everyone agrees to help each other, especially if someone needs it. We call these special friendship clubs \"alliances.\" It's a fancy word, but it just means friends working together!\n\nThese European countries had many old friends in these alliances. They had helped each other for many, many years. They had shared their toys (like important things they needed), and they had always stood up for each other. They trusted each other a lot, just like you trust your best friend.\n\nBut now, because of the new ideas Mr. Trump shared, the countries in Europe are doing a lot of thinking. They are asking big questions. They are wondering, \"Are our old friends and our old friendship clubs still enough for everything we need? Should we just keep playing with the same friends, or should we try to make even more friends?\"\n\n<h3>Why Make New Friends?</h3>\nLet's imagine you only ever play with just one friend. What if that friend moves to a different town? Or what if you want to try a new game that your one friend doesn't know how to play? It's always a good idea to have many friends! That way, you have more people to share with, more games to play, and more fun to have!\n\nThis is a bit like what the countries in Europe are thinking. They are thinking, \"Maybe it's a good idea to make new friends too!\" Making new friends means talking to countries they haven't talked to much before. It means trying new ways to work together. It means learning new things from other people and other countries.\n\nThere's a special word for this, a bit big but easy to understand: \"diversifying.\" It just means trying new things and making more friends. So, if a country \"diversifies\" its friendships, it means it's making friends with different countries and trying different ways to work with them. It’s like having a bigger team for a bigger game!\n\nDid you know? Friendship makes us stronger and happier! When we have many friends, we feel safer and more connected to the world around us. Countries feel the same way!\n\n<h3>Change Can Be Good</h3>\nSometimes, when things change, it can feel a little bit strange at first. It's like learning to ride a bicycle without training wheels for the first time. It might feel wobbly, but soon you get the hang of it, and it's amazing!\n\nThese big changes and new ideas are making the countries in Europe think quickly. They have to adjust fast! \"Adjust\" means to get used to the new way of doing things. But change can also be very good and very exciting! It can help countries find new and better ways to stay safe and happy. It can help them discover new opportunities and learn from others around the world.\n\nWhen countries try new things and make new friends, they can find smarter ways to share resources, protect their people, and build a brighter future for everyone. It’s all about growing and becoming even better!\n\n<h3>What Does This Mean for Europe?</h3>\nSo, right now, the leaders of the countries in Europe are talking a lot. They are having many meetings. They are thinking very hard about these questions: \"Should we stick only to our traditional friends, or should we reach out and make new friends and try new ways of working together?\"\n\nThey want to make sure that all their people stay safe, healthy, and have good lives. They are working hard to find the best path forward. It's just like when you and your friends decide what new game to play or what new adventure to go on next. You all talk about it, listen to each other, and choose the best way together!\n\nDid you know? The flags of countries are like their special team shirts! Each flag has unique colors and symbols that tell a story about that country.\n\n<h3>What Does This Mean for Us?</h3>\nEven though this story is happening very far away in Europe, it teaches us something very important here in Africa and all around the world. It teaches us about the power of friendship!\n\nNo matter where we live, whether in a small village or a big city, friendship makes our lives better. Working together, sharing our ideas, and helping each other makes us all stronger. And being open to new ideas and new friends is a truly wonderful thing. It helps us learn, grow, and see the world in new, exciting ways!\n\nFrom all of us here in Africa, we know that kindness, community, and friendship are super important. They help us overcome challenges and build a peaceful, happy world for all children, everywhere! So, keep making friends and keep sharing your kindness! You are all amazing!",
    "summary": "Countries in Europe are thinking about making new friends and trying new ways to work together because a big leader had new ideas about how countries should be friends.",
    "whyMatters": "It's important because it shows how countries need friends, how new ideas can change things, and how being open to new friends and ways of working together can help everyone stay safe and happy, just like you and your friends.",
    "category": "world",
    "date": "2026-02-16T10:44:51.129Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Changes%20for%20Friends%20Far%20Away!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-changes-for-friends-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cddn002g6qzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bondi Beach shooting accused faces court for the first time",
    "title": "Bondi Beach shooting accused faces court for the first time",
    "content": "The 24-year-old faces 59 charges, including 15 counts of murder and one of committing a terrorist attack.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:44:56.236Z",
    "image": "https://image.pollinations.ai/prompt/Bondi%20Beach%20shooting%20accused%20faces%20court%20for%20the%20first%20time%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bondi-beach-shooting-accused-faces-court-for-the-first-time",
    "originalLink": "https://www.bbc.com/news/articles/c3rzwe7lr4jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Matheson on Old Trafford heroics, 'torrid time' as £1m teenager & McLeod death",
    "title": "Matheson on Old Trafford heroics, 'torrid time' as £1m teenager & McLeod death",
    "content": "A 16-year-old Luke Matheson wrote his name in the history books by scoring against Manchester United in 2019. Six years later, he is aiming for more cup heroics with Macclesfield.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:45:01.775Z",
    "image": "https://image.pollinations.ai/prompt/Matheson%20on%20Old%20Trafford%20heroics%2C%20'torrid%20time'%20as%20%C2%A31m%20teenager%20%26%20McLeod%20death%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "matheson-on-old-trafford-heroics-torrid-time-as-pound1m-teenager-and-mcleod-death",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg18xrw2rwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Lampard fan v Lampard in pivotal game at top of Championship",
    "title": "Lampard fan v Lampard in pivotal game at top of Championship",
    "content": "In-depth preview of leaders Middlesbrough's game against second-placed Coventry in a key game in the Championship season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-16T10:45:06.886Z",
    "image": "https://image.pollinations.ai/prompt/Lampard%20fan%20v%20Lampard%20in%20pivotal%20game%20at%20top%20of%20Championship%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lampard-fan-v-lampard-in-pivotal-game-at-top-of-championship",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn8zlzz8v8do?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "The big VAR debate: with, without or change its scope?",
    "title": "The big VAR debate: with, without or change its scope?",
    "content": "After a weekend of FA Cup action without VAR, BBC Sport ask managers, fans and pundits whether the game needs technology - and what needs to change.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T10:45:11.997Z",
    "image": "https://image.pollinations.ai/prompt/The%20big%20VAR%20debate%3A%20with%2C%20without%20or%20change%20its%20scope%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-big-var-debate-with-without-or-change-its-scope",
    "originalLink": "https://www.bbc.com/sport/football/articles/crl4k0rr8xgo?at_medium=RSS&at_campaign=rss"
  }
]