[
  {
    "originalTitle": "People cling to treetops as 'worst floods in a generation' sweep Mozambique",
    "title": "Big Rains and Brave Hearts in Mozambique!",
    "content": "Hi friends! It's your kid-friendly news reporter for Africa, ready to share an important story with you. Sometimes, nature can be very powerful, and that's what happened in a special country called Mozambique. Let's talk about big rains and how people helped each other!\n\n<h3>A Special Place Called Mozambique</h3>\nMozambique is a beautiful country in Africa. It has a very long coastline with lovely beaches where the ocean waves crash. People there love to live near the water. But sometimes, when it rains too much, the water can cause problems.\n\nDid you know? Mozambique is on the eastern side of Africa, right next to the big Indian Ocean!\n\n<h3>What is a Flood?</h3>\nImagine your bathtub overflowing. That's a bit like a flood, but much, much bigger! A flood is when a lot of water covers land that is usually dry. This happens when it rains very, very hard for many days, or when rivers get too full and spill over their banks. The water can go over roads, into houses, and cover fields where yummy food grows.\n\nDid you know? Floods can also happen very quickly, making it hard for people to get ready!\n\n<h3>Very, Very Big Rains</h3>\nRecently, Mozambique had an amazing amount of rain. It was not just a little rain; it was very, very big rain! So much rain fell that people are calling it the 'worst floods in a generation'. This means that your mommy and daddy, and even their mommy and daddy, have never seen floods this big in their lives. The water kept coming and coming, making rivers grow huge and spill all over the land.\n\nImagine the water level going up, up, up! Higher than your chairs, higher than your tables, even higher than some houses. It was a very tricky and scary time for many people in Mozambique.\n\n<h3>Homes and Farms Underwater</h3>\nWhen the water came, it covered many homes. People's houses were surrounded by water, making it impossible to stay inside. Imagine trying to walk around when your house is filled with water! It also covered the fields where farmers grow food like corn, beans, and vegetables. When the fields are underwater, the plants can't grow, and that means less food for everyone.\n\nThis made it very hard for families. They couldn't cook, they couldn't sleep in their beds, and they couldn't get food from their farms. They needed to find safe, dry places.\n\n<h3>Climbing to Safety</h3>\nTo stay safe from the fast-moving water, many brave people had to do something amazing. They climbed up high! Where did they go? They climbed up into big, strong trees! Yes, just like monkeys, they held onto the branches, waiting for help. Some people even climbed onto their rooftops to be away from the water. It was a very long and cold wait for many families, especially children.\n\nDid you know? Trees have very strong roots that help them stay in the ground, even in strong winds or floods!\n\n<h3>Friends from Around the World Help</h3>\nBut guess what? When people are in trouble, other people from far away come to help! It's like having a big family across the world. Countries like Brazil, which is very, very far away across the ocean, and South Africa, which is a close neighbor to Mozambique, and even the United Kingdom, sent their best rescue teams. These teams are like real-life superheroes!\n\nDid you know? South Africa shares a border with Mozambique, meaning they are next-door neighbours!\n\n<h3>Brave Rescuers at Work</h3>\nThese brave helpers came with special boats and big helicopters. They flew over the flooded areas, looking for people stuck in trees, on rooftops, or on small pieces of dry land. When they found someone, they would fly down low or use their boats to get to them. They helped bring people to safe places where there was no water. They also brought food, clean water to drink, and warm blankets for the families who had lost everything.\n\nIt was a very big job, and the rescuers worked day and night, without much sleep, to help as many people as they could. They are true heroes!\n\nDid you know? Helicopters are super useful in floods because they can land in small spaces or even just hover in the air to pick people up!\n\n<h3>Why Countries Help Each Other</h3>\nWhy do countries from all over the world help Mozambique? Because we are all part of one big global family! When one part of our family is sad or in trouble, the other parts come to help. It shows kindness, love, and that we care about each other, no matter where we live. Helping each other makes the world a much better and stronger place for everyone.\n\nIt teaches us that even when bad things happen, there is always good in the world, and people will always try to help.\n\n<h3>What Happens Next?</h3>\nAfter the big water finally goes away, the people of Mozambique will start to clean up. It will be a very big job to rebuild their homes and replant their farms. It will take time, but with the help from their friends around the world, and by working together, they will make Mozambique strong and beautiful again. People will help each other clean the mud, fix broken things, and get back to their normal lives.\n\nDid you know? After floods, it's very important to have clean water to drink so people don't get sick!\n\n<h3>A Message of Hope</h3>\nSo, my friends, this is a story about a lot of rain, but it's also a story about a lot of hope and a lot of brave hearts. It shows us that even when nature is tricky, people can be even stronger when they work together and help each other. Let's send a big cheer to all the brave people of Mozambique and all the wonderful helpers! Remember, a little kindness goes a long, long way!",
    "summary": "Mozambique faced huge floods from very heavy rains, forcing people to climb trees for safety, but brave helpers from countries like Brazil, South Africa, and the UK came to rescue them and offer support.",
    "whyMatters": "This story matters because it shows how powerful nature can be and how important it is for people and countries to help each other when bad things happen, like big floods, to keep everyone safe and hopeful.",
    "category": "world",
    "date": "2026-01-26T10:21:53.382Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Rains%20and%20Brave%20Hearts%20in%20Mozambique!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-rains-and-brave-hearts-in-mozambique",
    "originalLink": "https://www.bbc.com/news/articles/cddgq9z4899o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenya's ex-deputy president alleges assassination attempt in church attack",
    "title": "Keeping Safe in Kenya: A Big Helper's Story!",
    "content": "<h3>Hello, Super Friends from Africa!</h3>\n\nHello, my super cool friends! It's me, your kid-friendly news reporter, coming to you live from our amazing continent, Africa! I hope you're all having a wonderful day filled with fun and learning. Today, we have an important story to share from a beautiful country called Kenya. It's about keeping safe and how grown-ups work hard to make sure everyone can live peacefully.\n\n<h3>What Happened in Kenya?</h3>\n\nImagine someone who used to be a very, very important helper for the main leader of a country. We call him an 'ex-deputy president.' This person from Kenya said something scary happened. He told everyone that bad people tried to hurt him when he was at a church. Wow, that sounds like a very big and serious thing, right? When someone 'alleges' something, it means they are saying it happened, but people still need to look for all the clues to be sure.\n\n<h3>Who is an Ex-Deputy President?</h3>\n\nLet's make it super simple! Think of your school. You have a head teacher, right? And maybe there's a very important helper who works super close with the head teacher, like a deputy head teacher. Well, an 'ex-deputy president' is like that, but for a whole country! This person used to be a big helper to the country's main leader, making important decisions and helping to run things for everyone. Even though they don't have that job anymore, they are still a very respected and important person in the country. They have helped Kenya in many ways.\n\n<h3>What is a Church?</h3>\n\nNow, this scary thing happened at a church. What exactly is a church? A church is a special building where many people, often friends and families, go to pray, sing happy songs, and listen to stories. It’s a place where people feel peaceful and think about good things. People go to church to feel connected and strong together. It's usually a very calm and safe place for everyone. That's why it's extra sad and surprising when something bad happens there.\n\nDid you know? There are many different kinds of special buildings where people go to pray and be together! Some people go to churches, others go to mosques, temples, or synagogues! They are all special places where people share good thoughts and feelings.\n\n<h3>The Police Are Like Super Detectives!</h3>\n\nWhen something scary or bad happens, who do we call? That's right, the police! The police are like real-life superheroes who wear uniforms. Their job is to keep everyone safe, find clues when something goes wrong, and make sure that bad things don't happen again. They help people and protect our communities. In Kenya, the police are now 'investigating' this event. Investigating is a big word, but it just means they are looking for all the clues, like super detectives trying to solve a mystery! They want to find out exactly what happened and who might have tried to cause trouble.\n\nDid you know? Police officers go through special training to learn how to keep us safe, solve mysteries, and help people who are in trouble! They are very brave and helpful!\n\n<h3>What Did the Government Say?</h3>\n\nAnother very important person in Kenya, called the 'interior minister,' heard about this attack. An interior minister is like the main boss for all the police and safety people in the whole country. When he heard about what happened at the church, he said the attack was 'condemned.' That means he said it was very, very wrong and bad. He wants everyone to know that doing such a thing is not okay. He also said that the government is serious about finding out what happened and making sure justice is done. This shows that the grown-ups in charge care a lot about keeping people safe and happy in Kenya.\n\n<h3>Why Keeping Safe Matters So Much</h3>\n\nIt's so important that places like churches, schools, and our homes are safe for everyone. We all want to live in a peaceful place where we can play, learn, and be happy without worrying. Our leaders and the police work very hard to make sure bad things don't happen and that people feel protected. When something bad like this happens, it makes everyone a little sad or worried. But it also makes everyone work even harder to keep peace and order.\n\nDid you know? Kenya is a beautiful country in East Africa! It's famous for its amazing wildlife, like lions, elephants, and giraffes, and its super-fast runners! It's a country full of wonderful people and places.\n\n<h3>My Message to You</h3>\n\nSo, my friends, while this story sounds a bit serious, remember that there are many good people working hard to keep everyone safe. The police are on the case, and important leaders are making sure bad actions are not allowed. It reminds us all to be kind to each other and to help create a peaceful world wherever we are. Let's keep hoping for safety and peace in Kenya and all over Africa! Stay curious and stay kind, everyone! Bye for now!",
    "category": "politics",
    "date": "2026-01-26T10:22:14.056Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Safe%20in%20Kenya%3A%20A%20Big%20Helper's%20Story!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-safe-in-kenya-a-big-helpers-story",
    "originalLink": "https://www.bbc.com/news/articles/cpqyxew338po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "content": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:19.194Z",
    "image": "https://image.pollinations.ai/prompt/'Half%20of%20my%20friends%20were%20killed'%20-%20the%20girls%20returning%20to%20a%20school%20caught%20up%20in%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "half-of-my-friends-were-killed-the-girls-returning-to-a-school-caught-up-in-war",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At least 10 people die, million without power as winter storm grips US",
    "title": "At least 10 people die, million without power as winter storm grips US",
    "content": "At least 20 states declare states of emergency as nearly a million people are without power due to snow and ice.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:24.437Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2010%20people%20die%2C%20million%20without%20power%20as%20winter%20storm%20grips%20US%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-10-people-die-million-without-power-as-winter-storm-grips-us",
    "originalLink": "https://www.aljazeera.com/gallery/2026/1/26/at-least-10-people-die-million-without-power-as-winter-storm-grips-us?traffic_source=rss"
  },
  {
    "originalTitle": "President Xi says India, China ‘friends, partners’ in Republic Day message",
    "title": "President Xi says India, China ‘friends, partners’ in Republic Day message",
    "content": "On India's Republic Day, President Xi Jinping says Beijing and New Delhi are 'good neighbours, friends and partners'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:29.568Z",
    "image": "https://image.pollinations.ai/prompt/President%20Xi%20says%20India%2C%20China%20%E2%80%98friends%2C%20partners%E2%80%99%20in%20Republic%20Day%20message%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "president-xi-says-india-china-friends-partners-in-republic-day-message",
    "originalLink": "https://www.aljazeera.com/news/2026/1/26/president-xi-says-india-china-friends-partners-in-republic-day-message?traffic_source=rss"
  },
  {
    "originalTitle": "Video: Anti-ICE protest held in Minneapolis after second US citizen killed",
    "title": "Video: Anti-ICE protest held in Minneapolis after second US citizen killed",
    "content": "Hundreds of protesters marched in the US city of Minneapolis on Sunday, demanding justice for the fatal ICE shooting.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:34.738Z",
    "image": "https://image.pollinations.ai/prompt/Video%3A%20Anti-ICE%20protest%20held%20in%20Minneapolis%20after%20second%20US%20citizen%20killed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "video-anti-ice-protest-held-in-minneapolis-after-second-us-citizen-killed",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/26/video-anti-ice-protest-held-in-minneapolis-after-second-us-citizen-killed?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says administration 'reviewing everything' after fatal shooting of Minneapolis nurse",
    "title": "Trump says administration 'reviewing everything' after fatal shooting of Minneapolis nurse",
    "content": "The US president was asked by the Wall Street Journal whether the immigration agent who shot dead a man in Minneapolis had done the right thing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-26T10:22:40.489Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20administration%20'reviewing%20everything'%20after%20fatal%20shooting%20of%20Minneapolis%20nurse%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-administration-reviewing-everything-after-fatal-shooting-of-minneapolis-nurse",
    "originalLink": "https://www.bbc.com/news/articles/cr571qg4m61o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "title": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "content": "Two people have been shot dead by federal agents in the city in recent weeks, leaving many angry and frustrated.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:45.637Z",
    "image": "https://image.pollinations.ai/prompt/'This%20is%20horrifying'%20-%20Minneapolis%20residents%20reel%20from%20second%20deadly%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-is-horrifying-minneapolis-residents-reel-from-second-deadly-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cvg50vv1ezko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "content": "He has been described as an avid outdoorsman who loved mountain biking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:50.773Z",
    "image": "https://image.pollinations.ai/prompt/Who%20was%20Alex%20Pretti%2C%20the%20intensive%20care%20nurse%20shot%20dead%20in%20Minneapolis%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-was-alex-pretti-the-intensive-care-nurse-shot-dead-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "title": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "content": "As Michael Carrick's perfect start at Manchester United continues, is he building a case for the job longer term?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:22:56.293Z",
    "image": "https://image.pollinations.ai/prompt/Hardly%20anyone%20would%20have%20picked%20Carrick%20to%20be%20Man%20Utd%20boss%20-%20but%20now%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hardly-anyone-would-have-picked-carrick-to-be-man-utd-boss-but-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxjdk4rk1xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "title": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "content": "Arsenal's winless run may normally be cause for concern - but the stats suggest they are still in control of the Premier League title race.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:23:01.426Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Arsenal's%20wobble%20may%20not%20even%20matter%20-%20despite%20'feeling%20pressure'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-arsenals-wobble-may-not-even-matter-despite-feeling-pressure",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2xvq5ng0xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Another unbelievable result' - but what's different about Man Utd now?",
    "title": "'Another unbelievable result' - but what's different about Man Utd now?",
    "content": "MOTD pundit Danny Murphy explains how Manchester United earned their impressive win at Premier League leaders Arsenal, and how he feels the Gunners will react.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T10:23:06.577Z",
    "image": "https://image.pollinations.ai/prompt/'Another%20unbelievable%20result'%20-%20but%20what's%20different%20about%20Man%20Utd%20now%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "another-unbelievable-result-but-whats-different-about-man-utd-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62vk5l68x3o?at_medium=RSS&at_campaign=rss"
  }
]