[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Brave Twin Sisters Go Back to School!",
    "content": "Hello, amazing friends from all over Africa! Your friendly news reporter is here!\n\nToday, I want to tell you a very special story. It's about two brave girls who love school very much. They are twin sisters, which means they were born on the same day! Isn't that cool?\n\nMany of you have brothers or sisters, but twins are super special. Did you know? Twins sometimes even think the same thoughts! They have a very strong bond.\n\nThese twins had a very sad time, but they are showing us all how strong we can be.\n\n<h3>Friends and School Fun</h3>\nOur story is about twin sisters. Let's imagine their names are Nia and Mia.\n\nNia and Mia loved going to school every day. Just like you, they loved to learn new things.\n\nThey liked to read stories, draw colourful pictures, and play with their friends. School was a place full of laughter and fun for them.\n\nThey had many friends in their class. Playing games during break time was one of their favourite things to do.\n\nLearning numbers and letters made them feel smart and happy. They dreamed of growing up and using what they learned to help their community.\n\n<h3>When Sad Things Happened</h3>\nOne day, something very sad happened in their town.\n\nThere was a big, noisy fight. People call this a \"war.\"\n\nWar is when people fight, and it makes places unsafe and very sad. There were loud noises, like big bangs, near their school.\n\nSometimes, these big bangs are called \"shelling.\" Shelling can break buildings and make people very scared.\n\nIt meant that going to school was not safe for a while. Many people had to leave their homes to be safe.\n\nDuring this sad time, some of Nia and Mia's friends were hurt. Some of their friends even died because of the fighting.\n\nThis made Nia and Mia very, very sad. Imagine losing your friends. It's a very hard thing to go through. Their hearts were broken.\n\n<h3>A Brave Decision</h3>\nAfter the fighting stopped and it became a little bit safer, a big question came up.\n\nShould Nia and Mia go back to school? Their school building was hurt. Many things were broken.\n\nAnd the memory of their friends made them sad. It would have been easy to stay home and feel sad.\n\nBut Nia and Mia are very brave. They talked to each other.\n\nThey thought about their friends who were no longer there. They remembered how much their friends loved school too.\n\nThey made a very strong decision. They decided to go back!\n\nThey wanted to learn, not just for themselves, but for their friends too. They wanted to show everyone that even after sad times, hope can grow.\n\n<h3>Why School is a Superpower</h3>\nDid you know that going to school is like having a superpower?\n\nWhen you learn to read, you can read amazing stories and learn about the world. When you learn to write, you can share your thoughts and ideas.\n\nWhen you learn to count, you can help with numbers and understand many things. School helps you grow into a strong and smart person.\n\nIt helps you dream big dreams for your future. For Nia and Mia, going back to school was a way to honour their friends.\n\nIt was a way to keep hope alive in their hearts. They know that learning can help them make their town better someday.\n\nThey want to build a better, peaceful future for everyone. They want to learn how to help people and solve problems.\n\nEvery book they read, every sum they do, makes them stronger.\n\n<h3>Never Give Up!</h3>\nNia and Mia are showing us all how important it is to never give up.\n\nEven when things are tough, holding onto hope is very important. They are going back to school, even when it feels hard.\n\nThey are learning for themselves and for their community. Their story reminds us that education is a precious gift.\n\nIt's a gift that no one can take away from you. It helps you grow and shine brightly, like the sun.\n\nSo, the next time you go to school, think of Nia and Mia. Think of how brave they are and how much they value their learning.\n\nLet's all cherish our schools, our teachers, and our friends. Let's learn and grow and make our Africa an even better place! You are all superstars, just like Nia and Mia!",
    "summary": "Brave twin sisters, Nia and Mia, went back to school after a sad war where they lost friends, showing everyone the power of hope and learning.",
    "whyMatters": "This story matters because it shows us that even after very sad times, we can be brave and go back to school to learn and build a better future, and that education is super important for everyone.",
    "category": "world",
    "date": "2026-01-24T18:23:46.627Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Twin%20Sisters%20Go%20Back%20to%20School!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-twin-sisters-go-back-to-school",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Nelson Mandela's Special Treasures Can Find New Homes!",
    "content": "<h3>Hello, Super Kids!</h3>\nHello, super kids! Are you ready for some exciting news from our big continent, Africa? Today, we are talking about a very special hero. His name is Nelson Mandela. He was a kind and brave man from South Africa. He helped make our world a fairer place for everyone.\n\n<h3>Meet Nelson Mandela, Our Hero!</h3>\nNelson Mandela was like a super kind grandparent to a whole country. He spent his life making sure that all people, no matter their skin colour, were treated equally and had freedom. He taught us to be kind, brave, and to stand up for what is right.\n\n<h3>Nelson Mandela's Special Treasures</h3>\nOur hero, Nelson Mandela, had some very special things. Imagine a key. Not just any key, but a key from the place where he lived for many years. It was a prison. He also had a cool pair of sunglasses. And a shirt that he wore. These were his personal treasures, like your favourite toy or special blanket.\n\n<h3>Why These Things Are So Important</h3>\nThese things are not just old items. Oh no! They are like clues from history. They remind us of Nelson Mandela's big journey. He was in prison because he wanted everyone to be treated fairly. He wanted all people to be friends. The key reminds us that he was brave. The shirt and sunglasses remind us he was a real person, just like us.\n\nDid you know? Nelson Mandela spent 27 long years in prison! That's almost as long as some of your parents have been alive! He was very patient and strong.\n\n<h3>A Daughter's Wish</h3>\nNelson Mandela has a daughter. Her name is Makaziwe. She wanted to sell some of these special items. She thought maybe people all around the world would like to have a piece of history. Imagine having something that belonged to a real hero!\n\n<h3>A Big Disagreement!</h3>\nBut wait! Some grown-ups in charge of South Africa said, \"Hold on!\" These grown-ups are called \"the authorities.\" They are like the big helpers who look after important things for the country. They said these items are very important for South Africa. They said these things are part of the country's special memory box.\n\n<h3>What is 'Heritage'?</h3>\nThis special memory box is called \"heritage.\" Imagine your family has a really old photo album. Or a special toy that your grandma played with. These things are part of your family's heritage. They tell your story. A country's heritage is the same. It's all the important old things that tell the country's story. The authorities felt Mandela's key, sunglasses, and shirt were part of South Africa's amazing heritage.\n\nDid you know? Nelson Mandela's special nickname was \"Madiba.\" It's like calling your grandpa \"Grandpa Bear\" because you love him so much!\n\n<h3>Going to Court</h3>\nWhen people disagree a lot, they sometimes go to a place called a \"court.\" In court, there is a special judge. The judge listens to everyone. They listen to Nelson Mandela's daughter. And they listen to the authorities. Then, the judge makes a decision. It's like a referee in a game, but for rules and laws!\n\n<h3>The Judge's Decision</h3>\nAfter listening very carefully, the judge made a decision. The judge said that Nelson Mandela's daughter *can* sell the key, the sunglasses, and the shirt. This means people can buy them if they want to. They can even be taken out of the country, which is called \"exporting.\"\n\n<h3>Why The Grown-ups Were Worried</h3>\nThe authorities wanted to keep these items safe in South Africa. They wanted them to be in museums. So that all children, like you, could go see them one day. They wanted everyone to remember Nelson Mandela's story right here in Africa. They thought taking them out of the country was not a good idea because they are so special to South Africa.\n\nDid you know? Nelson Mandela won the Nobel Peace Prize! That's a super important award for people who work for peace and happiness in the world.\n\n<h3>How Special Things Are Sold</h3>\nWhen special items like these are sold, it's often at something called an \"auction.\" Imagine lots of people want the same special toy. They all say how much money they will give for it. The person who offers the most money gets the toy! That's a bit like an auction. It’s where special treasures find new homes.\n\n<h3>Why This News is Important For Us</h3>\nThis news helps us remember Nelson Mandela. It helps us think about what is important for a country. Should special things stay in their home country? Or can they go to new homes with people who love history all over the world? It's a tricky question!\n\nDid you know? Nelson Mandela became the first black president of South Africa! This was a huge step for freedom and equality for everyone in the country.\n\n<h3>Always Remembering Our Hero</h3>\nEven if his key, sunglasses, and shirt go to new homes, we will never forget Nelson Mandela. He taught us to be kind. He taught us to be brave. He taught us to fight for what is right, but always with peace in our hearts. He is a true African hero, and his lessons are treasures for all of us. Let's always remember \"Madiba\"!",
    "summary": "A judge has said that some special items belonging to African hero Nelson Mandela, like his prison key and sunglasses, can be sold by his daughter, even though the country's grown-ups wanted to keep them in South Africa.",
    "whyMatters": "This news is important because it makes us think about how we keep and remember the stories of our heroes, and if special things from history should stay in their home country or be shared with the world to inspire everyone.",
    "category": "world",
    "date": "2026-01-24T18:24:08.555Z",
    "image": "https://image.pollinations.ai/prompt/Nelson%20Mandela's%20Special%20Treasures%20Can%20Find%20New%20Homes!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nelson-mandelas-special-treasures-can-find-new-homes",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:24:13.723Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "LIVE: Villarreal vs Real Madrid – La Liga",
    "title": "Get Ready for Football Fun! Real Madrid vs. Villarreal!",
    "content": "Hello, football friends! Do you love kicking a ball? Do you cheer loudly for your favourite teams? In Africa, football is magic! It brings big smiles and lots of excitement. Today, we're talking about a super exciting game happening far, far away in a country called Spain. It's between two teams called Real Madrid and Villarreal!\n\n<h3>What is La Liga?</h3>\nImagine your school has many sports teams. They all play against each other to see who is the best. Well, in Spain, there is a big football competition called La Liga. Many famous teams play in La Liga. They play games almost every week!\n\nOur game today, Real Madrid vs. Villarreal, is one of those special La Liga matches. It's where teams show how strong they are and try to win important points. Points help them climb to the top of the league table, just like getting good grades in school helps you do well!\n\nDid you know? La Liga means \"The League\" in Spanish! It's like a big football family where everyone competes.\n\n<h3>Meet the Mighty Real Madrid!</h3>\nFirst, let's talk about Real Madrid. Have you ever seen a team wear sparkling white shirts? That's Real Madrid! They are like superheroes of football. They come from a big, beautiful city called Madrid in Spain.\n\nReal Madrid has won so many big trophies, more than almost any other team in the world! They have amazing players who can kick the ball so fast and score incredible goals. Everyone knows Real Madrid because they are so, so good! They always try their best to win every game.\n\nMany children in Africa dream of playing for a team like Real Madrid one day. They train hard and watch these games to learn from the best players. It's a wonderful dream to have!\n\nDid you know? Real Madrid's stadium is called the Santiago Bernabéu, and it's enormous! Thousands of fans can watch games there, cheering very loudly.\n\n<h3>Meet the Brave Villarreal!</h3>\nNow, let's meet their opponents, Villarreal! Villarreal wears bright yellow shirts, like happy sunshine! People sometimes call them the 'Yellow Submarine'. This is because of their yellow colours and because they are very clever, like a submarine swimming under the water and popping up to surprise you!\n\nVillarreal comes from a smaller town in Spain, but they are very strong. They play with a lot of heart and always give Real Madrid a tough time. They might not win as many trophies as Real Madrid, but they are a very exciting team to watch because they never give up! They work together as a team to try and win.\n\nDid you know? The nickname 'Yellow Submarine' comes from a famous song by a band called The Beatles! It's a very catchy song.\n\n<h3>Getting Ready for the Big Game!</h3>\nBefore the game starts, there's always a lot of excitement! It's like before a big party. Everyone is getting ready! This is called the 'live build-up.' Reporters tell us all the news. They tell us which players will be starting the game – like who will be the goalkeeper, who will play in the middle, and who will try to score goals.\n\nThis is called 'team news coverage.' It's important to know who is playing so we can cheer for our favourites! Everyone wants their team to have the best players on the field. Sometimes a favourite player might be hurt, and then another player gets a chance to play! It's all part of the football story.\n\nDid you know? Team news can change right up until the last minute if a player feels unwell or gets a small injury!\n\n<h3>How We Follow the Game</h3>\nMaybe you can't watch the game on a big TV. But guess what? You can still follow along! Sometimes, people listen to the game on the radio, or they read about it on a phone or computer. This is called a 'text commentary stream.'\n\nIt's like someone telling you a story of the game, minute by minute! They tell you when someone kicks the ball, when there's a good save, or when a goal is scored. It makes you feel like you are right there, even if you are far away in Africa! It helps you imagine all the action.\n\nDid you know? Many people in Africa listen to football matches on the radio! It's a wonderful way to enjoy the game together, and sometimes the commentators are very funny and exciting.\n\n<h3>Why We Love Football!</h3>\nFootball is amazing because it connects us all. Even though these teams are from Spain, we can still enjoy watching them play. It teaches us about teamwork, trying your best, and never giving up. These are good lessons for school and for life!\n\nMaybe one day, a talented boy or girl from Africa will play for one of these big teams! Dreaming big is part of the fun of football. It shows us that with hard work, anything is possible. We can cheer for players from all over the world!\n\nSo, whether you cheer for the white shirts of Real Madrid or the yellow shirts of Villarreal, remember to enjoy the beautiful game. Football brings joy, excitement, and big smiles to everyone. Let's get ready for some football magic!",
    "summary": "Join us for exciting football fun as we learn about a big game in Spain between the famous Real Madrid and the brave Villarreal, exploring how teams prepare and how we can follow all the action!",
    "whyMatters": "This is important because football brings joy and teaches us about teamwork, hard work, and dreaming big, connecting children in Africa to exciting games and famous teams from all over the world.",
    "category": "world",
    "date": "2026-01-24T18:24:35.166Z",
    "image": "https://image.pollinations.ai/prompt/Get%20Ready%20for%20Football%20Fun!%20Real%20Madrid%20vs.%20Villarreal!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "get-ready-for-football-fun-real-madrid-vs-villarreal",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/1/24/live-villarreal-vs-real-madrid-la-liga?traffic_source=rss"
  },
  {
    "originalTitle": "US federal agents shoot and kill another person in Minneapolis",
    "title": "US federal agents shoot and kill another person in Minneapolis",
    "content": "Footage circulating on social media shows US officers wrestling a person to the ground before several shots ring out.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:24:40.338Z",
    "image": "https://image.pollinations.ai/prompt/US%20federal%20agents%20shoot%20and%20kill%20another%20person%20in%20Minneapolis%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-federal-agents-shoot-and-kill-another-person-in-minneapolis",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/us-federal-agents-shoot-another-person-in-minneapolis-governor?traffic_source=rss"
  },
  {
    "originalTitle": "Trump threatens 100 percent tariff on Canada over China deal",
    "title": "Trump threatens 100 percent tariff on Canada over China deal",
    "content": "Donald Trump's threat comes after Canada reached deal with China last week on trade of agriproducts, electric vehicles.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:24:45.510Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20100%20percent%20tariff%20on%20Canada%20over%20China%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-100-percent-tariff-on-canada-over-china-deal",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/trump-threatens-100-percent-tariff-on-canada-over-china-deal?traffic_source=rss"
  },
  {
    "originalTitle": "Trump threatens Canada with 100% tariffs over China trade deal",
    "title": "Trump threatens Canada with 100% tariffs over China trade deal",
    "content": "Trump made the threat in a social media post as tensions rise between the US and its northern neighbour.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:24:51.180Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20Canada%20with%20100%25%20tariffs%20over%20China%20trade%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-canada-with-100percent-tariffs-over-china-trade-deal",
    "originalLink": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Two days of peace talks end as Russia continues Ukraine attacks",
    "title": "Two days of peace talks end as Russia continues Ukraine attacks",
    "content": "There is no apparent breakthrough as the three-way talks conclude and Russia maintains its bombardment.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:24:56.350Z",
    "image": "https://image.pollinations.ai/prompt/Two%20days%20of%20peace%20talks%20end%20as%20Russia%20continues%20Ukraine%20attacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-days-of-peace-talks-end-as-russia-continues-ukraine-attacks",
    "originalLink": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How Soviet urban planning is helping Russia freeze Ukraine",
    "title": "How Soviet urban planning is helping Russia freeze Ukraine",
    "content": "Thousands of people are affected when heating plants are targeted by Russian forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:25:01.515Z",
    "image": "https://image.pollinations.ai/prompt/How%20Soviet%20urban%20planning%20is%20helping%20Russia%20freeze%20Ukraine%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-soviet-urban-planning-is-helping-russia-freeze-ukraine",
    "originalLink": "https://www.bbc.com/news/articles/c338jpk8r1vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ref's 'courageous' call denies Man City penalty on Premier League debut",
    "title": "Ref's 'courageous' call denies Man City penalty on Premier League debut",
    "content": "Referee Farai Hallam was praised for choosing not to award Manchester City a penalty against Wolves on his Premier League debut.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-24T18:25:07.132Z",
    "image": "https://image.pollinations.ai/prompt/Ref's%20'courageous'%20call%20denies%20Man%20City%20penalty%20on%20Premier%20League%20debut%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "refs-courageous-call-denies-man-city-penalty-on-premier-league-debut",
    "originalLink": "https://www.bbc.com/sport/football/articles/c4g477krp2go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "From 'impossible task' to 'hope' - will West Ham stay up?",
    "title": "From 'impossible task' to 'hope' - will West Ham stay up?",
    "content": "Back-to-back Premier League wins have taken West Ham United to within two points of 17th.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:25:12.304Z",
    "image": "https://image.pollinations.ai/prompt/From%20'impossible%20task'%20to%20'hope'%20-%20will%20West%20Ham%20stay%20up%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "from-impossible-task-to-hope-will-west-ham-stay-up",
    "originalLink": "https://www.bbc.com/sport/football/articles/cpdy88wlwpjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mead and Caldentey star as Arsenal triumph over Chelsea",
    "title": "Mead and Caldentey star as Arsenal triumph over Chelsea",
    "content": "Beth Mead puts Arsenal in front in the 55th minute before Mariona Caldentey completes a 2-0 victory for the Gunners at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T18:25:17.463Z",
    "image": "https://image.pollinations.ai/prompt/Mead%20and%20Caldentey%20star%20as%20Arsenal%20triumph%20over%20Chelsea%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mead-and-caldentey-star-as-arsenal-triumph-over-chelsea",
    "originalLink": "https://www.bbc.com/sport/football/videos/cp8252gqp5po?at_medium=RSS&at_campaign=rss"
  }
]