[
  {
    "originalTitle": "Eswatini angers Madagascar junta for hosting deposed leader",
    "title": "Eswatini angers Madagascar junta for hosting deposed leader",
    "content": "Eswatini says the talks were part of regional diplomacy and not an attempt to interfere.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:53:23.368Z",
    "image": "https://image.pollinations.ai/prompt/Eswatini%20angers%20Madagascar%20junta%20for%20hosting%20deposed%20leader%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eswatini-angers-madagascar-junta-for-hosting-deposed-leader",
    "originalLink": "https://www.bbc.com/news/articles/c9v0pgj0xw2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "New video game sees Africans fantasise about taking back looted treasures",
    "title": "New video game sees Africans fantasise about taking back looted treasures",
    "content": "Imagine it is 2099 and a historic treaty to return African artefacts is falling apart.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:53:28.510Z",
    "image": "https://image.pollinations.ai/prompt/New%20video%20game%20sees%20Africans%20fantasise%20about%20taking%20back%20looted%20treasures%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "new-video-game-sees-africans-fantasise-about-taking-back-looted-treasures",
    "originalLink": "https://www.bbc.com/news/articles/clyg4lgm1d2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Migrant boat capsizes off Libya leaving 53 dead",
    "title": "Sad News from the Sea: Remembering Friends and Helping Hands",
    "content": "<h3>Hello, Brave Listeners and Curious Kids!</h3>\n\nHello, everyone! It’s your kid-friendly news reporter here, bringing you important stories from our amazing continent of Africa and beyond. Today, we have some sad news to share, but it’s also a chance to learn about kindness and helping each other. Sometimes, sad things happen, but we can always learn to be more caring and understand our world better.\n\nImagine a big, big blue ocean, like the ones you might see in pictures or even visit with your family. This ocean connects many countries. Sometimes, people need to travel across this big ocean to find a new, safer place to live. Today, we're talking about a part of the sea near a country called Libya, which is in North Africa.\n\n<h3>What Happened Far Away on the Big Sea?</h3>\n\nNot long ago, a very sad thing happened on that big sea near Libya. A boat, carrying many people, tipped over and sank. This is called 'capsizing.' When a boat capsizes, it means it turns upside down or on its side, and the people inside fall into the water. It’s very dangerous, especially when the boat is small and the sea is big and wavy.\n\nVery sadly, 53 people lost their lives in this accident. That’s like a whole classroom full of your friends, and even more. It’s a very big number, and it makes us feel very sad to think about it. These people were looking for a better and safer home, and their journey ended in a very tragic way.\n\n<h3>Who Are Our Friends on These Boats?</h3>\n\nThe people on these boats are often called 'migrants.' What does that mean? Well, imagine your family moving from one town to another, or even to a new country. You might move because your parents get a new job, or because you want to live closer to family. Migrants are people who move from their home country to another country.\n\nSometimes, people move because they are looking for a safer place. Maybe their homes are not safe anymore, or they don't have enough food, or they can't go to school. They dream of a new place where they can be safe, go to school, and have a good life. So, they try to travel to these new places, often taking very long and difficult journeys, like across the big sea.\n\nDid you know? People have been moving to new places for thousands of years! Sometimes it’s for adventure, sometimes it’s to find food, and sometimes it’s to find peace and safety.\n\n<h3>The Big Blue Sea Journey from Libya</h3>\n\nLibya is a country in North Africa, right next to the Mediterranean Sea. This sea is a very busy place, connecting Africa, Europe, and Asia. For many people hoping to find a new home in Europe, the journey often starts from the coast of Libya.\n\nBut the sea journey is very, very dangerous. The boats they travel in are often too small and not safe enough for such a long trip. The sea can be very rough, with big waves that can easily flip over a small boat. There are no roads or signs on the sea, and it's easy to get lost. It’s a bit like trying to cross a very wide, wild river in a tiny paper boat – super risky!\n\nDid you know? The Mediterranean Sea is one of the busiest shipping routes in the world! Many big cargo ships and cruise liners sail there every day. But for small, unsafe boats, it can be a very dangerous place.\n\n<h3>Who Helps Our Friends? Meet the IOM!</h3>\n\nThere are kind people and organizations in the world who try to help. One very important group is called the IOM. That stands for the International Organization for Migration. It’s like a team of superheroes who work to help people who are moving from one place to another. They are like very helpful big brothers and sisters to people on these difficult journeys.\n\nWhat do they do? The IOM tries to keep track of people who are traveling. They help families find each other, and they try to make sure people are safe. They also count how many people have been hurt or gone missing during these journeys. They tell the world about these sad numbers so that everyone knows how dangerous these trips can be and so we can all work together to find safer ways for people to move.\n\nDid you know? The IOM works in over 100 countries around the world! They have thousands of staff members who are dedicated to helping migrants, no matter where they are from or where they are going.\n\n<h3>Why Are Numbers Important?</h3>\n\nThe IOM told us something else very sad. So far this year, almost 500 people have either died or gone missing in the sea near Libya. Imagine that! 500 people is like having ten classrooms full of children, or even more. That’s a huge number of lives lost.\n\nEach one of those 500 people was a son, a daughter, a mother, a father, a brother, or a sister. They had dreams, just like you and me. They wanted to find a safe home and a happy life. When we hear these numbers, it reminds us that every person counts, and that every life is precious. It makes us think about how we can make our world a kinder and safer place for everyone.\n\n<h3>What Can We Learn from This Sad News?</h3>\n\nEven though this news is sad, it teaches us very important lessons. It teaches us about courage – the courage of people who try to find a better life. It teaches us about the dangers they face. Most importantly, it teaches us about kindness and helping others.\n\nWe can learn to be kind to everyone, no matter where they come from. We can think about how important it is for everyone to have a safe home and food to eat. When we grow up, maybe some of us can become people who help others, just like the IOM!\n\n<h3>Let's Be Kind and Hopeful!</h3>\n\nSo, my brave listeners, let’s always remember to be kind to each other. Let’s think about how we can help people in our own communities and around the world. Every small act of kindness makes our world a little bit brighter. Stay safe, stay kind, and keep learning! We'll be back soon with more news from Africa and beyond. Bye for now!\n",
    "summary": "A sad boat accident near Libya claimed 53 lives, adding to almost 500 people lost this year while trying to cross the sea for a safer home, and groups like IOM are working to help.",
    "whyMatters": "This story is important because it shows us that many people are looking for a safe place to live, and sometimes their journeys are very dangerous, reminding us to be kind and help others.",
    "category": "world",
    "date": "2026-02-10T10:53:48.434Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20the%20Sea%3A%20Remembering%20Friends%20and%20Helping%20Hands%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-the-sea-remembering-friends-and-helping-hands",
    "originalLink": "https://www.bbc.com/news/articles/cy9ge3844q0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israel used weapons in Gaza that made thousands of Palestinians evaporate",
    "title": "Israel used weapons in Gaza that made thousands of Palestinians evaporate",
    "content": "US-made thermal weapons burning at 3,500C caused 2,842 people to \"evaporate\" in Gaza, Al Jazeera Investigation finds.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:53:53.638Z",
    "image": "https://image.pollinations.ai/prompt/Israel%20used%20weapons%20in%20Gaza%20that%20made%20thousands%20of%20Palestinians%20evaporate%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israel-used-weapons-in-gaza-that-made-thousands-of-palestinians-evaporate",
    "originalLink": "https://www.aljazeera.com/features/2026/2/10/israel-used-weapons-in-gaza-that-made-thousands-of-palestinians-evaporate?traffic_source=rss"
  },
  {
    "originalTitle": "LIVE: Pakistan vs USA – T20 World Cup",
    "title": "Big Cricket Fun: Pakistan vs. USA in the World Cup!",
    "content": "<h3>Hello from Your Kid Reporter!</h3>\nHi everyone! It's me, your kid news reporter from Africa! I hope you are having a super day. Today, we have some very exciting news to share. We are going to talk about a very big game. It is a game played with a special bat and a ball. Lots of people around the world love it so much.\n\n<h3>What is Cricket?</h3>\nSo, what is this game called cricket? Imagine playing catch and running around with your friends. Cricket is a bit like that, but much bigger and more organized! It is a sport where two teams play against each other. Each team tries very hard to score more points than the other team. They use a special flat bat and a hard ball. The game has special rules and many players. It is super fun to watch and even more fun to play!\n\n**Did you know?** Cricket balls are very hard and can fly super fast when someone throws them!\n\n<h3>The Big World Cup Game!</h3>\nToday, we are talking about a very special game. It is part of something called the T20 World Cup. A \"World Cup\" is like a huge party for sports. Teams from many different countries come together to play. They want to see who is the best team in the whole wide world! T20 means the game is super-fast. It does not take all day to play. Kids love fast games, don't they? They are full of excitement and action from start to finish.\n\n<h3>Who is Playing Today?</h3>\nIn today's special game, two amazing teams are playing. One team is from a country called Pakistan. Pakistan is a big country far, far away. Many people there love cricket very, very much. They have some very good and strong players. The other team is from a country called the USA. The USA is also a very big country. They are trying hard to get better and better at cricket. This game is very important for both teams. They both want to win this match to go further in the World Cup!\n\n**Did you know?** Pakistan has won the T20 World Cup before! They are a very strong team in cricket.\n\n<h3>How Do They Play?</h3>\nIn cricket, one team bats first. This means their players hit the ball with their bat. They try to score \"runs.\" Runs are like points in a game. The other team tries to get the players \"out.\" They do this by catching the ball after it is hit. Or by hitting some wooden sticks called \"wickets\" with the ball. When a player is out, another player comes to bat. After a certain time, the teams swap roles. The team that was batting now fields. And the team that was fielding now bats. The team with the most runs at the end wins! It is a game of great skill and clever planning.\n\n<h3>Before the Game Starts!</h3>\nBefore the game starts, there is something called a \"toss.\" What is a toss? It is when the team captains flip a coin! Just like when you flip a coin to decide something with your friends. The captain who wins the toss gets to choose first. They can choose if their team will bat first or field first. This is a very important choice! It can change how the whole game plays out. After the toss, we learn which players are in each team. Each team has eleven players on the field. They all wear special uniforms that show their country's colors. Then, it's time for the game to begin!\n\n<h3>Lots of Fun and Teamwork!</h3>\nCricket is not just about one person. It is about a whole team working together as friends. The batter needs to hit the ball well and run fast. The bowler needs to throw the ball well and cleverly. The fielders need to catch the ball and throw it back quickly. Everyone has a very important job to do. Just like in your games at school! When everyone works together, the team is strong and happy. They cheer for each other and help each other. It is a beautiful thing to see. Learning to play together as a team is so important for everyone.\n\n**Did you know?** There are special big moves in cricket! Like a \"six\" when the batter hits the ball so hard it goes out of the stadium. That scores 6 big runs!\n\n<h3>Did You Know? Cool Cricket Facts!</h3>\nHere are some more cool facts about cricket! The game of cricket has been played for a very, very long time. It started in a country called England many years ago. Now, people play it all over the world, even in countries like ours. Countries like India, Australia, South Africa, and the West Indies love it too. Some cricket games can last for many, many days! But T20 games are much shorter and faster. They only last a few hours, which makes them very exciting and full of action. There are special people called umpires who watch the game very carefully. They make sure everyone follows all the rules. They are like the referees in football games.\n\n**Did you know?** The special strip of grass where the game is played, called the pitch, is about 22 big steps long!\n\n<h3>Why We Love Games!</h3>\nGames like the T20 World Cup bring people together from all over the world. They make us cheer loudly for our favorite teams and players. We learn about different countries and their cultures through sports. We see amazing sportsmanship, where players are fair and respectful. It teaches us about winning and losing with grace. But most importantly, it teaches us about trying our very best every single time. It shows us how much fun sports can be for everyone. So, whether you are playing games with friends or watching a big match, remember to always have fun! Let's all cheer for Pakistan and USA today! May the best team win this exciting cricket match! I hope you learned something new and exciting today. See you next time for more kid news!",
    "summary": "Two cricket teams, Pakistan and USA, are playing an exciting T20 World Cup match today, full of fast-paced action and teamwork.",
    "whyMatters": "This game matters because it helps teams move forward in the big World Cup to become champions, and it brings people together from different countries to enjoy a fun sport.",
    "category": "world",
    "date": "2026-02-10T10:54:15.810Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Cricket%20Fun%3A%20Pakistan%20vs.%20USA%20in%20the%20World%20Cup!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-cricket-fun-pakistan-vs-usa-in-the-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/2/10/live-pakistan-vs-united-states-t20-world-cup?traffic_source=rss"
  },
  {
    "originalTitle": "People displaced by South Sudan fighting wait for aid at remote camp",
    "title": "People displaced by South Sudan fighting wait for aid at remote camp",
    "content": "Displaced civilians in South Sudan have fled heavy fighting between government forces and opposition fighters.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-10T10:54:20.939Z",
    "image": "https://image.pollinations.ai/prompt/People%20displaced%20by%20South%20Sudan%20fighting%20wait%20for%20aid%20at%20remote%20camp%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "people-displaced-by-south-sudan-fighting-wait-for-aid-at-remote-camp",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/10/people-displaced-by-south-sudan-fighting-wait-for-aid-at-remote-camp?traffic_source=rss"
  },
  {
    "originalTitle": "Maxwell refuses to answer questions about Epstein in congressional hearing",
    "title": "Maxwell refuses to answer questions about Epstein in congressional hearing",
    "content": "A video released by members of Congress shows Maxwell, the jailed associate of Jeffrey Epstein, refusing to answer questions about the late sex offender.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-10T10:54:26.477Z",
    "image": "https://image.pollinations.ai/prompt/Maxwell%20refuses%20to%20answer%20questions%20about%20Epstein%20in%20congressional%20hearing%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "maxwell-refuses-to-answer-questions-about-epstein-in-congressional-hearing",
    "originalLink": "https://www.bbc.com/news/articles/cvgv5yre39zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump threatens to block opening of US-Canada bridge",
    "title": "Trump threatens to block opening of US-Canada bridge",
    "content": "The Gordie Howe International Bridge, which connects Michigan to Ontario, is set to open this year.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:54:31.608Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20to%20block%20opening%20of%20US-Canada%20bridge%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-to-block-opening-of-us-canada-bridge",
    "originalLink": "https://www.bbc.com/news/articles/cpw052pkvl0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
    "title": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
    "content": "Wasserman's flirtatious emails to Ghislaine Maxwell were revealed in the Epstein files.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-10T10:54:36.738Z",
    "image": "https://image.pollinations.ai/prompt/Chappell%20Roan%20leaves%20talent%20agency%20led%20by%20Casey%20Wasserman%20after%20Epstein%20fallout%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chappell-roan-leaves-talent-agency-led-by-casey-wasserman-after-epstein-fallout",
    "originalLink": "https://www.bbc.com/news/articles/cewz1keql5no?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'You love Kobbie' - Mainoo showing Amorim why so many do",
    "title": "'You love Kobbie' - Mainoo showing Amorim why so many do",
    "content": "Why Manchester United midfielder Kobbie Mainoo is proving Ruben Amorim was wrong to keep ignoring him.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:54:42.555Z",
    "image": "https://image.pollinations.ai/prompt/'You%20love%20Kobbie'%20-%20Mainoo%20showing%20Amorim%20why%20so%20many%20do%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "you-love-kobbie-mainoo-showing-amorim-why-so-many-do",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg83g4zyllo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Great attitude but goals have dried up - what's happened to Woltemade?",
    "title": "Great attitude but goals have dried up - what's happened to Woltemade?",
    "content": "After an impressive start to life at Newcastle, what has happened to Nick Woltemade?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:54:47.701Z",
    "image": "https://image.pollinations.ai/prompt/Great%20attitude%20but%20goals%20have%20dried%20up%20-%20what's%20happened%20to%20Woltemade%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "great-attitude-but-goals-have-dried-up-whats-happened-to-woltemade",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxg63vn67vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Lyon loan helping 'explosive' Endrick's World Cup 'dream' with Brazil",
    "title": "Lyon loan helping 'explosive' Endrick's World Cup 'dream' with Brazil",
    "content": "Real Madrid striker Endrick's impact on loan at Lyon has been immediate, and is fuelling the teenager's \"dream\" of playing for Brazil at the World Cup.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T10:54:52.829Z",
    "image": "https://image.pollinations.ai/prompt/Lyon%20loan%20helping%20'explosive'%20Endrick's%20World%20Cup%20'dream'%20with%20Brazil%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lyon-loan-helping-explosive-endricks-world-cup-dream-with-brazil",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjrqd10722xo?at_medium=RSS&at_campaign=rss"
  }
]