[
  {
    "originalTitle": "Powerful cyclone kills at least 31 as it tears through Madagascar port",
    "title": "A Big Wind Visits Madagascar: How Friends Are Helping!",
    "content": "<h3>Hello, Amazing Friends from Across Africa!</h3>\n\nHello, amazing friends! I'm your friendly news reporter for Africa, ready to tell you an important story from a special island country. Today, we're going to talk about a beautiful place called Madagascar. Have you ever heard of it? It's a very big island, full of wonderful animals like lemurs, which you can't find anywhere else in the world! It's a place with sunny beaches and tall, green trees. But sometimes, nature can be very powerful, and big storms come to visit. This is a story about one of those storms and how people are helping each other.\n\n<h3>What is a Cyclone?</h3>\n\nDid you know what a cyclone is? Imagine a super, super big spinning wind! It's like a giant top spinning really, really fast in the sky, over the warm ocean water. These big winds bring lots and lots of rain with them too. We call these big storms by different names, like hurricanes or typhoons, depending on where they are in the world. But they all mean a very strong wind and heavy rain that can make a big splash!\n\nDid you know? Cyclones get their power from warm ocean water. The warmer the water, the stronger they can become!\n\n<h3>A Big Storm Hits Madagascar</h3>\n\nRecently, a very, very strong cyclone visited Madagascar. Its name was Cyclone Gamane. This storm brought incredibly powerful winds – winds so strong they could push over almost anything! It also brought buckets and buckets of rain, pouring down for many days and nights. Imagine rain that just keeps falling and falling! The wind was like a giant invisible hand pushing everything around with all its might. It was a very scary time for many people living there.\n\n<h3>What Happened to Homes and Roads?</h3>\n\nWhen Cyclone Gamane roared through, it caused a lot of trouble, especially in a town called Antalaha. Imagine your house, but without its roof! The strong winds ripped off many, many roofs. News reports say that ninety percent (that's almost all!) of the roofs in some places were blown away. This means that many families don't have a safe, dry place to sleep right now. It's very sad because roofs protect us from the sun and the rain. Without them, it's very hard to stay warm and dry.\n\nAnd imagine big, big trees falling down! Many tall trees were pulled right out of the ground by their roots. We call this \"uprooted.\" These huge, fallen trees blocked the roads. Roads are like the paths for cars, buses, and people to travel. When they are blocked, it means people cannot drive to help others, or get food, water, or important medicines to the towns that need them. We say the roads are \"inaccessible\" – which means you can't get to them at all. It makes helping very, very difficult.\n\nEven the tall poles that carry electricity fell down. These power poles help us have lights in our homes and charge our phones and school tablets. When they are down, many homes have no electricity. It can be very scary and dark without lights, especially at night. Sadly, because of this very big and powerful storm, some people even lost their lives. This makes many, many families very, very sad. And many other people had to leave their homes to find a safer place to stay until the storm passed.\n\n<h3>How Are People Helping?</h3>\n\nBut even when things are tough, people are kind and strong! People in Madagascar are helping each other, showing what it means to be good neighbors. Neighbors are looking after neighbors, sharing what little they have and comforting each other. Did you know that helping hands make heavy loads lighter? It's true!\n\nPeople are working very hard to clear the fallen trees and other things from the roads so that help can get through. Other good people, from different helper groups and countries, are sending important things like food and clean water. They are also sending blankets to keep people warm and special tents for people who lost their homes to have a place to sleep. It takes a lot of hard work to fix everything after such a big storm, but everyone is working together like a big team. They are showing great courage and kindness.\n\n<h3>Learning About Madagascar</h3>\n\nLet's learn some more fun facts about Madagascar! Did you know Madagascar is the fourth largest island in the whole world? It's bigger than many countries! It is home to many unique animals and plants that you cannot find anywhere else. Besides the cute lemurs with their big eyes and long tails, there are amazing chameleons that can change their colors to hide! There are also tall baobab trees that look like they are growing upside down!\n\nDid you know? Madagascar is also famous for growing vanilla, which makes our ice cream and cakes taste so yummy! The people of Madagascar are very strong and resilient, which means they are very good at bouncing back after challenges. They love their beautiful island and will work hard to make it bright and green again.\n\n<h3>Staying Safe in Big Storms</h3>\n\nWhat should you do if there's a big storm where you live? It's super important to listen to your grown-ups – your parents, teachers, or guardians. They will tell you what to do to stay safe. Sometimes, you might need to go to a special, safer place, like a community hall or a stronger building. Always stay inside your home and away from windows during a strong storm, because things can fly around outside. And remember, big storms don't last forever. After the storm, when a grown-up says it's safe, you can come out and help tidy up if you're able to. We can all be little helpers!\n\n<h3>Looking to the Future</h3>\n\nThe people of Madagascar are working very hard right now. They are clearing the roads, fixing their homes, and helping their friends and families. It will take some time, but with their bravery and hard work, they will make their communities strong and beautiful again. It's important to remember that even after big problems, things can get better. With kindness, teamwork, and a lot of hope, they can rebuild. We send our love and strength to all our friends in Madagascar! They are brave, and they will shine bright again, just like the sun after a big rain.",
    "summary": "A very strong wind and rain storm, called a cyclone, hit a country in Africa called Madagascar, making many homes sad and roads hard to use, but people are helping each other.",
    "whyMatters": "This story matters because it shows how powerful nature can be and how important it is for everyone to help when friends are in trouble, so they can feel safe and rebuild their homes.",
    "category": "world",
    "date": "2026-02-12T04:21:20.102Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Wind%20Visits%20Madagascar%3A%20How%20Friends%20Are%20Helping!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-wind-visits-madagascar-how-friends-are-helping",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "title": "South African Epstein survivor calls on UK Royal Family to search Andrew's files",
    "content": "Juliette Bryant has called on the Palace to \"act\" on revelations about Andrew's relationship with Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:21:25.216Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20Epstein%20survivor%20calls%20on%20UK%20Royal%20Family%20to%20search%20Andrew's%20files%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-epstein-survivor-calls-on-uk-royal-family-to-search-andrews-files",
    "originalLink": "https://www.bbc.com/news/articles/cvg5ww8lq9zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghanaians embrace 'Fugu Day' after online mockery of traditional outfits",
    "title": "Ghanaians embrace 'Fugu Day' after online mockery of traditional outfits",
    "content": "The iconic attire has been trending online for days following the banter between Ghanaians and Zambians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-12T04:21:30.342Z",
    "image": "https://image.pollinations.ai/prompt/Ghanaians%20embrace%20'Fugu%20Day'%20after%20online%20mockery%20of%20traditional%20outfits%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanaians-embrace-fugu-day-after-online-mockery-of-traditional-outfits",
    "originalLink": "https://www.bbc.com/news/articles/cgqg8xegxqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Three children killed in drone strike on mosque in central Sudan: Doctors",
    "title": "Let's Wish for Peace in Sudan!",
    "content": "<h3>Hello, Friends! Your Africa Reporter Here!</h3>\nHello everyone! It's your friendly Africa Reporter, bringing you news from our amazing continent! My name is your Africa Reporter, and I love sharing stories about all the wonderful places and people here. Today, I have some news from a country called Sudan. It's a big, beautiful country in Africa, just like our home. Sometimes, sad things happen even in lovely places, and it's important to know about them so we can all wish for a better tomorrow and help where we can.\n\n<h3>What Happened in Sudan?</h3>\nNot long ago, something very sad happened in Sudan. In a special building called a mosque, some children were there. A mosque is like a church or a temple; it's a peaceful place where people go to pray, think, and feel close to God. Sadly, a 'drone' came and hurt some people, including three children. This made many people very, very sad.\n\nWe hear this sad news from very kind helpers called 'doctors'. They are like the nurses and doctors who help us feel better when we are sick or need help. These doctors in Sudan are working very hard to help everyone who is hurt and to tell the world what is happening so that people can get help.\n\n<h3>What is a Drone?</h3>\nDid you know what a 'drone' is? Imagine a very big toy aeroplane or a flying toy car, but it doesn't have a person sitting inside to fly it. Someone flies it from far away using a special remote control, just like you might fly a toy helicopter or a remote control car! Drones can be used for many things, like taking cool pictures from high up in the sky, or even delivering packages like a flying postman!\n\nBut sometimes, sadly, drones are used in wars to cause harm and hurt things or people. And that is what happened in Sudan. When drones are used for fighting, they are not toys anymore, and they can cause a lot of sadness and hurt.\n\n<h3>Who are the Doctors Helping?</h3>\nThe kind people telling us this news are from the 'Sudan Doctors Network'. Think of them as a team of superheroes in white coats! They are doctors and nurses who work together to help people who are sick or hurt. When sad things like this happen, these doctors rush to help everyone, whether they are tiny babies, young children like you, or grandmas and grandpas. They work very hard to make sure people get medicine and feel safe.\n\n**Did you know?** Doctors often have to work very long hours when there is trouble, and they are very brave helpers! They also tell the world when sad things happen, so everyone knows and can wish for peace and send help.\n\n<h3>Why is There Fighting? (Simply Explained)</h3>\nSometimes, grown-ups in different groups in a country disagree very, very strongly about important things. These disagreements can get so big that they start fighting. In Sudan, there are two big groups who are fighting. One group is called the 'Rapid Support Forces'. You can think of them like special soldiers, but they are not the main army of the country. They are a different group who have weapons.\n\nWhen groups fight, it's very scary and sad for everyone, especially for children. Buildings can get broken, and people can get hurt. This is why everyone hopes for peace, so the fighting can stop and all the children and families can be safe again. It's hard to play and learn when there is fighting around.\n\n<h3>Did You Know About Sudan?</h3>\nSudan is a really interesting and special country! It's full of history and beautiful places.\n*   **Did you know?** Sudan is in North-East Africa, and it's one of the biggest countries on our amazing continent! It has hot deserts and green lands.\n*   **Did you know?** The River Nile, one of the longest rivers in the whole world, flows right through Sudan! People love to live by the river because it helps plants grow and provides water.\n*   **Did you know?** Sudan has pyramids, just like Egypt! They are very, very old and tell stories of kings and queens from long, long ago. They are called the Pyramids of Meroë.\n*   **Did you know?** People in Sudan speak a language called Arabic, and they love to tell stories, listen to music, and sing beautiful songs. They are known for their warm welcome.\n*   **Did you know?** Many children in Sudan love to play football, just like you! They also enjoy traditional games with their friends and family, and going to school to learn is very important to them.\n\n<h3>What Can We Do?</h3>\nEven though we are far away, we can still do important things to help and show we care.\n*   First, we can think kind thoughts for the children and their families in Sudan. It's like sending them a warm, imaginary hug and wishing them safety and comfort. Thinking kind thoughts can make a difference!\n*   Second, we can learn about countries like Sudan. The more we learn, the more we understand and care about our friends across Africa. We are all part of one big African family.\n*   Third, we can always, always try to be kind to each other in our own homes and schools. When we are kind, we help spread peace right where we are. Imagine if everyone in the world chose kindness! There would be no fighting, only happy hearts.\n\nHelpers from all over the world, like big organisations, are also trying very hard to send food, clean water, medicine, and blankets to help the people in Sudan. They are trying to make sure children can go to school safely and have safe places to play and just be kids.\n\n<h3>Wishing for Peace</h3>\nIt's very sad when children get hurt, especially in places that should be peaceful and safe like a mosque. This reminds us how important peace is. Peace means no fighting, no sadness, and everyone being safe and happy together. It means children can play, learn, and grow up without fear.\n\nWe should all wish for peace in Sudan, and for all children everywhere to be safe, healthy, and happy. Let's send our best wishes and hopes for all the children and families in Sudan. May they find peace and comfort very soon, and may their country be safe and strong once again. Thank you for listening, my friends, and remember to always choose kindness!",
    "summary": "Three children were sadly hurt in a drone strike at a mosque in Sudan, and doctors are asking for help and peace for everyone in the country.",
    "whyMatters": "This is important because it teaches us about children in other parts of Africa who are hurting, and it reminds us to wish for peace and kindness everywhere so all children can be safe and happy.",
    "category": "technology",
    "date": "2026-02-12T04:21:52.243Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Wish%20for%20Peace%20in%20Sudan!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-wish-for-peace-in-sudan",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/three-children-killed-in-drone-strike-on-mosque-in-central-sudan-doctors?traffic_source=rss"
  },
  {
    "originalTitle": "Trump orders Pentagon to buy electricity generated by coal",
    "title": "Trump orders Pentagon to buy electricity generated by coal",
    "content": "Trump's order is the latest move by US administration to boost fossil fuel industry despite climate change concerns.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:21:57.362Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20orders%20Pentagon%20to%20buy%20electricity%20generated%20by%20coal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-orders-pentagon-to-buy-electricity-generated-by-coal",
    "originalLink": "https://www.aljazeera.com/economy/2026/2/12/trump-orders-pentagon-to-buy-electricity-generated-by-coal?traffic_source=rss"
  },
  {
    "originalTitle": "Russia evacuates tourists from Cuba as US-engineered fuel crisis deepens",
    "title": "Russia evacuates tourists from Cuba as US-engineered fuel crisis deepens",
    "content": "Russia will operate only return flights from Cuba as 'evacuation' of tourists from Caribbean island gets under way.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:02.470Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20evacuates%20tourists%20from%20Cuba%20as%20US-engineered%20fuel%20crisis%20deepens%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-evacuates-tourists-from-cuba-as-us-engineered-fuel-crisis-deepens",
    "originalLink": "https://www.aljazeera.com/news/2026/2/12/russia-to-evacuate-tourists-from-cuba-amid-us-engineered-fuel-crisis?traffic_source=rss"
  },
  {
    "originalTitle": "Police identify 18-year-old as suspect in Tumbler Ridge shooting ",
    "title": "Police identify 18-year-old as suspect in Tumbler Ridge shooting ",
    "content": "Six people were killed and at least 25 others were injured at a school, and two others were found dead at a nearby home.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:07.931Z",
    "image": "https://image.pollinations.ai/prompt/Police%20identify%2018-year-old%20as%20suspect%20in%20Tumbler%20Ridge%20shooting%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-identify-18-year-old-as-suspect-in-tumbler-ridge-shooting",
    "originalLink": "https://www.bbc.com/news/articles/ce8w95knp55o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "title": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "content": "Members of the remote community have spoken of their fear and uncertainty after nine people were killed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:13.043Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20terrifying'%3A%20Tumbler%20Ridge's%20tight-knit%20community%20in%20shock%20after%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-terrifying-tumbler-ridges-tight-knit-community-in-shock-after-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cddn078mnn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US House votes to overturn Trump's tariffs on Canada",
    "title": "USA and Canada: Friends Again! Grown-ups Vote to Stop Extra Money!",
    "content": "Hello, my wonderful friends across Africa! It’s your friendly news reporter, Nia, bringing you exciting news from around the world! Today, we have a super important story about countries being good neighbours and making friends, just like you and your playmates do every day!\n\n<h3>A Friendly Vote!</h3>\nImagine you have a friend who lives right next door. Sometimes, you share your toys, right? Or maybe your friend has yummy cookies, and you have juicy mangoes, and you swap them! Countries are like giant friends! They swap things too. Like big trucks, or shiny phones, or yummy food like special sweet maple syrup.\n\nWell, a long time ago, a very important grown-up named Mr. Trump was the leader of a big country called the United States of America, or USA. The USA is very far away, across a giant ocean from us, but it's a very big and important country.\n\nHe made a rule about things that came from another country, Canada. Canada is a super, super big country that is right next to the USA. They are usually very good friends, like best buddies!\n\n<h3>What is \"Extra Money\" (Tariffs)?</h3>\nMr. Trump said that when certain things, like special strong metal that we call steel and aluminum, came from Canada to the USA, people in the USA had to pay extra money for them. This extra money is called a \"tariff\" (say: TAH-riff). It's like a special tax, or a fee!\n\nDid you know? Imagine if you wanted to buy a yummy snack from your friend, but then a grown-up said you had to pay them extra money *just because* your friend made it! That extra money would be like a tariff.\n\nWhy did Mr. Trump do this? Well, he thought it would help the people in the USA who make their *own* steel and aluminum. He wanted people in the USA to buy things made in the USA. He thought it would make their businesses stronger.\n\n<h3>Friends and Neighbours</h3>\nBut sometimes, paying extra money for things can make everything more expensive for everyone. It's like if your favorite snack suddenly cost more because it came from your friend's house. It might make people sad, or not want to buy as much anymore. It can also make countries feel less friendly with each other.\n\nCanada and the USA have a very long border, longer than any other two countries in the world! They share so many things, and people often travel between them for work or holidays. Being good friends is very important for them.\n\nDid you know? Canada is famous for its super sweet maple syrup! It’s like honey but comes from special maple trees. Many people put it on their pancakes!\n\n<h3>Grown-ups Making Choices</h3>\nRecently, a group of very important grown-ups in the USA, who work in a big building called the 'House,' had a special meeting. The 'House' is like a big team that helps make rules and important decisions for the country. These grown-ups are elected, which means people voted for them to do this important job!\n\nIn this big team of grown-ups, there are two smaller teams. We call them the Democrats and the Republicans. They often have different ideas about how to make their country the best it can be. It's kind of like when you and your friend might want to play different games, but you're still friends!\n\nBut guess what? Six grown-ups from the Republican team joined all the grown-ups from the Democratic team! This means they all came together, even though they usually have different ideas. They all voted 'yes' on a special paper.\n\nThis special paper said: \"Let's stop paying that extra money, those tariffs, on things coming from Canada! Let's make things easier, make them a bit cheaper, and keep our friendship strong!\" This special paper is called a \"resolution.\"\n\n<h3>Why Working Together Helps</h3>\nSo, it means a lot of grown-ups from different teams decided together that it’s better to be very good friends with Canada and make things easier for everyone who buys or sells things. It helps businesses, and it helps people who buy things because they might be a little less expensive.\n\nDid you know? When countries trade things, it’s called international trade! Africa, our amazing continent, also trades many wonderful things with the world, like delicious fruits, beautiful crafts, and important minerals! It helps everyone grow and learn from each other.\n\nThis vote is like saying, \"Let’s be good neighbours and help each other out.\" It shows that even when grown-ups have different ideas, they can still work together for the best. They chose to work together to make things better for their countries and for their friendship with Canada.\n\nIt’s a wonderful example of how cooperation and being kind can make a big difference, not just between you and your friends, but between big countries too! When countries are friends, everyone wins and the world becomes a happier place! And that’s our news for today, my friends! See you next time!",
    "summary": "Grown-ups in America voted to stop asking for extra money on things from Canada to make them better friends and make things easier for everyone.",
    "whyMatters": "It's important because when countries are friends and work together, it helps everyone, just like when you share your toys and cooperate with your friends during playtime!",
    "category": "government",
    "date": "2026-02-12T04:22:42.273Z",
    "image": "https://image.pollinations.ai/prompt/USA%20and%20Canada%3A%20Friends%20Again!%20Grown-ups%20Vote%20to%20Stop%20Extra%20Money!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "usa-and-canada-friends-again-grown-ups-vote-to-stop-extra-money",
    "originalLink": "https://www.bbc.com/news/articles/clyz2142e77o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nottingham Forest sack manager Dyche after 114 days",
    "title": "Nottingham Forest sack manager Dyche after 114 days",
    "content": "Nottingham Forest sack Sean Dyche as head coach after just 114 days in charge and are looking for their fourth boss of the season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:47.571Z",
    "image": "https://image.pollinations.ai/prompt/Nottingham%20Forest%20sack%20manager%20Dyche%20after%20114%20days%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nottingham-forest-sack-manager-dyche-after-114-days",
    "originalLink": "https://www.bbc.com/sport/football/articles/c98p80g568do?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City 'breathing down Arsenal's neck' as title 'belief' grows",
    "title": "Man City 'breathing down Arsenal's neck' as title 'belief' grows",
    "content": "Pep Guardiola vowed his Manchester City side would \"breathe down the neck of Arsenal\" as they aim to hunt down the Premier League leaders in this fascinating title race.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:52.695Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20'breathing%20down%20Arsenal's%20neck'%20as%20title%20'belief'%20grows%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-breathing-down-arsenals-neck-as-title-belief-grows",
    "originalLink": "https://www.bbc.com/sport/football/articles/c7438z9d983o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "PM tells Ratcliffe to apologise for 'colonised' remarks",
    "title": "PM tells Ratcliffe to apologise for 'colonised' remarks",
    "content": "Sir Keir Starmer says comments by the businessman and Manchester United co-owner are \"offensive and wrong\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-12T04:22:57.828Z",
    "image": "https://image.pollinations.ai/prompt/PM%20tells%20Ratcliffe%20to%20apologise%20for%20'colonised'%20remarks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pm-tells-ratcliffe-to-apologise-for-colonised-remarks",
    "originalLink": "https://www.bbc.com/news/articles/ckglv1n4dzeo?at_medium=RSS&at_campaign=rss"
  }
]