[
  {
    "originalTitle": "Thirteen schoolchildren killed after bus collides with lorry in South Africa",
    "title": "A Sad Story About Being Safe on the Road in South Africa",
    "content": "Hello everyone! This is your friend, reporting from Africa. Today, I have some sad news to share with you, but it’s very important that we talk about it. Sometimes, sad things happen, and when they do, it's good to learn from them so we can all be safer in the future.\n\n<h3>A Very Sad Day</h3>\n\nIn a beautiful country called South Africa, something very sad happened not long ago. Many children were going to school, just like you do, on a big school bus. School buses are meant to take children safely to and from school, and they are usually full of laughter and happy chatter.\n\nBut on this day, the school bus had a big accident. It bumped into a very large truck, which we sometimes call a lorry. When the bus and the lorry bumped together, it was a very big crash. This made many children get hurt, and some of our young friends sadly passed away.\n\nIt is a very, very sad thing when something like this happens. Everyone in South Africa and all over Africa is very sad for the children, their families, and their teachers. It reminds us how important it is to be careful every time we are near roads or travelling in a car or a bus.\n\n<h3>What Happened?</h3>\n\nImagine a big yellow bus, full of happy children on their way to school. Now imagine a really, really big truck, with huge wheels, carrying heavy things. These two big vehicles met on the road. For some reason, they bumped into each other very, very hard. It was a terrible accident.\n\nWhen big vehicles crash, it can be very dangerous. That's why we have to be extra careful on the roads. The grown-ups called for help very quickly. Doctors, nurses, and kind people called paramedics came to try and help everyone who was hurt. They always try their best to make people feel better.\n\nDid you know? Paramedics are special helpers who travel in ambulances. Ambulances are like special fast cars with bright lights and sirens that take hurt people to the hospital very quickly!\n\n<h3>Where is South Africa?</h3>\n\nSouth Africa is a wonderful country right at the bottom of our amazing continent, Africa! It has big cities, beautiful beaches, and lots of incredible animals like lions, elephants, and giraffes in its game parks.\n\nMany children live in South Africa, just like you. They go to school, play games, and have families. It is known as the 'Rainbow Nation' because so many different kinds of people live there together, just like the beautiful colours of a rainbow.\n\nDid you know? South Africa has three capital cities! That's more than most countries. Each one does a different important job for the country.\n\n<h3>What is a Bus? What is a Lorry?</h3>\n\nA bus is a very big car that carries many people at once. School buses are special because they only carry children to and from school. They often have special colours or signs to show they are carrying precious children.\n\nA lorry, or a truck, is also a very big vehicle, but it doesn't usually carry people. Instead, lorries carry heavy things like food, clothes, building materials, or even other cars! They have very big engines and can be quite long. Because they are so big and heavy, lorries need a lot of space to stop and turn.\n\n<h3>Why Do We Need Road Rules?</h3>\n\nRoads are like special pathways for cars, buses, and lorries to travel on. To make sure everyone stays safe, we have very important road rules. These rules are like game rules, but even more important, because they help to save lives. Imagine if everyone just drove any way they wanted – it would be a big mess and very dangerous!\n\nThe rules tell drivers things like how fast they can go, when to stop at traffic lights, and which side of the road to drive on. They also tell people walking and cycling where it is safe to go. All these rules are there to keep you, your family, and everyone else safe.\n\nDid you know? Traffic lights have three colours: red means stop, yellow means get ready, and green means go! It's like a special dance for cars!\n\n<h3>Who Helps Us on the Road?</h3>\n\nThere are many helpful people who work very hard to keep us safe on the roads. Police officers are like the road's guardians. They make sure everyone follows the rules. If someone isn't following a rule, they help them to understand how to be safer.\n\nEngineers help to build roads that are smooth and strong, and they also put up signs to help drivers know what to do. Doctors and nurses work in hospitals to help people who get hurt in accidents. And the kind paramedics, as we learned, are always ready to rush to help.\n\nDid you know? Many countries in Africa, like South Africa, drive on the left side of the road! In other places, they drive on the right. It's important for everyone to know which side to drive on!\n\n<h3>How Can We Be Safe?</h3>\n\nEven though grown-ups do their best, we can all help to be safer. Here are some things you can do:\n\n*   **Always listen to your parents or teachers:** They know the safest way to walk or travel.\n*   **Look Left, Right, Left:** Before you cross any road, always look left, then right, then left again to make sure no cars are coming. If you don't see any, it's safe to cross quickly!\n*   **Hold a Grown-Up's Hand:** If you are little, always hold the hand of a grown-up when you are near the road or crossing it.\n*   **Wear Your Seatbelt:** If you are in a car or a bus that has seatbelts, always buckle up! A seatbelt is like a special hug that keeps you safe in your seat if the car stops suddenly.\n*   **Be Careful When Playing:** Never play too close to a road, even if it seems quiet. A car could come along without you knowing.\n\n<h3>Remembering Our Friends</h3>\n\nWhen sad things like this happen, it makes us think about all the children who were on that bus. We remember their smiles, their laughter, and their dreams. We send our love and kind thoughts to their families and friends. It's okay to feel sad when bad things happen, and it's good to talk about how you feel.\n\nThis sad story reminds us that every single life is precious. We all need to look out for each other and try our best to keep everyone safe.\n\n<h3>Working Together for Safety</h3>\n\nThe grown-ups in South Africa and all over Africa are working very hard to make sure roads are safer for everyone, especially for children. They are checking buses, training drivers, and fixing roads to make them better.\n\nThey want to make sure that children can go to school and play safely, and that sad accidents like this happen less and less. By learning about road safety now, you are also helping to make our world a safer place for everyone. Let’s all work together to be safe and kind.",
    "summary": "Thirteen schoolchildren in South Africa sadly died after their bus crashed with a big truck, reminding everyone how important it is to be very careful and safe on the roads.",
    "whyMatters": "This sad story matters because it teaches us how important it is for everyone, big and small, to understand and follow road rules to keep ourselves and our friends safe when we are walking, playing, or travelling near or on roads.",
    "category": "world",
    "date": "2026-01-19T13:42:29.318Z",
    "image": "https://image.pollinations.ai/prompt/A%20Sad%20Story%20About%20Being%20Safe%20on%20the%20Road%20in%20South%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-sad-story-about-being-safe-on-the-road-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/cvgdmkxl1mko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African team helps search for politician swept away by Mozambique floodwaters",
    "title": "Big Floods in Mozambique! Friends from South Africa Come to Help!",
    "content": "<h3>Oh No! Too Much Water in Mozambique!</h3>\nHello, super friends! Our news today comes from a beautiful country in Africa called Mozambique. It's a place with lovely beaches and sunshine, but right now, something very big and wet is happening there.\n\nThere has been a lot, lot, LOT of rain! And all that rain has caused something called 'floods.' When there are floods, it means there's too much water everywhere, much more than usual.\n\nThe water covers roads, goes into houses, and can make it very hard for people to get around or even stay safe. Imagine your playground filled with a big puddle, but much, much bigger!\n\n<h3>What Are Floods Anyway?</h3>\nFloods happen when rivers get too full and spill over their banks. Or when heavy rain keeps falling and the ground can't soak up any more water. It's like pouring too much juice into a glass – it overflows!\n\nWhen water floods an area, it can be very strong. It can push things around, like cars or even big trees. This makes it dangerous for everyone living there.\n\nDid you know? Africa has many different kinds of weather. Sometimes it's very sunny and dry, and other times it can rain a lot, especially during certain seasons!\n\n<h3>A Helper Goes Missing in the Water</h3>\nIn Mozambique, a very important person, a 'politician,' went missing because of the floodwaters. A politician is someone who works very hard to help run the country and make good rules for everyone.\n\nThis person was swept away by the fast-moving water. This is very, very sad news. Everyone is worried and hoping they can be found quickly.\n\nWhen someone goes missing, it means no one knows where they are. It's a very scary feeling for their family and friends.\n\n<h3>Friends from South Africa Come to Help!</h3>\nBut guess what? When people are in trouble, their friends come to help! Mozambique has a neighbor country called South Africa. And a special team from South Africa has come to lend a hand.\n\nThis team is called a 'search team.' Their job is to look for people who are lost or in danger. They are very brave and use special tools and skills to help.\n\nThey are working hard, trying their best to find the missing politician in the big, watery areas. It's wonderful when countries help each other, just like friends help friends in school!\n\nDid you know? South Africa is famous for its amazing wildlife, like lions, elephants, and giraffes! It's also known for having 11 different official languages!\n\n<h3>Our President Stays Home to Help His People</h3>\nNow, let's talk about the leader of Mozambique, his name is President Daniel Chapo. A 'president' is like the head of a big family, but for an entire country! He is in charge and makes important decisions.\n\nPresident Chapo was supposed to travel very far away to a big meeting called 'Davos.' Imagine a huge classroom where all the leaders from different countries meet to talk about important things for the world.\n\nBut because of the big floods and the trouble in his country, President Chapo decided to cancel his trip. He said, \"No, I need to stay right here with my people and help them.\"\n\nHe knows that his people need him the most when times are tough. He wants to make sure everyone is safe and that help gets to where it's needed.\n\n<h3>Why Is It Important for a President to Stay?</h3>\nWhen a president stays with their people during a difficult time, it shows they care very much. It means they want to be close by to make quick decisions and organize help.\n\nIt's like if your mom or dad stayed home from work to help you when you're not feeling well. They put you first, just like President Chapo is putting the people of Mozambique first.\n\nDid you know? Presidents often have very busy jobs, traveling and meeting important people, but their main job is always to look after their own country and its people.\n\n<h3>How Do We Stay Safe from Floods?</h3>\nIf you ever hear about floods where you live, remember these things:\n\n*   Always listen to your grown-ups. They know what to do.\n*   Move to higher ground if asked. That means going to places that are not flat and wet.\n*   Never play in floodwaters. They can be very dirty and dangerous.\n\nIt's important to be safe and help each other during difficult times like this. We hope the waters go down soon in Mozambique, and that everyone stays safe.\n\n<h3>Being Kind and Helping Each Other</h3>\nThis news reminds us how important it is for people, and even whole countries, to help each other when someone is in need. The search team from South Africa is doing a kind thing.\n\nAnd President Chapo is showing great leadership by staying with his people. Let's send our kind thoughts to everyone in Mozambique and hope for sunshine and safety soon!\n\nWe will keep you updated on this story, super friends. Stay kind and stay curious!",
    "summary": "Mozambique is facing big floods, a politician went missing, and a kind South African team is helping to search, while their President Daniel Chapo stayed to help his people.",
    "whyMatters": "This is important because floods can be very dangerous, and it shows how leaders care for their people and how different countries help each other in tough times.",
    "category": "world",
    "date": "2026-01-19T13:42:53.831Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Floods%20in%20Mozambique!%20Friends%20from%20South%20Africa%20Come%20to%20Help!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-floods-in-mozambique-friends-from-south-africa-come-to-help",
    "originalLink": "https://www.bbc.com/news/articles/c62nen4n971o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "My children were recruited in a trafficking scam. I joined a police hunt to find them",
    "title": "My children were recruited in a trafficking scam. I joined a police hunt to find them",
    "content": "BBC Africa Eye joins an anti-trafficking police unit in Sierra Leone helping a man look for his missing children.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:42:59.000Z",
    "image": "https://image.pollinations.ai/prompt/My%20children%20were%20recruited%20in%20a%20trafficking%20scam.%20I%20joined%20a%20police%20hunt%20to%20find%20them%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "my-children-were-recruited-in-a-trafficking-scam-i-joined-a-police-hunt-to-find-them",
    "originalLink": "https://www.bbc.com/news/articles/cx2w9q28xjxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Inter Milan vs Arsenal: UEFA Champions League – team news, start, lineups",
    "title": "Inter Milan vs Arsenal: UEFA Champions League – team news, start, lineups",
    "content": "Leaders Arsenal itching to get back to winning ways against Inter in league phase of UEFA Champions League on Tuesday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-19T13:43:04.382Z",
    "image": "https://image.pollinations.ai/prompt/Inter%20Milan%20vs%20Arsenal%3A%20UEFA%20Champions%20League%20%E2%80%93%20team%20news%2C%20start%2C%20lineups%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "inter-milan-vs-arsenal-uefa-champions-league-team-news-start-lineups",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/19/inter-milan-vs-arsenal-uefa-champions-league-team-news-start-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "Several killed in Kabul blast, Afghan Interior Ministry says",
    "title": "Several killed in Kabul blast, Afghan Interior Ministry says",
    "content": "This is a breaking news story.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:43:09.556Z",
    "image": "https://image.pollinations.ai/prompt/Several%20killed%20in%20Kabul%20blast%2C%20Afghan%20Interior%20Ministry%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "several-killed-in-kabul-blast-afghan-interior-ministry-says",
    "originalLink": "https://www.aljazeera.com/news/2026/1/19/several-killed-in-kabul-blast-afghan-taliban-interior-ministry-says?traffic_source=rss"
  },
  {
    "originalTitle": "The UK is now willing to undermine British institutions to protect Israel",
    "title": "The UK is now willing to undermine British institutions to protect Israel",
    "content": "British football fans are regularly banned without scandal. Why is it that Israeli fans cannot be?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:43:14.726Z",
    "image": "https://image.pollinations.ai/prompt/The%20UK%20is%20now%20willing%20to%20undermine%20British%20institutions%20to%20protect%20Israel%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-uk-is-now-willing-to-undermine-british-institutions-to-protect-israel",
    "originalLink": "https://www.aljazeera.com/opinions/2026/1/19/the-uk-is-now-willing-to-undermine-british-institutions-to-protect-israel?traffic_source=rss"
  },
  {
    "originalTitle": "High-speed train crash in Spain kills at least 39",
    "title": "High-speed train crash in Spain kills at least 39",
    "content": "More than 400 passengers were on board the trains that derailed near the city of Córdoba, in Spain's worst rail crash in more than a decade.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-19T13:43:20.584Z",
    "image": "https://image.pollinations.ai/prompt/High-speed%20train%20crash%20in%20Spain%20kills%20at%20least%2039%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "high-speed-train-crash-in-spain-kills-at-least-39",
    "originalLink": "https://www.bbc.com/news/articles/cedw6ylpynyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watch: Spain train crash survivors describe 'absolutely terrifying' scene",
    "title": "Oh No! Trains Bumped! Helpers Rush to Spain!",
    "content": "<h3>Hello, Friends! Your African Reporter is Here!</h3>\nHello, my wonderful friends all across Africa! It's your friendly reporter here, bringing you news from around our big, beautiful world. Today, we are going to talk about something that happened far away, in a country called Spain. Sometimes, things happen that can be a little bit scary. But it's good to remember that there are always good people who come to help. Let's learn about it together, in a gentle way, and think about all the brave helpers.\n\n<h3>What Happened to the Trains?</h3>\nImagine two big, long trains. They are like giant metal caterpillars, carrying many people on a journey. These trains were going on their trip in Spain. One day, on a Sunday evening, something unexpected happened. These two trains bumped into each other. It was not a tiny tap like when your toy cars touch. It was a bigger bump, and it made a big noise.\n\nMany people were inside the trains. They were sitting down, maybe reading a book or looking out the window at the lovely Spanish countryside. When the trains bumped, it made a big jolt! It was a bit scary for the people inside. They felt the train shake strongly. Everyone was safe in the end, but it was a big surprise for them. It must have felt like a giant push!\n\n<h3>Where is Spain? And How Do Trains Travel So Far?</h3>\nDid you know that Spain is a country very far away from Africa? It is in a place called Europe, across the big ocean. If you flew in an aeroplane, it would take many hours to get there! Spain has beautiful beaches, old castles, and tall mountains. People travel by trains there all the time, for work and for fun.\n\nThese trains were travelling between two very big cities in Spain. One city is called Málaga. The other big city is called Madrid. Think of it like a very, very long journey from Accra in Ghana to Lagos in Nigeria, but even further! Trains help millions of people travel these long distances in Spain every single day. They are a very important way to get around!\n\n<h3>The Brave People on the Trains</h3>\nMany people were on those trains. We call them passengers. They were going to see their families, or maybe they were going on a holiday to a new place. Some might have been going home after a fun weekend visiting friends. When the trains bumped, these passengers felt a big shake and heard loud sounds. It was a scary moment for them all.\n\nThey might have closed their eyes tightly or held onto their seats very strongly. But soon, they knew that help would come. It's always important to try and stay calm and wait for helpers when something like this happens. The grown-ups on the train did a great job of helping the children to feel safe and explaining that help was coming very soon.\n\n<h3>Superstar Helpers Came Running!</h3>\nGuess what happened next? Many, many helpers rushed to the trains! These helpers are like real-life superheroes, but they don't wear capes. They wear uniforms and special clothes! There were police officers, who are very brave and keep everyone safe and sound. They helped check on people and directed everyone.\n\nThere were also kind doctors and nurses. They are very special people who help anyone who might have gotten a little bump or a small scratch. They checked everyone carefully to make sure they were okay. And guess what? Firefighters also came quickly! They are super brave people who help in all sorts of emergencies, like making sure everyone gets out of places safely. They used their special tools to check everything around the trains. Everyone worked together like a big, amazing team to help the passengers. It was wonderful to see so many people helping each other with such big smiles and kind hearts.\n\n<h3>Getting Everyone to Safety and Comfort</h3>\nThe superstar helpers carefully looked at everyone on the trains. They made sure that no one was badly hurt. Luckily, most people were okay, just a little bit shaken from the big bump. Some people had small scratches or tiny bumps, but nothing too serious at all. The helpers were very gentle and kind, speaking softly to everyone.\n\nThey helped all the people get off the trains very slowly and carefully. Then, they made sure everyone had a safe place to go. Some people went home to their families, and others might have stayed with friends nearby. The most important thing was that everyone was safe and looked after with care and love. It shows how much we care for each other in the world when things go wrong.\n\n<h3>Did You Know? Train Safety Rules Are Super Important!</h3>\nTrains are usually very, very safe. Did you know that millions and millions of people travel by train every single day all over the world? Yes, it's true! There are many, many rules that help to keep trains safe. These rules help trains stay on their special tracks and travel smoothly, just like a smooth ride. Train drivers, who are called engineers, are trained very, very well for a long time.\n\nDid you know that train tracks are like special roads just for trains? Trains cannot steer left or right like cars can. They can only go where the tracks take them. That's why it's super important for train drivers and people who manage the tracks to be very, very careful. They always make sure the tracks are clear. They also make sure that trains keep a safe distance from each other. This helps a lot to stop bumps like the one in Spain from happening. Safety first is always the best rule for trains!\n\n<h3>Learning from What Happened</h3>\nWhen something unexpected like this train bump happens, very smart people try to understand why it happened. Engineers and safety experts will look very carefully at everything that went wrong. They will check the trains many times, and they will check the tracks many times too. They want to find out exactly what happened so that it doesn't happen again ever.\n\nLearning from things that go wrong helps us make things even better and even safer in the future. It's like when you fall down when you're learning to ride a bike, and then you learn to be more careful next time. Countries all over the world share ideas and new inventions to make trains the safest way to travel. This helps everyone, everywhere, have happy and safe journeys when they ride a train.\n\n<h3>A Message from Your Friend in Africa</h3>\nEven though this happened far away in Spain, it reminds us of something very important: it's always good to be kind and help each other. When things go wrong, the most important thing is for helpers to rush in and for everyone to work together. We are so happy that the people on the trains in Spain were helped quickly and that everyone is safe and sound now.\n\nRemember to always be kind, be helpful, and listen to the grown-ups around you who keep you safe. Stay safe, my friends! Your reporter from Africa sends you big smiles and warm wishes! Until next time!",
    "summary": "In Spain, two big trains bumped into each other, which was a bit scary for the people inside, but many kind helpers like police, doctors, and firefighters came very quickly to make sure everyone was safe and well looked after.",
    "whyMatters": "This is important because it shows that even when something surprising or scary happens, there are always good people ready to help, and we learn from these events to make train travel even safer for everyone everywhere.",
    "category": "world",
    "date": "2026-01-19T13:44:02.282Z",
    "image": "https://image.pollinations.ai/prompt/Oh%20No!%20Trains%20Bumped!%20Helpers%20Rush%20to%20Spain!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oh-no-trains-bumped-helpers-rush-to-spain",
    "originalLink": "https://www.bbc.com/news/videos/c23r1rx5vp7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US believes its power matters more than international law, UN chief tells BBC",
    "title": "US believes its power matters more than international law, UN chief tells BBC",
    "content": "António Guterres says Washington's \"clear conviction\" is that multilateral solutions are irrelevant.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:44:07.446Z",
    "image": "https://image.pollinations.ai/prompt/US%20believes%20its%20power%20matters%20more%20than%20international%20law%2C%20UN%20chief%20tells%20BBC%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-believes-its-power-matters-more-than-international-law-un-chief-tells-bbc",
    "originalLink": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Shameful' and 'terrible look' - the chaos that marred Senegal's Afcon triumph",
    "title": "'Shameful' and 'terrible look' - the chaos that marred Senegal's Afcon triumph",
    "content": "Senegal beat Morocco to win the Africa Cup of Nations after the final is overshadowed when they temporarily refuse to play.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:44:13.823Z",
    "image": "https://image.pollinations.ai/prompt/'Shameful'%20and%20'terrible%20look'%20-%20the%20chaos%20that%20marred%20Senegal's%20Afcon%20triumph%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "shameful-and-terrible-look-the-chaos-that-marred-senegals-afcon-triumph",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70ljednyl6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Arsenal will never forgive themselves if they don't win title now'",
    "title": "'Arsenal will never forgive themselves if they don't win title now'",
    "content": "This is Mikel Arteta and Arsenal's \"now or never\" moment as Premier League title rivals stumble badly, says chief football writer Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-19T13:44:18.982Z",
    "image": "https://image.pollinations.ai/prompt/'Arsenal%20will%20never%20forgive%20themselves%20if%20they%20don't%20win%20title%20now'%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-will-never-forgive-themselves-if-they-dont-win-title-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/cm24736mrm7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Dalot 'would have been given red card in Europe'",
    "title": "Dalot 'would have been given red card in Europe'",
    "content": "Manchester United's Diogo Dalot was not sent off against Manchester City after his foul on Jeremy Doku was \"glancing\" contact.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-19T13:44:24.144Z",
    "image": "https://image.pollinations.ai/prompt/Dalot%20'would%20have%20been%20given%20red%20card%20in%20Europe'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "dalot-would-have-been-given-red-card-in-europe",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn5616rve3eo?at_medium=RSS&at_campaign=rss"
  }
]