[
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "A Little Talk About Baby Shots and Being Fair!",
    "content": "<h3>Hello from Your News Friend!</h3>\nHello, my amazing friends all across Africa! It's your kid-friendly news reporter here, ready to share an important story with you. We often talk about playing, learning, and having fun, right? But today, we're going to talk about something super important: staying healthy! Our bodies are like amazing machines, and we need to take good care of them.\n\nSometimes, special doctors and nurses help us stay strong and safe from tiny, invisible germs. They use something called a \"vaccine\" or a \"shot.\" Have you ever had one? Maybe in your arm? They might sting a tiny bit, but they are like a superhero shield for your body!\n\nToday's story is about some very, very tiny babies in a country called Guinea-Bissau. It's a beautiful country in West Africa, just like many of our homes. There was a plan to give these babies a special shot. But some people, very wise people, said the plan was not fair. Let's find out why!\n\n<h3>What is a Baby Shot (Vaccine)?</h3>\nImagine you have a toy castle, and you want to protect it from bad guys. You build a strong wall, right? A vaccine is a bit like that strong wall for your body. It's a special medicine, usually given as a small injection, that teaches your body how to fight off tiny germs that can make you very sick.\n\nWhen you get a vaccine, your body learns to recognize the bad germs. Then, if those germs ever try to attack, your body is ready! It can fight them off quickly, so you don't get very sick, or maybe you don't get sick at all. It's like having a superpower that keeps you healthy!\n\nBabies get many shots when they are very little. These shots protect them from many serious sicknesses, like measles or polio. These sicknesses used to make many children very unwell, but thanks to vaccines, fewer children get them now.\n\nDid you know? Vaccines save millions of lives every year! They are one of the best ways to keep children and grown-ups healthy around the world.\n\n<h3>Meet Hepatitis B – A Tricky Germ</h3>\nNow, let's talk about a specific germ. Its name is Hepatitis B. It's a bit of a tricky germ because it likes to attack a special part of your body called the \"liver.\" Your liver is inside your tummy, and it's super important! It helps to clean your blood and keeps your body working well.\n\nIf the Hepatitis B germ makes your liver sick, it can cause big problems. For tiny babies, it can be very dangerous. They might get sick for a long, long time. Sometimes, babies can even get this germ from their mothers when they are born.\n\nThat's why doctors want to protect babies from Hepatitis B. There is a special shot, a vaccine, that can protect babies from this germ. It works very well, like a strong shield against this particular bad guy. Many babies around the world get this shot soon after they are born.\n\n<h3>A Special Plan for Babies in Guinea-Bissau</h3>\nSo, in Guinea-Bissau, there was a plan. It was a plan to give some of these tiny babies a shot to protect them from Hepatitis B. This plan was going to get some help from a country far away, the United States. They offered some money to help pay for the project.\n\nThis special shot is called the Hepatitis B vaccine. It's not a brand-new medicine that no one knows about. No, this vaccine has been used for many, many years all over the world. Doctors know it works very well to keep babies safe from this germ.\n\nThe idea was to study how well the babies did after getting the shot. This is called a \"trial\" or a \"study.\" Scientists sometimes do studies to learn more about how medicines work or if new medicines are safe. But remember, this shot was not new. It was already a known superhero!\n\n<h3>The Big Problem: Is it Fair?</h3>\nHere's where the story gets a bit tricky. The plan was to give the Hepatitis B shot to *some* babies, but not to *all* the babies in the study. Imagine if you and your friends were sharing a tasty treat, like a big, juicy mango. And the person sharing it said, \"Some of you get a piece, but some of you get none.\" Would that feel fair to you?\n\nNo, it wouldn't! And that's exactly what many wise people thought about this plan for the babies. If doctors already know that a shot works very well to protect babies from a bad germ, then every baby who needs it should get it. It's not fair to choose some babies to get the protection and leave others without it.\n\nThis idea of being fair is very important when we talk about helping people get healthy. Everyone deserves the chance to be safe and strong, especially tiny, helpless babies. When health plans are not fair, we call it \"unethical.\" It means it's not the right or good way to do things.\n\nDid you know? Being fair means treating everyone equally and making sure everyone has the same chance. It's a very important rule for doctors and scientists!\n\n<h3>Who is the WHO? (The World Health Organization)</h3>\nThere's a very big and very important group in the world called the World Health Organization. We call them the WHO for short. They are like the biggest team of health experts on the planet! Their job is to help everyone, in every country, stay healthy. They give advice, share information, and help countries make good health plans.\n\nThe WHO heard about the plan in Guinea-Bissau. They looked at it very carefully. And what did they say? They said, \"Hold on! This plan is not fair.\" They said it was \"unethical\" to give the known Hepatitis B shot to some babies but not to others.\n\nThe WHO believes that if there's a good medicine that we know works, and it can save babies from getting sick, then all babies in the study should get it. They speak up for fairness and safety for everyone, especially the most vulnerable, like tiny newborns.\n\n<h3>Why Do We Do \"Trials\" or \"Studies\"?</h3>\nSometimes, when a *brand-new* medicine is found, doctors need to do \"trials\" or \"studies\" to see if it works and if it's safe. In these cases, it might be okay to give the new medicine to some people and a different medicine (or no medicine) to others. This helps doctors compare and see if the new medicine is truly better.\n\nBut this is only for *new* medicines, when we don't already know if they work. For the Hepatitis B shot, we *do* know it works! It's been helping babies for a long time. So, there was no good reason to say, \"Let's give it to some babies and not to others\" just to watch what happens. That would be like knowing a road is safe, but telling some cars they can't drive on it.\n\nDid you know? It can take many, many years to test a brand-new medicine and make sure it is safe and works well. This careful testing helps keep all of us safe!\n\n<h3>What Happens Next?</h3>\nBecause the WHO spoke up and said the plan was not fair, things might change. Everyone involved – the doctors, the people who offered money, and the government in Guinea-Bissau – will need to think again. They will need to find a way to make sure that *all* the babies who need protection get it.\n\nThe main goal for everyone is to keep babies healthy and safe. This story teaches us that it's super important to be fair, especially when it comes to health. We all want the best for our little ones, and that means making sure they all get the care they need.\n\n<h3>Stay Healthy, My Friends!</h3>\nSo, my wonderful friends, remember this story. It reminds us that being fair is very important in everything we do, especially when we talk about health and medicine. Always listen to your parents and doctors about how to stay healthy. Eat your fruits and vegetables, play outside, and keep your hands clean.\n\nThank you for listening to this important news! Stay safe, stay healthy, and always remember to be kind and fair to everyone around you. See you next time for more news for kids in Africa!",
    "summary": "The World Health Organization says it's not fair to give a known baby shot to some babies but not others in a study in Guinea-Bissau, because all babies deserve equal health protection.",
    "whyMatters": "This is important because all babies deserve to be safe and get the best health care, and big groups like the WHO help make sure health plans are fair for everyone, especially for the smallest and most vulnerable.",
    "category": "world",
    "date": "2026-02-14T20:20:38.530Z",
    "image": "https://image.pollinations.ai/prompt/A%20Little%20Talk%20About%20Baby%20Shots%20and%20Being%20Fair!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-little-talk-about-baby-shots-and-being-fair",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "content": "Bouquets of cash have been blooming in popularity in Kenya but recent warnings may slow the trend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:05.871Z",
    "image": "https://image.pollinations.ai/prompt/Kenyans%20drop%20flowers%20for%20Valentine's%20bouquets%20of%20cash.%20Not%20everyone%20is%20impressed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenyans-drop-flowers-for-valentines-bouquets-of-cash-not-everyone-is-impressed",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:10.974Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hungary’s Orban says EU bigger threat than Russia before April elections",
    "title": "Hungary’s Orban says EU bigger threat than Russia before April elections",
    "content": "'Illiberal' PM, endorsed by ally Trump this week, to receive US Secretary of State Marco Rubio on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:16.217Z",
    "image": "https://image.pollinations.ai/prompt/Hungary%E2%80%99s%20Orban%20says%20EU%20bigger%20threat%20than%20Russia%20before%20April%20elections%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hungarys-orban-says-eu-bigger-threat-than-russia-before-april-elections",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/hungarys-orban-says-eu-bigger-threat-than-russia-ahead-of-april-election?traffic_source=rss"
  },
  {
    "originalTitle": "Helicopter triggers avalanche amid maximum alert across French Alps",
    "title": "Helicopter triggers avalanche amid maximum alert across French Alps",
    "content": "Emergency teams intentionally triggered an avalanche near a Chamonix ski resort as a safety precaution.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:21.321Z",
    "image": "https://image.pollinations.ai/prompt/Helicopter%20triggers%20avalanche%20amid%20maximum%20alert%20across%20French%20Alps%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helicopter-triggers-avalanche-amid-maximum-alert-across-french-alps",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/14/helicopter-triggers-avalanche-amid-maximum-alert-across-french-alps?traffic_source=rss"
  },
  {
    "originalTitle": "Palestinian protester Leqaa Kordia calls ICE custody ‘dehumanising’",
    "title": "Palestinian protester Leqaa Kordia calls ICE custody ‘dehumanising’",
    "content": "Palestinian Columbia protester Leqaa Kordia says she was chained to a hospital bed after a seizure in ICE custody.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-14T20:21:26.431Z",
    "image": "https://image.pollinations.ai/prompt/Palestinian%20protester%20Leqaa%20Kordia%20calls%20ICE%20custody%20%E2%80%98dehumanising%E2%80%99%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palestinian-protester-leqaa-kordia-calls-ice-custody-dehumanising",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/14/palestinian-protester-leqaa-kordia-calls-ice-custody?traffic_source=rss"
  },
  {
    "originalTitle": "Rubio says US and Europe 'belong together' despite tensions",
    "title": "Rubio says US and Europe 'belong together' despite tensions",
    "content": "The US secretary of state reassures European leaders that the Trump administration backs the transatlantic alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:31.922Z",
    "image": "https://image.pollinations.ai/prompt/Rubio%20says%20US%20and%20Europe%20'belong%20together'%20despite%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rubio-says-us-and-europe-belong-together-despite-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c2lrdq47149o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:37.014Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Police activity under way near Nancy Guthrie's home",
    "content": "A search has been carried out in Tuscon, Arizona, close to where the 84-year-old was abducted nearly two weeks ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:42.125Z",
    "image": "https://image.pollinations.ai/prompt/Police%20activity%20under%20way%20near%20Nancy%20Guthrie's%20home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-activity-under-way-near-nancy-guthries-home",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "title": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "content": "Burnley manager Scott Parker is under increasing pressure as the Premier League side are dumped out of the FA Cup by League One Mansfield.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:47.392Z",
    "image": "https://image.pollinations.ai/prompt/Brilliant%20Mansfield%20pile%20pressure%20on%20Parker%20-%20is%20his%20time%20up%20at%20Burnley%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brilliant-mansfield-pile-pressure-on-parker-is-his-time-up-at-burnley",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy0dnxwxyl0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kane reaches 500 goals - what other records could he break?",
    "title": "Kane reaches 500 goals - what other records could he break?",
    "content": "Bayern Munich striker Harry Kane became the first Englishman to reach 500 career goals on Saturday, but what other records could he break?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:52.500Z",
    "image": "https://image.pollinations.ai/prompt/Kane%20reaches%20500%20goals%20-%20what%20other%20records%20could%20he%20break%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kane-reaches-500-goals-what-other-records-could-he-break",
    "originalLink": "https://www.bbc.com/sport/football/articles/c743xp1xw9yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "From 'demoralising' 8-0 defeat to pushing Man City all the way ",
    "title": "From 'demoralising' 8-0 defeat to pushing Man City all the way ",
    "content": "Thirteen months after being embarrassed 8-0 by Manchester City, Salford City produce a performance to make their fans proud.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T20:21:57.606Z",
    "image": "https://image.pollinations.ai/prompt/From%20'demoralising'%208-0%20defeat%20to%20pushing%20Man%20City%20all%20the%20way%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "from-demoralising-8-0-defeat-to-pushing-man-city-all-the-way",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9v0kwpd9z4o?at_medium=RSS&at_campaign=rss"
  }
]