[
  {
    "originalTitle": "Aid workers missing after airstrikes hit South Sudan hospital ",
    "title": "When Hospitals Get Hurt: Friends Are Missing!",
    "content": "Hello, super friends! Your African news reporter is here with some very important news. It's a little sad, but we need to talk about it because it's about helping people. Far away, in a beautiful country in Africa called South Sudan, something not nice happened to a special place. \n\n<h3>A Place for Healing Gets Hurt</h3>\nImagine a big, friendly building where sick people go to get better. This special building is called a hospital. Doctors and nurses work there every day to make sure everyone feels okay. Hospitals are like a warm, safe hug for people who are not well.\n\nWell, sadly, a hospital in South Sudan got hurt. It was hit by something called an 'airstrike.' An airstrike is when something like an airplane or a big flying machine drops things from the sky. It's like a loud bang from above. This is very, very sad because hospitals are supposed to be safe places, always.\n\n\n<h3>Who Are the Super Helpers?</h3>\nIn this hospital, there were very kind and brave people. They are called 'aid workers.' Aid workers are like real-life superheroes! They travel to places where people need extra help. They bring medicine, comfort, and smiles to people who are having a difficult time. \n\nThese particular aid workers work for a special group called MSF. MSF is a big name, but it simply means 'Doctors Without Borders.' Think of them as doctors and nurses who don't let any borders (like country lines) stop them from helping people. They go where help is needed most, even if it's far away or difficult.\n\nDid you know that MSF helps millions of people all around the world? They have been helping people for a very long time, in many different countries, including right here in Africa! They believe everyone deserves to be healthy and safe.\n\n<h3>Sad News: Friends Are Missing</h3>\nAfter the hospital got hurt by the airstrike, something even sadder happened. Some of these brave MSF aid workers are now missing. MSF is very, very worried about their friends. They are trying their best to find them and make sure they are safe.\n\nIt's a very scary feeling when friends or family go missing. Everyone hopes they will be found soon and that they are okay. The people who work with MSF are like a big family, and they care deeply for each other.\n\n\n<h3>Why Hospitals Must Be Safe</h3>\nDid you know that everyone in the world agrees that hospitals should always be safe? It's like a very important rule. Even when there are big problems or disagreements between people, hospitals and the people who work in them should never be hurt.\n\nImagine if you were sick and needed a doctor, but the hospital was not safe. That would be very scary! That's why it's so important to protect hospitals. They are places of healing, not places for harm.\n\nThese doctors and nurses and other helpers are there for everyone. They don't pick sides. They just want to help people get better, no matter who they are or where they come from. That's why their work is so special and important.\n\n<h3>Another Sad Story: Things Taken Away</h3>\nBefore the hospital was hit, MSF had another health place in South Sudan. This place also had a problem. Some bad people came and took things from it. This is called 'looting.' It means taking things that don't belong to you.\n\nWhen things are looted from a health center, it makes it much harder for MSF to help people. Imagine if someone took all your pencils from school, and you couldn't draw anymore. It's a bit like that, but with very important medicine and tools for doctors. It means fewer people can get the help they need.\n\nDid you know that South Sudan is a country with beautiful landscapes and many wonderful people? Like many countries, it sometimes faces big challenges, and that's when groups like MSF step in to lend a helping hand.\n\n<h3>What Happens Now?</h3>\nMSF is not giving up. They are working very, very hard to find their missing friends. They are also trying to make sure that hospitals and health centers stay safe in South Sudan and everywhere else.\n\nThey want to continue their important work of helping people who are sick or hurt. Everyone hopes that the missing aid workers will be found soon and that hospitals can once again be safe places for healing.\n\nLet's send our kind thoughts to the people in South Sudan and to the brave aid workers. We hope for safety and peace for everyone.",
    "summary": "A special hospital in South Sudan was hurt by an airstrike, and some kind helpers from MSF (Doctors Without Borders) are now missing, making many people sad and worried.",
    "whyMatters": "It is very important because hospitals are safe places where doctors and nurses help people get better, and everyone needs to help keep them safe so these brave helpers can continue their important work of caring for others.",
    "category": "government",
    "date": "2026-02-05T12:52:18.638Z",
    "image": "https://image.pollinations.ai/prompt/When%20Hospitals%20Get%20Hurt%3A%20Friends%20Are%20Missing!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "when-hospitals-get-hurt-friends-are-missing",
    "originalLink": "https://www.bbc.com/news/articles/c20dq9e3qr7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gunmen kill dozens in Nigeria as US military deployment confirmed",
    "title": "Being Brave and Helping Each Other in Nigeria!",
    "content": "<h3>Hello from Africa!</h3>\n\nHi everyone! It's your friendly news reporter, here to share some important news from our amazing continent, Africa. Today, we're going to talk about a country called Nigeria. It's a place full of sunshine, happy children, and lots of different languages!\n\nSometimes, grown-ups share news that can sound a little sad or confusing. But don't worry, I'm here to explain it in a way that's easy to understand. We'll learn about being brave and how people help each other.\n\n<h3>Where is Nigeria?</h3>\n\nNigeria is a really big country right here in West Africa. Imagine a giant map of Africa; Nigeria is on the part that bulges out towards the ocean. It has lots of beautiful rivers, green forests, and even big cities!\n\nDid you know? Nigeria is home to many different kinds of animals, like monkeys, elephants, and colourful birds! It's also famous for its delicious Jollof rice and lovely music.\n\nMany wonderful people live in Nigeria. They have vibrant cultures, amazing music, and love to tell stories. Most people in Nigeria live peaceful and happy lives, just like you.\n\n<h3>What Happened? (Gentle News)</h3>\n\nNow, sometimes, a small group of people can make choices that are not very kind. In a place in Nigeria, there was a group of people who were not playing nicely. They wanted other people to join their group and do things their way.\n\nBut the people who lived there, who follow a religion called Islam (just like how some people go to church, they go to a mosque), didn't want to join this unkind group. They bravely said, \"No, thank you!\"\n\nBecause these good people said no, the unkind group did some very sad things. They hurt many people and made families very, very sad. It was a very hard time for the people in that area.\n\nIt's important to remember that this group does not represent everyone. Most people in Nigeria, and most people who follow Islam, are kind, loving, and want peace for everyone in the world.\n\n<h3>Brave People</h3>\n\nEven though it was a scary time, the people who said \"no\" were very brave. It takes a lot of courage to stand up for what you believe is right, especially when someone is trying to make you do something you don't want to do.\n\nTheir courage reminds us that it's always good to be kind and to choose peace. These brave people showed us how important it is to follow your heart and do the right thing, even when it's tough.\n\nDid you know? Being brave doesn't always mean fighting. Sometimes, being brave means speaking up, saying no, or asking for help when you need it. It means being strong inside.\n\n<h3>Who Helps When Things Are Hard?</h3>\n\nWhen sad things like this happen, lots of grown-ups and helpers step in. The government of Nigeria, which is like the big team of grown-ups who look after the whole country, is working very hard.\n\nThey want to make sure the unkind group stops their bad actions. They want to make sure everyone in Nigeria is safe and can live in peace. The government sends helpers to protect people and bring comfort to those who are sad.\n\nOther grown-ups from around the world are also listening and thinking about how they can help Nigeria. When something sad happens, people often come together to support each other. This shows how strong we are when we work together.\n\nDid you know? The United States of America is a country far away, but they also care about what happens in Nigeria and sometimes send helpers to share ideas on how to keep people safe and solve problems.\n\n<h3>Working for Peace</h3>\n\nThe grown-ups are working really hard to make sure these kinds of sad events don't happen again. They are talking to each other and making plans to protect all the wonderful people in Nigeria from harm.\n\nTheir main goal is to bring peace back to all corners of the country. They want children to be able to play safely, and families to live happily without any worries or fear.\n\nPeace means everyone can be friends, share, and live without fear. It's what everyone hopes for, and it's what many grown-ups are working tirelessly to achieve every single day.\n\nDid you know? \"Peace\" is a feeling of calm and happiness, where everyone gets along. It's like when all your friends are playing nicely together in the playground, with no arguments!\n\n<h3>Kindness is Stronger</h3>\n\nThis news reminds us that even when there are people who make sad choices, there are always more people who choose kindness. Kindness is a very strong power, and it can help fix many things!\n\nIt's important for us all to remember to be kind to our friends, our family, and even people we don't know very well. When we are kind, we make the world a better, happier, and safer place for everyone to live in.\n\nLet's send our happy thoughts and wishes for peace to all the children and grown-ups in Nigeria. Remember, we can all choose to be brave and kind every single day to make our world wonderful!\n",
    "summary": "In Nigeria, a sad event happened where some people were hurt by a group of unkind people, but brave individuals stood up for what was right, and grown-ups are working hard to bring peace and keep everyone safe.",
    "whyMatters": "It's important to know that even when sad things happen, there are always brave people, and grown-ups are working hard to make sure everyone is safe and kind to each other.",
    "category": "world",
    "date": "2026-02-05T12:52:43.059Z",
    "image": "https://image.pollinations.ai/prompt/Being%20Brave%20and%20Helping%20Each%20Other%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "being-brave-and-helping-each-other-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/ckgvllk3lx9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files",
    "title": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files",
    "content": "Epstein considered approaching Mugabe about a new currency in 2015 - the latest batch of files show.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-05T12:52:48.159Z",
    "image": "https://image.pollinations.ai/prompt/Zimbabwe's%20Mugabe%20latest%20former%20African%20leader%20to%20be%20mentioned%20in%20Epstein%20files%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "zimbabwes-mugabe-latest-former-african-leader-to-be-mentioned-in-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cy59xlez1q5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "One man killed, girl missing as Storm Leonardo hits Portugal and Spain",
    "title": "One man killed, girl missing as Storm Leonardo hits Portugal and Spain",
    "content": "Leonardo is the latest in a series of half a dozen storms to batter the Iberian Peninsula this year.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-05T12:52:53.433Z",
    "image": "https://image.pollinations.ai/prompt/One%20man%20killed%2C%20girl%20missing%20as%20Storm%20Leonardo%20hits%20Portugal%20and%20Spain%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "one-man-killed-girl-missing-as-storm-leonardo-hits-portugal-and-spain",
    "originalLink": "https://www.aljazeera.com/news/2026/2/5/one-man-killed-girl-missing-as-storm-leonardo-hits-portugal-and-spain?traffic_source=rss"
  },
  {
    "originalTitle": "Christian group says all abductees taken in Nigeria’s Kurmin Wali released",
    "title": "Christian group says all abductees taken in Nigeria’s Kurmin Wali released",
    "content": "Nigerian government yet to confirm that 166 villagers and churchgoers who were kidnapped last month are now back home.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-05T12:52:58.558Z",
    "image": "https://image.pollinations.ai/prompt/Christian%20group%20says%20all%20abductees%20taken%20in%20Nigeria%E2%80%99s%20Kurmin%20Wali%20released%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "christian-group-says-all-abductees-taken-in-nigerias-kurmin-wali-released",
    "originalLink": "https://www.aljazeera.com/news/2026/2/5/christian-group-says-all-abductees-taken-in-nigerias-kurmin-wali-released?traffic_source=rss"
  },
  {
    "originalTitle": "Russia says will act responsibly despite New START nuclear treaty expiry",
    "title": "Russia says will act responsibly despite New START nuclear treaty expiry",
    "content": "Both Beijing and Moscow expressed regret at lapse of last Russia-US nuclear arms control treaty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-05T12:53:03.670Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20says%20will%20act%20responsibly%20despite%20New%20START%20nuclear%20treaty%20expiry%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-says-will-act-responsibly-despite-new-start-nuclear-treaty-expiry",
    "originalLink": "https://www.aljazeera.com/news/2026/2/5/russia-says-will-act-responsibly-despite-new-start-nuclear-treaty-expiry?traffic_source=rss"
  },
  {
    "originalTitle": "US must be prudent when supplying arms to Taiwan, Xi tells Trump",
    "title": "US must be prudent when supplying arms to Taiwan, Xi tells Trump",
    "content": "Their call comes in the wake of a flurry of visits by Western leaders to China in recent months.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-05T12:53:09.059Z",
    "image": "https://image.pollinations.ai/prompt/US%20must%20be%20prudent%20when%20supplying%20arms%20to%20Taiwan%2C%20Xi%20tells%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-must-be-prudent-when-supplying-arms-to-taiwan-xi-tells-trump",
    "originalLink": "https://www.bbc.com/news/articles/c62wpjd3j1zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Naked images remained in Epstein files despite outcry",
    "title": "Naked images remained in Epstein files despite outcry",
    "content": "Four images seen by BBC Verify show partially clothed women with their faces and bodies unredacted.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-05T12:53:14.157Z",
    "image": "https://image.pollinations.ai/prompt/Naked%20images%20remained%20in%20Epstein%20files%20despite%20outcry%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "naked-images-remained-in-epstein-files-despite-outcry",
    "originalLink": "https://www.bbc.com/news/articles/c5yd10yp2m1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We are ready to talk': US news anchor Savannah Guthrie pleads for return of her abducted mother",
    "title": "'We are ready to talk': US news anchor Savannah Guthrie pleads for return of her abducted mother",
    "content": "\"She is without any medicine. She needs it to survive,\" says the NBC host about missing 84-year-old Nancy Guthrie.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "health",
    "date": "2026-02-05T12:53:19.260Z",
    "image": "https://image.pollinations.ai/prompt/'We%20are%20ready%20to%20talk'%3A%20US%20news%20anchor%20Savannah%20Guthrie%20pleads%20for%20return%20of%20her%20abducted%20mother%20realistic%20news%20photography%20context%20Health%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "we-are-ready-to-talk-us-news-anchor-savannah-guthrie-pleads-for-return-of-her-abducted-mother",
    "originalLink": "https://www.bbc.com/news/articles/c2e18wvrx9xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Are Chelsea-Strasbourg transfer deals bad for football?",
    "title": "Are Chelsea-Strasbourg transfer deals bad for football?",
    "content": "Chelsea and Strasbourg have completed 12 transfer deals this summer. Is it out of the ordinary, and might Fifa get involved?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-05T12:53:24.750Z",
    "image": "https://image.pollinations.ai/prompt/Are%20Chelsea-Strasbourg%20transfer%20deals%20bad%20for%20football%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "are-chelsea-strasbourg-transfer-deals-bad-for-football",
    "originalLink": "https://www.bbc.com/sport/football/articles/c89qzpqe1qko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Pure logic' Guehi should play in final - Guardiola seeks rule change",
    "title": "'Pure logic' Guehi should play in final - Guardiola seeks rule change",
    "content": "Manchester City boss Pep Guardiola wants the English Football League to change their rules to allow Marc Guehi to play in the Carabao Cup final against Arsenal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-05T12:53:29.841Z",
    "image": "https://image.pollinations.ai/prompt/'Pure%20logic'%20Guehi%20should%20play%20in%20final%20-%20Guardiola%20seeks%20rule%20change%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pure-logic-guehi-should-play-in-final-guardiola-seeks-rule-change",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy8y677z23go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Horneland a leading candidate for Aberdeen job",
    "title": "Horneland a leading candidate for Aberdeen job",
    "content": "Eirik Horneland has emerged as a leading candidate for the manager's job at Aberdeen.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-05T12:53:34.949Z",
    "image": "https://image.pollinations.ai/prompt/Horneland%20a%20leading%20candidate%20for%20Aberdeen%20job%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "horneland-a-leading-candidate-for-aberdeen-job",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvgn2kv1zwzo?at_medium=RSS&at_campaign=rss"
  }
]