[
  {
    "originalTitle": "More than 200 killed in mine collapse in DR Congo",
    "title": "Heavy Rains and a Mine: Sad News from DR Congo",
    "content": "Hello, my friends! Your friendly news reporter is here. Today, I have some sad news to share with you from a country called DR Congo. It's a beautiful country in Africa, just like many of our homes. \n\n<h3>Sad News from Our Continent</h3>\nSomething very sad happened in DR Congo. It was in a place where people dig for special rocks, deep under the ground. We call these places \"mines\". A big part of the ground in one of these mines fell down. \n\nThis happened after many, many days of heavy rain. It was a very big accident. Many people were working there. We are very sad because many people lost their lives. We send our love to all the families who are hurting right now.\n\nIt is important to know that accidents like this are rare, but when they happen, they make us all very sad. Our hearts go out to everyone affected in this part of Africa.\n\n<h3>What is a Mine?</h3>\n**Did you know?** A mine is like a giant hole that people dig into the earth! It can be very wide, or it can be very deep, like a tunnel. People dig these holes because they are looking for special treasures. \n\nNot shiny gold coins, but special rocks! These rocks are called \"minerals.\" They are very important for making many things we use every day. \n\nImagine digging a very, very big sandcastle, but instead of sand, it's hard rock, and you go deep, deep down! That's a bit like a mine, but much bigger and deeper.\n\n<h3>Why Did This Happen?</h3>\nThe people who work in the mine said it fell down because of too much rain. Imagine if you build a sandcastle, and then a big bucket of water falls on it. What happens?\n\nIt can get soft and collapse, right? That's a bit like what happened. The ground deep inside the mine got very, very wet and soft. It could not hold itself up anymore.\n\nSo, a big part of the mine came crashing down. This happened on a Wednesday. It was a very unexpected and scary event for everyone there. Heavy rains can make the ground weak, even deep underground.\n\n<h3>Who Works in Mines?</h3>\nMany people in DR Congo work in these mines. They work very hard to find the special minerals. They do this because it helps them earn money.\n\nThis money helps them buy food, clothes, and send their children to school. It is a very important job for many families. These workers are very brave. They go deep underground every day to help their families.\n\nWe must remember that they are working to make a living, just like our parents or guardians work hard for us. Their work helps their communities too.\n\n<h3>What Are They Looking For?</h3>\n**Did you know?** Some of the special rocks they find in DR Congo are called \"cobalt\" and \"gold\"! Cobalt is a very important mineral. It is used to make the batteries in your mommy's phone, your daddy's computer, and even some electric cars!\n\nGold is used for beautiful jewellery and also in tiny parts of computers. So, the things they find in the mines help make the world go round! Our phones and tablets need these special rocks to work.\n\nThese minerals from Africa are used all over the world to make new and exciting things. It's amazing how things from deep in the earth connect us all.\n\n<h3>Helping Hands and Hope</h3>\nWhen something sad like this happens, people always come together to help. Many brave people went to the mine to try and find others. They are called rescuers.\n\nThey work very hard to help. It's like when someone falls, and your friends help them up. Everyone wants to make sure that places like mines are safe for workers. \n\nWe hope that rescuers can help everyone, and that things can get better for the families. Many people from different places are sending help and good wishes to DR Congo.\n\n<h3>Learning and Caring</h3>\nThis sad story reminds us about being safe. It teaches us that nature, like heavy rain, can be very powerful. It also reminds us to think about the people who work hard to give us the things we use.\n\nWe should always try to make sure that everyone can work in safe places. We send our thoughts and prayers to everyone in DR Congo. \n\nLet's remember to be kind and caring to each other, always. And let's hope that places where people work can always be safe and sound for everyone.",
    "summary": "Heavy rains caused a mine to collapse in DR Congo, leading to a sad accident where many people who were working to find special rocks lost their lives.",
    "whyMatters": "This is important because it shows how nature can be powerful and how we must keep workers safe when they dig for important minerals that we use every day in things like phones and computers.",
    "category": "technology",
    "date": "2026-01-31T18:25:07.363Z",
    "image": "https://image.pollinations.ai/prompt/Heavy%20Rains%20and%20a%20Mine%3A%20Sad%20News%20from%20DR%20Congo%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "heavy-rains-and-a-mine-sad-news-from-dr-congo",
    "originalLink": "https://www.bbc.com/news/articles/cly381dvnvzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "title": "Big Dreams for Uganda's Future!",
    "content": "<h3>Hello, Super Readers!</h3>\nHello, amazing friends! It's your friendly African news reporter here, ready to share some exciting news from our wonderful continent! Today, we're going on an adventure to a beautiful country called Uganda. It's a place with lovely green lands and friendly people. We are going to learn about someone who has big dreams for Uganda!\n\n<h3>Meet a Special Son</h3>\nIn Uganda, there is a very important leader called the President. The President helps everyone in the country. He helps make sure there are schools for children and hospitals for when people are sick. Now, the President has a son. This son is also a grown-up, and he loves his country very much. He sees all the good things and also thinks about ways to make Uganda even better!\n\n**Did you know?** Uganda is sometimes called the \"Pearl of Africa\" because it is so beautiful! It has amazing animals like gorillas and giraffes.\n\n<h3>What Does a Leader Do?</h3>\nBeing a leader is a very big job! Imagine you are the leader of your classroom. You would want everyone to be happy and learn lots of things, right? A country's leader does that for a whole nation! They listen to people, they help build roads, and they try to keep everyone safe and smiling. The President's son wants to do this important work too. He wants to help Uganda grow stronger and happier for all its people.\n\n**Did you know?** The capital city of Uganda is called Kampala. It's a very busy and exciting city!\n\n<h3>Sharing Ideas for Tomorrow</h3>\nWhen people want to help lead a country, they share their ideas. They might talk about new schools, new jobs, or new ways to protect nature. The President's son talks a lot about his ideas for Uganda's future. He uses special ways to tell people what he thinks, like using social media on the internet. It's like sending messages to many friends at once! He wants everyone to know his big plans for making Uganda shine even brighter.\n\n<h3>Big Dreams for Uganda</h3>\nThe President's son has many dreams for his country. He dreams of a Uganda where every child can go to school and learn. He dreams of a place where families are healthy and happy. He dreams of new inventions and lots of yummy food for everyone. He believes in the power of Uganda and its people. His heart is full of hope for a wonderful future for his homeland. He wants to help make all these good dreams come true.\n\n**Did you know?** Uganda is home to the source of the mighty River Nile, the longest river in Africa! It's an incredible natural wonder.\n\n<h3>Our Beautiful Uganda</h3>\nUganda is a truly special place. Imagine vast lakes, towering mountains, and lush forests. It's a country rich with different cultures and languages. People in Uganda love to sing, dance, and tell stories. The President's son knows how amazing Uganda is. He wants to make sure this beauty and happiness last for a very long time. He wants to make sure all the children of Uganda have a bright and happy future in their beautiful home.\n\n**Did you know?** In Uganda, people speak many different languages, but the official languages are English and Luganda. How cool is that!\n\n<h3>Working Together for Africa</h3>\nUganda is one of many wonderful countries in Africa, our amazing continent! When leaders work together, great things happen. The President's son hopes that Uganda can be a strong example of peace and progress. He wants Uganda to work with other African countries to make our whole continent a better place for everyone. Sharing ideas and helping each other is how we all grow strong.\n\n<h3>Being a Good Helper</h3>\nWhat makes a good leader or a good helper? It's about being kind, listening to others, and working hard. It's about wanting what is best for everyone. The President's son wants to be a good helper for his country. He wants to guide Uganda with a kind heart and a strong spirit. He knows that with hard work and big dreams, anything is possible for Uganda!\n\n**Did you know?** Many African leaders work together in groups like the African Union to help all countries on our continent!\n\n<h3>A Future Full of Hope!</h3>\nSo, there you have it, my curious friends! We learned about a leader's son in Uganda who has big dreams and wants to help his country. It's all about wishing for a bright future and working hard to make it happen. Isn't it wonderful to think about all the good things that can happen when people have hope and big plans? Let's all wish Uganda and its people a future full of happiness and success! Until next time, keep dreaming big!",
    "summary": "A leader's son in Uganda has big dreams to help his country grow and prosper, sharing his ideas for a bright future.",
    "whyMatters": "It matters because when people have big dreams to help their country, they can make wonderful changes that help everyone, especially children, live happy and healthy lives.",
    "category": "politics",
    "date": "2026-01-31T18:25:30.811Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Dreams%20for%20Uganda's%20Future!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-dreams-for-ugandas-future",
    "originalLink": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mali lawmaker jailed in Ivory Coast for insulting president",
    "title": "Mali lawmaker jailed in Ivory Coast for insulting president",
    "content": "Prosecutors say Mamadou Hawa Gassama described Alassane Ouattara as a \"tyrant\" and \"an enemy of Mali\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-31T18:25:35.947Z",
    "image": "https://image.pollinations.ai/prompt/Mali%20lawmaker%20jailed%20in%20Ivory%20Coast%20for%20insulting%20president%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mali-lawmaker-jailed-in-ivory-coast-for-insulting-president",
    "originalLink": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Explosion in Iran’s Bandar Abbas caused by gas leak, official says",
    "title": "Explosion in Iran’s Bandar Abbas caused by gas leak, official says",
    "content": "Local fire official says gas leak likely caused blast that ripped through residential building in Iranian port city.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:25:41.169Z",
    "image": "https://image.pollinations.ai/prompt/Explosion%20in%20Iran%E2%80%99s%20Bandar%20Abbas%20caused%20by%20gas%20leak%2C%20official%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "explosion-in-irans-bandar-abbas-caused-by-gas-leak-official-says",
    "originalLink": "https://www.aljazeera.com/news/2026/1/31/explosion-in-irans-bandar-abbas-caused-by-gas-leak-official-says?traffic_source=rss"
  },
  {
    "originalTitle": "NBA issues 76ers’ Paul George with 25-game ban for drug violation",
    "title": "NBA issues 76ers’ Paul George with 25-game ban for drug violation",
    "content": "NBA suspends Philadelphia 76ers' nine-time All Star Paul George for 25 games for undisclosed anti-drug policy violation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:25:46.297Z",
    "image": "https://image.pollinations.ai/prompt/NBA%20issues%2076ers%E2%80%99%20Paul%20George%20with%2025-game%20ban%20for%20drug%20violation%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nba-issues-76ers-paul-george-with-25-game-ban-for-drug-violation",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/31/nba-issues-76ers-paul-george-with-25-game-ban-for-drug-violation?traffic_source=rss"
  },
  {
    "originalTitle": "Milan protests decry ‘creeping fascism’ of ICE role at Winter Olympics",
    "title": "Big News from Italy! Why People are Marching for Fair Games!",
    "content": "Hello, amazing friends in Africa! It’s your kid-friendly news reporter here, ready to share a cool story from far away. Today, we are travelling all the way to a beautiful country called Italy! Italy is in Europe, and it's famous for yummy food like pizza and pasta, and incredible history.\n\n<h3>A Snowy Sports Party!</h3>\n\nImagine a super exciting party where athletes from all over the world come together to play in the snow and ice! That’s what the Winter Olympics are all about. It’s a huge sports event that happens every four years. Think about zooming down mountains on skis, spinning gracefully on ice skates, or sliding really fast on a bobsled! It’s all about speed, skill, and lots of fun in the cold.\n\nThe next Winter Olympics will be in the year 2026. That’s still a little while away, but people are already getting ready! These special games will happen in a city in Italy called Milan, and also in a snowy place called Cortina. Milano-Cortina 2026 is what they call it! Isn't that a big name? People are very excited to welcome the whole world to their country for this amazing sports celebration. It's a chance for different countries to come together and cheer for their favourite athletes.\n\n**Did you know?** The Olympic Games have been happening for a very, very long time! They started in ancient Greece over 2,000 years ago! That's older than your great-grandparents' great-grandparents! Today, they are still a symbol of peace and friendship around the world.\n\n<h3>Meet the People in Milan</h3>\n\nIn Milan, a big city in Italy, there are many friendly people. Recently, some of these people gathered together. They weren't just going for a walk; they were doing something special called a \"protest.\" A protest is when a group of people stand together to show what they believe is right or what they are worried about. They want to make sure their voices are heard by everyone, especially by the people who make important decisions.\n\nWhen people protest, they often hold up signs with words on them. They might sing songs or chant slogans that tell everyone what they are thinking. It's a peaceful way for many people to share the same message. They were marching in the streets of Milan, holding their signs up high, sharing their big feelings about the upcoming Winter Olympics. They want the games to be perfect and welcoming for everyone who comes to Italy.\n\n**Did you know?** Italy is shaped like a boot! If you look at a map of the world, you can easily spot it because it looks just like a shoe kicking a ball! Milan is a very fashionable city in the northern part of this \"boot.\"\n\n<h3>What is a \"Protest\"?</h3>\n\nLet's talk a little more about what a protest means for kids. Imagine you and your friends want to play a certain game at school, but some grown-ups say \"no.\" If all of you together say \"But we really want to play this game, and here’s why!\" that’s a bit like a small protest. You are using your voices together to ask for something you believe in.\n\nThese people in Milan were doing something similar, but on a bigger scale. They were called \"demonstrators,\" which is just another word for people who join a protest. They wanted to show the world that they have important thoughts about how the Winter Olympics in their country should be organized. They gathered their signs and walked together, making sure everyone saw and heard them. They were speaking up for what they felt was fair and right.\n\n**Did you know?** Peaceful protests are a way for people to share their opinions and help make changes in the world without hurting anyone. It’s about using your voice, not your fists!\n\n<h3>Who is \"ICE\" and Why Are People Worried?</h3>\n\nNow, this is where it gets a little tricky, but we can understand it together! The people protesting in Milan were worried about a special team from another country, the United States of America. This team is called \"ICE.\" ICE stands for \"Immigration and Customs Enforcement.\" That's a very long name, right?\n\nThink of ICE as a special police team that usually works at the borders of America. Their job is to help with rules about who comes into the country and who leaves. They help make sure everyone follows the laws. So, they are a team that deals with important rules about people travelling between countries.\n\nThe people in Milan were protesting because they heard that this ICE team might be helping with security at the Winter Olympics in 2026. Security means keeping everyone safe. It's important to have security at big events, just like your school has teachers and guards to keep you safe. But some people in Milan were worried that having the ICE team there might change the happy, welcoming feeling of the Olympics.\n\nThey were worried that this special team from America, with their very strict rules, might make some visitors or athletes feel nervous or unwelcome. The Olympics are supposed to be a time for everyone, from every country, to feel happy and included. They wanted the games to be a place of pure sportsmanship and friendship, not a place where some people might feel a bit scared or singled out because of where they come from.\n\n**Did you know?** The United States of America is a very large country, and it's home to many different kinds of people from all over the world! It has beautiful places like the Grand Canyon and tall cities like New York.\n\n<h3>Wanting Everyone to Feel Welcome</h3>\n\nThe main thing the people protesting in Milan wanted to say was simple: they want *everyone* to feel welcome at the Winter Olympics. They believe that big sports events like the Olympics should bring people together, not make them feel apart. They want all the athletes, coaches, and visitors to feel safe, happy, and included, no matter where they are from.\n\nThey imagine the Olympics as a big global family reunion, where everyone is smiling, cheering, and having a good time. They want the security and safety teams to be friendly and helpful to *all* people. They worry that if a team like ICE, known for very strict border rules, is there, it might make some people feel less welcome. It's like wanting your birthday party to be fun for every single one of your friends, and not wanting anyone to feel left out or worried.\n\nThe protestors were showing that they care deeply about the spirit of the Olympic Games. This spirit is about peace, understanding, and fair play among all nations. They want the Milano-Cortina 2026 Winter Olympics to truly show these beautiful values to the whole world. Their voices were loud and clear, asking for a truly open and friendly event for all.\n\n**Did you know?** The Olympic rings – those five colourful circles linked together – represent the five continents of the world coming together in friendship! Each colour also appears in at least one national flag.\n\n<h3>What Happens Next?</h3>\n\nSo, what happens after a protest? Well, when people protest, they hope that the people in charge will listen to their concerns. The people who are organizing the Milano-Cortina 2026 Winter Olympics, and also the leaders in Italy, will hear what the protestors have said. They will think about the message: that the games should be welcoming for everyone.\n\nIt’s important that people’s feelings and worries are heard. The protestors hope that the decisions made about security for the big games will help everyone feel safe *and* happy, without anyone feeling left out. They want the spirit of friendship and fair play to shine brightly at the Winter Olympics in Italy. It reminds us that even kids can have ideas about fairness and how important it is for everyone to feel included and safe.\n\n**Did you know?** When a country hosts the Olympics, it's a very big job! They build new places for sports and get everything ready to welcome thousands of athletes and visitors. It takes many years of planning!\n\nThis story from Italy shows us that people everywhere care about making sure big events are kind and fair for all. They want the Winter Olympics in 2026 to be remembered as a time when everyone felt welcome to celebrate sports and friendship.",
    "summary": "People in Milan, Italy, protested to share their worry that a special team from America called ICE helping at the 2026 Winter Olympics might make some visitors feel unwelcome, asking for friendly and fair games for everyone.",
    "whyMatters": "This is important because the Olympics are meant to be a happy time for all countries to come together and play fair, and people want to make sure everyone feels safe and welcome, like a big global family party where no one is left out.",
    "category": "world",
    "date": "2026-01-31T18:26:13.188Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Italy!%20Why%20People%20are%20Marching%20for%20Fair%20Games!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-italy-why-people-are-marching-for-fair-games",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/31/milan-demonstrators-decry-creeping-fascism-of-ice-role-at-winter-olympics?traffic_source=rss"
  },
  {
    "originalTitle": "Takeaways from the millions of newly released Epstein files ",
    "title": "Takeaways from the millions of newly released Epstein files ",
    "content": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:18.699Z",
    "image": "https://image.pollinations.ai/prompt/Takeaways%20from%20the%20millions%20of%20newly%20released%20Epstein%20files%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "takeaways-from-the-millions-of-newly-released-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cevnmxyy4wjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say",
    "title": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say",
    "content": "Israel's military confirmed the strikes, which come during a ceasefire that Israel and Hamas accuse each other of breaking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:23.833Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20air%20strikes%20kill%20at%20least%2032%20Palestinians%20in%20Gaza%2C%20rescue%20officials%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-air-strikes-kill-at-least-32-palestinians-in-gaza-rescue-officials-say",
    "originalLink": "https://www.bbc.com/news/articles/c701g1g00gdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pedro Pascal and Meryl Streep lead tributes to Catherine O'Hara",
    "title": "Pedro Pascal and Meryl Streep lead tributes to Catherine O'Hara",
    "content": "The Canadian comedic actress died in Los Angeles on Friday at the age of 71 following a brief illness.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:28.958Z",
    "image": "https://image.pollinations.ai/prompt/Pedro%20Pascal%20and%20Meryl%20Streep%20lead%20tributes%20to%20Catherine%20O'Hara%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pedro-pascal-and-meryl-streep-lead-tributes-to-catherine-ohara",
    "originalLink": "https://www.bbc.com/news/articles/czejk8pnk82o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Forest agree Ortega deal and target Inter's Frattesi",
    "title": "Forest agree Ortega deal and target Inter's Frattesi",
    "content": "Nottingham Forest agree a deal for Manchester City goalkeeper Stefan Ortega worth up to £500,000.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:34.557Z",
    "image": "https://image.pollinations.ai/prompt/Forest%20agree%20Ortega%20deal%20and%20target%20Inter's%20Frattesi%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "forest-agree-ortega-deal-and-target-inters-frattesi",
    "originalLink": "https://www.bbc.com/sport/football/articles/cp9jev077j3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iraola hails 'incredible' goalscoring teenager Kroupi",
    "title": "Iraola hails 'incredible' goalscoring teenager Kroupi",
    "content": "Bournemouth manager Andoni Iraola credits much of his side's recent improvment to \"incredible\" performances of Eli Junior Kroupi, as well as the depth brought in by new signings.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:39.682Z",
    "image": "https://image.pollinations.ai/prompt/Iraola%20hails%20'incredible'%20goalscoring%20teenager%20Kroupi%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iraola-hails-incredible-goalscoring-teenager-kroupi",
    "originalLink": "https://www.bbc.com/sport/football/videos/cd9ewdkz58lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal showed character and quality in win at Leeds - Arteta ",
    "title": "Arsenal showed character and quality in win at Leeds - Arteta ",
    "content": "Arsenal manager Mikel Arteta says he is pleased with the dominance, character and quality that his side showed in their 4-0 win over Leeds.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T18:26:44.825Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20showed%20character%20and%20quality%20in%20win%20at%20Leeds%20-%20Arteta%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-showed-character-and-quality-in-win-at-leeds-arteta",
    "originalLink": "https://www.bbc.com/sport/football/videos/cx2l5gr9490o?at_medium=RSS&at_campaign=rss"
  }
]