[
  {
    "originalTitle": "'Affront to humanity': Sudan slams Uganda for hosting RSF paramilitary boss",
    "title": "News for Kids: Let's Talk About Peace in Sudan!",
    "content": "<h3>Hello, Super Friends!</h3>\nHi everyone! It's your friendly reporter here, bringing you super important news from our amazing continent, Africa! Today, we're going to talk about two wonderful countries, Sudan and Uganda. Sometimes, even good friends have disagreements, and that's a bit like what's happening now. Don't worry, we'll explain everything in a simple way, like a story!\n\nWe want all our friends in Africa to live happily and peacefully. So let's find out what's going on. Get ready for some cool facts too! We hope this news helps you understand why peace is so important for everyone, especially for children just like you.\n\n<h3>What's Happening in Sudan?</h3>\nImagine you and your friend are playing, but then you start arguing very, very loudly. In a country, when big groups of people argue so much that they start fighting, we call it a conflict or a war. This is happening in a country called Sudan. Sudan is a very, very big country in Africa, with lots of kind people and beautiful places.\n\nBut right now, some groups are fighting there. This fighting has been going on for a while. It makes people very sad and scared. Homes get broken, and it's hard for children to go to school or even find yummy food to eat. No one likes fighting, especially when it hurts innocent people. We all wish for the fighting to stop soon.\n\n<b>Did you know?</b> Sudan is one of the largest countries in Africa! It has a very long river called the Nile flowing through it, which is super important for many people and animals.\n\n<h3>Meet the \"Rapid Support Forces\"</h3>\nSo, in Sudan, there are two big groups who are fighting. One is the country's main army, like the protectors of the country. The other group is called the \"Rapid Support Forces,\" or RSF for short. It's a special kind of army group, but they are not the main army. They have a leader, a person named Mr. Mohamed Hamdan Dagalo.\n\nHe is like the head of the RSF team. These two big groups, the army and the RSF, have been having a big disagreement, and it turned into fighting. The fighting makes life very difficult for everyone else in Sudan. They just want peace. When there is fighting, people can't go to work or visit their friends, which makes everyone sad.\n\n<b>Did you know?</b> When there is fighting, doctors and nurses work extra hard to help people who are hurt. They are true heroes because they help everyone get better!\n\n<h3>Uganda's Meeting</h3>\nNow, here's where another wonderful African country, Uganda, comes into our story. Uganda is known as the \"Pearl of Africa\" because it's so beautiful! Recently, the leaders of Uganda met with Mr. Mohamed Hamdan Dagalo, the leader of the RSF. Imagine your friend's mum invited someone to their house that your family doesn't like very much, especially if that person caused trouble. That's a bit how Sudan feels right now.\n\nSudan is saying, \"Hey, why did you meet with him? We are having a big problem because of his group!\" It's like feeling confused and a little bit sad when your friends don't agree on how to help. They want everyone to help in a way that truly brings peace and stops the fighting for good.\n\n<b>Did you know?</b> Uganda is famous for its mountain gorillas, which are big, gentle animals that live in the forests! They are very special animals in Africa.\n\n<h3>What Are \"International Laws\"?</h3>\nThis is a fancy name for something very simple. Think of \"international laws\" as special rules that all countries agree to follow. It's like rules for a big game where all the countries in the world are players. These rules help countries be good neighbours and help each other. They make sure everyone is treated fairly and that countries try to help stop fighting, not make it worse.\n\nSudan believes that by meeting Mr. Dagalo, Uganda might not be following these special rules. They think Uganda should not be talking to people who are causing war. These rules are very important because they help keep the world safe and fair for everyone. They help countries work together to solve big problems.\n\n<b>Did you know?</b> The United Nations is like a big club for almost all countries in the world. They help make these international laws and work for peace and friendship among nations!\n\n<h3>Why is Sudan Upset?</h3>\nSudan is very, very sad and upset. They believe that if other countries, like Uganda, talk to Mr. Dagalo and his RSF group, it might make the fighting in Sudan last even longer. It's like if two kids are fighting, and then another friend comes and talks to one of the fighters as if nothing is wrong. The friend who is getting hurt might feel like no one is helping them.\n\nSudan wants all its neighbours and all countries to help stop the war and bring peace. They feel that meeting with the RSF leader doesn't help make peace. They want countries to say \"no\" to fighting and \"yes\" to talking about peace with *everyone* involved in a fair way, not just one side. They want everyone to encourage *all* fighting groups to stop.\n\n<b>Did you know?</b> When countries are upset with each other, sometimes they send messages or letters to explain how they feel, just like when you tell your friend you're upset and why.\n\n<h3>Why is Peace So Important?</h3>\nPeace is the most wonderful thing in the world! When there is peace, children can go to school, play with their friends, and sleep safely in their beds. Families can live together without fear. Shops can open, and farmers can grow food. In Sudan, because of the fighting, many children can't go to school right now, and finding food can be hard.\n\nPeace means everyone can live a happy, normal life. It means smiles, laughter, and a bright future for all children. That's why leaders and good people everywhere are always working hard to bring peace to places where there is fighting. Peace means families can stay together and build happy homes. It means growth and happiness for everyone.\n\n<b>Did you know?</b> Many kids around the world draw pictures of peace, often with doves or rainbows, to show what a happy, peaceful world looks like, full of bright colours and hope!\n\n<h3>What Everyone Hopes For</h3>\nAll the people in Sudan, and people all over Africa and the world, want the fighting to stop. They want peace to come back to Sudan very, very soon. Sudan wants other countries to help them achieve this peace by not talking to the groups that are fighting, but rather by helping to find a way for *everyone* to stop the fighting and live together.\n\nThey want countries to encourage *all* parties to sit down and talk about how to stop the war and make Sudan safe again for all its children and families. It's a big wish, but it's a very important one. Everyone wants to see a safe and happy Sudan again, where children can play freely and learn in school.\n\n<b>Did you know?</b> Sometimes, important people called \"diplomats\" help countries talk to each other to solve problems without fighting. They are like peace-makers who help everyone understand each other!\n\n<h3>Let's Be Friends and Help!</h3>\nSo, that's the story of Sudan and Uganda. It reminds us that being good neighbours and helping each other is super important. Even when there are disagreements, talking and understanding can help. Everyone hopes that Sudan and Uganda can understand each other better, and most importantly, that peace will come back to Sudan very, very soon.\n\nWe all want to see the children of Sudan playing, learning, and laughing again. Let's send our happy thoughts and wishes for peace to all our friends in Sudan! Thank you for listening, super friends! Always remember that peace begins with kindness and understanding, even between countries.\n\n<b>Did you know?</b> When children play together from different countries, it helps them learn about each other and become friends, building a more peaceful world one friendship at a time!",
    "summary": "Sudan is sad because its friend Uganda met with a leader of a group that is fighting in Sudan, and Sudan wants everyone to help bring peace.",
    "whyMatters": "It matters because when countries work together for peace, children can go to school and play safely, and no one has to be scared.",
    "category": "government",
    "date": "2026-02-22T23:20:50.897Z",
    "image": "https://image.pollinations.ai/prompt/News%20for%20Kids%3A%20Let's%20Talk%20About%20Peace%20in%20Sudan!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-for-kids-lets-talk-about-peace-in-sudan",
    "originalLink": "https://www.bbc.com/news/articles/c20lwznegk4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "content": "Days of competition culminate in a fishing contest rooted in efforts to cement local peace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:20:56.007Z",
    "image": "https://image.pollinations.ai/prompt/Catch%20of%20the%20day%3A%20Pictures%20from%20spectacular%20Nigerian%20fishing%20festival%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "catch-of-the-day-pictures-from-spectacular-nigerian-fishing-festival",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "content": "In a rare occurence, three soldiers were handed jail terms for killings in the troubled Anglophone region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T23:21:01.118Z",
    "image": "https://image.pollinations.ai/prompt/Rare%20prison%20sentences%20handed%20to%20Cameroon%20soldiers%20after%20killing%20of%2021%20civilians%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rare-prison-sentences-handed-to-cameroon-soldiers-after-killing-of-21-civilians",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Brazil does not want ‘a new Cold War’, says President Lula",
    "title": "Brazil does not want ‘a new Cold War’, says President Lula",
    "content": "Lula says he wants to tell US President Trump that Brazil wishes for all countries to be treated 'equally'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:06.390Z",
    "image": "https://image.pollinations.ai/prompt/Brazil%20does%20not%20want%20%E2%80%98a%20new%20Cold%20War%E2%80%99%2C%20says%20President%20Lula%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brazil-does-not-want-a-new-cold-war-says-president-lula",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/brazil-does-not-want-a-new-cold-war-says-lula?traffic_source=rss"
  },
  {
    "originalTitle": "Mexico announces killing of drug cartel kingpin ‘El Mencho’",
    "title": "Mexico announces killing of drug cartel kingpin ‘El Mencho’",
    "content": "Mexican leader Sheinbaum says government is responding to reported violence after operation against the cartel leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:11.502Z",
    "image": "https://image.pollinations.ai/prompt/Mexico%20announces%20killing%20of%20drug%20cartel%20kingpin%20%E2%80%98El%20Mencho%E2%80%99%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mexico-announces-killing-of-drug-cartel-kingpin-el-mencho",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/mexico-announces-killing-of-drug-cartel-kingpin-el-mencho?traffic_source=rss"
  },
  {
    "originalTitle": "What will Trump’s latest sweeping tariffs mean for the world?",
    "title": "What will Trump’s latest sweeping tariffs mean for the world?",
    "content": "The US president has injected new uncertainty into the global economy with a 15 percent tariff on all imports.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:16.613Z",
    "image": "https://image.pollinations.ai/prompt/What%20will%20Trump%E2%80%99s%20latest%20sweeping%20tariffs%20mean%20for%20the%20world%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-will-trumps-latest-sweeping-tariffs-mean-for-the-world",
    "originalLink": "https://www.aljazeera.com/video/inside-story/2026/2/22/what-will-trumps-latest-sweeping-tariffs-mean-for-the-world?traffic_source=rss"
  },
  {
    "originalTitle": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "title": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "content": "Ukraine's president sat down with the BBC's Jeremy Bowen in Kyiv days before the four-year anniversary of the war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:22.228Z",
    "image": "https://image.pollinations.ai/prompt/Zelensky%20tells%20BBC%20Putin%20has%20started%20WW3%20and%20must%20be%20stopped%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "zelensky-tells-bbc-putin-has-started-ww3-and-must-be-stopped",
    "originalLink": "https://www.bbc.com/news/articles/cvgj9p15y87o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mexico's most wanted drug lord 'El Mencho' killed in military operation",
    "title": "Mexico's most wanted drug lord 'El Mencho' killed in military operation",
    "content": "Nemesio Oseguera Cervantes, known as \"El Mencho\", headed one of Mexico's most powerful drug cartels.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:27.336Z",
    "image": "https://image.pollinations.ai/prompt/Mexico's%20most%20wanted%20drug%20lord%20'El%20Mencho'%20killed%20in%20military%20operation%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mexicos-most-wanted-drug-lord-el-mencho-killed-in-military-operation",
    "originalLink": "https://www.bbc.com/news/articles/cy4wywnrdd8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Armed man killed after entering secure perimeter of Trump's residence, Secret Service says",
    "title": "Armed man killed after entering secure perimeter of Trump's residence, Secret Service says",
    "content": "The suspect was carrying a shotgun and fuel can when he was killed, officers said. Trump was in Washington DC at the time.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:32.452Z",
    "image": "https://image.pollinations.ai/prompt/Armed%20man%20killed%20after%20entering%20secure%20perimeter%20of%20Trump's%20residence%2C%20Secret%20Service%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "armed-man-killed-after-entering-secure-perimeter-of-trumps-residence-secret-service-says",
    "originalLink": "https://www.bbc.com/news/articles/cp32l9w9pgyo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Eze torments Spurs again as leaders Arsenal win north London derby",
    "title": "Eze torments Spurs again as leaders Arsenal win north London derby",
    "content": "Eberechi Eze torments Tottenham Hotspur again as Arsenal made a title statement of intent by restoring their lead at the top of the Premier League table to five points with victory in the north London derby.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T23:21:37.812Z",
    "image": "https://image.pollinations.ai/prompt/Eze%20torments%20Spurs%20again%20as%20leaders%20Arsenal%20win%20north%20London%20derby%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eze-torments-spurs-again-as-leaders-arsenal-win-north-london-derby",
    "originalLink": "https://www.bbc.com/sport/football/videos/cr73z495vyxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mac Allister scores added-time winner as Liverpool beat Forest",
    "title": "Mac Allister scores added-time winner as Liverpool beat Forest",
    "content": "Alexis Mac Allister scores a 97th-minute winner as Liverpool beat Nottingham Forest in a chaotic finish at the City Ground.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:42.915Z",
    "image": "https://image.pollinations.ai/prompt/Mac%20Allister%20scores%20added-time%20winner%20as%20Liverpool%20beat%20Forest%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mac-allister-scores-added-time-winner-as-liverpool-beat-forest",
    "originalLink": "https://www.bbc.com/sport/football/videos/cvgvn0ed2ppo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Jimenez scores twice as Fulham leapfrog Sunderland into top half of table",
    "title": "Jimenez scores twice as Fulham leapfrog Sunderland into top half of table",
    "content": "Raul Jimenez scores twice as Fulham end a run of three consecutive defeats, with a 3-1 win over Sunderland at the Stadium of Light in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T23:21:48.014Z",
    "image": "https://image.pollinations.ai/prompt/Jimenez%20scores%20twice%20as%20Fulham%20leapfrog%20Sunderland%20into%20top%20half%20of%20table%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "jimenez-scores-twice-as-fulham-leapfrog-sunderland-into-top-half-of-table",
    "originalLink": "https://www.bbc.com/sport/football/videos/c3wldnxdd5do?at_medium=RSS&at_campaign=rss"
  }
]