[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "content": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:14:20.952Z",
    "image": "https://image.pollinations.ai/prompt/'Half%20of%20my%20friends%20were%20killed'%20-%20the%20girls%20returning%20to%20a%20school%20caught%20up%20in%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "half-of-my-friends-were-killed-the-girls-returning-to-a-school-caught-up-in-war",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Key Can Travel!",
    "content": "<h3>Hello, Super Kids of Africa!</h3>\n\nHi everyone! It's your friendly news reporter here, bringing you some exciting news from our amazing continent, Africa! Today, we're talking about a very special hero named Nelson Mandela. Have you heard of him? He was a wonderful leader from South Africa, and he taught us all about being fair and kind.\n\n<h3>Who Was Nelson Mandela?</h3>\n\nNelson Mandela, or 'Tata Madiba' as many loved to call him, was a very brave man. He wanted everyone in his country, no matter their skin color, to be treated equally. He fought for freedom and fairness for many, many years. Because he believed in this so strongly, some people who didn't agree with him put him in prison for a very long time. But he never gave up!\n\nDid you know? Nelson Mandela spent 27 years in prison! That's longer than most of your parents have been alive! But even in prison, he kept hope alive and believed in a better future for everyone.\n\n<h3>What Are These Special Things?</h3>\n\nGuess what? Nelson Mandela had some special things. Not toys or games, but things that tell a big story about his life. We are talking about his prison key, his cool sunglasses, and a shirt he once wore. These are not just any old key, sunglasses, or shirt. They are like treasures because they belonged to a great hero!\n\n<h3>A Key That Tells a Big Story</h3>\n\nImagine a key. This key was used to lock the door of the prison cell where Nelson Mandela lived for many years. It's a very famous key! For a long time, it was a symbol of him being locked away. But after he came out and helped make his country free, that key now reminds us that even after a hard time, good things can happen. It shows that freedom always wins!\n\nDid you know? The key we are talking about is from Robben Island prison, a famous place in South Africa where Nelson Mandela was kept. Now, it's a museum where people can learn his story!\n\n<h3>His Sunglasses and Shirt</h3>\n\nNelson Mandela also had some simple sunglasses. He wore them on sunny days, just like you might wear yours! And he had shirts, too, like the one we are talking about. These items might seem small, but because they were his, they help us remember him. They remind us of the person he was – strong, smart, and always fighting for what was right.\n\nThese personal items are like little pieces of history. They help us imagine him, walk in his shoes (or wear his shirt!), and remember his important journey.\n\n<h3>Mama Zenani's Wish</h3>\n\nNelson Mandela had a daughter named Mama Zenani. She is also a very kind and caring person. Mama Zenani had these special items of her father's, and she wanted to do something with them. She wanted to sell them so that people all over the world could see them and remember her dad's story. It's like sharing a special memory with everyone.\n\nShe wanted to share his legacy, which means the important lessons and memories he left behind for us all.\n\n<h3>A Little Problem at Home</h3>\n\nNow, here's where it got a little tricky, like a puzzle! Some people in charge of the country, we call them the 'authorities,' said, \"Wait! These items are super important for our country's history! They are part of South Africa's 'heritage'.\" Heritage means all the special things, stories, and traditions that belong to a country and its people. They thought these items should stay in South Africa.\n\nThey didn't want the items to 'export,' which means to be sent out of the country to another place. They felt they were national treasures that should always be kept at home.\n\n<h3>What is 'Heritage'?</h3>\n\nLet's talk more about heritage! Imagine your special family photos, or a unique recipe passed down from your grandmother. These are part of your family's heritage. For a country, heritage means all the old buildings, special songs, wise stories, and important items that tell us about our past and make us who we are today. Nelson Mandela's items are a big part of South Africa's heritage.\n\nDid you know? Africa has so much amazing heritage! From ancient pyramids in Egypt to colourful clothes in Ghana, and powerful stories from all over. Each country has its special history!\n\n<h3>A Big Game in Court</h3>\n\nSo, what happened? Mama Zenani and the 'authorities' couldn't agree. So, they went to a special place called a 'court.' A court is like a big, serious meeting place where people talk about problems and a judge decides what is fair and right. It's like a big game where rules are followed, and a decision is made.\n\nThis whole thing is called a 'court battle' – but don't worry, no one was fighting with fists! It was all about talking and showing reasons why they thought their way was best. It took a while, like a long match.\n\n<h3>Good News! Mama Zenani Won!</h3>\n\nAfter all the talking and deciding, guess what? Mama Zenani won the court battle! This means the judge said it was okay for her to sell her father's special key, sunglasses, and shirt. It was good news for her because now she can share these items and her father's story with more people around the world.\n\nIt was a big decision, and it means that a daughter's wish to honour her father was respected.\n\n<h3>What Happens Now?</h3>\n\nNow that Mama Zenani has won, she can decide where these special items go. They might be sold to someone who wants to keep them safe and show them to others, perhaps in a museum. This way, many more children and grown-ups can learn about Nelson Mandela and his amazing life, even if they live far away from South Africa.\n\nIt means that Tata Madiba's story can continue to travel and inspire people everywhere!\n\n<h3>Why Are These Things So Important?</h3>\n\nThese items are important because they are more than just a key or a shirt. They are powerful reminders of a man who changed the world with kindness, bravery, and a big heart. They teach us that even when things are hard, we should never stop fighting for what is right. They help us remember Nelson Mandela and the big lessons he taught us about peace and equality.\n\nLet's always remember the great Tata Madiba and his incredible journey for fairness for all!\n",
    "summary": "Nelson Mandela's daughter, Mama Zenani, won a court case, meaning she can now sell her father's special prison key, sunglasses, and shirt, which the government wanted to keep in South Africa as national heritage.",
    "whyMatters": "This news is important because Nelson Mandela was a great African hero who taught us about fairness and freedom, and now his personal items can travel the world to help more people learn about his amazing story and what he stood for.",
    "category": "world",
    "date": "2026-01-24T17:14:47.173Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Key%20Can%20Travel!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-key-can-travel",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:14:52.350Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump threatens 100 percent tariff on Canada over China deal",
    "title": "Trump threatens 100 percent tariff on Canada over China deal",
    "content": "Donald Trump's threat comes after Canada reached deal with China last week on trade of agriproducts, electric vehicles.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:14:57.613Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20100%20percent%20tariff%20on%20Canada%20over%20China%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-100-percent-tariff-on-canada-over-china-deal",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/trump-threatens-100-percent-tariff-on-canada-over-china-deal?traffic_source=rss"
  },
  {
    "originalTitle": "Iran rejects UN rights resolution condemning protest killings",
    "title": "A Big Club Tries to Help Friends Far Away",
    "content": "<h3>Hello from Far Away!</h3>\nHello, my wonderful friends! I'm your friendly news reporter, bringing you a story from a place far, far away. Imagine a land with different mountains, different trees, and different kinds of homes. This land is called Iran. It's a country just like our country, full of people who laugh, play, and learn. But sometimes, in Iran, things get a little bit tricky, and people can feel very sad. We are going to talk about a time when some people in Iran were not feeling happy, and what a big group of countries tried to do to help. It's like when your friends try to help you if you're sad.\n\n<h3>What is Iran?</h3>\nIran is a big country in a part of the world called Asia. It has a long history, with very old buildings and stories. Imagine ancient kingdoms and beautiful patterns! The people there have their own special ways of doing things, their own clothes, and their own yummy foods. Just like we have our own traditions here in Africa, people in Iran have theirs too. It’s important to remember that all countries are special, and all people want to be safe and happy.\n\nDid you know? Iran is home to some of the world's oldest cities, some more than 5,000 years old!\n\n<h3>When People Are Not Happy</h3>\nSometimes, people in any country might feel unhappy with certain rules or things that are happening. When many people feel unhappy about something, they might want to show it. This is like when you tell your teacher if something isn't fair in the classroom. In Iran, some people went out to show that they were not happy. They were hoping things would get better for everyone. But sometimes, when people show they are unhappy, things can get very difficult. It can get very sad, and some people can get hurt. This made many people around the world worried.\n\n<h3>The Big Club of Countries: The UN!</h3>\nNow, imagine a very, very big club. This club is not just for kids, it's for countries! It's called the United Nations, or UN for short. Almost all the countries in the world are part of this club. Think of it like a giant team where everyone tries to help each other. The UN's main job is to try and make sure everyone in the world is safe, healthy, and treated fairly. They want peace, not fighting. When they see people getting hurt or being unfair in one country, they try to help.\n\nDid you know? The United Nations has 193 member countries! That's almost every country on Earth!\n\n<h3>A Special Message from the Club</h3>\nBecause of the sad things happening in Iran, where people were getting hurt when they showed they were unhappy, the big club, the UN, decided to send a message. This message is like an important letter that all the countries in the club agree on. It's called a \"resolution.\" This resolution was a way for the UN to say, \"Hey Iran, we are worried about the people getting hurt. We think everyone deserves to be safe and treated kindly. Please try to make things better for your people.\" They wanted Iran to hear their concern and to make sure people were safe and happy again.\n\n<h3>Saying \"No, Thank You\"</h3>\nBut guess what happened? The leaders of Iran looked at the special message from the big club, the UN. And they said, \"No, thank you.\" This is what \"rejects\" means. It means they said they did not want to follow the message. They said that other countries should not tell them what to do. This made the big club, the UN, feel a bit sad. They still want to help, but Iran decided to do things their own way for now. It's like when your friend offers you help with your homework, but you say you want to try by yourself first.\n\n<h3>Why This Matters to Us All</h3>\nYou might think, \"Why does this story from far-away Iran matter to me?\" Well, it matters because we all live on the same planet. And it's important that everyone, everywhere, feels safe and happy. We all want fair rules, kindness, and to live without fear. When people in one place are not safe or happy, it reminds us to be kind to each other in our own homes and schools. It reminds us to always speak up for what is fair and right, even when it's hard. The UN wants all people to have what we call \"human rights\" – things like the right to be safe, to learn, and to be treated with respect.\n\nDid you know? There is a special day called Human Rights Day every year, on December 10th! It celebrates how everyone deserves to be treated kindly.\n\n<h3>Let's Hope for Kindness</h3>\nSo, even though the news from Iran sounds a little bit tricky, we can always hope for the best. We hope that the people in Iran will find peace and happiness. We hope that the leaders will listen to their people and make good rules. And we hope that the big club, the UN, will keep trying to help everyone in the world live in kindness and safety. Remember, every little act of kindness you do makes the world a better place, one smile at a time! Thank you for listening, my friends!",
    "summary": "The big club of countries, the UN, sent a message to Iran asking them to be kind to their people who were unhappy, but Iran said \"no, thank you.\"",
    "whyMatters": "It's important because all people everywhere deserve to be safe and happy, and countries should try to help each other make the world fair for everyone.",
    "category": "world",
    "date": "2026-01-24T17:15:22.054Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Club%20Tries%20to%20Help%20Friends%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-club-tries-to-help-friends-far-away",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/iran-rejects-un-rights-resolution-condemning-protest-killings?traffic_source=rss"
  },
  {
    "originalTitle": "Bangladesh out of T20 World Cup after ICC’s refusal to change venues",
    "title": "Bangladesh out of T20 World Cup after ICC’s refusal to change venues",
    "content": "Scotland replace Bangladesh after the BCB's request to relocate its games from India is turned down by the ICC.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:27.249Z",
    "image": "https://image.pollinations.ai/prompt/Bangladesh%20out%20of%20T20%20World%20Cup%20after%20ICC%E2%80%99s%20refusal%20to%20change%20venues%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladesh-out-of-t20-world-cup-after-iccs-refusal-to-change-venues",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/24/bangladesh-out-of-t20-world-cup-after-iccs-refusal-to-change-venues?traffic_source=rss"
  },
  {
    "originalTitle": "Trump threatens Canada with 100% tariffs over China trade deal",
    "title": "Trump threatens Canada with 100% tariffs over China trade deal",
    "content": "Trump made the threat in a social media post as tensions rise between the US and its northern neighbour.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:32.861Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20Canada%20with%20100%25%20tariffs%20over%20China%20trade%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-canada-with-100percent-tariffs-over-china-trade-deal",
    "originalLink": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Two days of peace talks end as Russia continues Ukraine attacks",
    "title": "Two days of peace talks end as Russia continues Ukraine attacks",
    "content": "There is no apparent breakthrough as the three-way talks conclude and Russia maintains its bombardment.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:38.027Z",
    "image": "https://image.pollinations.ai/prompt/Two%20days%20of%20peace%20talks%20end%20as%20Russia%20continues%20Ukraine%20attacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-days-of-peace-talks-end-as-russia-continues-ukraine-attacks",
    "originalLink": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How Soviet urban planning is helping Russia freeze Ukraine",
    "title": "How Soviet urban planning is helping Russia freeze Ukraine",
    "content": "Thousands of people are affected when heating plants are targeted by Russian forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:43.197Z",
    "image": "https://image.pollinations.ai/prompt/How%20Soviet%20urban%20planning%20is%20helping%20Russia%20freeze%20Ukraine%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-soviet-urban-planning-is-helping-russia-freeze-ukraine",
    "originalLink": "https://www.bbc.com/news/articles/c338jpk8r1vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mead and Caldentey star as Arsenal triumph over Chelsea",
    "title": "Mead and Caldentey star as Arsenal triumph over Chelsea",
    "content": "Beth Mead puts Arsenal in front in the 55th minute before Mariona Caldentey completes a 2-0 victory for the Gunners at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:49.043Z",
    "image": "https://image.pollinations.ai/prompt/Mead%20and%20Caldentey%20star%20as%20Arsenal%20triumph%20over%20Chelsea%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mead-and-caldentey-star-as-arsenal-triumph-over-chelsea",
    "originalLink": "https://www.bbc.com/sport/football/videos/cp8252gqp5po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'The title race is probably over' - Bompastor on Chelsea defeat",
    "title": "'The title race is probably over' - Bompastor on Chelsea defeat",
    "content": "Chelsea manager Sonia Bompastor says she knows the \"title race is gone\" but her side \"will never give up\" following defeat by Arsenal at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:54.206Z",
    "image": "https://image.pollinations.ai/prompt/'The%20title%20race%20is%20probably%20over'%20-%20Bompastor%20on%20Chelsea%20defeat%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-title-race-is-probably-over-bompastor-on-chelsea-defeat",
    "originalLink": "https://www.bbc.com/sport/football/videos/c2k98827kwpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'The Gunners fire finally!' - Mead puts Arsenal ahead against Chelsea ",
    "title": "'The Gunners fire finally!' - Mead puts Arsenal ahead against Chelsea ",
    "content": "Beth Mead's 10th goal against Chelsea gives Arsenal the lead at Stamford Bridge in the Women's Super League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T17:15:59.379Z",
    "image": "https://image.pollinations.ai/prompt/'The%20Gunners%20fire%20finally!'%20-%20Mead%20puts%20Arsenal%20ahead%20against%20Chelsea%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-gunners-fire-finally-mead-puts-arsenal-ahead-against-chelsea",
    "originalLink": "https://www.bbc.com/sport/football/videos/cx20r00e1l4o?at_medium=RSS&at_campaign=rss"
  }
]