[
  {
    "originalTitle": "Nigerian officers to face trial over coup-plot allegations",
    "title": "Big News from Nigeria: Finding Out the Truth!",
    "content": "<h3>Hello from Sunny Nigeria!</h3>\nHi everyone! I'm your friendly news reporter, zooming in from our amazing continent, Africa! Today, we're going to talk about something important happening in a very special country called Nigeria. Nigeria is a land full of wonderful people, delicious food, and beautiful places.\n\nDid you know? Nigeria is the most populated country in Africa! That means lots and lots of people live there, like a super big family!\n\n<h3>What's This Story About?</h3>\nSometimes, grown-ups have very important jobs. In Nigeria, there are special people called officers. These officers wear uniforms, and their job is to help keep the country safe and peaceful for everyone. They are like very brave helpers!\n\nOur story today is about some of these officers. Last year, some of them were asked to stay in a special place for a little while. This was so that some other grown-ups could ask them important questions. It’s like when your teacher asks you questions to understand something better.\n\nNow, some people are saying that these officers might have had a secret plan. This secret plan is what we're going to talk about today, and how grown-ups are trying to figure out the truth.\n\n<h3>Who is Our President?</h3>\nEvery country needs a leader to help make good decisions for all the people. In Nigeria, the main leader is called the President. His name is President Bola Tinubu. He was chosen by all the people of Nigeria through something called voting. Voting is how grown-ups choose their leaders, like picking your favorite game to play.\n\nDid you know? The President's job is to work hard to make life better for everyone in the country, just like a good parent or a good teacher tries to help their family or class.\n\n<h3>What Does 'Accused' Mean?</h3>\nOur story says that some officers are \"accused\" of planning something. What does \"accused\" mean? It means someone thinks they did something, but it's not proven yet. It's like if your friend says, \"You ate the last biscuit!\" They are accusing you, but maybe you didn't! We need to find out the real truth.\n\nSo, right now, it's just an idea or a thought that some people have. It's very important to remember that being accused doesn't mean it's true. That's why we have special ways to find out what really happened.\n\n<h3>What is a 'Coup Plot'? (A Secret Plan)</h3>\nThis is a bit of a tricky word, but I'll explain it simply. The officers are accused of something called a \"coup plot.\" Imagine your class has a leader, like a class monitor. What if someone tried to make the monitor leave their job without the teacher saying so, or without everyone voting for a new one?\n\nThat wouldn't be fair, would it? In countries, a \"coup plot\" is like a secret plan to make the President leave his job *without* the people voting or following the rules. It's like trying to change the rules of a game in the middle, and that's not how we play fairly.\n\nOur country has rules for everything, especially for how leaders are chosen. These rules help keep everything fair and peaceful. A coup plot tries to break those very important rules.\n\n<h3>Why Do We Have Trials?</h3>\nWhen someone is accused of something big, like a secret plan against the country's rules, we have something called a \"trial.\" A trial is like a very important meeting in a special room, often called a court.\n\nIn a trial, special, wise grown-ups, like judges, listen very carefully. They listen to what everyone has to say. They listen to the officers, and they listen to the people who are saying there was a plan. They also look at any clues or evidence.\n\nDid you know? The main job of a trial is to find out the truth! It’s like when your teacher helps you and your friends figure out a problem to make sure everyone is treated fairly and the right decision is made.\n\n<h3>What Happens Next?</h3>\nSo, the trial is going to start for some of these officers. This means that soon, everyone will hear all the facts and information. The wise grown-ups will listen to everything very carefully. They will try to understand exactly what happened.\n\nTheir job is to make sure that everything is fair. They want to know if the officers truly had a secret plan, or if there was a misunderstanding. It's a very serious job because it's about the rules of the whole country.\n\n<h3>Why Are Rules So Important?</h3>\nRules are super important! At school, we have rules to keep us safe and help us learn. At home, we have rules to help us live together happily. In a country, rules are even more important!\n\nRules help make sure everyone is treated fairly. They help everyone know what they should do and what they should not do. When everyone follows the rules, the country stays peaceful and happy. It helps grow-ups and kids feel safe and know that things will be fair.\n\nWhen we have problems, we use our rules and systems, like trials, to solve them. This is much better than trying to change things secretly or unfairly.\n\n<h3>Keeping Nigeria Safe and Fair</h3>\nThis story might sound big, but it’s really about making sure Nigeria stays a safe, fair, and happy country for everyone. Our leaders, like President Bola Tinubu, and all the people working in the government, want to make sure the rules are followed.\n\nThe trial is a way for them to make sure that justice is done. Justice means that what is fair and right happens for everyone. It helps us trust that our country is strong and that problems are handled in the proper way.\n\nSo, that's the news from Nigeria today! We'll keep watching to see how the wise grown-ups find out the truth and keep everything fair and peaceful. Until next time, stay curious and keep learning!",
    "summary": "Some officers in Nigeria are accused of planning to remove President Bola Tinubu unfairly, and they will now go to a special meeting called a trial to find out the truth and ensure fairness.",
    "whyMatters": "This story matters because it shows how important it is for everyone to follow the rules in a country, especially big rules about who gets to be the leader, so that the country stays safe and fair for all its people.",
    "category": "world",
    "date": "2026-01-26T18:28:52.637Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Nigeria%3A%20Finding%20Out%20the%20Truth!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-nigeria-finding-out-the-truth",
    "originalLink": "https://www.bbc.com/news/articles/c9dv4wlw3yzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyan cult leader faces charges over 52 further deaths",
    "title": "Keeping Everyone Safe in Kenya!",
    "content": "<h3>Hello, Super Listeners! Welcome to Our African News!</h3>\nHi everyone! It's your friendly reporter, ready to share some important news with you today. We are talking about a wonderful country called Kenya, right here in Africa! Kenya is a place with big elephants, tall giraffes, and lots of lovely people. Our news today is all about how we keep each other safe and happy in our communities. It’s like being part of a super team, where everyone looks out for each other! Grown-ups, kids, neighbours – we all help!\n\nDid you know? Kenya is famous for its amazing wildlife, like lions and zebras! It also has beautiful beaches and mountains.\n\n<h3>Learning About Being Safe</h3>\nSometimes, grown-ups can tell other people to do things that are not good for them. This is what happened in a place in Kenya. There was a grown-up named Mr. Paul Mackenzie. The police and good grown-ups are looking into this very carefully. Mr. Mackenzie told some people to do things that made them unwell, and he told them to do things that were not safe. This made some people very, very sad and unwell. It is very important that everyone stays safe and healthy. That is why we have rules, and that is why we have people like our parents, teachers, and police to help us. They always want what is best for us.\n\n<h3>What Grown-ups Do to Help</h3>\nWhen something like this happens, kind and clever grown-ups like the police step in to help. The police are like superheroes in our communities! They wear uniforms and drive special cars, and their job is to keep everyone safe and make sure everyone follows the rules. They ask lots of questions to understand what happened. They want to make sure that people who tell others to do bad things cannot do it again. The police are helping all the people who were hurt and making sure they get the help and care they need. They are working hard every day to protect families and children.\n\nDid you know? Police officers in Kenya work very hard to keep cities and villages safe. They are brave and always ready to help!\n\n<h3>Why Rules Are So Important</h3>\nImagine if there were no rules at school! Everyone might run around, push, or take things from others. It would be very messy and not fun! Rules are like special guidelines that help us live together happily. At home, you have rules like “always tell mom or dad where you are going.” At school, you have rules like “share your toys” and “listen to your teacher.” These rules are there to keep you safe and to help everyone get along. When someone doesn't follow the good rules, sometimes people get hurt or feel sad. That's why it's so important to follow the rules that keep everyone safe and happy.\n\n<h3>Who Can You Trust?</h3>\nIt's super important to know who your trusted grown-ups are. These are the people who love you very much and always want to help you. They could be your mom, dad, grandparents, older brothers or sisters, teachers, or even a kind neighbour. If someone ever tells you to do something that feels wrong, or makes you feel scared, or tells you to keep a secret from your trusted grown-ups, it's very, very important to tell your trusted grown-up right away. You should never, ever keep secrets that make you feel worried or unsafe. Your trusted grown-ups will always listen and help you.\n\nDid you know? Telling a trusted grown-up when something feels wrong is a very brave thing to do! It helps keep you and others safe.\n\n<h3>Always Ask Questions</h3>\nSometimes, people might say things that sound confusing or strange. They might say that you don't need to go to school anymore, or that you should not eat food, or that you should not listen to your parents. These are not good things to hear. If someone tells you things like this, it is very important to ask your mom, dad, or teacher about it. They can help you understand what is true and what is not true. Our parents and teachers want us to learn and grow strong and healthy. They help us make good choices every day.\n\n<h3>What Happens Next?</h3>\nThe good news is that the police and other kind grown-ups are still working very hard to make sure Mr. Mackenzie cannot tell people to do bad things again. They are asking him questions and making sure he understands that telling people to do unsafe things is wrong. They are making sure that everyone affected gets the help they need to feel better and strong again. This shows us that we have many helpers in our community who work tirelessly to protect everyone. We are all safer because of them.\n\nDid you know? The justice system in Kenya, just like in many places, works to make sure everyone is treated fairly and safely.\n\n<h3>Let's All Be Safety Superstars!</h3>\nSo, what can we learn from this? We learn that it’s important to listen to our trusted grown-ups, to follow good rules, and to always speak up if something feels wrong. We are all part of a big, loving community, and we all help each other stay safe. Remember, if you ever feel worried or scared, tell a grown-up you trust right away. You are brave, and your voice matters! Let's all be safety superstars and help keep our beautiful Africa a happy and safe place for everyone! Thank you for listening to our news today!",
    "summary": "A grown-up in Kenya told people to do unsafe things, and police and other helpers are now making sure everyone is safe and cared for, reminding us to always trust our parents and teachers.",
    "whyMatters": "This is important because it teaches us to always listen to trusted grown-ups and tell them if something feels wrong, so everyone in our community stays safe and happy.",
    "category": "world",
    "date": "2026-01-26T18:29:18.373Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Everyone%20Safe%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-everyone-safe-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/c98jk0rrwpko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army threat to 'spare no-one' condemned",
    "title": "Good News! Helpers are Working for Peace in South Sudan!",
    "content": "Hello, amazing friends! It's your friendly African news reporter here, ready to share some super important news from our wonderful continent. Today, we're zooming into a very special country called South Sudan. It's a place with bright sunshine, big rivers, and lots of friendly people, just like you!\n\n<h3>What Happened in South Sudan?</h3>\nSometimes, grown-ups in different places have big talks. And sometimes, these talks can get a little bit tricky. Recently, some grown-ups in South Sudan were talking in a way that made some other people feel worried.\n\nThey were saying things that sounded like they might not be kind to everyone. This made a very important team of helpers, called the United Nations, feel concerned.\n\nThe United Nations is like a giant family of friends from all over the world. Their job is to help countries and make sure everyone stays safe and happy.\n\n<h3>Who Are the United Nations (UN)?</h3>\nImagine you have friends from different schools, and you all come together to play and help each other. That's a bit like the United Nations, but much, much bigger! The UN is a special group with people from almost every country on Earth.\n\nTheir main job is to help countries live in peace. They want to make sure kids can go to school, families have food, and everyone is safe from harm. When they hear about grown-ups saying things that could cause problems, they step in.\n\nThey say, \"Hold on! Let's talk about how to be kind and safe for everyone.\" They are like the super big brothers and sisters of the world, always looking out for peace.\n\nDid you know? The United Nations was started many, many years ago, after a big world war, to help stop wars and make the world a better, safer place for everyone. They have a big building in a faraway city called New York!\n\n<h3>Why is Peace So Important?</h3>\nThink about when you play with your friends. If everyone is kind and shares, you have so much fun, right? That’s what peace is like for a whole country! When there is peace, kids can run and play outside without worries.\n\nThey can go to school and learn exciting new things every day. Families can stay together, laugh, and share yummy meals. When there is peace, everyone feels safe, loved, and happy.\n\nIt means no scary noises and no sad faces. That's why the United Nations cares so much about helping South Sudan stay peaceful.\n\nDid you know? When there is peace, people can build new schools, hospitals, and parks, making life even better for everyone!\n\n<h3>About Our Friend, South Sudan</h3>\nSouth Sudan is a really special country in Africa. It's quite a young country, meaning it hasn't been independent for as long as some other countries. It's full of amazing natural beauty.\n\nImagine seeing tall giraffes, big elephants, and speedy zebras roaming freely! The people of South Sudan are strong and hopeful. They love their land and want to build a bright future for all their children.\n\nThey have many different cultures and languages, which makes the country very colourful and interesting.\n\nDid you know? South Sudan became its own country in 2011, which means it's one of the newest countries in the world! It's still working hard to grow and become super strong.\n\n<h3>What Does \"Keep Everyone Safe\" Mean?</h3>\nWhen the grown-ups in the United Nations talk about keeping \"civilians\" safe, they mean people like you and me! Civilians are all the people who are not soldiers. They are mums, dads, grandmas, grandpas, teachers, shopkeepers, and all the wonderful children.\n\nEveryone, no matter who they are, deserves to be safe. Nobody should ever feel scared in their own home or in their own town. The UN wants to make sure that no one says or does anything that could hurt or frighten these everyday people.\n\nThey want everyone to live a normal, happy life.\n\n<h3>What is the UN Doing Now to Help?</h3>\nSo, when those worried talks happened, the United Nations quickly stepped in. They told the grown-ups, \"We are gravely concerned.\" This means they were very, very worried and wanted everyone to stop and think.\n\nThey reminded everyone that it's super important to always be kind and keep all people safe. The UN is now talking to the leaders and important people in South Sudan.\n\nThey are reminding everyone about peace and about protecting every single person. They are working hard to make sure that everyone understands that bad talks are not helpful, and that being kind and peaceful is the best way forward for South Sudan.\n\nThey are helping to make sure that everyone remembers that talking kindly and working together is the best way to solve problems, not by saying scary things. They are helping to cool things down and bring everyone back to thinking about peace.\n\n<h3>What Can We All Do?</h3>\nEven though we are kids, we can also help! We can always try to be kind to our friends and family. We can share our toys and listen to each other. When we choose peace in our own lives, we help spread peace in the world.\n\nRemember, every little bit of kindness helps. The grown-ups in South Sudan, with help from the United Nations, are working very hard to make sure that peace wins. They want all the children of South Sudan to grow up safe, happy, and strong.\n\n<h3>Good News for a Peaceful Future!</h3>\nIt’s good to know that there are big helpers like the United Nations always working to make sure our world, and especially countries like South Sudan, stay peaceful and safe. They are watching, listening, and reminding everyone that kindness and safety for all are the most important things. Let's send our happy thoughts to South Sudan and hope for a super peaceful future for all its wonderful children!",
    "summary": "Big helpers called the United Nations are making sure everyone stays safe and happy in the beautiful country of South Sudan, especially when grown-ups say things that make people worried.",
    "whyMatters": "It's important because every child and every family in South Sudan deserves to live in peace, play, and go to school without feeling scared, and big helpers are working hard to make that happen.",
    "category": "world",
    "date": "2026-01-26T18:29:46.236Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Helpers%20are%20Working%20for%20Peace%20in%20South%20Sudan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-helpers-are-working-for-peace-in-south-sudan",
    "originalLink": "https://www.bbc.com/news/articles/c79rjjr481zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Massive search underway for dozens missing in deadly Indonesia landslide",
    "title": "Massive search underway for dozens missing in deadly Indonesia landslide",
    "content": "At least 80 people, including 19 members of an elite marine force, are missing in a landslide in Indonesia.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:29:51.587Z",
    "image": "https://image.pollinations.ai/prompt/Massive%20search%20underway%20for%20dozens%20missing%20in%20deadly%20Indonesia%20landslide%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "massive-search-underway-for-dozens-missing-in-deadly-indonesia-landslide",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/26/massive-search-underway-for-dozens-missing-in-deadly-indonesia-landslide?traffic_source=rss"
  },
  {
    "originalTitle": "EU launches probe into Grok AI feature creating deepfakes of women, minors",
    "title": "EU launches probe into Grok AI feature creating deepfakes of women, minors",
    "content": "European Commission says its investigation will examine if the AI tool has met its legal obligations.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:29:56.770Z",
    "image": "https://image.pollinations.ai/prompt/EU%20launches%20probe%20into%20Grok%20AI%20feature%20creating%20deepfakes%20of%20women%2C%20minors%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eu-launches-probe-into-grok-ai-feature-creating-deepfakes-of-women-minors",
    "originalLink": "https://www.aljazeera.com/news/2026/1/26/eu-launches-probe-into-grok-ai-feature-creating-deepfakes-of-women-minors?traffic_source=rss"
  },
  {
    "originalTitle": "Netanyahu says next phase of ceasefire is ‘demilitarising’ Gaza",
    "title": "Netanyahu says next phase of ceasefire is ‘demilitarising’ Gaza",
    "content": "Benjamin Netanyahu said the next phase of the ceasefire will be “disarming Hamas and demilitarising the Gaza Strip.”",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:01.948Z",
    "image": "https://image.pollinations.ai/prompt/Netanyahu%20says%20next%20phase%20of%20ceasefire%20is%20%E2%80%98demilitarising%E2%80%99%20Gaza%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "netanyahu-says-next-phase-of-ceasefire-is-demilitarising-gaza",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/26/netanyahu-says-next-phase-of-ceasefire-is-demilitarising-gaza?traffic_source=rss"
  },
  {
    "originalTitle": "Israel says it has retrieved remains of final Gaza hostage",
    "title": "Israel says it has retrieved remains of final Gaza hostage",
    "content": "Israeli Prime Minister Benjamin Netanyahu called Ran Gvili’s return \"an extraordinary achievement\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:07.700Z",
    "image": "https://image.pollinations.ai/prompt/Israel%20says%20it%20has%20retrieved%20remains%20of%20final%20Gaza%20hostage%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israel-says-it-has-retrieved-remains-of-final-gaza-hostage",
    "originalLink": "https://www.bbc.com/news/articles/c5ydvz7nz4mo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "title": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "content": "Two people have been shot dead by federal agents in the city in recent weeks, leaving many angry and frustrated.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:12.863Z",
    "image": "https://image.pollinations.ai/prompt/'This%20is%20horrifying'%20-%20Minneapolis%20residents%20reel%20from%20second%20deadly%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-is-horrifying-minneapolis-residents-reel-from-second-deadly-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cvg50vv1ezko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "France debates under-15s social media ban endorsed by Macron",
    "title": "France debates under-15s social media ban endorsed by Macron",
    "content": "Prime Minister Sébastien Lecornu has said he will use a fast-track procedure to get the legislation on the books by September.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:18.039Z",
    "image": "https://image.pollinations.ai/prompt/France%20debates%20under-15s%20social%20media%20ban%20endorsed%20by%20Macron%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "france-debates-under-15s-social-media-ban-endorsed-by-macron",
    "originalLink": "https://www.bbc.com/news/articles/c07x003vx0yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "One week until transfer deadline day - who could be on the move?",
    "title": "One week until transfer deadline day - who could be on the move?",
    "content": "BBC Sport looks at some of the players that have been linked with moves before the Premier League transfer deadline on 2 February at 19:00 GMT.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:23.615Z",
    "image": "https://image.pollinations.ai/prompt/One%20week%20until%20transfer%20deadline%20day%20-%20who%20could%20be%20on%20the%20move%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "one-week-until-transfer-deadline-day-who-could-be-on-the-move",
    "originalLink": "https://www.bbc.com/sport/football/articles/c98pp7zd9d0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Besiktas pay £11m for Abraham - to sell him to Villa",
    "title": "Besiktas pay £11m for Abraham - to sell him to Villa",
    "content": "Besiktas pay £11.2m to Roma for Tammy Abraham - as the Turkish club prepare to sell him to Aston Villa.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:28.782Z",
    "image": "https://image.pollinations.ai/prompt/Besiktas%20pay%20%C2%A311m%20for%20Abraham%20-%20to%20sell%20him%20to%20Villa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "besiktas-pay-pound11m-for-abraham-to-sell-him-to-villa",
    "originalLink": "https://www.bbc.com/sport/football/articles/c301ry162d4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Yorath remembered at funeral as 'funny, humble man'",
    "title": "Yorath remembered at funeral as 'funny, humble man'",
    "content": "About 100 mourners attended the funeral of the Wales and Leeds midfielder, who died aged 75.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T18:30:33.953Z",
    "image": "https://image.pollinations.ai/prompt/Yorath%20remembered%20at%20funeral%20as%20'funny%2C%20humble%20man'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "yorath-remembered-at-funeral-as-funny-humble-man",
    "originalLink": "https://www.bbc.com/news/articles/c8x97w51r9ko?at_medium=RSS&at_campaign=rss"
  }
]