[
  {
    "originalTitle": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns",
    "title": "Sharing is Caring: Why Zimbabwe Said No to Health Help!",
    "content": "Hello everyone! It's your friendly news reporter here, bringing you a super important story from our amazing continent, Africa!\n\nToday, we're talking about a country called Zimbabwe. It's a beautiful place in southern Africa, famous for its big waterfalls and amazing animals!\n\n<h3>What is Health Help?</h3>\nImagine you get a little cough or a tummy ache. Your parents take you to the doctor, right? Doctors, nurses, hospitals, and medicines all help us stay healthy. Sometimes, countries need extra help to make sure all their people can get this good care. This extra help is called 'health aid' or 'health help.' It means other countries give money or things like medicines to help build more hospitals or train more doctors.\n\n<h3>The USA Wanted to Give Help</h3>\nA big country far away, called the United States of America (or USA for short), wanted to give health help to Zimbabwe. This sounds like a really good thing! More doctors, more medicines, healthier kids and grown-ups! Everyone wants to be healthy and strong, especially kids so they can play and learn every day.\n\n<h3>Collecting Tiny Samples</h3>\nNow, here's where the story gets a little tricky. The USA wanted to help, but they also wanted to do something else. They wanted to collect tiny pieces from people in Zimbabwe. Not big pieces, just very small things like a tiny drop of blood from your finger, or a little bit of spit. These tiny pieces are called 'biological samples.'\n\nDid you know? Your blood can tell doctors many secrets! It can show if you have a fever, if you're strong, or if you need special medicine.\n\n<h3>Why Samples Are Important</h3>\nScientists and doctors use these tiny samples to learn very important things. They can study them to understand why people get sick, how different medicines work, or even how to stop new sicknesses from spreading. It's like finding clues to solve a mystery! The mystery of how to keep everyone super healthy.\n\n<h3>The Big Question: Sharing Benefits</h3>\nSo, the USA wanted to collect these samples from people in Zimbabwe. Zimbabwe's leaders thought, \"Hmm, if you take these samples and learn amazing things from them, will you share what you learn with us? Will you help us use these new discoveries to make our own people even healthier?\" This is called 'sharing the benefits' or 'sharing what you find out.'\n\nDid you know? Scientists all over the world work together! They share their discoveries so everyone can learn and help each other. It's like building with LEGOs – if everyone shares their bricks, you can build something much bigger and better!\n\n<h3>Zimbabwe Said \"That's Not Fair!\"</h3>\nBut the USA said, \"No, we don't want to promise to share what we find out from your samples.\" Zimbabwe's leaders thought about this very carefully. They said, \"Wait a minute! That's not fair! If you use our people's samples to learn new things, we should get to know those things too. We should get to use them to help our own hospitals and doctors.\"\n\n<h3>Like Sharing Toys</h3>\nThink about it like this: Imagine you have a really cool toy, maybe a big, shiny ball. Your friend wants to borrow your ball to play a new game. You say, \"Okay! But if you learn a super fun new trick with my ball, will you teach it to me too?\" And your friend says, \"No, I'll keep the trick a secret.\" How would that make you feel? A little sad, right? You'd probably think it's not fair to keep a secret when you shared your toy.\n\nDid you know? Zimbabwe is home to amazing animals like elephants, lions, and giraffes! Just like people, these animals need doctors too sometimes, called vets, to keep them healthy.\n\n<h3>Why Fairness is Important</h3>\nFairness is very, very important. It means treating everyone kindly and making sure everyone gets a fair chance. Zimbabwe felt that if the USA took samples, they should also share any new health secrets they found. This way, Zimbabwe could use those secrets to help its own people get better medicines or find new ways to fight sicknesses.\n\n<h3>What Happens Next?</h3>\nBecause it didn't feel fair, Zimbabwe said, \"Thank you for offering help, but we cannot agree to this deal if you won't share what you learn.\" They rejected the deal. This doesn't mean Zimbabwe doesn't want help. It means they want help that is fair and helps them in the best way possible.\n\n<h3>Looking for New Friends</h3>\nNow, Zimbabwe will look for other friends and other countries that are happy to help and also happy to share anything they learn. They want partners who will work with them fairly, like true friends. They want to make sure that any health discoveries made using their people's samples will also help the people of Zimbabwe. It's all about teamwork and making sure everyone benefits.\n\nDid you know? Africa is a huge continent with 54 different countries! Each one is special and beautiful in its own way, full of amazing people and stories!\n\n<h3>A Lesson for Everyone</h3>\nSo, what does this story teach us? It teaches us that sharing is caring, and fairness is very important. Whether it's sharing your toys, sharing your knowledge, or sharing health discoveries, being fair makes everyone feel happy and helps us all grow stronger together. And that's the news from Africa today! Stay healthy and keep sharing! Bye for now!",
    "category": "technology",
    "date": "2026-02-25T15:57:41.306Z",
    "image": "https://image.pollinations.ai/prompt/Sharing%20is%20Caring%3A%20Why%20Zimbabwe%20Said%20No%20to%20Health%20Help!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sharing-is-caring-why-zimbabwe-said-no-to-health-help",
    "originalLink": "https://www.bbc.com/news/articles/cwy6nd3664no?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UN sanctions paramilitary leaders over Sudan atrocities",
    "title": "Big News from Sudan: The World Says 'Stop Fighting!'",
    "content": "Hello, my wonderful friends! Your kid-friendly news reporter from Africa is here to share some very important news with you today. We're going to talk about a country called Sudan. It's a beautiful country right here in Africa, full of amazing people, just like you!\n\nSometimes, grown-ups have big disagreements. And sometimes, these disagreements can turn into fights. Sadly, this has been happening in Sudan for a little while now. It's like when you see two friends arguing, but much, much bigger.\n\n<h3>What's Happening in Sudan?</h3>\n\nImagine a country where people from the same country are fighting each other. This is what grown-ups call a 'civil war'. It's very sad because it means people can't always go to school, play outside safely, or even stay in their homes.\n\nIn Sudan, there are two big groups of grown-ups who have been fighting. One of these groups is called the RSF. They are like a special army, but they are not the country's main army. They are a 'paramilitary' group, which just means they are a group of armed people who are not part of the regular government army.\n\nDid you know? Sudan is the third-largest country in Africa! It has big deserts, rivers, and lots of different animals.\n\n<h3>A Sad Story from a Special City</h3>\n\nLast year, in October, something very, very sad happened in a city in Sudan. The RSF group went into this city and did some really unkind and hurtful things. When grown-ups do very bad things to other people, we call them 'atrocities'. It means they hurt people and made them very scared.\n\nIt was one of the hardest times in this whole fight. Many families had to leave their homes very quickly. They left behind their toys, their books, and their favorite blankets. They just wanted to be safe.\n\nImagine having to leave your house and all your things behind. That's how it felt for many children and families in that city. It was a very 'brutal' time, which means it was very harsh and painful for many people.\n\n<h3>Who is the UN?</h3>\n\nNow, there's a very important club in the world called the United Nations, or UN for short. Imagine a super-duper big club where almost every country in the world is a member! Their biggest job is to try and make sure everyone on Earth lives in peace and is treated fairly.\n\nThink of the UN like a really big grown-up looking out for all the people in the world. When they see unfair or hurtful things happening, they try to help stop it.\n\nDid you know? The UN has members from almost 200 countries! They work together to solve big problems like hunger, sickness, and fighting.\n\n<h3>What Does 'Sanctions' Mean?</h3>\n\nSo, what did the UN do about the bad things happening in Sudan? They decided to put 'sanctions' on some of the grown-up leaders from the RSF group. What are sanctions? It's like when you do something wrong, and your parents might say, 'No TV for you today!' or 'You can't play with your favorite toy for a little while.'\n\nFor grown-up leaders, 'sanctions' mean they can't travel to certain places, or they can't use their money for special things, or they can't buy certain items. It's the UN's way of saying, 'We see what you're doing, and it's not okay. You need to stop!'\n\nIt's like a big 'time-out' from the world for those who are causing harm. The idea is that if these leaders can't do the things they want, they will think hard about their actions and decide to stop the fighting.\n\nDid you know? Sanctions are a peaceful way to try and stop fighting, without using more fighting. It's like using your words and rules instead of your fists.\n\n<h3>Who Got the 'Time Out'?</h3>\n\nThe UN gave this 'time-out' to some of the important leaders of the RSF group. These are the grown-ups who are in charge of the fighters. They got these sanctions because the UN believes they are responsible for the very bad things that happened in that special city in October. It's like saying, 'You are in charge, so you must make sure your people do good things, not bad things.'\n\nThis is a very serious step from the UN. It shows that the world is watching, and the world cares about what happens to the people in Sudan, especially the children.\n\n<h3>Why is This Important for All of Us?</h3>\n\nThis news is important because it shows us that the world wants peace. It tells leaders everywhere that being unkind and hurting people is not okay, and there will be consequences.\n\nIt also gives hope to the children and families in Sudan. It means that people are working hard to help them. They want to see children playing, going to school, and feeling safe in their homes again.\n\nEvery child deserves to grow up in a peaceful place. They deserve to learn, laugh, and dream big dreams. When big organizations like the UN step in, it's a big step towards making those dreams come true.\n\nLet's all hope and work for a day when all the children in Sudan can live happily and peacefully. Remember, kindness is powerful, and working together can make the world a better place for everyone. Thank you for listening, little news explorers! Until next time, stay kind and curious!",
    "summary": "The United Nations, a big club of countries, has told some grown-up leaders in Sudan to stop doing bad things, so that peace can come back.",
    "whyMatters": "This is important because it shows the world wants everyone in Sudan to be safe, happy, and live in peace, especially the children.",
    "category": "world",
    "date": "2026-02-25T15:58:04.756Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Sudan%3A%20The%20World%20Says%20'Stop%20Fighting!'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-sudan-the-world-says-stop-fighting",
    "originalLink": "https://www.bbc.com/news/articles/c1789eqz1qro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Senegal PM proposes tougher anti-LGBT law, doubling prison terms",
    "title": "Senegal PM proposes tougher anti-LGBT law, doubling prison terms",
    "content": "The bill seeks prison terms of five to ten years for what it describes as \"acts against nature\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-25T15:58:09.863Z",
    "image": "https://image.pollinations.ai/prompt/Senegal%20PM%20proposes%20tougher%20anti-LGBT%20law%2C%20doubling%20prison%20terms%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "senegal-pm-proposes-tougher-anti-lgbt-law-doubling-prison-terms",
    "originalLink": "https://www.bbc.com/news/articles/c7vj15zlmv6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palestinian filmmaker showcases the beauty of pre-war Gaza",
    "title": "Amazing Pictures Show Beautiful Gaza Before Big Changes!",
    "content": "<h3>A Friendly Hello from Africa!</h3>\nHello, hello, amazing friends! It’s your super friendly news reporter from Africa, here to share a very special story with you. We're going on a little trip today, not on an airplane, but through pictures and words, to a place far away called Gaza.\n\nDid you know? Africa is a huge continent with many countries, beautiful animals, and diverse cultures! We love to share stories from all over the world.\n\nOur story is about a kind man who used his camera to show us wonderful things. He helped us see the beauty in a place many people sometimes forget about.\n\n<h3>Meet Yousef: A Storyteller with a Camera</h3>\nOur special friend in this story is named Yousef Al Helou. Yousef is a very clever journalist and a filmmaker. A journalist is someone who tells news stories, and a filmmaker is someone who makes movies!\n\nDid you know? A journalist's job is to find out important things and share them with everyone, just like I'm doing now!\n\nBut Yousef doesn't just tell stories with words. He tells them with his camera! He takes lots and lots of pictures and videos to show people what things really look like.\n\nLast year, in 2023, Yousef decided to go on a big adventure. He wanted to show everyone the wonderful things in Gaza.\n\nHe walked all around Gaza, talking to people and filming everything. He wanted to capture the everyday beauty of the place.\n\n<h3>Gaza Before the Big Change</h3>\nSo, what was Gaza like when Yousef was filming? It was a place full of life, colours, and happy sounds! Imagine a town next to a big, blue sea.\n\nDid you know? Gaza is part of a place called Palestine. It's a land with a very long history and many interesting stories.\n\nBefore some big, sad changes happened, Gaza was a busy and vibrant place. People went about their daily lives, just like you and your family do.\n\nChildren played in the streets, grown-ups worked, and families shared meals together. Yousef wanted to capture all these normal, happy moments.\n\n<h3>What Did Yousef Show Us?</h3>\nYousef used his camera like a magic window. He showed us the things that make Gaza special. He filmed the bright sunshine and the busy streets.\n\nHe wanted people to see the good things, the everyday joys that sometimes get forgotten when we hear news about faraway places.\n\nHis film showed us that even in places we might hear grown-ups talk about as 'difficult,' there are always beautiful things happening.\n\nIt’s like finding a hidden treasure! Yousef's treasure was the beauty of Gaza and its people.\n\n<h3>Smiling Faces and Busy Markets</h3>\nYousef showed us many happy faces. He filmed children laughing and playing near the sea. He showed families walking together.\n\nHe also filmed the busy markets. Imagine a market where people sell fresh fruits, vegetables, and yummy local foods. It’s full of different smells and sounds!\n\nDid you know? Markets are places where people buy and sell things. They are often very colourful and noisy, full of life!\n\nPeople were selling their crafts, talking to friends, and going about their day. Yousef's pictures made it feel like you were right there with them.\n\nHe wanted to show the world that Gaza was not just a place in the news, but a home for many kind and hardworking people.\n\n<h3>The Beautiful Blue Sea</h3>\nOne of the most special things Yousef filmed was the big, blue sea. Gaza is right next to the Mediterranean Sea. It's a huge, sparkling ocean!\n\nDid you know? The Mediterranean Sea is connected to three big continents: Africa, Asia, and Europe! It's a very famous sea.\n\nHe showed us the long, sandy beaches where children used to play. The waves would crash gently, and people would relax and enjoy the sunshine.\n\nSeeing the sea in his film makes you want to visit, doesn't it? It looked so peaceful and inviting, a perfect place to build sandcastles.\n\nYousef's camera captured the calm beauty of the ocean, a place of fun and quiet reflection for many people in Gaza.\n\n<h3>Why Are These Pictures Important?</h3>\nWhy do Yousef's pictures matter so much? Because they help us remember. They show us what Gaza was like before it changed.\n\nSometimes, grown-ups hear difficult news, and it can make them forget the good things about a place. But Yousef’s film helps us remember the joy.\n\nDid you know? Pictures and videos are like magical time machines! They can take us back to how things looked and felt in the past.\n\nHis film is like a big hug, reminding everyone of the warmth and kindness that existed in Gaza. It shows a happy, busy community.\n\nIt helps us understand that every place has its own beauty, even if sometimes it faces challenges.\n\n<h3>Remembering Good Times</h3>\nAfter Yousef finished his beautiful film, some very sad and difficult things happened in Gaza. There was a big war, and things became very hard for the people.\n\nMany homes were changed, and life became very tough. It was a big, big change from the happy scenes Yousef had filmed.\n\nBut Yousef’s pictures and videos are still there. They are like a precious treasure box, holding memories of how Gaza once was.\n\nThey remind us that even when things are sad, we can always remember the good times and the beauty that was once there.\n\nIt’s important to remember the real people, with their smiles and their daily lives, not just the sad stories.\n\n<h3>What Can We Learn?</h3>\nFrom Yousef’s story, we learn that every place, no matter how far away, has something beautiful to show us.\n\nWe learn that people everywhere love their homes, their families, and their communities. They enjoy playing, working, and spending time together.\n\nDid you know? People all over the world, even if they live far apart and speak different languages, often have the same hopes and dreams!\n\nWe also learn the power of a camera. It can capture moments, tell stories, and help us understand the world better.\n\nThank you, Yousef, for showing us the beautiful heart of Gaza before the big changes. Your pictures help us remember and care.\n\n<h3>Sending Love from Africa</h3>\nSo, next time you think about faraway places, remember Gaza, remember Yousef, and remember the beauty he showed us.\n\nLet’s send our kindness and good wishes to all the children and families in Gaza and everywhere else. Everyone deserves a peaceful and happy home.\n\nThat’s all for today from your African reporter! Keep exploring, keep learning, and keep sharing kindness wherever you go. Bye for now!\n",
    "summary": "Palestinian filmmaker Yousef Al Helou captured the joyful daily life and beautiful places in Gaza with his camera in 2023, showing the world its happy people and vibrant culture before big changes happened.",
    "whyMatters": "This story matters because it helps us remember the beauty and normal life in Gaza through pictures, showing us that every place has good things and kind people, even when grown-ups hear sad news about it.",
    "category": "world",
    "date": "2026-02-25T15:58:30.784Z",
    "image": "https://image.pollinations.ai/prompt/Amazing%20Pictures%20Show%20Beautiful%20Gaza%20Before%20Big%20Changes!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "amazing-pictures-show-beautiful-gaza-before-big-changes",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/25/palestinian-filmmaker-showcases-the-beauty-of-pre-war-gaza?traffic_source=rss"
  },
  {
    "originalTitle": "Lebanon’s second airport could receive passengers by summer, officials say",
    "title": "Lebanon’s second airport could receive passengers by summer, officials say",
    "content": "Lebanon has long discussed opening a second airport. As the political debate has faded, the possibility is near.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-25T15:58:35.879Z",
    "image": "https://image.pollinations.ai/prompt/Lebanon%E2%80%99s%20second%20airport%20could%20receive%20passengers%20by%20summer%2C%20officials%20say%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lebanons-second-airport-could-receive-passengers-by-summer-officials-say",
    "originalLink": "https://www.aljazeera.com/features/2026/2/25/lebanons-second-airport-could-receive-passengers-by-summer-officials-say?traffic_source=rss"
  },
  {
    "originalTitle": "Displaced Sudanese women caught up in war suffer wretched Ramadan",
    "title": "Displaced Sudanese women caught up in war suffer wretched Ramadan",
    "content": "Women in Sudan’s Al-Sarraf camp face hunger and disease during a desperate holy month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-25T15:58:40.974Z",
    "image": "https://image.pollinations.ai/prompt/Displaced%20Sudanese%20women%20caught%20up%20in%20war%20suffer%20wretched%20Ramadan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "displaced-sudanese-women-caught-up-in-war-suffer-wretched-ramadan",
    "originalLink": "https://www.aljazeera.com/features/2026/2/25/displaced-sudanese-women-caught-up-in-war-suffer-wretched-ramadan?traffic_source=rss"
  },
  {
    "originalTitle": "Trump's theatrical State of the Union address offers little hint of any change in course",
    "title": "Trump's theatrical State of the Union address offers little hint of any change in course",
    "content": "The BBC's Anthony Zurcher says the US president appealed to his base and taunted his opponents in a marathon speech.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-25T15:58:46.665Z",
    "image": "https://image.pollinations.ai/prompt/Trump's%20theatrical%20State%20of%20the%20Union%20address%20offers%20little%20hint%20of%20any%20change%20in%20course%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-theatrical-state-of-the-union-address-offers-little-hint-of-any-change-in-course",
    "originalLink": "https://www.bbc.com/news/articles/cx2d7x6zrwro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Threat of further violence looms after Mexican cartel rampage",
    "title": "Threat of further violence looms after Mexican cartel rampage",
    "content": "The BBC speaks to Guadalajara residents days after cartel members sought to avenge the killing of Nemesio \"El Mencho\" Oseguera.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-25T15:58:51.760Z",
    "image": "https://image.pollinations.ai/prompt/Threat%20of%20further%20violence%20looms%20after%20Mexican%20cartel%20rampage%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "threat-of-further-violence-looms-after-mexican-cartel-rampage",
    "originalLink": "https://www.bbc.com/news/articles/cgml2djwwvno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bill Gates 'took responsibility' over Epstein ties in staff meeting, foundation says",
    "title": "Bill Gates 'took responsibility' over Epstein ties in staff meeting, foundation says",
    "content": "A newspaper reports Gates apologised to staff over his links to Epstein and said: \"I did nothing illicit. I saw nothing illicit.\"",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-25T15:58:56.863Z",
    "image": "https://image.pollinations.ai/prompt/Bill%20Gates%20'took%20responsibility'%20over%20Epstein%20ties%20in%20staff%20meeting%2C%20foundation%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bill-gates-took-responsibility-over-epstein-ties-in-staff-meeting-foundation-says",
    "originalLink": "https://www.bbc.com/news/articles/cnv6rjp468ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Uefa rejects Benfica appeal over Prestianni ban",
    "title": "Uefa rejects Benfica appeal over Prestianni ban",
    "content": "Gianluca Prestianni will miss the second leg of Benfica's Champions League tie against Real Madrid after Uefa reject the club's appeal against his suspension.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-25T15:59:02.546Z",
    "image": "https://image.pollinations.ai/prompt/Uefa%20rejects%20Benfica%20appeal%20over%20Prestianni%20ban%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uefa-rejects-benfica-appeal-over-prestianni-ban",
    "originalLink": "https://www.bbc.com/sport/football/articles/clygxwzvy1eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Terry 'frustrated' over Chelsea caretaker choice",
    "title": "Terry 'frustrated' over Chelsea caretaker choice",
    "content": "Former Chelsea captain John Terry says he is \"frustrated\" at being overlooked for a caretaker role following Enzo Maresca's departure as head coach in January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-25T15:59:07.636Z",
    "image": "https://image.pollinations.ai/prompt/Terry%20'frustrated'%20over%20Chelsea%20caretaker%20choice%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "terry-frustrated-over-chelsea-caretaker-choice",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce94rg39k0ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man Utd post profit but debt rises to £1.3bn",
    "title": "Man Utd post profit but debt rises to £1.3bn",
    "content": "The amount Manchester United owe increases to almost £1.3bn in outstanding transfer fees, rolling credit facility and legacy debt.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-25T15:59:12.731Z",
    "image": "https://image.pollinations.ai/prompt/Man%20Utd%20post%20profit%20but%20debt%20rises%20to%20%C2%A31.3bn%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-utd-post-profit-but-debt-rises-to-pound13bn",
    "originalLink": "https://www.bbc.com/sport/football/articles/c4gq70yqv0do?at_medium=RSS&at_campaign=rss"
  }
]