[
  {
    "originalTitle": "Kenya strike delays flights at international hub airport",
    "title": "Kenya strike delays flights at international hub airport",
    "content": "Authorities say they have put in place contingency measures as a labour dispute affects travel.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-16T14:03:02.805Z",
    "image": "https://image.pollinations.ai/prompt/Kenya%20strike%20delays%20flights%20at%20international%20hub%20airport%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenya-strike-delays-flights-at-international-hub-airport",
    "originalLink": "https://www.bbc.com/news/articles/c363096kd5po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nigeria warns against enlisting abroad  after reports of deaths in Ukraine",
    "title": "Your Safety First! Nigeria Cares for You!",
    "content": "<h3>Hello, Little Friends!</h3>\nHello, wonderful little friends! Auntie Safia here, bringing you some important news from our big, beautiful continent of Africa. Today, we have a very special message from Nigeria, a super important country in West Africa. It's all about keeping you and your families safe. Because your safety is the most important thing!\n\n<h3>What is This News About?</h3>\nImagine your home is like a big, warm blanket. It keeps you safe and cozy, right? Well, sometimes, people might be asked to leave their safe homes and go very, very far away. They might be asked to join a fight in another country. And our friends in Nigeria want everyone to know that this can be very dangerous. They want everyone to stay safe at home, with their families.\n\nNigeria is like a very, very big family. And in every family, the grown-ups look after the children. The government of Nigeria is like the grown-ups who look after all the citizens. They want to protect everyone, from the smallest baby to the oldest grandparent.\n\n<h3>Why is Nigeria Talking About This?</h3>\nNigeria is like a caring parent for its citizens. A parent always wants their children to be safe and sound. So, the people who lead Nigeria, we call them 'the government' or 'the authorities,' have heard some worrying news. They heard that some people from Nigeria have gone to a far-off place called Ukraine. And sadly, some of these people got hurt or even lost their lives there. This makes everyone very sad, and Nigeria wants to make sure no more people get into danger.\n\nDid you know? The 'authorities' are like the head teachers of the whole country. Just like your head teacher makes sure your school is safe and runs well, the authorities make sure the whole country is safe and people are happy.\n\n<h3>What Does 'Enlisting Abroad' Mean?</h3>\nLet's learn a new big phrase: 'enlisting abroad.' It sounds fancy, but it just means going to another country to join their army. An army is a group of people who protect their country. But when you 'enlist abroad,' it means you go to *another* country to help *them* fight. It's like leaving your own school team to play for a team in a faraway town without your coach's permission. It can be confusing and dangerous because you don't know the rules there.\n\nDid you know? Nigeria has its own brave army that protects its people right here at home! Our soldiers work hard to keep our country peaceful.\n\n<h3>Where is Ukraine?</h3>\nUkraine is a country very, very far away from us. Imagine drawing a straight line from Nigeria on a map, all the way across the big blue ocean, and then across some other countries. Ukraine is in a continent called Europe. It's very different from Africa. It has different weather, different people, and right now, there is a big problem there. There is a war happening. A war is when countries fight each other. It is very sad and dangerous.\n\nDid you know? Africa is the second-largest continent in the world, full of amazing animals and beautiful places! Europe is another continent, also full of interesting places, but it's very far from us. It would take a very long time to travel from Nigeria to Ukraine.\n\n<h3>Why is it Dangerous to Go There?</h3>\nWhen there is a war, it means people are fighting. And fighting is never safe. People can get hurt very badly, and sometimes, very sadly, they can even die. That's why Nigeria is so worried. They don't want their people, their citizens, to go to a place where they might get hurt or lose their lives. It's like being told not to play with fire because fire can burn you. War is like a very, very big, dangerous fire.\n\nWars are very loud and scary. There are loud noises, and things can get broken. People can get very, very sad when wars happen. That's why it's so important to stay away from places where wars are happening. Your safety is much more important than any faraway fight.\n\n<h3>What is 'Illegal Recruitment'?</h3>\nThis is a very important part of the message. Sometimes, people are 'illegally recruited.' This means someone might trick them or force them to go and fight. It's against the law, which means it's wrong and not allowed. Imagine if someone tried to trick you into going somewhere you shouldn't, without telling your parents. That's what 'illegal recruitment' can be like. People might promise things that are not true, or make it sound exciting, but it's really not safe or right.\n\nDid you know? It's always important to talk to a trusted adult, like your parents, teachers, or guardians, if someone asks you to do something that feels strange or wrong. They will always help you stay safe!\n\n<h3>Why is Nigeria Saying No?</h3>\nNigeria is saying 'no' to going to fight in other countries because it cares deeply for its people. They want everyone to live in peace and be safe at home. They want children to go to school, parents to work, and families to be together. When people go to fight in far-off wars, it breaks families apart and puts lives at risk. Nigeria wants to keep its big family – all its citizens – safe and sound.\n\nOur homes and our country are where we learn, play, and grow. They are where our schools are, where our friends are, and where our food grows. Leaving all that behind to go to a dangerous place is not a good idea. Nigeria wants its people to stay here and help build a stronger, happier Nigeria.\n\n<h3>What Should You Remember?</h3>\nSo, my little friends, here are the most important things to remember from Nigeria's message:\n<ol>\n    <li><b>Stay Safe at Home:</b> Your country and your family want you to be safe.</li>\n    <li><b>Listen to Grown-ups:</b> Always listen to your parents, teachers, and other trusted adults. They know what is best for you.</li>\n    <li><b>Don't Trust Strangers:</b> If someone you don't know well asks you to go somewhere or do something that makes you feel uneasy, say 'no' and tell a trusted adult right away.</li>\n    <li><b>No Fighting Far Away:</b> Going to fight in faraway countries is dangerous and can lead to sad outcomes.</li>\n    <li><b>Our Laws Protect Us:</b> There are laws to keep us safe, and 'illegal recruitment' goes against these laws.</li>\n</ol>\n\nDid you know? Nigeria has over 200 different languages spoken! That's a lot of ways to say 'hello'! But everyone understands the important message of safety.\n\n<h3>A Message of Peace</h3>\nNigeria, and all of Africa, hopes for a world where everyone can live in peace. A world where no one has to fight in wars, especially not in faraway places. Let's all hope for peace everywhere, and let's always remember to keep ourselves and our loved ones safe. Your life is precious, and your safety is Nigeria's top priority.\n\nThat's all for today, my little friends. Auntie Safia signing off, reminding you to always be safe, be smart, and always talk to your grown-ups. Bye-bye for now!",
    "summary": "Nigeria's government is asking its people to be careful and not go to faraway countries like Ukraine to fight, because it can be very dangerous and against the law.",
    "whyMatters": "This is important because Nigeria wants all its citizens, especially children and their families, to stay safe, happy, and together in their own country, and not get hurt in faraway places.",
    "category": "world",
    "date": "2026-02-16T14:03:30.425Z",
    "image": "https://image.pollinations.ai/prompt/Your%20Safety%20First!%20Nigeria%20Cares%20for%20You!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "your-safety-first-nigeria-cares-for-you",
    "originalLink": "https://www.bbc.com/news/articles/cev7e3m04ngo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Motorbike raids on villages kill dozens in Nigeria",
    "title": "Motorbike raids on villages kill dozens in Nigeria",
    "content": "Armed men shot locals dead, set homes alight and abducted an \"undetermined\" number of people in Niger State.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:03:35.530Z",
    "image": "https://image.pollinations.ai/prompt/Motorbike%20raids%20on%20villages%20kill%20dozens%20in%20Nigeria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "motorbike-raids-on-villages-kill-dozens-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/ckg1y0nk641o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "‘Rats run over our faces’: Gaza’s displaced forced to live on infested land",
    "title": "‘Rats run over our faces’: Gaza’s displaced forced to live on infested land",
    "content": "Displaced Palestinians forced to live on a landfill battle rats, scabies and unexploded shells.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:03:40.867Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Rats%20run%20over%20our%20faces%E2%80%99%3A%20Gaza%E2%80%99s%20displaced%20forced%20to%20live%20on%20infested%20land%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rats-run-over-our-faces-gazas-displaced-forced-to-live-on-infested-land",
    "originalLink": "https://www.aljazeera.com/features/2026/2/16/rats-run-over-our-faces-gazas-displaced-forced-to-live-on-infested-land?traffic_source=rss"
  },
  {
    "originalTitle": "The Epstein files cover-up: Botched or calculated?",
    "title": "The Epstein files cover-up: Botched or calculated?",
    "content": "Have the Epstein files shifted US politics beyond news hype?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-16T14:03:45.962Z",
    "image": "https://image.pollinations.ai/prompt/The%20Epstein%20files%20cover-up%3A%20Botched%20or%20calculated%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-epstein-files-cover-up-botched-or-calculated",
    "originalLink": "https://www.aljazeera.com/video/the-listening-post/2026/2/16/the-epstein-files-cover-up-botched-or-calculated?traffic_source=rss"
  },
  {
    "originalTitle": "Rights groups condemn Israeli plan for ‘de facto annexation’ of West Bank",
    "title": "Rights groups condemn Israeli plan for ‘de facto annexation’ of West Bank",
    "content": "Palestinians in the occupied West Bank face risk of losing homes, after an Israeli government proposal to register land.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-16T14:03:51.065Z",
    "image": "https://image.pollinations.ai/prompt/Rights%20groups%20condemn%20Israeli%20plan%20for%20%E2%80%98de%20facto%20annexation%E2%80%99%20of%20West%20Bank%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rights-groups-condemn-israeli-plan-for-de-facto-annexation-of-west-bank",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/16/rights-groups-condemn-israeli-plan-for-de-facto-annexation-of-west-bank?traffic_source=rss"
  },
  {
    "originalTitle": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove",
    "title": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove",
    "content": "The FBI says it recovered a DNA sample from the glove, which was found in a field a few miles from Guthrie's home.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:03:56.509Z",
    "image": "https://image.pollinations.ai/prompt/'It's%20never%20too%20late'%3A%20Savannah%20Guthrie's%20new%20plea%20for%20mother's%20release%20as%20FBI%20analyses%20glove%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "its-never-too-late-savannah-guthries-new-plea-for-mothers-release-as-fbi-analyses-glove",
    "originalLink": "https://www.bbc.com/news/articles/c5yrv2g16e2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump's new world order has become real and Europe is having to adjust fast",
    "title": "Trump's new world order has become real and Europe is having to adjust fast",
    "content": "European nations are asking whether traditional alliances can suffice, or whether they should be diversifying",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:04:01.611Z",
    "image": "https://image.pollinations.ai/prompt/Trump's%20new%20world%20order%20has%20become%20real%20and%20Europe%20is%20having%20to%20adjust%20fast%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-new-world-order-has-become-real-and-europe-is-having-to-adjust-fast",
    "originalLink": "https://www.bbc.com/news/articles/cddn002g6qzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bondi Beach shooting accused faces court for the first time",
    "title": "Learning About Safety and Justice Far Away!",
    "content": "Hello, my wonderful friends! Your kid-friendly news reporter from Africa is here. Today, we're going to talk about something important. We'll learn how grown-ups work very hard to keep everyone safe and sound. It's like having superheroes all around us, making sure the world is a good place for everyone to play and learn.\n\n<h3>A Sad Event Far, Far Away</h3>\n\nSometimes, things happen that make us feel a little sad. Long, long ago, in a country far away across the big ocean, something not good happened. Someone did something that caused trouble and made many people sad and worried. It's important to know that this happened very far from our homes here in Africa. Grown-ups are always working to make sure bad things don't happen often, and if they do, they fix them.\n\nLife is mostly full of happy times, fun, and kindness. But when something tricky happens, we learn about how people work together to make things right again.\n\n<h3>Brave Helpers Come Quickly!</h3>\n\nWhen this not-good thing happened, amazing grown-ups called the police quickly got to work. Their job is to keep everyone safe and to find out what happened. They are like guardians for our communities. They wear special uniforms so we can easily see them and know who to ask for help.\n\n*Did you know?* Police officers have many tools to help them! They have radios to talk to each other, and some even have friendly dogs that help them with their important jobs!\n\nThe brave police worked fast. They found the person who caused all the trouble. This is a very important part of keeping everyone safe. It means that when someone does something wrong, they don't get to keep doing it.\n\n<h3>What Happens Next? Going to Court</h3>\n\nAfter the police find the person, something else very important happens. They go to a special place called a court. A court is like a big, serious room where grown-ups talk about rules and fairness. It's where they try to understand everything that happened and decide what is the best thing to do next.\n\nIn the court, there is a very important grown-up called a judge. The judge is a very wise person who listens to everyone carefully. They listen to what the police say, and they listen to other grown-ups who know about what happened. The judge's job is to make sure things are fair and that everyone follows the rules.\n\n*Did you know?* Laws are like big rules that everyone in a country must follow! They help us know what is okay and what is not okay to do.\n\n<h3>Why Rules Are So Important</h3>\n\nRules are super important! Think about the rules in your home or at school. Rules like \"don't push your friends\" or \"always share your toys\" help us all get along. They keep us safe and happy. If there were no rules, it would be a very messy and confusing world!\n\nJust like school rules, countries have rules called laws. These laws help keep whole towns and cities safe. When someone breaks these laws, the police and the court help to make things right again. This is called 'justice' – making sure things are fair for everyone.\n\n<h3>Feeling Safe and Sound</h3>\n\nIt’s natural to hear about things like this and wonder about safety. But remember, your grown-ups, your teachers, and the police in your community are always working to keep you safe. They think about safety all the time.\n\nIf you ever feel worried or unsafe, it’s super important to tell a trusted grown-up right away. This could be your mum, dad, a grandparent, a teacher, or a family friend. They are there to listen and help you.\n\n*Did you know?* Many communities have special programmes to teach kids about safety, like \"stranger danger\" or how to cross the road safely!\n\n<h3>Helping Hands Make Strong Communities</h3>\n\nWhen sad things happen, people often come together to help each other. This is called community spirit. People might help their neighbours, or offer kind words to those who are sad. It shows how strong we are when we work together. Helping each other makes us all feel better and stronger.\n\nHere in Africa, we know a lot about helping each other. We have wonderful communities where people look out for one another, share food, and celebrate together. That spirit of togetherness is what makes our continent so special.\n\n*Did you know?* When you help a friend, you make both of you feel happier! Helping hands make the world a better place.\n\n<h3>Our Amazing Africa</h3>\n\nWe are so lucky to live in Africa, a continent full of sunshine, amazing animals, and kind people. Our leaders and police also work very hard every day to keep our homes and communities safe. They want everyone to grow up happy and strong, learning and playing.\n\nRemember, the story we heard today happened very far away. But it teaches us important lessons about rules, justice, and how brave grown-ups help keep our world safe. It reminds us to be kind, to follow rules, and to always trust the grown-ups who look after us.\n\nThank you for listening, my dear friends! Stay safe and keep shining brightly!",
    "summary": "Far away, something not good happened, but brave police quickly found the person who caused trouble, and now a judge in a court will make sure everything is fair, showing us how grown-ups work hard to keep everyone safe and how important rules are.",
    "whyMatters": "This story matters because it teaches us that even when bad things happen far away, grown-ups like police and judges work hard to keep everyone safe and make sure things are fair, reminding us that rules keep us safe and we can always trust grown-ups for help.",
    "category": "world",
    "date": "2026-02-16T14:04:20.887Z",
    "image": "https://image.pollinations.ai/prompt/Learning%20About%20Safety%20and%20Justice%20Far%20Away!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "learning-about-safety-and-justice-far-away",
    "originalLink": "https://www.bbc.com/news/articles/c3rzwe7lr4jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ratcliffe, Man Utd and the immigration comments fallout",
    "title": "Ratcliffe, Man Utd and the immigration comments fallout",
    "content": "Sports editor Dan Roan analyses the potential fallout of Manchester United co-owner Sir Jim Ratcliffe's comments on immigration.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:04:26.949Z",
    "image": "https://image.pollinations.ai/prompt/Ratcliffe%2C%20Man%20Utd%20and%20the%20immigration%20comments%20fallout%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ratcliffe-man-utd-and-the-immigration-comments-fallout",
    "originalLink": "https://www.bbc.com/sport/football/articles/c309dj3vm7do?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Matheson on Old Trafford heroics, 'torrid time' as £1m teenager & McLeod death",
    "title": "Matheson on Old Trafford heroics, 'torrid time' as £1m teenager & McLeod death",
    "content": "A 16-year-old Luke Matheson wrote his name in the history books by scoring against Manchester United in 2019. Six years later, he is aiming for more cup heroics with Macclesfield.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:04:32.048Z",
    "image": "https://image.pollinations.ai/prompt/Matheson%20on%20Old%20Trafford%20heroics%2C%20'torrid%20time'%20as%20%C2%A31m%20teenager%20%26%20McLeod%20death%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "matheson-on-old-trafford-heroics-torrid-time-as-pound1m-teenager-and-mcleod-death",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg18xrw2rwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Is number 10 role the next step for Saka?",
    "title": "Is number 10 role the next step for Saka?",
    "content": "Mikel Arteta gave a glimpse of what could be the next evolution of the Arsenal attack... Bukayo Saka playing as a number 10.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-16T14:04:37.154Z",
    "image": "https://image.pollinations.ai/prompt/Is%20number%2010%20role%20the%20next%20step%20for%20Saka%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "is-number-10-role-the-next-step-for-saka",
    "originalLink": "https://www.bbc.com/sport/football/articles/c8jx84dm32jo?at_medium=RSS&at_campaign=rss"
  }
]