[
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "Keeping Our Baby Friends Healthy: A Story About Being Fair!",
    "content": "Hello, my amazing friends all across Africa! It's your friendly news reporter, here to share an important story with you. Today, we're going to talk about something super important: keeping our tiniest friends, our baby brothers and sisters, safe and healthy. We all want every single baby to grow up strong, don't we? So, let's learn about a plan that was made to help babies in a country called Guinea-Bissau, and why some grown-ups were worried about it.\n\n<h3>What Are Germs and How Do We Fight Them?</h3>\nImagine tiny, tiny little creatures that you can't even see, like super-duper small invisible monsters! These are called germs. Sometimes, these germs can make us feel yucky and sick. Our bodies are very clever and try to fight them off, but sometimes they need a little help.\n\nDid you know? Washing your hands with soap and water is like building a tiny fort against many of these invisible germ monsters!\n\n<h3>What is a Vaccine? It's Like a Super Shield!</h3>\nTo help our bodies fight some really strong germs, doctors and scientists made something special called a vaccine. Think of a vaccine as a super shield! When you get a vaccine (often a little prick like a mosquito bite, but much faster!), it teaches your body how to build its own strong shield against a specific germ. So, if that germ ever tries to visit, your body is ready to fight it off and keep you from getting very sick.\n\nDid you know? Vaccines have helped save millions and millions of lives around the world, making sure kids like you can go to school and play without getting very sick from certain diseases!\n\n<h3>Meet Hepatitis B: A Nasty Germ</h3>\nThere's a germ called Hepatitis B. This germ can be very nasty, especially for tiny babies. It can make their 'liver' very sick. What's a liver? It's like a special cleaning machine inside your body that helps keep your blood healthy and clean. If a baby gets Hepatitis B, it can make them very, very poorly for a long time, sometimes even for their whole life. That's why we want to protect all babies from it.\n\nDid you know? Many babies get their first vaccine right after they are born, to start building their shields early on!\n\n<h3>Our Friends in Guinea-Bissau</h3>\nNow, let's talk about a wonderful country in Africa called Guinea-Bissau. It's a place with beautiful landscapes and lovely people. Just like in your country, there are many families who want their children to be healthy and happy. Doctors and health helpers in Guinea-Bissau work very hard to take care of everyone, especially the newest babies.\n\nDid you know? Guinea-Bissau is known for its cashew nuts, which are super yummy! Many people there also speak Portuguese because of its history.\n\n<h3>A Plan to Help Babies... But With a Worry</h3>\nSome big scientists and doctors from another country (the United States) wanted to do a special test, called a 'trial', in Guinea-Bissau. They wanted to see if giving a baby medicine for Hepatitis B right at birth, and then more later, made them extra safe. It sounds like a good idea to help babies, right?\n\nHowever, this test had a plan that worried some other very important health experts. They planned to give the special medicine (the super shield vaccine) to *some* babies, but *not* to others. This was so they could compare and see if the babies who got the medicine were healthier than those who didn't.\n\n<h3>Why Was This Plan Not Fair?</h3>\nThis is where the problem came in, and why the World Health Organization (WHO) spoke up. The WHO is like a very big team of doctors and health experts from all over the world. Their job is to help everyone stay healthy and make sure that health rules are fair for everyone.\n\nThe WHO looked at the plan and said, \"Wait a minute! We already know that the Hepatitis B vaccine (that super shield) *works*! We know it helps babies stay safe from this bad germ.\" They said it wasn't fair to give some babies the shield and then leave other babies *without* it, just for a test, when we already know the shield is important and helps. This is what they meant by \"unethical\" – it wasn't right or fair to the babies who wouldn't get the protection they should have.\n\nImagine if you and your friend were both running a race, and you both needed special shoes to run safely. But someone said, \"Let's give one of you the special shoes and the other one no shoes, just to see what happens.\" That wouldn't be fair, would it? It's the same idea with the baby medicine. Every baby deserves the best chance to be safe and healthy.\n\n<h3>What Happens Next?</h3>\nBecause the WHO raised their concerns, everyone is now talking about the plan again. The most important thing is that all babies, everywhere, get the best care and protection they need. Health experts will now work together to find a way to learn more about how to keep babies super healthy, without anyone missing out on important medicines that we know already work.\n\nWe all want to make sure that children in Guinea-Bissau, and all over Africa and the world, have a healthy start to life. It's a reminder that being fair and kind is super important, especially when it comes to helping our smallest and most precious friends!\n\nThank you for listening, my wonderful friends! Stay curious and keep learning! Bye for now!",
    "summary": "A big group of doctors, the World Health Organization (WHO), said a plan to test medicine on some babies in Guinea-Bissau wasn't fair because not all babies would get the help they needed, even though we know the medicine works.",
    "whyMatters": "It's super important that all babies, especially very tiny ones, get the best chance to be healthy and strong, and that all tests done to help people are always fair for everyone involved.",
    "category": "world",
    "date": "2026-02-15T05:53:00.071Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Our%20Baby%20Friends%20Healthy%3A%20A%20Story%20About%20Being%20Fair!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-our-baby-friends-healthy-a-story-about-being-fair",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "content": "Bouquets of cash have been blooming in popularity in Kenya but recent warnings may slow the trend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:05.178Z",
    "image": "https://image.pollinations.ai/prompt/Kenyans%20drop%20flowers%20for%20Valentine's%20bouquets%20of%20cash.%20Not%20everyone%20is%20impressed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenyans-drop-flowers-for-valentines-bouquets-of-cash-not-everyone-is-impressed",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "Africa's Big Voice: Playing Fair in Our Big World!",
    "content": "Hello, amazing kids of Africa! Your friendly reporter is here with some big news from around the world. We live in a wonderful continent called Africa, with so many countries, people, and beautiful places. Today, we're talking about how Africa plays a part in our big, big world!\n\nSometimes, things change far away, and we need to understand what it means for us here in Africa. It's like when new rules come for a game you play. Everyone needs to understand the new rules and make sure they are fair for everyone.\n\nAfrica is a very important part of our world. Our leaders and grown-ups are working hard to make sure Africa's voice is heard and that we have a bright future. Let's learn more!\n\n<h3>Our Big, Beautiful World!</h3>\nOur Earth is like a giant playground! It has many, many countries, just like you have many friends in your school or village. All these countries are connected to each other in different ways.\n\nWe live in Africa, which is a very big continent with 54 amazing countries! Imagine that! So many different people, languages, and cultures, all living together on one big land.\n\nCountries talk to each other, just like friends talk. They share ideas, they buy and sell things, and sometimes they help each other when someone needs a hand. This is called 'international relations' – it just means how countries get along.\n\nDid you know? Africa is the second-largest continent in the world! It is home to incredible animals like elephants, giraffes, and lions, and has beautiful places like the Sahara Desert and the Nile River.\n\nSometimes, the way countries talk and work together changes. It's like when you learn a new game, or when the teacher introduces a new way to do things in class. Everyone needs to figure out how to play by the new rules.\n\nOur leaders in Africa want to make sure that these changes are good for us. They want to make sure that Africa is treated fairly and that our people can grow up safe and happy.\n\n<h3>Who is the US President?</h3>\nFar, far away, across the ocean, there is a very big country called the United States of America. This country has a leader, just like your school has a head teacher or your village has a chief.\n\nThis leader is called the 'US President'. He is a very powerful person because he makes big decisions for his country. Sometimes, these decisions can make other countries think about how they work together.\n\nImagine if the captain of one big team in your game changed a very important rule. All the other teams would need to think about how this new rule affects them and how they will play now.\n\nDid you know? The United States of America is very far from Africa. It takes many, many hours to fly there in an aeroplane! But even though it's far, what happens there can still touch us.\n\nWhen we hear that the US President has made big changes, it means that countries all over the world start to think about what this means for them. It's a big topic for grown-ups and leaders.\n\n<h3>What Does 'Shaken Up' Mean?</h3>\nWhen we say things have been 'shaken up,' it doesn't mean something actually shook! It means that things are a bit mixed up, or different from how they used to be. Like when you shake a juice bottle, everything inside gets mixed around!\n\nSo, when the news says the US President has 'shaken up' how countries talk, it means the old ways of doing things might be changing. The rules for how countries work together might look a little different now.\n\nThis makes all the countries in Africa, and our leaders, stop and think. They ask, 'What does this mean for Africa? How will we work with our friends around the world now?'\n\nDid you know? Africa has many different kinds of natural resources, like gold, diamonds, and oil. Countries all over the world want to work with Africa to get these resources, so it's important that we have a say in how we share them fairly.\n\nOur leaders are very smart. They are working hard to figure out the best way for Africa to keep growing and keep its people safe and happy, no matter what changes are happening in other parts of the world.\n\n<h3>Africa's Place in the World</h3>\nAfrica is a strong and important continent! We have so much to offer the world. We have clever people, amazing art, beautiful music, and rich history. Our continent is full of life and brilliant ideas.\n\nOur leaders want to make sure that everyone knows how important Africa is. They want to show the world that Africa is a place of growth, innovation, and bright futures.\n\nWe want fairness for everyone. We want every child in Africa to have good schools, clean water, and healthy food. We want our doctors and hospitals to be the best, and our homes to be safe.\n\nDid you know? Africa has the youngest population in the world! This means there are lots and lots of children and young people who will grow up to be amazing leaders, scientists, and artists. You are the future of Africa!\n\nOur leaders are making sure that Africa is seen as an equal player on the world stage. We want to be part of all the big decisions that affect our world, not just listen to what others decide.\n\n<h3>Being 'At the Table'</h3>\nWhen we say Africa wants a 'seat at the table,' it doesn't mean a real chair at a dinner table! It's a special way of saying that Africa wants to be included in all the important meetings and talks where big decisions are made.\n\nImagine you and your friends are planning a fun game. Everyone wants to be at the table, sharing their ideas and making choices together. No one wants to be left out of the planning!\n\nAfrica has many important things to say. Our leaders want to share our ideas about how to make the world a better, more peaceful place. We have solutions to problems, and we want to help find them.\n\nDid you know? The African Union is like a big family of all the countries in Africa. They work together to make Africa stronger and louder in the world. They help make sure Africa's voice is heard.\n\nBeing at the table means that our leaders can talk directly to other leaders from big countries. They can explain what Africa needs and what Africa can offer to the world. It’s about being equal partners.\n\n<h3>Not 'On the Menu'</h3>\nAnd what about 'on the menu'? That also doesn't mean Africa is food! It's another special way of saying that Africa doesn't want other big countries to decide things for us. We want to make our own choices.\n\nImagine if someone else always chose what you would eat for dinner, or what games you could play. You wouldn't like that very much, would you? You want to choose for yourself!\n\nAfrica is grown up and smart. Our leaders know what is best for our continent and our people. We want to decide how we live, how we trade, and how we grow our countries.\n\nDid you know? Africa has thousands of languages spoken across its countries. This shows how rich and diverse our continent is, with so many unique ways of communicating and understanding the world!\n\nOur leaders are saying: 'Africa will make its own path. We will work with friends, but we will always choose what is best for Africa.' This makes Africa strong and independent.\n\n<h3>Working Together for a Bright Future!</h3>\nSo, even though there are big changes happening in the world, Africa is ready. Our leaders are talking, planning, and working together to make sure our continent thrives.\n\nWhen countries work together, it's like a big team. Everyone uses their special skills to help the team win. Africa wants to be a great team player for a better world.\n\nWe want peace, friendship, and fairness for everyone, everywhere. Our leaders are making sure that Africa is a strong voice for these important ideas.\n\nDid you know? Many countries in Africa are building new roads, schools, and hospitals to make life better for everyone. This shows how much we are growing and looking forward to the future.\n\nSo, children of Africa, remember that our continent is important and powerful. We are part of a big world, and we are working hard to make sure our future is super bright and happy!\n\nLet's keep learning, keep growing, and keep cheering for Africa!",
    "summary": "Africa's leaders are making sure our continent has a strong voice and makes its own choices as how countries around the world talk and work together changes.",
    "whyMatters": "This is important because it means Africa will be treated fairly and can decide its own future, making sure all kids grow up safe and happy.",
    "category": "world",
    "date": "2026-02-15T05:53:31.098Z",
    "image": "https://image.pollinations.ai/prompt/Africa's%20Big%20Voice%3A%20Playing%20Fair%20in%20Our%20Big%20World!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "africas-big-voice-playing-fair-in-our-big-world",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Cyclone Gezani kills four in Mozambique as Madagascar assesses damage",
    "title": "Cyclone Gezani kills four in Mozambique as Madagascar assesses damage",
    "content": "Powerful storm batters Mozambique's Inhambane a day after killing at least 41 people in Madagascar.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:36.291Z",
    "image": "https://image.pollinations.ai/prompt/Cyclone%20Gezani%20kills%20four%20in%20Mozambique%20as%20Madagascar%20assesses%20damage%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cyclone-gezani-kills-four-in-mozambique-as-madagascar-assesses-damage",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/cyclone-gezani-kills-four-in-mozambique-as-madagascar-assesses-damage?traffic_source=rss"
  },
  {
    "originalTitle": "Israeli forces kill nine Palestinians in Gaza, attack southern Lebanon",
    "title": "Israeli forces kill nine Palestinians in Gaza, attack southern Lebanon",
    "content": "Medical sources say Israeli forces killed five Palestinians in southern Khan Younis and four in northern al-Faluja.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:41.394Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20forces%20kill%20nine%20Palestinians%20in%20Gaza%2C%20attack%20southern%20Lebanon%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-forces-kill-nine-palestinians-in-gaza-attack-southern-lebanon",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/israeli-forces-kill-eight-palestinians-in-attacks-across-gaza?traffic_source=rss"
  },
  {
    "originalTitle": "Gunmen kill at least 32 people in northern Nigeria, residents say",
    "title": "Gunmen kill at least 32 people in northern Nigeria, residents say",
    "content": "Witnesses say the motorcycle riding gunmen attacked three communities in northern Nigeria, killing and abducting dozens.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:46.493Z",
    "image": "https://image.pollinations.ai/prompt/Gunmen%20kill%20at%20least%2032%20people%20in%20northern%20Nigeria%2C%20residents%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gunmen-kill-at-least-32-people-in-northern-nigeria-residents-say",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/gunmen-kill-at-least-32-people-in-northern-nigeria-residents-say?traffic_source=rss"
  },
  {
    "originalTitle": "Russia killed opposition leader Alexei Navalny using dart frog toxin, UK says",
    "title": "Russia killed opposition leader Alexei Navalny using dart frog toxin, UK says",
    "content": "There is no innocent explanation for the toxin being found in samples taken from Navalny's body, Foreign Office says.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:51.855Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20killed%20opposition%20leader%20Alexei%20Navalny%20using%20dart%20frog%20toxin%2C%20UK%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-killed-opposition-leader-alexei-navalny-using-dart-frog-toxin-uk-says",
    "originalLink": "https://www.bbc.com/news/articles/cwyk4lz4e3eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rubio says US and Europe 'belong together' despite tensions",
    "title": "Rubio says US and Europe 'belong together' despite tensions",
    "content": "The US secretary of state reassures European leaders that the Trump administration backs the transatlantic alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:53:56.955Z",
    "image": "https://image.pollinations.ai/prompt/Rubio%20says%20US%20and%20Europe%20'belong%20together'%20despite%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rubio-says-us-and-europe-belong-together-despite-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c2lrdq47149o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Motorbike raids on villages kill at least 30 in Nigeria",
    "title": "Motorbike raids on villages kill at least 30 in Nigeria",
    "content": "Assailants shot dead or cut the throats of their victims, lit homes on fire and abducted multiple people in Niger state, Nigeria.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-15T05:54:02.054Z",
    "image": "https://image.pollinations.ai/prompt/Motorbike%20raids%20on%20villages%20kill%20at%20least%2030%20in%20Nigeria%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "motorbike-raids-on-villages-kill-at-least-30-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/ckg1y0nk641o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'The officials looked petrified' - was Villa Park chaos advert for VAR?",
    "title": "'The officials looked petrified' - was Villa Park chaos advert for VAR?",
    "content": "Newcastle United beat Aston Villa in the FA Cup fourth round in a match dominated by a number of controversial decisions without VAR.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:54:07.555Z",
    "image": "https://image.pollinations.ai/prompt/'The%20officials%20looked%20petrified'%20-%20was%20Villa%20Park%20chaos%20advert%20for%20VAR%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-officials-looked-petrified-was-villa-park-chaos-advert-for-var",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70ke0zglk5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kane reaches 500 goals - what other records could he break?",
    "title": "Kane reaches 500 goals - what other records could he break?",
    "content": "Bayern Munich striker Harry Kane became the first Englishman to reach 500 career goals on Saturday, but what other records could he break?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:54:12.660Z",
    "image": "https://image.pollinations.ai/prompt/Kane%20reaches%20500%20goals%20-%20what%20other%20records%20could%20he%20break%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kane-reaches-500-goals-what-other-records-could-he-break",
    "originalLink": "https://www.bbc.com/sport/football/articles/c743xp1xw9yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "title": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "content": "Burnley manager Scott Parker is under increasing pressure as the Premier League side are dumped out of the FA Cup by League One Mansfield.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T05:54:17.747Z",
    "image": "https://image.pollinations.ai/prompt/Brilliant%20Mansfield%20pile%20pressure%20on%20Parker%20-%20is%20his%20time%20up%20at%20Burnley%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brilliant-mansfield-pile-pressure-on-parker-is-his-time-up-at-burnley",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy0dnxwxyl0o?at_medium=RSS&at_campaign=rss"
  }
]