[
  {
    "originalTitle": "Nigerian officers to face trial over coup-plot allegations",
    "title": "Keeping Nigeria Safe and Fair!",
    "content": "<h3>Hello, Super Friends of Africa!</h3>\nWelcome, welcome to our special news report! I'm your kid-friendly reporter, here to tell you about some important things happening in our amazing continent. Today, we're zooming into Nigeria, a very big and wonderful country. We're going to talk about a little puzzle that is being solved there, and we'll use super simple words so everyone can understand. It's like finding clues in a fun mystery!\n\n<h3>Who is Our President?</h3>\nEvery country has a leader, just like your school has a head teacher, or your family has grown-ups in charge. In Nigeria, the leader is called the President. His name is President Bola Tinubu. He is like the captain of our big Nigerian ship! His most important job is to help everyone in Nigeria live safely and happily. He makes big decisions to make sure schools are good, there is yummy food, and that everyone is well looked after.\n\nDid you know? A President is chosen by many, many people voting. It's like choosing your favorite game, but for the whole country! It's a very special way to pick a leader.\n\n<h3>What Happened? A Little Puzzle!</h3>\nSometimes, even in big countries, there can be little puzzles or tricky situations. Recently, some grown-ups who are soldiers were asked to answer some questions. These soldiers were accused of trying to change who the President is. They were accused of wanting to stop President Bola Tinubu from being the leader without a fair vote. This is not how we do things in Nigeria because we believe in fairness and rules. Imagine if someone tried to change the rules of your favorite game in the middle of playing! That wouldn't be fair, right?\n\nDid you know? Nigeria is the most populated country in Africa! That means lots and lots of people live there, so it's extra important to have clear rules.\n\n<h3>Why Do We Have a President?</h3>\nHaving a President who is chosen by everyone is super important. It means that the people of Nigeria get to decide who leads them. This is called \"democracy,\" and it means power belongs to the people. When a President is chosen fairly, it helps everyone trust the leader and work together. If someone tries to change the leader without a vote, it can make things confusing and sometimes not peaceful. We want Nigeria to always be peaceful and orderly, just like a well-organized classroom!\n\nDid you know? The capital city of Nigeria is Abuja! It's a beautiful city where many important decisions for the country are made.\n\n<h3>What is a Trial?</h3>\nNow, about those soldiers. They are going to go to a special place called a court. This is like a big meeting where wise judges listen carefully to what happened. Everyone gets a chance to tell their side of the story. The judges will look at all the facts, like finding clues in a mystery story. Then, they will decide what is right and fair. It's a very important way to make sure that rules are followed and that justice happens for everyone. This trial will help us understand the whole puzzle better.\n\nDid you know? In a court, there are people called lawyers who help others tell their stories and make sure everyone's voice is heard.\n\n<h3>Why Rules Are Super Important!</h3>\nThink about your home or school. You have rules, right? Rules like \"no running in the hallway\" or \"share your toys\" help everyone get along. They keep us safe and make sure things are fair. In a country, laws are like big, important rules for everyone. They help keep peace, protect people, and make sure things work well. Trying to change a leader without following the rules is like playing a game and suddenly changing the score so you win. That's not fair! So, the trial is about making sure the big rules of Nigeria are respected.\n\nDid you know? There are special books where all the laws of a country are written down! These books help everyone know what the rules are.\n\n<h3>Our Soldiers Are Here to Help!</h3>\nSoldiers are very important people. They wear uniforms and are trained to protect our country. They keep us safe from dangers from outside. They are like the strong guardians of our nation. But their job is to protect the country and its leaders, not to choose who the leader should be. Choosing a leader is a job for all the people of Nigeria through their votes. So, when some soldiers are accused of trying to change the leader, it means they might have forgotten their special job of protecting the system.\n\nDid you know? Soldiers train very hard to be strong and brave. They learn many skills to keep people safe.\n\n<h3>What Happens Next?</h3>\nThe trial will happen, and the judges will listen very carefully. It might take some time, just like solving a big mystery. Once the judges have heard everything, they will make a decision. This decision will help Nigeria continue to be a country where everyone follows the rules and lives together peacefully. President Bola Tinubu is still our leader, and he is working hard for Nigeria every day to make it a wonderful place for all children.\n\n<h3>Let's Keep Nigeria Strong!</h3>\nNigeria is a country full of amazing people, beautiful places, and rich culture. It's a place where children go to school, families share meals, and friends play together. It's super important that we all help keep Nigeria strong and happy. We do this by respecting our leaders, following rules, and being kind to each other. Even when there are little puzzles like this, we know Nigeria is strong and will always work things out fairly, following its big, important rules.\n\nDid you know? Nigeria is famous for its music, movies (Nollywood is a huge movie industry!), and delicious jollof rice! Yum!\n\n<h3>Our Promise to You</h3>\nAs your kid-friendly reporter, I promise to always tell you the news in a way that is easy to understand. We want you to feel safe and happy about your country and continent. Leaders and grown-ups are working hard every day to make Africa a better place for all children. So, don't worry, just keep learning, playing, and being kind to everyone!",
    "summary": "Some soldiers in Nigeria are going to court because they are accused of trying to change the country's leader, President Bola Tinubu, without following the rules and a fair vote.",
    "whyMatters": "This is important because countries need to follow rules for choosing leaders fairly and peacefully, so everyone can live safely and trust their government. It shows that even powerful people must follow the laws of the country, just like we follow rules in our games and schools.",
    "category": "world",
    "date": "2026-01-27T09:28:52.714Z",
    "image": "https://image.pollinations.ai/prompt/Keeping%20Nigeria%20Safe%20and%20Fair!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "keeping-nigeria-safe-and-fair",
    "originalLink": "https://www.bbc.com/news/articles/c9dv4wlw3yzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyan cult leader faces charges over 52 further deaths",
    "title": "News for Kids: Stay Safe, Listen to Grown-Ups!",
    "content": "<h3>Hello, Super Star Kids of Africa!</h3>\nHi everyone! I'm your friendly news reporter, Asha, and I'm here to share important stories with you. Today, we have something really important to talk about, all the way from Kenya! Kenya is a beautiful country in Africa, famous for its amazing animals like lions and elephants. It's also known for its kind people and bright sunshine.\n\nWe love sharing news that helps you learn and stay safe. Sometimes, news can be a bit serious, but we always talk about it in a way that helps you understand and grow. It's like learning new things in school!\n\n<h3>Learning About Good Choices and Safety</h3>\nSometimes, grown-ups make choices that are not very good. It's important for all of us, especially children like you, to know how to stay safe and make smart choices. We have some news about a grown-up in Kenya who made some very confusing choices.\n\nHis name is Paul Mackenzie. He told people things that were not true and not safe. Grown-ups called \"police\" and \"prosecutors\" are working hard to make sure everyone is safe. They are like the good helpers who make sure rules are followed.\n\n<h3>What Happened in Kenya?</h3>\nPaul Mackenzie is in a special place called a prison. He is there because he told people to do things that made them very sick and sad. These things were not good for anyone. It's very important to always listen to what trusted grown-ups tell you.\n\nEven though he was in prison, Paul Mackenzie tried to tell more people to do these unsafe things. He wrote notes and sent messages. This is why it's super important for us to talk about always checking if someone's words are safe and true.\n\nOur grown-up helpers, like the police, found out about this. They are making sure that no one else gets hurt. They are doing a very important job to protect everyone.\n\n<h3>Did You Know?</h3>\nDid you know that Kenya is home to the Great Migration? Millions of wildebeest and zebras travel across the land in search of food and water. It's one of the biggest animal movements on Earth! Just like animals follow safe paths, we should follow safe rules.\n\nDid you know that the word \"safari\" comes from a Swahili word that means \"journey\"? When you go on a journey, you need to be prepared and safe!\n\n<h3>Who Are Your Trusted Grown-Ups?</h3>\nThis is the most important part, super kids! You have many trusted grown-ups around you. Who are they?\nThey are your mummy and daddy.\nThey are your grandmas and grandpas.\nThey are your teachers at school.\nThey are your aunts and uncles, and other family members who care for you.\nThese grown-ups love you very, very much. They want you to be healthy, happy, and safe every single day.\n\n<h3>Why Should We Listen to Trusted Grown-Ups?</h3>\nTrusted grown-ups know a lot about the world. They know what is safe and what is not safe. They teach you good things, like how to cross the road, how to eat healthy food, and how to be kind to others.\n\nIf someone, even another grown-up you don't know very well, tells you to do something that feels strange, scary, or unsafe, what should you do? Tell your trusted grown-up right away! Don't keep it a secret.\n\nYour trusted grown-ups will always listen to you. They will help you understand what is safe and what is not. They are like your superheroes, always there to protect you.\n\n<h3>Making Smart Choices Every Day</h3>\nEvery day, you make many choices.\nShould I eat my vegetables? Yes! That's a smart choice for your body.\nShould I run into the street? No! That's an unsafe choice.\nShould I listen to my teacher? Yes! That's a smart choice for learning.\n\nSometimes, people might tell you to do things that seem fun but are actually dangerous. Or they might tell you to stop eating or going to school. These are not good choices. Going to school helps you learn and grow strong and smart! Eating good food keeps your body healthy.\n\n<h3>Did You Know?</h3>\nDid you know that telling a trusted grown-up about something that worries you is a very brave thing to do? Being brave means doing the right thing even when it's a bit scary.\n\nDid you know that many schools in Africa teach children how to stay safe from different dangers? Learning about safety is just as important as learning your ABCs and 123s!\n\n<h3>Working Together for a Safe Community</h3>\nIn Africa, we have wonderful communities. People help each other. Neighbors look out for each other. Families support each other. This is how we build a strong and safe place for everyone to live.\n\nWhen bad things happen, like what Paul Mackenzie did, it reminds us that we all need to work together. We need to teach each other about safety. We need to be kind and look out for our friends and family.\n\nIf you ever feel worried about something, or if someone tells you to do something that makes you feel uneasy, remember to talk to your trusted grown-ups. They are there to help you sort it out and keep you safe.\n\n<h3>Let's Look to a Bright Future!</h3>\nYou, the children of Africa, are the future! You are bright, curious, and full of joy. By always listening to your trusted grown-ups and making smart choices, you are helping to build a wonderful and safe world for everyone.\n\nRemember to play safely, learn happily, and always, always talk to your mummy, daddy, teachers, or other trusted grown-ups if something doesn't feel right. We are all here to make sure you grow up strong, smart, and safe! Keep shining bright, super kids!",
    "summary": "Children in Africa are reminded to always listen to trusted adults and make safe choices, following news about a man in Kenya who told people to do unsafe things.",
    "whyMatters": "This news teaches us that listening to trusted grown-ups like parents and teachers is very important to stay safe and healthy, and to make good choices every day.",
    "category": "world",
    "date": "2026-01-27T09:29:20.316Z",
    "image": "https://image.pollinations.ai/prompt/News%20for%20Kids%3A%20Stay%20Safe%2C%20Listen%20to%20Grown-Ups!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-for-kids-stay-safe-listen-to-grown-ups",
    "originalLink": "https://www.bbc.com/news/articles/c98jk0rrwpko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army threat to 'spare no-one' condemned",
    "title": "South Sudan army threat to 'spare no-one' condemned",
    "content": "The UN mission says it is gravely concerned by \"inflammatory rhetoric calling for violence against civilians\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-27T09:29:46.818Z",
    "image": "https://image.pollinations.ai/prompt/South%20Sudan%20army%20threat%20to%20'spare%20no-one'%20condemned%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-sudan-army-threat-to-spare-no-one-condemned",
    "originalLink": "https://www.bbc.com/news/articles/c79rjjr481zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "India, EU agree on ‘mother of all’ trade deals",
    "title": "Two Big Friends Make a Big Plan to Share!",
    "content": "<h3>Hello from Africa!</h3>\nHi friends! It’s me, your news reporter, bringing you exciting stories from around our big, beautiful continent and beyond! Today, we have some super big news that happened far away, but it's important for everyone, everywhere. Imagine two really big friends deciding to play together even better. That’s kind of what happened! This is a story about India and Europe. They made a very special agreement to share and swap things more easily. Isn't that cool? Let's find out more about this super exciting news!\n\n<h3>What is this Big Deal About?</h3>\nSo, what is this big deal all about? Well, it's like when you and your friend decide to share your toys and snacks more easily. You don't have to jump through hoops or pay extra just to share! This big deal is called a \"trade deal.\" It means India and a group of countries in Europe have agreed to buy and sell things from each other more easily. They want to make it super simple for things like clothes, toys, food, and even services to travel between them.\n\nDid you know? \"Trade\" is just a fancy word for buying and selling things! When you buy bread from the shop, you are trading money for bread!\n\n<h3>Who are India and Europe?</h3>\nLet's meet our big friends! First, there's India. India is a very, very big country in Asia. It has lots of people, beautiful clothes, yummy spices, and amazing movies! Think of it as a place with a rainbow of colours and sounds.\n\nThen there's Europe. Europe is not one country, but a group of many countries that are neighbours. They have different languages, famous castles, and lots of history. Together, these countries are called the European Union, or EU for short. So, it's India and the EU making this big plan!\n\nDid you know? India is home to over a billion people! That's more than 1,000,000,000 people! And the EU has many countries like France, Germany, Italy, and Spain.\n\n<h3>What is 'Trading' Anyway?</h3>\nImagine you have a yummy mango, and your friend has a cool toy car. You might want to swap your mango for a turn with the toy car, right? That's a simple trade! Countries do the same thing, but on a much, much bigger scale.\n\nCountries might make lots of certain things, like cars or phones. And other countries might grow lots of food, like maize or rice. When they trade, they can get the things they need but don't make themselves. It helps everyone get more choices and sometimes even better prices. It's like sharing your special talents and things with others!\n\nDid you know? People have been trading things for thousands and thousands of years! Even before money was invented, people swapped shells, salt, or tools for what they needed.\n\n<h3>Making Things Easier to Trade</h3>\nThis big deal means they want to create something called a \"free trade zone.\" What does that mean? Imagine a special playground where all your friends can play without any big fences or extra rules to get in. Things just flow smoothly.\n\nUsually, when something travels from one country to another to be sold, there might be extra money you have to pay. We call these \"taxes\" or \"tariffs.\" It's like paying a small fee just to bring something across a line. This deal wants to make those fees much smaller, or even get rid of them! This makes it cheaper and easier for things to move between India and Europe.\n\nDid you know? When things are cheaper to move, sometimes the things you buy in the shops can also become a little bit cheaper for everyone!\n\n<h3>Why is this Deal So Big?</h3>\nThis isn't just any small deal; it's a super important one! The news said it's like the \"mother of all trade deals.\" That means it's one of the biggest and most important agreements ever made for trading. Why is it so big?\n\nFirst, it covers a huge amount of money that countries make. They say it covers \"a quarter of the global GDP.\" That sounds like a big grown-up word, doesn't it? \"GDP\" is just a way to measure all the money a country makes by selling things and doing services in a year. Imagine if all the money made in the world was a giant cake. This deal is about one big slice of that cake – a quarter of it! That's a lot of things being made and sold!\n\nSecond, it involves so many people! The deal will make it easier for two billion people to trade things. Can you imagine two billion people? That's a lot of families, a lot of children, a lot of mums and dads! It means more choices and chances for people in India and Europe.\n\nDid you know? Two billion is a number so big, it's hard to count! If you counted one number every second, it would take you about 63 years to count to two billion! That's why this deal is so, so big!\n\n<h3>What Does This Mean for Kids?</h3>\nYou might be thinking, \"What does this big deal mean for me, a kid in Africa?\" That's a great question! Even though this deal is between India and Europe, it can still touch our lives in small ways.\n\nWhen big countries like India and those in Europe trade more easily, it can help the whole world's economy. Sometimes, things that are made in India or Europe might come to our shops here in Africa. Maybe your favourite toy, or a type of food, or clothes could come from these places. If it's easier and cheaper for them to trade, it might also help make things a little more affordable or give us more choices in the future. It's like when everyone in a big family is doing well, it helps the whole family!\n\nDid you know? Many of the clothes you wear, or toys you play with, might have travelled a very long way across the oceans to get to you!\n\n<h3>Big News for Our World!</h3>\nSo, there you have it! India and the European Union have shaken hands on a super big deal. It's about making it easier to share, buy, and sell things across the world. This is great news because when countries work together and trade easily, it can help make the world a better, more connected place. It shows that even faraway places can become closer friends through good agreements. And that's something to cheer about! Yay for teamwork and sharing!",
    "summary": "India and a group of European countries called the EU have agreed to a super big plan to make it easier to buy and sell things between them, which is good for many people around the world.",
    "whyMatters": "This deal is important because it makes it easier and possibly cheaper for many countries to get the things they need, helping people everywhere have more choices and chances to buy and sell things.",
    "category": "world",
    "date": "2026-01-27T09:30:15.006Z",
    "image": "https://image.pollinations.ai/prompt/Two%20Big%20Friends%20Make%20a%20Big%20Plan%20to%20Share!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-big-friends-make-a-big-plan-to-share",
    "originalLink": "https://www.aljazeera.com/news/2026/1/27/india-eu-agree-on-mother-of-all-trade-deals?traffic_source=rss"
  },
  {
    "originalTitle": "China’s Xi Jinping signals deeper ties with Finland during PM’s visit",
    "title": "Jambo, Friends! China and Finland Are Making New Pals!",
    "content": "Jambo, amazing kids of Africa! Your friendly news reporter here, bringing you super exciting news from faraway lands! Today, we're going to learn about two countries that are becoming even better friends. It's like when you make a new friend at school, but on a much bigger scale! These countries are China and Finland. Both are very important places, far across the big oceans.\n\n<h3>Friends From Far Away!</h3>\nImagine a big, big world map. If you look very carefully, you'll see China. It's a huge country in a part of the world called Asia. China has so many people, more than any other country! And then, if you travel very far north, you'll find Finland. It's a beautiful country in Europe, famous for its cold winters, lovely forests, and maybe even Santa Claus!\n\nThese two countries, China and Finland, are making their friendship even stronger. It’s like when you and your best friend decide to play together even more, or help each other with your homework. This kind of friendship between countries is very important for everyone in the world, including us here in Africa.\n\n<h3>Who is President Xi?</h3>\nIn China, the leader is called President Xi Jinping. He is a very important man who helps guide his country, just like a head teacher guides a school. President Xi met with a very important person from Finland. They had a friendly chat about how their countries can work together even more.\n\nDid you know? China is famous for many amazing things! They have giant pandas, which are super cute bears that love to eat bamboo. They also built the Great Wall of China, which is so long you can see it from space! It's one of the oldest and longest walls in the whole world.\n\n<h3>Who is the Finnish Prime Minister?</h3>\nThe important person President Xi met was the Prime Minister of Finland. A Prime Minister is also a leader of a country, like a captain of a big ship. This meeting was very special because it shows that both countries want to be good partners and help each other.\n\nDid you know? Finland is sometimes called the 'Land of a Thousand Lakes' because it has so many beautiful lakes! It's also known for being a very peaceful and happy place. And guess what? Many people believe that Santa Claus lives in Lapland, which is a region in Finland! How cool is that?\n\n<h3>What Does 'Deeper Ties' Mean?</h3>\nWhen we say countries are making 'deeper ties,' it means they want to be better friends and partners. It’s not just about leaders shaking hands. It means that people from China and people from Finland will find more ways to work together, learn from each other, and even sell things to each other. \n\nThink about it like this: If your friend has a yummy snack and you have a cool toy, you might share them, right? Countries do something similar! They share ideas, knowledge, and things that their businesses make. This helps everyone grow and become stronger.\n\n<h3>Businesses are Like Fish!</h3>\nPresident Xi told the Finnish Prime Minister something very interesting. He said that businesses from Finland are welcome to 'swim freely' in China's 'vast market.' Now, what does that mean?\n\nImagine a tiny fish in a tiny pond. It can swim around, but it doesn't have much space. Now, imagine a big, beautiful fish swimming in a giant, endless ocean! That's what President Xi meant.\n\nFinnish businesses are like those fish. They make amazing things in Finland, like special paper, cool technology, and beautiful designs. China's 'market' is like that giant ocean. A market is a place where people buy and sell things. And because China has so many, many people (remember, it's the biggest country by population!), its market is indeed 'vast' – super, super big!\n\nSo, when President Xi said Finnish businesses can 'swim freely,' he meant that they are very welcome to sell their wonderful products to all the people in China. They can do business easily and without trouble, just like a fish swims freely in a big ocean. This is great news for both countries!\n\n<h3>Why is This Important for Everyone?</h3>\nWhen countries become better friends and trade with each other, lots of good things happen. \n\n*   **For Finland:** Their businesses can sell more things, which means they can grow bigger, make more jobs for people, and earn more money to make even better products. \n*   **For China:** Chinese people get to buy new and different things from Finland. It also helps China learn new ideas and ways of doing things from Finland.\n\nThis kind of friendship and cooperation also helps to make the world a more peaceful place. When countries work together, they understand each other better, and there's less chance of disagreements. It's like when friends play together, they usually have a good time and don't argue!\n\nAnd for us in Africa, it's also important to see countries being friendly. We too have many friends all around the world, and we trade with them. Learning about other countries and how they work together helps us understand our big, beautiful world a little bit better.\n\nSo, there you have it! China and Finland are making their friendship even stronger, and it’s a good example of how countries can help each other grow. Isn't that wonderful? Keep exploring and learning, my friends!",
    "summary": "China's leader, President Xi Jinping, told Finland's Prime Minister that Finnish companies are welcome to easily sell their products in China's very big market, strengthening the friendship between the two countries.",
    "whyMatters": "This is important because when big countries like China and Finland become better friends and help each other's businesses, they grow stronger together, create new things, and it helps make the whole world a friendlier and more peaceful place for everyone.",
    "category": "world",
    "date": "2026-01-27T09:30:49.013Z",
    "image": "https://image.pollinations.ai/prompt/Jambo%2C%20Friends!%20China%20and%20Finland%20Are%20Making%20New%20Pals!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "jambo-friends-china-and-finland-are-making-new-pals",
    "originalLink": "https://www.aljazeera.com/news/2026/1/27/chinas-xi-jinping-signals-deeper-ties-with-finland-during-pms?traffic_source=rss"
  },
  {
    "originalTitle": "Minnesota candidate bows out over Republican response to Pretti shooting",
    "title": "A Leader Steps Down: Why One Man Changed His Mind!",
    "content": "<h3>Hello, Super Star Listeners!</h3>\n\nHello, my amazing friends from across Africa! It's your kid-friendly news reporter here, ready to share a story from far, far away, in a place called Minnesota. It’s a place that has many people, just like our big, beautiful countries. Today, we're talking about a man who wanted to be a very important leader, but then decided to stop trying. It's a story about making big choices and thinking about what's fair and kind.\n\n\n<h3>Who is This Special Man?</h3>\n\nImagine your school has a head teacher, someone who helps make sure everything runs smoothly and everyone is happy. Well, in a big place like a 'state' (which is like a giant region in a country), they have a leader called a 'governor'. This governor is like the head teacher for the whole state! They help make big decisions to keep everyone safe and make sure things are working well.\n\nThere was a man who wanted to be this special governor. He was called a 'candidate', which just means he was trying to get the job. He belonged to a team of helpers called the 'Republicans'. In many countries, people who want to be leaders often join different teams, like sports teams, but these teams have different ideas about how to make things better.\n\n\n<h3>Did You Know?</h3>\n\nDid you know that in many countries, people vote to choose their leaders? It's like choosing who will be the captain of your football team, but for a whole country or a big part of it! Every grown-up gets a chance to pick who they think will do the best job.\n\n\n<h3>A Big Surprise: He Stepped Down!</h3>\n\nOne day, this man made a very big decision. He said, \"I don't want to try to be the governor anymore.\" He decided to 'step aside' or 'bow out'. It was a surprise for many people because he was working hard to get the job. Why would someone stop trying for such an important role? This is where our story gets really interesting and shows us about being kind and fair.\n\n\n<h3>Why Did He Change His Mind?</h3>\n\nThis man explained why he stopped. He said that his team, the Republicans, had done some things that caused 'negative impact'. What does 'negative impact' mean? It means their actions made some people feel sad, or scared, or caused problems for them. Imagine if a rule at school made some children feel left out or worried. That would be a negative impact.\n\n\n<h3>What Was the 'ICE Operation'?</h3>\n\nThe specific thing he talked about was something called an 'ICE operation'. ICE stands for 'Immigration and Customs Enforcement'. It's a group of people who work for the government. Their job is to make sure people who come to live in the country follow all the rules, like having the right papers. Imagine your home has rules about who can come in and stay. These helpers make sure those rules are followed.\n\nBut sometimes, when these helpers do their job, it can be very difficult for families. For example, some families might be separated, or people might feel scared if they are new to the country. The man felt that his team's way of dealing with these ICE operations had caused too many problems and sadness for people.\n\n\n<h3>Did You Know?</h3>\n\nDid you know that many people move from one country to another to find new homes, jobs, or to be safe? These people are sometimes called 'immigrants'. It takes a lot of bravery to move to a new place!\n\n\n<h3>Thinking About Fairness and Kindness</h3>\n\nThe man who wanted to be governor felt very strongly that the way these operations were handled was not fair to everyone. He believed that even when trying to follow rules, it's very important to also be kind and understand how people feel. He thought that his team was not doing enough to help the people who were affected badly by these rules.\n\nHe felt that because his team was part of the problem, he couldn't ask people to vote for him anymore. He wanted to show that he really cared about people and fairness, even if it meant giving up his dream of being a governor. This is a very brave thing to do, isn't it? It shows he was thinking with his heart.\n\n\n<h3>What is a 'Party' Anyway?</h3>\n\nWe talked about his 'party' or 'team' called the Republicans. In many big countries, there are usually two or more main political parties. Think of them like different clubs in your school, each with their own ideas about how to make the school the best it can be. One club might think more playtime is best, another might think more reading time is best! These parties try to convince people that their ideas are the best for the whole country.\n\nThis man felt that his party's ideas, especially around the ICE operations, were causing too much hurt. He decided that he couldn't stand with them on this important issue and still ask people to trust him as a leader. He put people's feelings and fairness before his own big dream.\n\n\n<h3>Did You Know?</h3>\n\nDid you know that leaders need to listen to all the people in their community, not just the ones who agree with them? A good leader tries to understand everyone's problems and find solutions that help the most people.\n\n\n<h3>Why Does This Matter to Us?</h3>\n\nEven though this happened far away in Minnesota, this story teaches us some important lessons. It teaches us that leaders, just like all of us, sometimes have to make very tough decisions. It shows us that it's super important to think about how our actions, and the actions of our teams or friends, affect other people. Are we being fair? Are we being kind? Are we listening to those who are sad or scared?\n\nThis man chose to speak up for what he believed was right, even when it was hard. He decided that his team needed to do better, and if they didn't, he couldn't be a part of it. That shows great courage! It reminds us all to always try to be good friends, good neighbours, and to care for everyone around us, no matter where they come from.\n\n\n<h3>What Happens Next?</h3>\n\nWhen a candidate steps down, other people from his team might try to become the governor instead. The important thing is that the people of Minnesota will still choose someone new to be their leader, someone they believe will help everyone fairly. This story is a reminder that even grown-up leaders are always learning and trying to do what is best for their community. And sometimes, doing what is best means saying, \"I need to step back and think about how we can do things better.\"\n\nSo, my wonderful friends, remember to always be brave, always be kind, and always think about how your actions make others feel. Until next time, stay curious and keep shining brightly!",
    "summary": "A man who wanted to be a very important leader (a governor) in a place called Minnesota decided not to try anymore because he felt his team (Republicans) caused problems and sadness for people with their actions related to a group called ICE.",
    "whyMatters": "This story matters because it shows us that leaders sometimes make big, brave choices to stand up for what they believe is fair and kind, even if it means giving up their own big dreams, teaching us to always think about how our actions affect others.",
    "category": "world",
    "date": "2026-01-27T09:31:47.300Z",
    "image": "https://image.pollinations.ai/prompt/A%20Leader%20Steps%20Down%3A%20Why%20One%20Man%20Changed%20His%20Mind!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-leader-steps-down-why-one-man-changed-his-mind",
    "originalLink": "https://www.aljazeera.com/news/2026/1/27/minnesota-candidate-bows-out-over-republican-response-to-pretti-shooting?traffic_source=rss"
  },
  {
    "originalTitle": "Immigration chief at centre of Trump's crackdown set to leave Minneapolis",
    "title": "Immigration chief at centre of Trump's crackdown set to leave Minneapolis",
    "content": "The US president is sending border tsar Tom Homan to the city in an apparent shift in tone from the White House.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-27T09:32:12.404Z",
    "image": "https://image.pollinations.ai/prompt/Immigration%20chief%20at%20centre%20of%20Trump's%20crackdown%20set%20to%20leave%20Minneapolis%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "immigration-chief-at-centre-of-trumps-crackdown-set-to-leave-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/cgrdlr70qg4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We're all terrified', Minnesotan tells the BBC in tears",
    "title": "Being Safe is Important: A Story from Far Away",
    "content": "Hello, wonderful kids of Africa! It's your friendly news reporter, here to tell you a story.\n\nToday, we're going on a little trip in our minds, very far away from our sunny continent. We're going to a place called Minnesota. It's in a big country called America.\n\n<h3>A Story from Far Away in Minnesota</h3>\nImagine a place with lots of trees and sometimes even snow! That's Minnesota. People live there, just like you live in your village or town.\n\nThey go to school, play games, and have families. They are called 'residents' because they reside, or live, there.\n\nBut something has made many people in Minnesota feel very sad and scared. A kind lady named Ana Faguy, who is a news reporter, went to talk to them.\n\nShe listens to people's stories. She wants to understand how they feel. This is a very important job for a reporter.\n\nDid you know? Reporters are like storytellers! They travel to different places to find out what is happening and then share the news with everyone.\n\n<h3>Why Are People Scared?</h3>\nThe people in Minnesota are scared because of something called a \"shooting.\" When we say \"shooting,\" it means a gun was used.\n\nGuns can be very dangerous. Sometimes, when a gun is used, someone gets hurt. Sadly, in this story, people got hurt very badly.\n\nSome even died. When someone dies because of a gun, it's called a 'fatal shooting.' This is very sad news, isn't it?\n\nIt happened two times. Imagine if something scary happened in your village once. Then it happened again. You would feel very worried, wouldn't you?\n\nThat's how the people in Minnesota are feeling. They told the reporter, \"We're all terrified.\"\n\n<h3>What Does 'Terrified' Mean?</h3>\n\"Terrified\" is a big word for being super, super scared. It's like when you hear a very loud thunderclap, and you jump.\n\nOr when you think there's a monster under your bed! When you are terrified, your heart might beat fast. Your tummy might feel funny.\n\nIt's a very strong feeling of fear. The people in Minnesota feel terrified because they don't feel safe anymore. They are worried about what might happen next.\n\nDid you know? It's okay to feel scared sometimes. Everyone feels scared. It's important to talk to a grown-up you trust when you feel scared.\n\n<h3>Who Are Immigration Officers?</h3>\nThis scary thing happened because of people called \"federal immigration officers.\" That's a very long name, so let's make it simple!\n\nImagine there are special helpers who work for the government of a country. Their job is to help decide who can live in that country.\n\nThey have rules to follow. These rules are about people who come from other countries to live there.\n\nSometimes, these officers have very important and serious jobs. They are supposed to help keep everyone safe and follow the rules.\n\nBut in this story, something went wrong. And people got hurt. This made many people very upset and scared.\n\n<h3>What Do People Want?</h3>\nWhen reporter Ana Faguy talked to the people, they told her what they want. They want to feel safe again.\n\nThey want to know why these sad things happened. They want to make sure it doesn't happen a third time.\n\nEvery person, no matter where they live, wants to feel safe in their home and in their community.\n\nDid you know? The United States of America, where Minnesota is, is a very big country with many different states, just like Africa has many different countries! Every state has its own rules, too.\n\n<h3>Why is Feeling Safe Important?</h3>\nFeeling safe helps you be happy. When you feel safe, you can play, learn, and sleep well.\n\nWhen you don't feel safe, it's hard to do those things. You might always be worried. You might not feel peaceful.\n\nThat's why the people in Minnesota are speaking out. They want to tell everyone that safety is very important.\n\nThey want the grown-ups who make the rules to listen to them. They want things to change so no one else gets hurt.\n\nDid you know? Communities are like big families. Everyone helps each other. When something bad happens, it affects everyone in the community because they all live close by and care for each other.\n\n<h3>What Happens Next?</h3>\nNow, many people are talking about this. Reporters like Ana Faguy help by telling their stories.\n\nWhen stories are told, people listen. And when people listen, they can try to find solutions and make things better.\n\nWe hope that the people in Minnesota will soon feel safe again. We hope that everyone will work together to make sure sad things like this don't happen.\n\n<h3>Let's Remember to Be Kind</h3>\nEven though this story is sad, it reminds us of something important. We must always try to be kind to each other.\n\nWe must try to understand each other. And we must always work to make sure everyone feels safe and loved.\n\nThis is a lesson we can all learn, whether we live in Africa or far away in Minnesota. Let's send our good thoughts to the people in Minnesota.\n\nWe hope for peace and safety for everyone, everywhere. Thank you for listening, kids! See you next time for more news from around the world.",
    "summary": "A kind reporter talked to people in a faraway place called Minnesota who are feeling very scared because something sad happened with guns two times.",
    "whyMatters": "It is important for everyone, everywhere, to feel safe in their homes and communities, and for grown-ups to listen when people are scared and help them.",
    "category": "world",
    "date": "2026-01-27T09:32:38.278Z",
    "image": "https://image.pollinations.ai/prompt/Being%20Safe%20is%20Important%3A%20A%20Story%20from%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "being-safe-is-important-a-story-from-far-away",
    "originalLink": "https://www.bbc.com/news/videos/crkr1g5vnveo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "India and EU announce landmark trade deal",
    "title": "Friends Across the World Make a Super Special Promise!",
    "content": "<h3>Hello, Super Reporters!</h3>\n\nHello, amazing friends in Africa! Guess what? We have some very, very exciting news to share with you today! Imagine two big, big friends from far away lands shaking hands and making a super special promise. That's what happened with a wonderful country called India and a big group of countries called the European Union! It’s like two big teams deciding to play nicely together.\n\n<h3>What is a Super Special Promise (a Trade Deal)?</h3>\n\nSometimes, grown-ups make special promises. These promises are called 'deals'. Imagine you have a yummy apple, and your friend has a cool toy car. You might say, 'I'll give you half my apple if I can play with your car!' That's a tiny deal! India and the European Union (EU) just made a giant deal like that. It's called a 'trade deal'. 'Trade' means buying and selling things, or swapping things, just like you might swap stickers with a friend at school. They decided to make it easier to share their treasures with each other.\n\n<h3>Who is India?</h3>\n\nIndia is a super big country, very far away from us, across the ocean! It has so many people, more than you can count! India is famous for many wonderful things. They have beautiful, colourful clothes, yummy spicy food that smells amazing, and amazing movies with lots of singing and dancing, called Bollywood! They also have magnificent elephants and brave tigers!\n\nDid you know? India is the home of the Bengal tiger, a very big and beautiful striped cat that loves to live in the jungle!\n\n<h3>Who is the European Union (EU)?</h3>\n\nNow, let's talk about the European Union, or EU for short. The EU is not just one country. It's like a special club or a big team made up of many, many countries in Europe! Think of it like a bunch of friends who decided to work together and help each other. Countries like France, Germany, Italy, and Spain are all part of the EU. They have old castles, delicious chocolate, cool inventions, and lots of different languages!\n\nDid you know? The EU has 27 countries working together, like a super big team that shares ideas and helps each other's people!\n\n<h3>Why Did They Make This Special Promise?</h3>\n\nSo, why did these two big friends, India and the EU, make this special promise, this 'trade deal'? It's simple! When friends work together, good things happen. They want to share things, help each other grow stronger, and make life better and happier for everyone. It’s about building a better future where everyone can learn and thrive.\n\nImagine if you and your friend decide to share your snacks. You both get to try something new and yummy! This deal is a bit like that, but on a much bigger scale with countries. They want to share the good things they have, like yummy foods, cool toys, and smart ideas!\n\n<h3>What Will They Share?</h3>\n\nWith this deal, India and the EU will share many, many things! From India, we might see even more of their beautiful clothes, like colourful scarves and dresses made with special patterns. We might also get more of their delicious spices that make food taste so good, like curry powder for yummy meals! And maybe even some cool hand-made toys or crafts that tell stories.\n\nFrom the EU, India might get amazing new machines that help build roads or make computers work even faster. They might get delicious chocolates and different kinds of cheeses. Or maybe even some fantastic storybooks and games that teach new things! It's like a big swap meet between two giant friends, bringing wonderful new items to each other's homes.\n\n<h3>Making Things Cheaper and Easier</h3>\n\nWhen countries make a trade deal, it can sometimes mean that the things they share become a little bit cheaper. Why? Because it's easier to send things from one place to another without too many rules or extra payments. If it's easier and cheaper to get a toy or a special food from far away, then more people can buy it! This means more fun, more delicious food, and more amazing things for everyone to enjoy.\n\nDid you know? Shipping things across the ocean happens on giant boats that are bigger than many houses, carrying thousands of toys, clothes, and foods!\n\n<h3>More Jobs for Grown-ups!</h3>\n\nAnother super important reason for this deal is that it helps create more jobs! When India sends more clothes to the EU, more grown-ups in India are needed to make those clothes. They get to work and use their skills! When the EU sends more machines to India, more grown-ups are needed to build and operate those machines. More jobs mean that more grown-ups can earn money to take care of their families and buy good things, like food and clothes and even school supplies for kids like you! It makes communities stronger and happier.\n\n<h3>Learning New Things Together</h3>\n\nWhen friends share, they also learn from each other. India and the EU will not just share things, but also ideas! They can teach each other how to make new things even better, how to protect our beautiful Earth from pollution, or even how to build faster, safer trains that run on clean energy. It’s like when you learn a new game from a friend, and now you both have more fun and know more things!\n\nDid you know? Sometimes, countries share ideas about how to make our planet cleaner and healthier for everyone, even for the animals!\n\n<h3>How Does This Help Us in Africa?</h3>\n\nNow, you might be thinking, 'That's great for India and the EU, but how does it help me in Africa?' Well, when big parts of the world become better friends and stronger, it helps everyone! When India and the EU are doing well and working together, it helps make the whole world a happier and safer place because there is more peace and more sharing.\n\nAlso, Africa trades with India and the EU too! So, when they are strong and happy, it can make it easier for *us* to trade with them, which means more good things for us too. It’s like when your big brother or sister does well, it sometimes makes things better for the whole family! Everyone benefits when there's more friendship and sharing.\n\n<h3>A Brighter Future Together!</h3>\n\nSo, this special promise between India and the European Union is a really, really good thing! It means more sharing, more helping, more learning, and a brighter future for everyone across the whole world. It shows that when countries work together as friends, amazing things can happen across our big, beautiful world! Hooray for friendship and sharing!\n\nDid you know? Having friends around the world helps everyone understand each other better, respect different cultures, and live in peace, making our world a wonderful place for all of us!\n\nWe hope you enjoyed this exciting news, and remember, being a good friend is always a super idea, whether you're sharing a toy or making a big deal with another country! See you next time, Super Reporters!",
    "summary": "India and a big group of countries called the European Union made a special promise called a trade deal to share many good things and help each other grow.",
    "whyMatters": "This deal is important because it means India and the EU will share more yummy food, cool toys, and smart ideas, making things cheaper, creating more jobs for grown-ups, helping everyone learn new things, and making the world a friendlier place.",
    "category": "world",
    "date": "2026-01-27T09:33:08.203Z",
    "image": "https://image.pollinations.ai/prompt/Friends%20Across%20the%20World%20Make%20a%20Super%20Special%20Promise!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-across-the-world-make-a-super-special-promise",
    "originalLink": "https://www.bbc.com/news/articles/crrnee01r9jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How 'Premier League' Galatasaray can derail Man City",
    "title": "Big Soccer Game Fun: Galatasaray vs. Manchester City!",
    "content": "Hello, hello, my amazing soccer stars and future champions all across Africa! Are you ready for some super exciting news from the world of football? It's all about a really, really big game that will have lots of people cheering and jumping up and down! We are talking about two fantastic teams, Galatasaray and Manchester City, getting ready to play a super important match. It's like a big challenge between two very strong lion teams on the football field!\n\n<h3>What is Football?</h3>\nFirst, let's talk about football! Did you know that football is the most popular sport in the whole wide world? We also call it soccer sometimes! It's a game where two teams, usually with eleven players each, try to kick a round ball into the other team's net. This net is called a goal! The team that scores more goals wins the game. It's all about running super fast, kicking the ball with your feet, passing to your teammates, and working together like a big family. It's so much fun to play and to watch!\n\n<h3>Meet Manchester City!</h3>\nOne of the awesome teams playing in this big game is called Manchester City. Wow, that's a mouthful! They are from a country very, very far away called England. Imagine a big, busy city with lots of tall buildings and friendly people, that's where they come from. Manchester City is a very, very famous and strong football team. They have amazing players who can kick the ball super hard and score fantastic goals. When they play, they usually wear bright blue shirts, like the colour of a clear sky on a sunny day!\n\nDid you know? Manchester City's home ground, where they play many of their games, is called the Etihad Stadium! It's a giant place that can hold thousands and thousands of cheering fans! It's bigger than many schools combined!\n\n<h3>Meet Galatasaray!</h3>\nNow, let's meet the other brave team! Their name is Galatasaray (say: Gah-lah-tah-sigh-ray). They come from another beautiful country called Turkey. Turkey is also very far away, across some big oceans! Galatasaray is also a very, very strong football team, just like Manchester City. They have wonderful players who are very fast and clever with the ball. Their team colours are bright red and sunny yellow, just like a beautiful African sunset or a yummy mango! Galatasaray has many, many loyal fans who sing and cheer louder than a whole choir for their team!\n\nDid you know? Galatasaray's fans are known all over the world for being incredibly passionate and making a lot of noise to support their team! They love their club so much!\n\n<h3>What is the Champions League?</h3>\nThis game is not just any game; it's part of something super, super important called the Champions League! Imagine all the very best football teams from different countries in Europe, all coming together to play against each other. It's like a super big tournament, where only the strongest and most skilled teams get to join. Every team dreams of winning the Champions League trophy because it means they are truly the champions of Europe! It's like winning the biggest, most shiny medal for football!\n\nDid you know? The Champions League trophy is one of the most famous trophies in the world of sports. It's big and shiny, with two large handles, which some people say look like big ears! It's often called 'Ol' Big Ears'!\n\n<h3>Why is This Game So Special?</h3>\nNow, let's talk about why this game between Manchester City and Galatasaray is super, super special and why everyone is so excited! For Galatasaray, this game is incredibly important to 'keep their Champions League journey on track.' What does that mean? It means they need to get a 'positive result.' A positive result means they need to either win the game or draw (which means the score is equal, like 1 goal for each team). If they win or draw, they have a better chance to keep playing in the Champions League and move to the next stage. If they lose, it might be very hard for them to continue in the competition. They really, really want to stay in the race to become champions!\n\nFor Manchester City, this is one of their big games in this part of the competition. They are already a very strong team, but they don't want to lose either! They want to show everyone how powerful they are and finish this part of the Champions League in the best way possible. They know Galatasaray is a tough team, and it's like two mighty warriors meeting for a big, friendly, but very competitive fight!\n\n<h3>What Could Happen?</h3>\nIn football, anything can happen, and that's what makes it so thrilling! Here are some things that could happen:\n*   **Galatasaray could win!** If they play their very best, score more goals than Manchester City, and surprise everyone, they will be so happy! This would be a fantastic 'positive result' for them and help them stay in the Champions League.\n*   **Manchester City could win!** If they are too strong and score more goals, they will celebrate loudly! They are a top team and always aim to win.\n*   **It could be a draw!** This means both teams score the same number of goals, like 1-1 or 2-2. Nobody wins, but nobody loses! For Galatasaray, even a draw would be a good result to help them keep their Champions League dream alive!\n\nDid you know? Sometimes, a team that everyone thinks will win actually loses, and a team that nobody expects to win plays an amazing game and surprises everyone! That's why we love football so much – it's full of surprises!\n\n<h3>The Big Day of the Game!</h3>\nThis game is going to be full of energy and excitement! There will be lots of running, clever passing, strong kicking, and maybe even some incredible goals that make everyone cheer! Both teams will try their very, very best. The players have been training super hard, just like you practice your favourite games or prepare for a big test at school. They want to make their coaches and their many fans around the world very proud and happy.\n\nSo, my wonderful young soccer friends, keep your ears and eyes open for news about this super, super game! It's a really big challenge for both Galatasaray and Manchester City. Who do you think will win? Will Galatasaray get their 'positive result' and stay in the Champions League? We will have to wait and watch! Remember, football is all about fun, teamwork, trying your hardest, and celebrating great moves. And no matter who wins, it's always a joy to watch amazing players chase the ball! Goooooooooooooal!",
    "summary": "Two strong football teams, Galatasaray from Turkey and Manchester City from England, are playing a very important Champions League game where Galatasaray needs a good result to keep playing in the competition.",
    "whyMatters": "This game matters because it will help decide if Galatasaray can continue their exciting journey to try and become the champions of Europe, which is a very big deal for any football team!",
    "category": "sports",
    "date": "2026-01-27T09:33:40.180Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Soccer%20Game%20Fun%3A%20Galatasaray%20vs.%20Manchester%20City!%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-soccer-game-fun-galatasaray-vs-manchester-city",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn56lp5yrwvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bayern Munich open talks to extend Kane contract",
    "title": "Bayern Munich open talks to extend Kane contract",
    "content": "Bayern Munich sporting director Max Eberl says the German club are in talks with Harry Kane about extending the striker's contract.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-27T09:33:45.329Z",
    "image": "https://image.pollinations.ai/prompt/Bayern%20Munich%20open%20talks%20to%20extend%20Kane%20contract%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bayern-munich-open-talks-to-extend-kane-contract",
    "originalLink": "https://www.bbc.com/sport/football/articles/cm245j0ldn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Barca president unhappy at teen's 'unpleasant' PSG move",
    "title": "Barca president unhappy at teen's 'unpleasant' PSG move",
    "content": "PSG sign 18-year-old Barcelona midfielder Dro Fernandez, with the Spanish side's president calling the situation around the transfer \"unpleasant\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-27T09:33:50.508Z",
    "image": "https://image.pollinations.ai/prompt/Barca%20president%20unhappy%20at%20teen's%20'unpleasant'%20PSG%20move%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "barca-president-unhappy-at-teens-unpleasant-psg-move",
    "originalLink": "https://www.bbc.com/sport/football/articles/cyv52393236o?at_medium=RSS&at_campaign=rss"
  }
]