[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Our Brave Twins Go Back to School!",
    "content": "Hello, my amazing friends all across Africa and the world! It's your friend, Reporter Zara, here with some very special news today. Get ready to hear about two super brave girls who remind us all how important school is for every child!\n\n<h3>Meet Ami and Ayo, Our Super Twins!</h3>\nIn a place far, far away, but still in our big, beautiful continent of Africa, live two wonderful girls. Their names are Ami and Ayo. Guess what? They are twins! That means they were born on the very same day, and they look a lot alike. Can you imagine having a sister who looks just like you? They are best friends and always stick together, sharing secrets and sunny smiles.\n\nDid you know? Twins are like having a built-in best friend from day one! There are many twins in Africa and all over the world, bringing extra joy to families. Sometimes twins even have their own secret language!\n\n<h3>Their Happy School Days</h3>\nAmi and Ayo absolutely loved going to school. Just like you, they loved to learn new things every single day! Their school was a truly happy place, filled with the sound of children's laughter and friendly chatter. They had kind teachers who taught them how to read exciting stories, how to write their names and special messages, and how to count all the way to big numbers. During break time, they would play fun games like 'tag' or 'hide-and-seek' with all their friends, running around and making loud laughs.\n\nSchool is where you learn new things that help you grow big and smart! It's like a magical garden where your brain gets stronger with every seed of knowledge planted. You learn about animals that live in our beautiful Africa, about the big, wide world, and about how to be a good friend to everyone.\n\nDid you know? Learning to read can open up a whole new world of adventures for you! When you read, you can travel to faraway lands, meet amazing characters, and discover incredible facts without even leaving your chair!\n\n<h3>When Trouble Came Calling</h3>\nOne day, something very, very sad and scary happened in their village. There was a lot of trouble, and loud noises that made everyone hide. These scary times meant that their happy school had to close its doors. It was a very difficult time for everyone in their community. Many families were sad, and the children felt very scared. Sadly, some of Ami and Ayo's classmates, their happy friends they played with every day, were not there anymore because of the trouble.\n\nAmi and Ayo were very, very heartbroken and sad. It was like a big, dark cloud came over their lovely school and their village. Imagine not being able to play with your best friends or learn with them anymore. That's how Ami and Ayo felt every day. They missed their friends and the happy school times so much.\n\nSimple explanation: Sometimes, grown-ups have big, difficult fights, and this is sometimes called a war. Wars make things very, very hard and dangerous for everyone, especially for children. It often stops them from going to school and playing safely outside.\n\n<h3>Why School Had to Wait</h3>\nBecause of all this big trouble and the scary noises, it was not safe for any children to go to school. The school buildings were damaged, and everyone was worried. So, Ami and Ayo couldn't go to their classrooms for a very long time. It felt like forever to them, like the school doors would never open again.\n\nBut even during this super sad and scary time, Ami and Ayo never, ever forgot how much they loved learning. They remembered their kind teachers, they remembered the colorful books, and they remembered the joy of being with all their friends, even if those friends were not there anymore. They held onto the special memories of their school days.\n\n<h3>Their Brave Hearts and Big Decision</h3>\nAfter many long, quiet days, things started to get a little bit better. The scary noises stopped, and it slowly became safer in their village. Ami and Ayo looked at each other with courage in their eyes and made a very brave decision. They decided, together, that they would go back to school!\n\nEven though it was hard to walk back to a school that looked a little different, and even though they missed their friends so much, they knew they had to be strong. They knew that learning was super important, and that going to school was their chance to build a better future. Their hearts were full of both a little bit of fear and a lot of hope.\n\nDid you know? Being brave doesn't mean you're not scared at all. It means you feel scared, but you still do what's right and important anyway! Ami and Ayo are true superheroes for their bravery!\n\n<h3>Learning for Their Friends and Future</h3>\nWhen Ami and Ayo finally went back, their school felt different. Some of the desks where their friends used to sit were empty and quiet. It made them sad inside, but it also made them feel even stronger and more determined. They decided right then and there to learn not just for themselves, but for their dear friends who couldn't be there anymore.\n\nThey promised in their hearts, 'We must finish our studies. We must learn for them!' This is a very powerful and beautiful promise. It means they will work extra, extra hard to make their friends proud, and to show that love and learning can win over sadness.\n\nEvery time they opened a book, every time they solved a math problem, they were remembering their friends and honoring their memory. They knew that learning was a way to keep their friends' spirits alive and to build a brighter future for everyone.\n\nDid you know? Children who get to go to school often grow up to help their communities even more! They can become doctors, teachers, engineers, or leaders who make their homes and countries stronger.\n\n<h3>Dreams for a Bright, Happy Future</h3>\nAmi and Ayo have really big, exciting dreams, just like you! They want to finish all their schooling, go to university, and become amazing, helpful women in their country. Maybe one of them will become a kind doctor, helping people feel better and stay healthy. And maybe the other will become a wonderful teacher, helping many more children learn and chase their own big dreams!\n\nTheir dreams show us all that no matter how hard or sad things get, we should never, ever stop hoping and working hard for a better tomorrow. Their future looks bright because they are choosing to learn.\n\nDid you know? Every single child in the world, no matter where they live or what has happened, has the right to go to school and learn. It's a very important right that helps children grow up to be happy, smart, and strong members of their community and the world!\n\n<h3>What We Can Learn from Ami and Ayo</h3>\nAmi and Ayo teach us so many important and wonderful lessons. They teach us to be super brave, even when we are scared. They teach us to never, ever give up on our big dreams, no matter what challenges come our way. And most of all, they teach us to really, truly value our school, our caring teachers, and our precious friends.\n\nEven when sad and difficult things happen in life, we can always find amazing strength inside us to keep going, to keep learning, and to keep playing. We can make the world a better, happier place, just like Ami and Ayo are doing by going back to school.\n\nLet's all cheer loudly for Ami and Ayo! They are real-life superheroes with books and pencils, showing us the power of learning and hope!\n\nThank you for listening, my wonderful friends! Remember to cherish your school, your amazing teachers, and your best friends. And always remember that learning makes you strong, smart, and ready for anything! This is Reporter Zara, signing off from Africa, with news that makes our hearts glow with hope and inspiration!",
    "summary": "Brave twins Ami and Ayo, who lost friends when trouble came to their school, have shown great courage by returning to their studies, proving that learning and hope can shine even after difficult times.",
    "whyMatters": "This story matters because it shows us that even when very sad and scary things happen, children like Ami and Ayo are super brave. They remind us that school is a special and important place for every child, and that learning helps us all build a bright future and honor our friends.",
    "category": "world",
    "date": "2026-01-25T18:24:17.023Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Brave%20Twins%20Go%20Back%20to%20School!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-brave-twins-go-back-to-school",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "content": "The authorities tried to stop their export arguing they were part of the country's heritage.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:24:22.175Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20prison%20key%2C%20sunglasses%20and%20shirt%20can%20be%20sold%20after%20daughter%20wins%20court%20battle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-prison-key-sunglasses-and-shirt-can-be-sold-after-daughter-wins-court-battle",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:24:27.315Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Storm causes widespread US power outages, thousands of flights cancelled",
    "title": "Wow! A Giant Storm Hits Far-Away America!",
    "content": "Hello, my amazing friends! It's me, your super kid-friendly reporter, bringing you exciting news from all over the world! Today, we are going to talk about something big that happened very, very far away. It happened in a country called America. It was a giant storm!\n\n<h3>What is a Storm?</h3>\nDo you know what a storm is? Imagine the sky getting very dark. Then, the wind starts to blow super strong, pushing everything around. Sometimes, there is a lot of rain, or even snow and ice! A storm is like nature getting very, very busy and loud. It can be a little bit scary, but it's also a part of our amazing world.\n\n<h3>A Giant Storm in Far-Away America</h3>\nSo, in America, a huge storm came. It was so big that some people called it a \"monster storm\"! But don't worry, it wasn't a real monster. It just meant the storm was very, very powerful and covered a lot of places. It went all the way from one side of America, called Texas, to another side, called New England. That's like going from one end of a big country in Africa to another!\n\n<h3>Oh No, No Lights!</h3>\nOne of the biggest things that happened was called \"power outages.\" What does that mean? It means the electricity went off! Imagine your house suddenly becoming dark. No lights, no television, no radio! Your mum or dad can't cook with electric stoves. The fridge stops working. It's like magic lights just disappear!\n\nThousands and thousands of homes in America had no electricity because of this big storm. The strong wind blew down trees, and these trees fell on the wires that bring electricity to houses. When the wires break, the electricity stops. People had to use candles or flashlights to see.\n\nIt was very cold there, so without electricity, their heaters didn't work. They had to wear extra warm clothes and huddle together to keep warm. It’s not easy when the power is out, especially in the cold!\n\nDid you know? Electricity helps us do so many things! It lights our homes, cooks our food, and even charges our phones so we can talk to our friends and family! It's like an invisible helper that makes modern life work.\n\n<h3>Planes Can't Fly!</h3>\nAnother big problem was that many, many planes could not fly. This is called \"flights cancelled.\" Imagine you are going on a trip to see your grandparents, and suddenly, your plane can't go! That's what happened to thousands of people.\n\nWhy did planes stop flying? Because the storm made it too dangerous! There was too much wind, too much snow, and too much ice in the sky. It's like trying to ride your bicycle very fast in a super strong wind – it's just not safe.\n\nSo, to keep everyone safe, the airports said, \"No planes today!\" Many people had to wait at the airport for a long time, hoping the storm would go away so they could fly. They couldn't get to their families or their holidays.\n\nDid you know? Airplanes are like giant birds that can carry many people across the sky! They need very good weather to fly safely, so they don't get tossed around by strong winds.\n\n<h3>Stay Off the Roads!</h3>\nThe storm also made it very dangerous to drive cars. People were told to \"stay off the roads.\" This means they should not go out in their cars or buses.\n\nWhy? Because the roads became very slippery with ice and snow. Imagine walking on a floor that's covered in ice – you might slip and fall! It's the same for cars, but much more dangerous. When roads are slippery, cars can slide around and crash into each other.\n\nAlso, the strong wind could blow things onto the road, like branches from trees, making it hard to see. So, for everyone's safety, people were asked to stay at home and not travel. This helps prevent accidents and keeps people out of harm's way.\n\nDid you know? In some cold countries, special trucks put salt on the roads to melt the ice and make them safer for driving! The salt makes the ice turn into water, which is less slippery.\n\n<h3>How Do People Stay Safe?</h3>\nWhen a big storm like this happens, people need to be very careful. They listen to the news, just like you're doing now! They make sure they have warm blankets, food that doesn't need to be cooked, and flashlights in case the lights go out. Families stay together inside their homes, playing games or telling stories. It's important to keep warm and safe until the storm passes.\n\n<h3>Helpers Are Working Hard!</h3>\nEven when things are tough, there are always helpers! Brave people called engineers worked hard to fix the broken electricity wires. They climbed up tall poles to connect the wires again, even in the cold and snow. Other brave people helped clear the snow from the roads with big machines.\n\nPilots and airport staff worked to get the planes ready for when it was safe to fly again. Everyone worked together to make things better and safer for everyone. They are like real-life superheroes, helping their communities!\n\n<h3>Our Amazing World</h3>\nSo, you see, nature can be very powerful, whether it's a storm far away in America or a heavy rain here in Africa. It reminds us that our world is amazing and full of surprises. But it also teaches us to always be prepared and listen to grown-ups when they tell us how to stay safe during bad weather.\n\nI hope you learned something new today, my wonderful friends! Always be curious, and always stay safe! That's all for now from your African news friend!",
    "summary": "A very big storm hit America, making the lights go out for many people, stopping planes from flying, and making roads too dangerous to drive on, but brave helpers are working hard to make everything safe again.",
    "whyMatters": "This news helps us understand how strong nature can be and why it's important to stay safe when there is bad weather, no matter where you live in the world.",
    "category": "world",
    "date": "2026-01-25T18:24:52.601Z",
    "image": "https://image.pollinations.ai/prompt/Wow!%20A%20Giant%20Storm%20Hits%20Far-Away%20America!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wow-a-giant-storm-hits-far-away-america",
    "originalLink": "https://www.aljazeera.com/news/2026/1/25/us-storm-causes-widespread-power-outages-thousands-of-flights-cancelled?traffic_source=rss"
  },
  {
    "originalTitle": "What al-Maliki’s return would mean for Iraq and the region",
    "title": "What al-Maliki’s return would mean for Iraq and the region",
    "content": "Nouri al-Maliki's third term as prime minister is likely to escalate sectarian politics in the country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:24:57.744Z",
    "image": "https://image.pollinations.ai/prompt/What%20al-Maliki%E2%80%99s%20return%20would%20mean%20for%20Iraq%20and%20the%20region%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-al-malikis-return-would-mean-for-iraq-and-the-region",
    "originalLink": "https://www.aljazeera.com/opinions/2026/1/25/what-al-malikis-return-would-mean-for-iraq-and-the-region?traffic_source=rss"
  },
  {
    "originalTitle": "Why is Trump upending 80 years of US foreign policy?",
    "title": "Why is Trump upending 80 years of US foreign policy?",
    "content": "Former Trump official Christian Whiton argues it is about time to press ‘reset’ on US relations with the world.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:25:02.891Z",
    "image": "https://image.pollinations.ai/prompt/Why%20is%20Trump%20upending%2080%20years%20of%20US%20foreign%20policy%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-is-trump-upending-80-years-of-us-foreign-policy",
    "originalLink": "https://www.aljazeera.com/video/the-bottom-line/2026/1/25/why-is-trump-upending-80-years-of-us-foreign-policy?traffic_source=rss"
  },
  {
    "originalTitle": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "content": "He has been described as an avid outdoorsman who loved mountain biking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:25:08.521Z",
    "image": "https://image.pollinations.ai/prompt/Who%20was%20Alex%20Pretti%2C%20the%20intensive%20care%20nurse%20shot%20dead%20in%20Minneapolis%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-was-alex-pretti-the-intensive-care-nurse-shot-dead-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Captain of suspected Russian shadow tanker in French custody",
    "title": "Captain of suspected Russian shadow tanker in French custody",
    "content": "French officials seized the tanker, named the Grinch, in the Mediterranean Sea on Thursday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-25T18:25:13.658Z",
    "image": "https://image.pollinations.ai/prompt/Captain%20of%20suspected%20Russian%20shadow%20tanker%20in%20French%20custody%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "captain-of-suspected-russian-shadow-tanker-in-french-custody",
    "originalLink": "https://www.bbc.com/news/articles/c62vke5dly2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Party backed by generals set for landslide as 'sham' Myanmar election ends",
    "title": "Party backed by generals set for landslide as 'sham' Myanmar election ends",
    "content": "Many parties were banned and there was no voting in about half the country which is gripped by fear and civil war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:25:18.795Z",
    "image": "https://image.pollinations.ai/prompt/Party%20backed%20by%20generals%20set%20for%20landslide%20as%20'sham'%20Myanmar%20election%20ends%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "party-backed-by-generals-set-for-landslide-as-sham-myanmar-election-ends",
    "originalLink": "https://www.bbc.com/news/articles/cx2l6wg0p8eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'They're engaged' - Rosenior continues positive start at Chelsea",
    "title": "'They're engaged' - Rosenior continues positive start at Chelsea",
    "content": "Liam Rosenior has started well at Chelsea and it bodes well for the future amid ambitions to qualify for the Champions League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-25T18:25:24.114Z",
    "image": "https://image.pollinations.ai/prompt/'They're%20engaged'%20-%20Rosenior%20continues%20positive%20start%20at%20Chelsea%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "theyre-engaged-rosenior-continues-positive-start-at-chelsea",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2yw86ep6eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City 'got job done' - so is WSL title race over?",
    "title": "Man City 'got job done' - so is WSL title race over?",
    "content": "Manchester City capitalised on Chelsea's defeat to open up a nine-point lead at the top of the Women's Super League. Is the title race over?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-01-25T18:25:29.254Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20'got%20job%20done'%20-%20so%20is%20WSL%20title%20race%20over%3F%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-got-job-done-so-is-wsl-title-race-over",
    "originalLink": "https://www.bbc.com/sport/football/articles/c2k935n12wwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Leicester sack Cifuentes after six months as boss",
    "title": "Leicester sack Cifuentes after six months as boss",
    "content": "Marti Cifuentes is sacked as Leicester City manager after just six months in charge with the Foxes in the bottom half of the Championship.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-25T18:25:34.386Z",
    "image": "https://image.pollinations.ai/prompt/Leicester%20sack%20Cifuentes%20after%20six%20months%20as%20boss%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "leicester-sack-cifuentes-after-six-months-as-boss",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjezj5y0yw9o?at_medium=RSS&at_campaign=rss"
  }
]