[
  {
    "originalTitle": "Pilot praised after crash-landing faulty Somali passenger plane on seashore",
    "title": "Wow! A Brave Pilot Lands a Plane on the Beach and Everyone is Safe!",
    "content": "<h3>Hello, My Super Friends!</h3>\nHello, my super friends! It's your kid-friendly news reporter from Africa here! I have a really amazing story to tell you today. It's about a very special plane, a very brave pilot, and a landing that was super, super unique! Get ready to hear about a true hero right here in Africa!\n\n<h3>The Big Plane Trip</h3>\nImagine you are going on a big trip! You get on a plane, maybe with your family or friends. A plane is like a giant bird that flies high in the sky. It has big wings and powerful engines that help it soar above the clouds. This exciting story happened in a beautiful country in Africa called Somalia, near the big, blue ocean.\n\nOn this day, 55 people were inside a plane. That's a lot of people! They were sitting in their seats, looking out the windows, and getting ready to land after their journey. They were looking forward to seeing their families or starting a new adventure.\n\nDid you know? Airplanes are one of the safest ways to travel! Pilots train for many, many years to learn how to fly them super well and keep everyone safe.\n\n<h3>Uh Oh! A Little Problem</h3>\nBut sometimes, even big, strong planes can have a little problem. It's very rare, but it can happen. The pilot, Captain Abdi, was getting ready to land the plane. Usually, planes land on a special long road called a 'runway' at an airport.\n\nA runway is a very smooth, flat path made just for planes to land and take off safely. It's like a special road only for airplanes! Captain Abdi was bringing the plane closer and closer to the airport.\n\nOn this day, something wasn't quite right with the plane. It couldn't land on the runway like it usually does. Oh no! What would Captain Abdi do? Everyone on board was waiting to land safely.\n\nDid you know? Pilots have to check their planes very carefully before every single flight. They are super smart and know all about their big flying machines to make sure everything works perfectly!\n\n<h3>A Super Smart Pilot to the Rescue!</h3>\nCaptain Abdi is a very experienced pilot. That means he has flown planes many, many times and knows what to do in tricky situations. He had to think super fast! His mind was working like a super-computer.\n\nHe had to find a safe place to land the plane if not on the runway. He looked out of the window. He saw the big, blue ocean and a lovely sandy beach right next to it! 'Aha!' he must have thought. 'I can land the plane there!'\n\nHe knew he had to keep everyone safe, and a sandy beach would be much softer than rocky ground or water. He had a brilliant idea!\n\nDid you know? Pilots are trained to stay calm and think clearly even when things get a bit wobbly or unexpected. They are like real-life superheroes, but their powers are their amazing flying skills and quick thinking!\n\n<h3>Landing on the Sandy Beach!</h3>\nSo, Captain Abdi, with his amazing skill, guided the big plane down. Not on the hard runway, but onto the soft, sandy seashore! A seashore is where the land meets the ocean, a lovely place often with soft sand and gentle waves.\n\nCan you imagine a huge airplane landing right on the beach? It must have looked like a giant bird coming down for a rest, very carefully choosing its spot on the sand!\n\nHe landed it so gently, like he was parking a small car! Everyone inside the plane felt a little bump, but then they knew they were safe. It was an amazing moment for everyone, a true test of skill and bravery.\n\nDid you know? The front of the plane is called the 'nose' and the back is called the 'tail'! Just like an animal! And the big window where the pilot sits is called the cockpit.\n\n<h3>Everyone is Safe! Hooray!</h3>\nAnd guess what? Because Captain Abdi was so brave and so clever, all 55 people inside the plane were safe! Not one person was hurt. Can you believe it? That's truly amazing and something to celebrate!\n\nWhen the plane stopped, everyone clapped and cheered loudly for the pilot! They were so happy and thankful to be safe on the beautiful beach. They quickly got off the plane and stood on the soft sand, breathing a big sigh of relief.\n\nPeople from nearby quickly came to help. Everyone was smiling and happy that this exciting adventure ended so well, with everyone safe and sound. It was a happy ending!\n\nDid you know? When you fly on a plane, there are always amazing people called flight attendants who help you and make sure you are comfortable and safe throughout your journey!\n\n<h3>Why This Story Matters to Us in Africa</h3>\nThis story tells us something very important. It tells us that we have very skilled and brave people, like Captain Abdi, right here in Africa. It shows that even when unexpected things happen, people can work together and heroes can emerge to save the day.\n\nIt also reminds us that safety is always the most important thing, especially when we travel. We are so proud of Captain Abdi and so happy that everyone is okay! What a truly wonderful and brave act.\n\nSo, next time you see a plane flying high above, remember Captain Abdi and his amazing landing. He truly is a hero of the skies, and a wonderful example of bravery for all of us here in Africa!",
    "summary": "A very brave pilot in Africa landed a plane with 55 people safely on a beach after a problem, making everyone cheer with happiness because not one person was hurt!",
    "whyMatters": "This story is important because it shows how brave and smart pilots are, and how everyone can be safe even when unexpected things happen, making us proud of our heroes and reminding us that safety is very important when we travel.",
    "category": "world",
    "date": "2026-02-10T20:38:51.085Z",
    "image": "https://image.pollinations.ai/prompt/Wow!%20A%20Brave%20Pilot%20Lands%20a%20Plane%20on%20the%20Beach%20and%20Everyone%20is%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wow-a-brave-pilot-lands-a-plane-on-the-beach-and-everyone-is-safe",
    "originalLink": "https://www.bbc.com/news/articles/c2d1pz3pxewo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bid launched to extend Zimbabwe president's term in office",
    "title": "Bid launched to extend Zimbabwe president's term in office",
    "content": "President Mnangagwa's term in office is due to end in 2028 but a bill could open the way for him to extend that time.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:38:56.216Z",
    "image": "https://image.pollinations.ai/prompt/Bid%20launched%20to%20extend%20Zimbabwe%20president's%20term%20in%20office%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bid-launched-to-extend-zimbabwe-presidents-term-in-office",
    "originalLink": "https://www.bbc.com/news/articles/c15x3xl52qdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Son of Zambia's ex-President Lungu ordered to surrender 79 cars, petrol station and 'luxury' flats",
    "title": "Big News from Zambia: Sharing Fairly!",
    "content": "<h3>Hello, Super Star Explorers!</h3>\n\nHello, hello, my wonderful friends! I'm your friendly news reporter, zooming in from our amazing continent, Africa! Today, we have a very important story from a beautiful country called Zambia. Zambia is in Southern Africa, and it's famous for many wonderful things, like big waterfalls and amazing animals!\n\n<h3>What's the Big News?</h3>\n\nSomething very interesting happened in Zambia. There's a grown-up man named Dalitso Lungu. He is the son of someone who used to be the President of Zambia. A President is like the big boss of a country, helping everyone.\n\nNow, a very smart and kind judge in a big building called the High Court has made an important decision. The judge asked Mr. Dalitso Lungu to give back many things. It's like when you have too many toys, and your parents ask you to share or give some away that you didn't get fairly.\n\n<h3>Lots and Lots of Cars!</h3>\n\nCan you imagine having 79 cars? That's a super lot of cars! If you lined them up, they would be very, very long. Mr. Dalitso Lungu was asked to give back these 79 cars. That's more cars than many schools have in their car parks!\n\nDid you know? Most cars have four wheels and an engine that makes them go zoom! People use cars to go to school, to the market, or to visit friends and family. Some cars are small, and some are big, like buses!\n\n<h3>A Special Place for Cars to Drink</h3>\n\nBesides the cars, Mr. Lungu also has to give back a petrol station. Do you know what a petrol station is? It's a special shop where cars go to get petrol or fuel. Petrol is like the food and water for a car – it helps the car's engine work so it can drive.\n\nImagine your car running out of energy; it needs petrol to keep going! Petrol stations also sometimes sell yummy snacks and drinks for the people driving the cars. They are very important places in any town or city.\n\n<h3>Lovely Homes Called Flats</h3>\n\nAnd there's more! He also has to give back some lovely homes called 'flats'. Flats are like apartments, which are houses that are part of a bigger building. Many families can live in one big flat building, each in their own home. They are very cosy places to live.\n\nDid you know? Many people in big cities live in flats because it saves space. Sometimes, these buildings can be very tall, like giants reaching for the sky!\n\n<h3>Why Did This Happen?</h3>\n\nThe judge made this decision because Mr. Dalitso Lungu couldn't show how he got all these things in a good, honest way. In big words, it means he couldn't show they were 'lawfully acquired'.\n\nWhat does 'lawfully acquired' mean? It means you got something in a fair and right way. Like if your parents work hard to earn money to buy food or toys for you. Or if you save your pocket money to buy something you really want. It means no cheating, no stealing, and always being honest.\n\n<h3>Everyone Must Follow the Rules!</h3>\n\nOur world, our countries, and even our homes have rules, right? Rules help us all live together happily and safely. Imagine playing a game without any rules – it would be messy and unfair! Laws are like big rules for everyone in a country. They help make sure everyone is treated fairly.\n\nThis story from Zambia shows us that everyone, no matter how important their family is, must follow the rules. It's super important for people to be honest and fair. When people are honest, our countries become stronger and happier for everyone.\n\nDid you know? Zambia's capital city is called Lusaka. It's a busy and exciting place where many people live and work.\n\n<h3>What Happens Next?</h3>\n\nNow, Mr. Dalitso Lungu has to give back the 79 cars, the petrol station, and the flats. These items will then belong to the country of Zambia, and the government will decide what to do with them. Maybe they will be used to help more people in Zambia!\n\nThis decision helps remind everyone that being honest and following the rules is the best way to live. It helps make sure that things are fair for all the children and grown-ups in Zambia and all across Africa.\n\nSo, remember to always be honest and fair in everything you do, my little news adventurers! Until next time, keep exploring and learning! Bye-bye! Your friendly African news reporter!",
    "category": "world",
    "date": "2026-02-10T20:39:13.239Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20from%20Zambia%3A%20Sharing%20Fairly!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-zambia-sharing-fairly",
    "originalLink": "https://www.bbc.com/news/articles/c78xdvwl70wo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "People climb from windows of burning campus building in Dakar",
    "title": "People climb from windows of burning campus building in Dakar",
    "content": "Footage shows people climbing out of windows to escape from a burning university building in Dakar as protests erupt ove",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:39:18.673Z",
    "image": "https://image.pollinations.ai/prompt/People%20climb%20from%20windows%20of%20burning%20campus%20building%20in%20Dakar%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "people-climb-from-windows-of-burning-campus-building-in-dakar",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/10/people-climb-from-windows-of-burning-campus-building-in-dakar?traffic_source=rss"
  },
  {
    "originalTitle": "US imposes new Hezbollah sanctions targeting gold exchange firm",
    "title": "US imposes new Hezbollah sanctions targeting gold exchange firm",
    "content": "Trump administration vows to cut off Lebanese group 'from the global financial system' amid daily Israeli violations.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:39:39.698Z",
    "image": "https://image.pollinations.ai/prompt/US%20imposes%20new%20Hezbollah%20sanctions%20targeting%20gold%20exchange%20firm%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-imposes-new-hezbollah-sanctions-targeting-gold-exchange-firm",
    "originalLink": "https://www.aljazeera.com/news/2026/2/10/us-imposes-new-hezbollah-sanctions-targeting-gold-exchange-firm?traffic_source=rss"
  },
  {
    "originalTitle": "Why is a moderate Democrat’s primary loss being called an AIPAC backfire?",
    "title": "Why is a moderate Democrat’s primary loss being called an AIPAC backfire?",
    "content": "Tom Malinowski faced onslaught of AIPAC attack ads, paving the way for a candidate more critical of US-Israel policy.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-10T20:39:44.822Z",
    "image": "https://image.pollinations.ai/prompt/Why%20is%20a%20moderate%20Democrat%E2%80%99s%20primary%20loss%20being%20called%20an%20AIPAC%20backfire%3F%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-is-a-moderate-democrats-primary-loss-being-called-an-aipac-backfire",
    "originalLink": "https://www.aljazeera.com/news/2026/2/10/why-is-a-moderate-democrats-primary-loss-being-called-an-aipac-backfire?traffic_source=rss"
  },
  {
    "originalTitle": "FBI releases images of masked person in hunt for Savannah Guthrie's mother",
    "title": "FBI releases images of masked person in hunt for Savannah Guthrie's mother",
    "content": "The mother of the news anchor Savannah disappeared in the middle of night from her Tucson, Arizona, home and was last seen on 31 January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:39:50.523Z",
    "image": "https://image.pollinations.ai/prompt/FBI%20releases%20images%20of%20masked%20person%20in%20hunt%20for%20Savannah%20Guthrie's%20mother%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fbi-releases-images-of-masked-person-in-hunt-for-savannah-guthries-mother",
    "originalLink": "https://www.bbc.com/news/articles/cy4wdgxr081o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Under-fire Trump commerce secretary confirms he visited Epstein's island",
    "title": "Under-fire Trump commerce secretary confirms he visited Epstein's island",
    "content": "Howard Lutnick says he had lunch on the island in 2012, contradicting previous claims he had cut ties with Jeffrey Epstein in 2005.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:39:55.658Z",
    "image": "https://image.pollinations.ai/prompt/Under-fire%20Trump%20commerce%20secretary%20confirms%20he%20visited%20Epstein's%20island%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "under-fire-trump-commerce-secretary-confirms-he-visited-epsteins-island",
    "originalLink": "https://www.bbc.com/news/articles/cwyx9vq0ne0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Laegreid wins bronze then confesses to affair on TV",
    "title": "Laegreid wins bronze then confesses to affair on TV",
    "content": "Winter Olympics bronze medallist Sturla Holm Laegreid says on live TV that he made the \"biggest mistake\" by cheating on his girlfriend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-10T20:40:00.780Z",
    "image": "https://image.pollinations.ai/prompt/Laegreid%20wins%20bronze%20then%20confesses%20to%20affair%20on%20TV%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "laegreid-wins-bronze-then-confesses-to-affair-on-tv",
    "originalLink": "https://www.bbc.com/sport/articles/ckglnm521kko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Toughest season I've had as manager 'by a mile' - Slot",
    "title": "Toughest season I've had as manager 'by a mile' - Slot",
    "content": "Liverpool boss Arne Slot says this season is the toughest he has had as a manager \"by a mile\" and his side are \"not performing to Liverpool's standards\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:40:05.983Z",
    "image": "https://image.pollinations.ai/prompt/Toughest%20season%20I've%20had%20as%20manager%20'by%20a%20mile'%20-%20Slot%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "toughest-season-ive-had-as-manager-by-a-mile-slot",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yqwelklxgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Has Gyokeres finally found form or are stats misleading?",
    "title": "Has Gyokeres finally found form or are stats misleading?",
    "content": "Arsenal are top of the league, fighting for trophies in four competitions and at the same time £64m striker Viktor Gyokeres looks to be finding his feet in north London.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:40:11.109Z",
    "image": "https://image.pollinations.ai/prompt/Has%20Gyokeres%20finally%20found%20form%20or%20are%20stats%20misleading%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "has-gyokeres-finally-found-form-or-are-stats-misleading",
    "originalLink": "https://www.bbc.com/sport/football/articles/c8d5jezj7y9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mateta knee injury 'not as bad as feared' ",
    "title": "Mateta knee injury 'not as bad as feared' ",
    "content": "The knee injury which scuppered Jean-Philippe Mateta's move to AC Milan last month is \"not as bad as feared\" and he will not need surgery, says Crystal Palace manager Oliver Glasner.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T20:40:16.250Z",
    "image": "https://image.pollinations.ai/prompt/Mateta%20knee%20injury%20'not%20as%20bad%20as%20feared'%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mateta-knee-injury-not-as-bad-as-feared",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg1lrvn1lyo?at_medium=RSS&at_campaign=rss"
  }
]