[
  {
    "originalTitle": "Pilot praised after landing faulty Somali passenger plane on seashore",
    "title": "Our Amazing African Pilot Hero!",
    "content": "Hello, my super friends across Africa! It's your kid-friendly news reporter here, ready with a super exciting story! Today, we're talking about a true hero, a pilot who did something so brave and so clever that everyone is cheering!\n\n<h3>Big News from Somalia!</h3>\nWe have some really big news from a country called Somalia. Somalia is in Africa, just like where you are! Something happened there that made many people happy and thankful. It was all thanks to a very special pilot.\n\n<h3>Meet Our Pilot Hero!</h3>\nImagine you are flying in a big airplane. What if something goes a little bit wrong? It can be scary, right? But not for our pilot hero! This pilot was flying a big plane with many people inside. These people were going on a trip, maybe to see family or for a holiday.\n\n<h3>What is a Pilot?</h3>\nA pilot is like the captain of a ship, but for an airplane! They sit at the front of the plane in a special room called the cockpit. They have lots of buttons and screens. Pilots are super smart! They train for many years to learn how to fly big planes safely. They know what to do in all kinds of weather and in all kinds of situations. Our pilot hero showed just how amazing pilots are!\n\nDid you know? Pilots need to wear special uniforms! They look very smart and professional.\n\n<h3>The Plane Had a Problem</h3>\nSo, this big plane was getting ready to land. Landing means coming down from the sky safely onto the ground. But something went a little bit wrong with the plane. We call it \"faulty\" when something is not working perfectly. It means a part of the plane was not doing its job very well. The plane was finding it hard to stop.\n\n<h3>What is a Runway?</h3>\nWhen planes land, they usually land on a very long, flat road made just for planes. We call this a \"runway.\" An airport has runways. It's like a special highway for airplanes to take off and land. Planes need a lot of space to stop safely. But our plane was having trouble stopping on the runway.\n\nDid you know? Some runways are so long they can be like walking for 20 minutes from one end to the other!\n\n<h3>An Amazing Landing on the Beach!</h3>\nBecause the plane couldn't stop on the runway, the pilot had to think very, very fast. What could they do? They looked around. And guess what? There was a big, open, sandy beach nearby! A beach is next to the ocean, with soft sand. The pilot made a super clever decision! Instead of trying to stop on the short runway, they decided to land the plane right on the seashore, on the sand!\n\nImagine that! A big airplane landing on the sand! It was an amazing moment. The pilot was so calm and so skilled. They carefully brought the big plane down, gently, onto the sand.\n\n<h3>Everyone Was Safe!</h3>\nThe most important thing is that everyone on the plane was safe! Not one person was hurt. Can you imagine how happy and relieved the people on the plane must have felt? They must have cheered and clapped for their pilot hero! They were thankful for the pilot's quick thinking and brave actions.\n\nDid you know? Planes are designed to be very strong, but landing on sand is still very tricky and takes a lot of skill!\n\n<h3>Why the Pilot is a Hero</h3>\nThis pilot is a true hero because they kept calm when things were difficult. They thought quickly and made a very smart decision. They used all their training and skill to keep everyone safe. That's what heroes do! They help others and keep them out of harm's way.\n\nPeople everywhere are praising this pilot. Praising means saying \"Well done!\" and \"You are amazing!\" because they did such a fantastic job.\n\n<h3>What Happens Next?</h3>\nAfter the plane landed safely on the beach, many people came to help. They made sure everyone got off the plane safely. Now, experts will look at the plane to find out exactly why it had trouble stopping. They will learn from this so that other planes can be even safer in the future.\n\nDid you know? Sometimes planes can get little problems, just like a car can. But there are always people working hard to fix them and make sure they are super safe.\n\n<h3>Flying in Africa</h3>\nAirplanes are very important for Africa. They help people travel across our big continent. They help families visit each other. They help people go on amazing adventures. Stories like this remind us how important it is to have brave and smart people, like our pilot hero, working hard to keep us safe in the sky.\n\nSo, let's give a big, imaginary cheer for our amazing African pilot hero from Somalia! What a fantastic job they did!\n\nSee you next time with more exciting news from our wonderful continent!",
    "summary": "A brave pilot in Somalia safely landed a big passenger plane on a sandy beach after it had a problem stopping on the runway, making sure everyone was safe and well.",
    "whyMatters": "This story matters because it shows how incredibly brave and smart pilots are, using their skills to keep everyone safe even when something unexpected happens, reminding us of the heroes working to protect us every day.",
    "category": "world",
    "date": "2026-02-10T16:02:28.929Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Amazing%20African%20Pilot%20Hero!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-amazing-african-pilot-hero",
    "originalLink": "https://www.bbc.com/news/articles/c2d1pz3pxewo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenya to confront Russia over 'unacceptable' use of its nationals in combat",
    "title": "Kenya to confront Russia over 'unacceptable' use of its nationals in combat",
    "content": "Nairobi says it has shut down illegal recruiters and will urge Moscow to sign a deal banning conscription.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:02:34.100Z",
    "image": "https://image.pollinations.ai/prompt/Kenya%20to%20confront%20Russia%20over%20'unacceptable'%20use%20of%20its%20nationals%20in%20combat%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenya-to-confront-russia-over-unacceptable-use-of-its-nationals-in-combat",
    "originalLink": "https://www.bbc.com/news/articles/c0k1jzvrykro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Eswatini angers Madagascar junta for hosting deposed leader",
    "title": "Friends, Talks, and a Little Wiggle-Wobble in Africa!",
    "content": "<p>Hello, amazing friends! Welcome to our super special African news corner! Today, we have a story from our big, beautiful continent about two countries, Eswatini and Madagascar. Sometimes, even countries need to talk and make sure they understand each other, just like you and your friends!</p>\n\n<h3>Meet Eswatini!</h3>\n<p>First, let's say hello to Eswatini! Eswatini is a small, happy country in the southern part of Africa. It's like a tiny jewel tucked between bigger countries. People there are very friendly, and they love their beautiful mountains and valleys. Imagine a place with lots of green hills and lovely open spaces. That's Eswatini!</p>\n<p><b>Did you know?</b> Eswatini used to be called Swaziland, but its name changed to Eswatini, which means \"place of the Swazi.\" How cool is that?</p>\n\n<h3>Meet Madagascar!</h3>\n<p>Now, let's fly across the ocean, not too far, to a very special island country called Madagascar! Madagascar is not on the main land of Africa; it's a huge island in the big blue ocean, to the east. It's famous for its amazing animals that you can't find anywhere else in the world, like cute lemurs with their big eyes and long tails! It’s like a giant, wonderful zoo all on its own island.</p>\n<p><b>Did you know?</b> Madagascar is the fourth largest island in the whole wide world! That's bigger than many countries!</p>\n\n<h3>What are Leaders?</h3>\n<p>Every country has a leader, or sometimes a group of leaders. These are the grown-ups who help make important decisions for everyone in the country. They are like the head teacher of a school, or the captain of a team. Their job is to make sure everything runs smoothly and that people are happy and safe. They help decide things like building schools, making sure there's enough food, and talking to other countries.</p>\n\n<h3>A Special Visit</h3>\n<p>Now, here's where our story begins! Once upon a time, not too long ago, a person who used to be a leader in Madagascar visited Eswatini. Let's call him the 'old leader' from Madagascar. He was not the leader anymore, because some new people had taken charge in Madagascar. Sometimes, leaders change, and sometimes, new people take charge in a different way, not by everyone voting. This 'old leader' went to Eswatini to have a chat.</p>\n<p>The leaders in Eswatini were being very polite and friendly. They said, \"Come in, let's talk!\" They listened to what the 'old leader' had to say. It was like when a friend comes to your house, and you invite them in for a chat and a snack. Eswatini just wanted to be a good host.</p>\n\n<h3>Why Some People Got a Little Bit Cross</h3>\n<p>But guess what? The new leaders in Madagascar heard about this visit. And they were not very happy! They felt a little bit cross, like when your brother or sister plays with your toy without asking. They thought Eswatini was taking sides. They thought Eswatini was being friends with the 'old leader' more than being friends with them, the 'new leaders.'</p>\n<p>They thought, \"Hmm, why is Eswatini talking to someone who is not in charge of our country anymore? Are they trying to cause trouble for us?\" This made them feel worried and a little bit upset. They felt like Eswatini was getting involved in something that was just for Madagascar to decide.</p>\n\n<h3>What Eswatini Said Back</h3>\n<p>But Eswatini quickly said, \"Hold on a minute! That's not what we meant at all!\" The leaders in Eswatini explained that they were not trying to make anyone mad or take sides. They said they were just being friendly neighbours. They said that talking to different people, even 'old leaders,' is how countries learn to get along.</p>\n<p>They called it 'regional diplomacy.' That's a big word, but it just means that countries in the same part of the world talk to each other to solve problems, understand each other, and stay friends. It's like when all the kids in your neighbourhood talk to each other to plan a game, even if they sometimes disagree on the rules.</p>\n<p><b>Did you know?</b> When countries talk nicely to each other to solve problems, it's called 'diplomacy.' It's like having a giant friendly chat to make the world a better place!</p>\n\n<h3>Why Talking is Super Important</h3>\n<p>Talking is one of the best ways to solve problems, isn't it? If you have a disagreement with a friend, talking helps you understand each other. It's the same for countries! When countries talk, they can share ideas, help each other, and avoid getting into big fights.</p>\n<p>Eswatini wanted to make sure that everyone understood that their talk with the 'old leader' was just part of trying to keep everyone talking and friendly. They didn't want Madagascar to feel like they were poking their nose into their business. They just wanted to be good friends to everyone around them.</p>\n<p><b>Did you know?</b> The word 'interfere' means to get in the way or try to change something that isn't your business. Eswatini really didn't want to do that!</p>\n\n<h3>Being Good Neighbours</h3>\n<p>It's super important for countries that live close to each other to be good neighbours. Just like you share toys with your friends, countries share rivers, roads, and sometimes even help each other when there's a big problem, like a storm or not enough food. Being good neighbours means being respectful and always trying to understand each other.</p>\n<p>Even when there are misunderstandings, like with Eswatini and Madagascar, talking about it nicely helps. It helps everyone remember that we are all part of the big African family. We all want to live in peace and be happy.</p>\n<p><b>Did you know?</b> Africa has 54 countries! That's a lot of neighbours who need to talk and be friends!</p>\n\n<h3>What Happens Next?</h3>\n<p>Hopefully, after Eswatini explained everything, the new leaders in Madagascar will understand. They will see that Eswatini just wanted to be helpful and friendly, not to cause any trouble. It's like when you explain to your friend why you did something, and then they understand, and you can play happily again.</p>\n<p>So, our story from Africa reminds us all that talking and listening are super powers! They help us make friends and keep the peace, whether we are kids, grown-ups, or even whole countries!</p>",
    "summary": "Eswatini hosted a visit from Madagascar's old leader, which made Madagascar's new leaders upset, but Eswatini explained they were just talking to be friendly and not to cause trouble.",
    "whyMatters": "It's important for countries to talk nicely and understand each other, even when there are disagreements, so they can stay friends and help each other in Africa.",
    "category": "world",
    "date": "2026-02-10T16:02:56.490Z",
    "image": "https://image.pollinations.ai/prompt/Friends%2C%20Talks%2C%20and%20a%20Little%20Wiggle-Wobble%20in%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-talks-and-a-little-wiggle-wobble-in-africa",
    "originalLink": "https://www.bbc.com/news/articles/c9v0pgj0xw2o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What were Jeffrey Epstein’s links to Israel?",
    "title": "New Papers Tell a Story About Jeffrey Epstein",
    "content": "<p>Jambo, my lovely friends! It's your friendly news reporter from Africa here. Today, we have a special story about learning important things from old papers. Sometimes, grown-ups need to understand what happened in the past so we can all be safe and happy in the future. We are going to talk about a man named Jeffrey Epstein.</p>\n\n<h3>Who Was Jeffrey Epstein?</h3>\n<p>Jeffrey Epstein was a grown-up man who lived very far away, in a country called America. He had a lot of money and big, fancy houses. But he did some very, very bad things. Things that made many people sad and hurt. Because of the bad things he did, many people are still working hard to understand everything about him and how to make sure bad things like that don't happen again.</p>\n<p>It's important to remember that most grown-ups are kind and helpful. They want to protect you and make you happy. Jeffrey Epstein was not one of those kind grown-ups, and that is why we talk about him carefully.</p>\n<p>Did you know? Even grown-ups can make mistakes or do bad things. But it's always important to learn from them and try to make things right.</p>\n\n<h3>What Are \"Papers\" and \"Documents\"?</h3>\n<p>Imagine your school books or your drawings. They are all papers, right? Well, grown-ups also have special papers. Some are like letters, some are like notes, and some are like lists of names. These are called \"documents.\" These papers help grown-ups remember things and learn about what happened a long, long time ago, or even just yesterday.</p>\n<p>When we say \"new papers have come out,\" it means that some old letters and notes that people had kept hidden for a while are now being shared. These papers help us understand more about Jeffrey Epstein.</p>\n<p>Did you know? Detectives, like the ones in your storybooks, often look for clues in old papers to solve mysteries and find out what happened!</p>\n\n<h3>Learning About His Friends and Connections</h3>\n<p>Jeffrey Epstein was a person who knew many other people. He traveled to many places and met different grown-ups. The new papers are like puzzle pieces. When we put them all together, they show us who he knew and where he went.</p>\n<p>Think about your own friends. You have friends at school, maybe friends in your neighborhood, or even cousins who live far away. Jeffrey Epstein also had \"connections,\" which means people he knew and talked to, in many different places.</p>\n<p>Did you know? It's good to have friends! But it's very important to choose kind and good friends who make you feel happy and safe.</p>\n\n<h3>What Does \"Links to Israel\" Mean?</h3>\n<p>One of the places mentioned in these new papers is a country called Israel. It's a country far, far away from us, across the big blue ocean. When we say \"links to Israel,\" it means that the papers show Jeffrey Epstein knew some people in Israel. Maybe he visited Israel, or maybe he talked to people from Israel. The papers help us understand these connections.</p>\n<p>It doesn't mean everyone in Israel knew him, or that Israel did anything wrong. It just means the papers show he had some connection to that country, just like he had connections to many other places in the world.</p>\n<p>Did you know? Israel is a country in a part of the world called the Middle East. It has many old, important buildings and stories!</p>\n\n<h3>Why Do We Need to Know This?</h3>\n<p>It's very important to know about these connections. When someone does bad things, grown-ups called \"investigators\" try to find out everything. They want to understand how it happened, who was involved, and how to stop it from happening again. These new papers help the investigators learn more and piece together the story.</p>\n<p>Learning about the past, even the sad parts, helps us make a better future. It helps us make sure that all children, everywhere, are safe and protected. The police and other helpers use this information to do their very important jobs.</p>\n<p>Did you know? Investigators are like super-smart problem-solvers. They collect clues and ask lots of questions to figure things out!</p>\n\n<h3>Keeping Everyone Safe</h3>\n<p>The most important thing for all grown-ups is to keep children safe. Every child deserves to feel loved, safe, and happy. When we learn about people like Jeffrey Epstein, it helps us remember how important it is for grown-ups to always protect children and to be very careful about who they trust.</p>\n<p>If you ever feel unsafe, or if someone ever makes you feel uncomfortable or sad, it's super important to tell a trusted grown-up right away. This could be your parent, your teacher, your auntie, or an elder you trust very much. They are there to help you!</p>\n<p>Did you know? There are special rules and laws in every country to protect children. These rules are very important!</p>\n\n<h3>Our Special Job as News Reporters</h3>\n<p>As your friendly news reporters, our job is to tell you about what is happening in the world. We try to tell you in a way that is easy to understand and safe for your young minds. We want you to know about important things, but always gently and kindly.</p>\n<p>So, to sum it up: new papers are helping grown-ups learn more about a man named Jeffrey Epstein, who did many bad things. These papers show he had connections to different places, including Israel. All this learning helps us work towards a safer world for all children.</p>\n<p>Thank you for listening, my wonderful friends! Stay curious and stay safe!</p>",
    "summary": "New papers are helping grown-ups learn more about a man named Jeffrey Epstein, who did bad things, and understand his connections to different places, including the country of Israel.",
    "whyMatters": "Learning about these connections is important because it helps grown-ups understand what happened, solve problems, and make sure that all children are kept safe and happy in the future.",
    "category": "world",
    "date": "2026-02-10T16:03:24.555Z",
    "image": "https://image.pollinations.ai/prompt/New%20Papers%20Tell%20a%20Story%20About%20Jeffrey%20Epstein%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "new-papers-tell-a-story-about-jeffrey-epstein",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/10/what-were-jeffrey-epsteins-links-to-israel-2?traffic_source=rss"
  },
  {
    "originalTitle": "Netanyahu heads to US for talks with Trump on Iran, Gaza",
    "title": "Netanyahu heads to US for talks with Trump on Iran, Gaza",
    "content": "Israeli Prime Minister Benjamin Netanyahu is heading to Washington to meet US President Donald Trump.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:03:29.741Z",
    "image": "https://image.pollinations.ai/prompt/Netanyahu%20heads%20to%20US%20for%20talks%20with%20Trump%20on%20Iran%2C%20Gaza%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "netanyahu-heads-to-us-for-talks-with-trump-on-iran-gaza",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/10/netanyahu-heads-to-us-for-talks-with-trump-on-iran-gaza?traffic_source=rss"
  },
  {
    "originalTitle": "Struggling to navigate the Epstein files? Here is a visual guide",
    "title": "Struggling to navigate the Epstein files? Here is a visual guide",
    "content": "The US Department of Justice has released three million files related to convicted sex offender Jeffrey Epstein.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:03:34.915Z",
    "image": "https://image.pollinations.ai/prompt/Struggling%20to%20navigate%20the%20Epstein%20files%3F%20Here%20is%20a%20visual%20guide%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "struggling-to-navigate-the-epstein-files-here-is-a-visual-guide",
    "originalLink": "https://www.aljazeera.com/news/2026/2/10/struggling-to-navigate-the-epstein-files-here-is-a-visual-guide?traffic_source=rss"
  },
  {
    "originalTitle": "US lawmakers accuse justice department of 'inappropriately' redacting Epstein files",
    "title": "US lawmakers accuse justice department of 'inappropriately' redacting Epstein files",
    "content": "Republican Thomas Massie and Democrat Ro Khanna say the DOJ is not complying with their transparency law.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-10T16:03:40.595Z",
    "image": "https://image.pollinations.ai/prompt/US%20lawmakers%20accuse%20justice%20department%20of%20'inappropriately'%20redacting%20Epstein%20files%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-lawmakers-accuse-justice-department-of-inappropriately-redacting-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cn5gzepnw4lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Macron urges Europe to start acting like world power",
    "title": "Macron urges Europe to start acting like world power",
    "content": "The French president warns of growing threats from China, Russia and now the US, saying Europe faces a \"wake-up call\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:03:45.782Z",
    "image": "https://image.pollinations.ai/prompt/Macron%20urges%20Europe%20to%20start%20acting%20like%20world%20power%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "macron-urges-europe-to-start-acting-like-world-power",
    "originalLink": "https://www.bbc.com/news/articles/ce8n1zdnpd3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
    "title": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
    "content": "Wasserman's flirtatious emails to Ghislaine Maxwell were revealed in the Epstein files.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-10T16:03:50.947Z",
    "image": "https://image.pollinations.ai/prompt/Chappell%20Roan%20leaves%20talent%20agency%20led%20by%20Casey%20Wasserman%20after%20Epstein%20fallout%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chappell-roan-leaves-talent-agency-led-by-casey-wasserman-after-epstein-fallout",
    "originalLink": "https://www.bbc.com/news/articles/cewz1keql5no?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Toughest season I've had as manager 'by a mile' - Slot",
    "title": "Toughest season I've had as manager 'by a mile' - Slot",
    "content": "Liverpool boss Arne Slot says this season is the toughest he has had as a manager \"by a mile\" and his side are \"not performing to Liverpool's standards\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:04:08.577Z",
    "image": "https://image.pollinations.ai/prompt/Toughest%20season%20I've%20had%20as%20manager%20'by%20a%20mile'%20-%20Slot%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "toughest-season-ive-had-as-manager-by-a-mile-slot",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yqwelklxgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Has Gyokeres finally found form or are stats misleading?",
    "title": "Has Gyokeres finally found form or are stats misleading?",
    "content": "Arsenal are top of the league, fighting for trophies in four competitions and at the same time £64m striker Viktor Gyokeres looks to be finding his feet in north London.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:04:13.741Z",
    "image": "https://image.pollinations.ai/prompt/Has%20Gyokeres%20finally%20found%20form%20or%20are%20stats%20misleading%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "has-gyokeres-finally-found-form-or-are-stats-misleading",
    "originalLink": "https://www.bbc.com/sport/football/articles/c8d5jezj7y9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mateta knee injury 'not as bad as feared' ",
    "title": "Mateta knee injury 'not as bad as feared' ",
    "content": "The knee injury which scuppered Jean-Philippe Mateta's move to AC Milan last month is \"not as bad as feared\" and he will not need surgery, says Crystal Palace manager Oliver Glasner.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-10T16:04:18.906Z",
    "image": "https://image.pollinations.ai/prompt/Mateta%20knee%20injury%20'not%20as%20bad%20as%20feared'%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mateta-knee-injury-not-as-bad-as-feared",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg1lrvn1lyo?at_medium=RSS&at_campaign=rss"
  }
]