[
  {
    "originalTitle": "Ex-Nigeria oil minister in bribery trial spent £2m at Harrods, court hears",
    "title": "Big Money Story: Helping Nigeria or Helping Herself?",
    "content": "<h3>Hello, Africa's Super Kids!</h3>\nHello, my amazing friends! I am your Kid-Friendly News Reporter. I am here to tell you about something important. It is about fairness. It is about money. And it is about helping everyone in our big, beautiful Africa. Today, we are talking about a big story from Nigeria. It is about a very important person. This person used to be in charge of Nigeria's oil treasure.\n\n<h3>Who Is Diezani Alison-Madueke?</h3>\nThere was a lady named Diezani Alison-Madueke. She was a very important person in Nigeria. She used to be the \"Oil Minister.\" What is an Oil Minister? Imagine Nigeria has a big treasure underground. This treasure is called oil. Oil helps us run cars and make electricity. It is very important for the country.\n\nThe Oil Minister is like a super-guardian. She helps manage this oil treasure for the whole country. She helps make sure the oil is used well. She makes sure it helps all the people of Nigeria. She had a very big and important job.\n\n<h3>What is a \"Bribe\"?</h3>\nNow, here is the tricky part. Diezani Alison-Madueke is being accused of something called taking \"bribes.\" What is a bribe? Let me explain in a simple way. Imagine you are playing a game with your friends. Someone wants to win very badly. They might secretly give the referee a sweet or a toy. They want the referee to help them win. Even if they are not the best player.\n\nThis secret gift is like a bribe. It is not fair. It makes things wrong. It is cheating. In this story, Diezani Alison-Madueke is accused of getting secret gifts. These gifts were not sweets. They were money. Big amounts of money. Who gave her these gifts? People who wanted to do business with Nigeria.\n\nDid you know? Taking bribes is against the rules. It is not honest. It means someone is not playing fair. It hurts everyone who is trying to do things the right way. Leaders should always be fair.\n\n<h3>Why Do People Give Bribes?</h3>\nThese people wanted \"government contracts.\" What are government contracts? Imagine the government needs to build a new road. Or they need to find more oil. They ask different companies, \"Who can do this job best?\" They should choose the company that is best. They should choose the company that is fair and honest.\n\nBut sometimes, people try to cheat. They try to give secret money. They give money to the important person in charge. They hope the important person will choose *their* company. Even if another company is better or cheaper. This is what Diezani Alison-Madueke is accused of doing. She is accused of taking money. Then she might have chosen those companies. This would mean it was not fair at all.\n\n<h3>A Big Trial in London</h3>\nThis is a very serious thing to be accused of. So, there is a special place where people find out the truth. It is called a \"court.\" It is like a big classroom or a big meeting room. But instead of a teacher, there is a \"judge.\" The judge listens to all the stories. Lawyers tell their side. Witnesses tell what they saw and heard. It is like a big game to find out what really happened.\n\nThis court is not in Nigeria. It is in a faraway city called London. So, Diezani Alison-Madueke is in London. She is in a court there. The court is trying to find out the truth. They want to know if she really took bribes. This is a very important job for the court.\n\n<h3>Spending So Much Money!</h3>\nThe court heard something very surprising. They heard that a lot of money was spent. Where was this money spent? It was spent in a very, very fancy shop. The shop is called Harrods. It is in London. Imagine the biggest, most beautiful toy shop you have ever seen. But instead of just toys, it sells very, very expensive clothes, jewelry, and other fancy things.\n\nHow much money was spent? A very, very big number. £2 million. That is like 2 million pounds! That is a super huge amount of money. It is so much money! You could buy so many good things for so many people with that money. You could build many schools for children. You could buy many medicines for sick people. You could give many children good food. It is a really, really big number.\n\nDid you know? £2 million is more money than most people earn in their whole lives! It is a massive amount. It makes people wonder where all that money came from. That's why the court is looking into it.\n\n<h3>Why Does This Matter for Nigeria?</h3>\nThis story is very important for all of us. Especially for the children and families of Nigeria. Why? Because the money from oil belongs to everyone in Nigeria. It should be used to make Nigeria a better place. It should be used to build good schools. It should be used to build hospitals so people can get well. It should be used to bring clean water to villages. It should be used to help every child get a good start in life.\n\nIf someone takes bribes, that money does not go to help the people. It goes into one person's pocket. This is not fair to anyone. It is not fair to the children who need schools. It is not fair to the sick people who need hospitals. It is not fair to all the hard-working people of Nigeria. This is why we want leaders to be honest. We want them to be fair. We want them to use money wisely. We want them to help everyone.\n\nDid you know? When leaders are honest and fair, everyone benefits! The country becomes stronger and happier. More children can go to school and have bright futures.\n\n<h3>What Happens Next?</h3>\nThe court in London will keep listening. They will listen to all the stories. They will look at all the evidence. Then, the judge will make a decision. The judge will decide if Diezani Alison-Madueke is guilty. Guilty means she did the bad thing she is accused of. Or not guilty means she did not do it.\n\nIt is a serious process. It takes time. But it is important to find the truth. It is important to make sure everyone follows the rules. It is important that justice is done. Justice means what is fair and right happens in the end. We will wait to see what the court decides.\n\n<h3>Let's Be Fair and Honest!</h3>\nSo, my dear friends, remember this story. It teaches us something very important. It teaches us about being fair. It teaches us about being honest. It teaches us that money should be used to help everyone. Not just one person. That is how a country grows strong and happy.\n\nLet's all promise to be fair in our games. Let's promise to be honest with our friends and family. And let's hope that all our leaders are fair and honest too. Because that is how we build a super, strong, and happy Africa for all of us! Thank you for listening, my wonderful kids! Keep dreaming big and always be honest!",
    "summary": "A former important leader in Nigeria is accused of taking secret money, called bribes, to help herself instead of her country, and spent a huge amount at a very fancy shop in London.",
    "whyMatters": "This story matters because money from our country's oil and other treasures should help all children and families get schools and hospitals, not just one person, and everyone in charge should be honest and fair.",
    "category": "politics",
    "date": "2026-01-28T03:41:40.659Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Money%20Story%3A%20Helping%20Nigeria%20or%20Helping%20Herself%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-money-story-helping-nigeria-or-helping-herself",
    "originalLink": "https://www.bbc.com/news/articles/ckglpd167n9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rwanda takes legal action against UK over axed migrant deal",
    "title": "Rwanda takes legal action against UK over axed migrant deal",
    "content": "The African nation argues it is owed payments but Downing Street says it will fight the case.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-28T03:41:45.829Z",
    "image": "https://image.pollinations.ai/prompt/Rwanda%20takes%20legal%20action%20against%20UK%20over%20axed%20migrant%20deal%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rwanda-takes-legal-action-against-uk-over-axed-migrant-deal",
    "originalLink": "https://www.bbc.com/news/articles/czx32yxnvzro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nigeria president 'in great shape' after falling at Turkey reception",
    "title": "Nigeria president 'in great shape' after falling at Turkey reception",
    "content": "On a visit to Ankara, Bola Tinubu was filmed stumbling and falling after walking past soldiers and dignitaries.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-28T03:41:50.990Z",
    "image": "https://image.pollinations.ai/prompt/Nigeria%20president%20'in%20great%20shape'%20after%20falling%20at%20Turkey%20reception%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nigeria-president-in-great-shape-after-falling-at-turkey-reception",
    "originalLink": "https://www.bbc.com/news/articles/cvgpz16q2xdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "President talks up strength of US economy in advance of midterm elections",
    "title": "America's President Talks About Good Times!",
    "content": "<h3>Hello, My Amazing Little Friends!</h3>\nHello, my amazing little friends from all over Africa! Your friendly news reporter is here to share some exciting news from far, far away. Today, we are going to learn about a very important person called a President and how he helps his country. It's like learning about our own leaders, but for a country called America!\n\n<h3>Who is a President?</h3>\nImagine a very big family, and that family is a whole country! The President is like the head of that big family. He is chosen by the people to help make good decisions for everyone in the country. He works very hard to make sure people are happy and safe.\n\nDid you know? Many countries in Africa also have Presidents! They all work hard to make life better for their people, just like the President in America.\n\n<h3>What is the \"Economy\"?</h3>\nNow, this is a big word, but it's not too tricky! The \"economy\" is all about how money moves around in a country. It’s about jobs, shops, and things people buy and sell. \n\nThink about your family. When your parents have good jobs, they can buy food, clothes, and send you to school, right? That's a little bit like the economy for a whole country!\n\nWhen the economy is strong, it means lots of people have jobs. It means shops have many things to sell, and families have enough money to buy what they need. It means the country can build new schools and hospitals! That sounds great, doesn't it?\n\n<h3>America's President Talks About Good Money Days!</h3>\nSo, in America, there is a very important leader. We call him the President. He was talking to everyone and saying that America's economy is doing very well. He was saying, \"Look! We have lots of jobs! People are working hard! Families have money!\"\n\nHe wanted everyone to know that things were looking good. He was cheering on the country, like a coach cheering for his team!\n\nDid you know? A President needs to be a very good leader and speaker. They talk to many people every day!\n\n<h3>Why Was He Talking About This Now?</h3>\nThis is a good question! Imagine your teacher tells you about a big test coming up. You would want to study hard and show you know a lot, right?\n\nWell, in America, people get to vote for their leaders, including who helps the President. These votes are called \"elections.\" Sometimes, there are special elections called \"midterm elections.\"\n\nMidterm elections are like a report card for the people who work with the President. People get to choose if they want to keep the same helpers or choose new ones. \n\nSo, the President wanted to show everyone that his team was doing a super job with the country's money, hoping people would vote for his team's helpers again!\n\n<h3>When Sad Things Happen</h3>\nSometimes, in life, sad things happen. Recently, in America, some people were feeling very sad and worried about some events that took place. When people are sad, they might feel upset or angry.\n\nThe President knew that people were thinking about these sad things. He wanted to help people remember the good things too. He wanted to shift their thoughts to something happy and hopeful.\n\nIt's like when you're feeling a bit down, and someone tries to tell you a funny story or remind you of something great that happened. The President wanted to remind people about the good things happening with their jobs and money.\n\n<h3>What Are \"Bread-and-Butter\" Issues?</h3>\nThis is a fun phrase! When we say \"bread-and-butter issues,\" we are talking about the very important things that every family needs every single day.\n\nThink about what your family needs:\n*   **Bread:** Yummy food to eat so you can grow big and strong!\n*   **Butter:** Maybe not real butter, but things like clothes to wear, a nice home to live in, and water to drink.\n*   **Money:** Enough money for parents to buy these important things.\n*   **Jobs:** Good jobs for adults so they can earn money for the family.\n\nSo, when the President talked about the economy, he was really talking about these \"bread-and-butter\" things. He was saying, \"Hey! Our economy is strong, so families can get their bread and butter!\" He wanted to focus on how people's daily lives were getting better.\n\nDid you know? In some places in Africa, people eat delicious injera or sadza which is like their \"bread\"! It's a very important food for many families.\n\n<h3>Why This Matters for Everyone</h3>\nWhen a country's economy is strong, it helps everyone. It means parents can find jobs more easily. It means shops have more things to sell. It means there's more money to build new schools for children like you, and new hospitals to keep everyone healthy.\n\nIt means people can dream big dreams and work to make them come true!\n\nThe President's message was all about hope and progress. He wanted people to feel good about their country and its future. He wanted them to focus on the positive things that affect their everyday lives.\n\n<h3>Our News Report Today</h3>\nSo, in short, the President of America was telling everyone that the country's money situation was really good! He wanted people to focus on how strong the economy was, how many jobs there were, and how families could get all the \"bread-and-butter\" things they needed.\n\nHe shared this happy news because people were feeling worried about some sad things, and also because new elections were coming up to choose who helps him run the country. He wanted people to remember the good work his team was doing.\n\nIt's important to know what leaders are talking about, even in countries far away. It helps us understand how the world works and how leaders try to make things better for their people.\n\nThank you for listening, my wonderful little news explorers! Until next time, stay curious and keep learning!",
    "summary": "America's President talked about how well the country's money and jobs were doing, wanting people to feel hopeful, especially when there was some sad news and important voting coming soon.",
    "whyMatters": "This matters because when a country's leader talks about money and jobs, it helps people know that things are getting better for their families, like having food and going to school. It helps everyone feel hopeful about their country's future.",
    "category": "politics",
    "date": "2026-01-28T03:42:17.161Z",
    "image": "https://image.pollinations.ai/prompt/America's%20President%20Talks%20About%20Good%20Times!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "americas-president-talks-about-good-times",
    "originalLink": "https://www.aljazeera.com/economy/2026/1/28/trump-talks-up-strength-of-us-economy-in-advance-of-midterm-elections?traffic_source=rss"
  },
  {
    "originalTitle": "US president praises Syrian leader al-Sharaa after offensive against SDF",
    "title": "US president praises Syrian leader al-Sharaa after offensive against SDF",
    "content": "Al-Sharaa is due in Moscow on Wednesday to meet with Russian President Vladimir Putin.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-28T03:42:22.331Z",
    "image": "https://image.pollinations.ai/prompt/US%20president%20praises%20Syrian%20leader%20al-Sharaa%20after%20offensive%20against%20SDF%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-president-praises-syrian-leader-al-sharaa-after-offensive-against-sdf",
    "originalLink": "https://www.aljazeera.com/news/2026/1/28/trump-praises-syrian-president-al-sharaa-after-offensive-against-sdf?traffic_source=rss"
  },
  {
    "originalTitle": "Minnesota Representative Ilhan Omar attacked during town hall meeting",
    "title": "Minnesota Representative Ilhan Omar attacked during town hall meeting",
    "content": "Omar was sprayed with an unknown substance during the attack by a man, who was then tackled to the ground.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-28T03:42:27.503Z",
    "image": "https://image.pollinations.ai/prompt/Minnesota%20Representative%20Ilhan%20Omar%20attacked%20during%20town%20hall%20meeting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "minnesota-representative-ilhan-omar-attacked-during-town-hall-meeting",
    "originalLink": "https://www.aljazeera.com/news/2026/1/28/minnesota-representative-ilhan-omar-attacked-during-town-hall-meeting?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says government will 'de-escalate' in Minnesota following Pretti shooting",
    "title": "Trump says government will 'de-escalate' in Minnesota following Pretti shooting",
    "content": "The killing of Alex Pretti over the weekend led MInnesota officials and locals to renew calls for Trump to end his immigration operation there.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-28T03:42:33.280Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20government%20will%20'de-escalate'%20in%20Minnesota%20following%20Pretti%20shooting%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-government-will-de-escalate-in-minnesota-following-pretti-shooting",
    "originalLink": "https://www.bbc.com/news/articles/c0q425vg4qzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Minnesota congresswoman Ilhan Omar attacked with 'unknown liquid' during town hall",
    "title": "Good News About Our Helper Ilhan!",
    "content": "<h3>Hello from Africa!</h3>\nHi, super friends! It's me, your news buddy from Africa, ready to share an important story with you today! We have news from a place far away, a country called America. But this story teaches us all about being brave and kind, no matter where we live. So, let's learn together!\n\n<h3>Meet Ilhan Omar!</h3>\nOur story is about a very special helper named Ilhan Omar. She is a very important person in her country. She is what they call a \"congresswoman.\" What does a congresswoman do? It's like being a big helper for a whole part of the country! Ilhan Omar works for the people in her state, which is called Minnesota. She listens to people's ideas and helps make good rules. She works very hard every day to make life better and fairer for everyone. She is like a leader in your own community, always trying to do good things.\n\nDid you know? Many countries around the world have special helpers like Ilhan Omar! They might have different names, but they all try their best to help their people and their country grow strong.\n\n<h3>What Happened?</h3>\nOne day, Ilhan Omar was at a special meeting. This meeting is called a \"town hall.\" Many people came to this town hall meeting to see her and talk with her. It's a place where people can share their thoughts with their leader. Suddenly, something very surprising happened. Someone threw something at Ilhan Omar. It was a \"liquid.\" What is a liquid? Think of water, or juice, or milk! It's something that flows and can be poured. But this liquid was \"unknown.\" That means nobody knew what it was at all. It was like water, but maybe not water, and we didn't know anything about it. Throwing things is never a good idea, friends. It's not kind, and it can make people feel scared or unsafe. It's always, always better to use our words, not to throw things or try to hurt anyone.\n\n<h3>Good News: She's Okay!</h3>\nNow, for the best news! Guess what? Ilhan Omar was not hurt at all! She was \"uninjured.\" This means she didn't get any ouchies, no bumps, and no boo-boos. She was completely safe, and we are so, so happy she was safe! Even after someone threw the unknown liquid, Ilhan Omar was very, very brave. She did not run away. She did not stop her important work. She kept talking to the people who came to see her. She \"continued to speak at the event.\" That means she stayed and kept doing her job! That is super brave! She showed everyone that she is strong and dedicated to helping people. It's good to be brave when surprising and tricky things happen.\n\nDid you know? Being brave doesn't mean you're not scared at all. It means you keep going and do what needs to be done, even if you feel a little bit scared inside!\n\n<h3>What is a \"Town Hall\" Meeting?</h3>\nLet's learn a little more about this special \"town hall\" meeting. A town hall is a special kind of meeting where people get to meet their leaders face-to-face. It's like how you might meet your teacher, or a wise village elder, to talk about things. People come to listen to their leader. They also come to ask questions and tell their leader what they think about different things in their town or country. It's a place for everyone to share their ideas and worries. Leaders, like Ilhan Omar, really want to hear from the people they help. It's a very important way for everyone to work together and make their community a better place.\n\nDid you know? Many countries have special places and times for people to meet and talk about important things! It's a wonderful way for people to help make good decisions together for everyone.\n\n<h3>Why Do Leaders Have Meetings?</h3>\nLeaders like Ilhan Omar have meetings for many good reasons. They want to know what makes people happy. They also want to know what makes people sad. Most importantly, they want to know what problems need to be fixed in the community. Imagine if you had a problem at school, like the swings were broken. You would tell your teacher, right? Leaders are like the teachers for a whole town or country. They need to hear all the voices, big and small, to understand what is happening. So, they listen very carefully to what people say. They want to help solve problems and make rules that are fair for everyone. These meetings help them do a very good job, because it helps them understand what people really need and want.\n\nDid you know? Listening to others with an open heart and mind is one of the most important jobs for any leader! It helps them learn and make the best choices for everyone.\n\n<h3>Being Kind and Safe Together</h3>\nAt any meeting, or anywhere we go, it's super important to be kind. It's also very important to be safe. We should never, ever throw things at anyone. We should never try to hurt anyone with our actions. Even if we don't agree with someone, we can still talk to them. We can use our words in a good and respectful way. We can say, \"I don't agree,\" or \"I think this way,\" using our voices calmly. But we must always be respectful. Being respectful means treating others nicely, even if they have different ideas than us. It means listening carefully, even when we don't share the same thoughts. Everyone deserves to feel safe. Everyone deserves to be heard. So, let's always choose kindness, and let's always choose safety in all our interactions.\n\nDid you know? When we are kind and respectful to each other, our homes, schools, and communities become stronger, happier, and much more peaceful places to live!\n\n<h3>Learning from What Happened</h3>\nWhat can we learn from this story about Ilhan Omar? We learned that Ilhan Omar is very, very brave. She kept doing her important job, even after a surprising and tricky thing happened. She did not let a mean moment stop her from helping people. We also learned that it's important for everyone to be safe, especially when people meet to talk about important things. When people gather, they should feel protected and comfortable. No one should have to worry about mean things happening to them. This story reminds us to always be thoughtful. It reminds us to always be good friends to each other and good community members. Even when a tricky thing happens, we can always find a good lesson from it. We can remember to be strong and to be kind, always.\n\nDid you know? Every challenge or surprise in life can teach us something new and valuable about ourselves and about how we can make the world a better place for everyone!\n\n<h3>Our Hope for Everyone</h3>\nSo, my dear friends, we are very glad that Ilhan Omar is safe and well. We hope she continues her important work, helping people every day. We hope all leaders around the world are safe too, as they work hard to help their communities. And we hope all people everywhere can meet and talk safely, sharing their ideas without fear. Let's always try to make our world a kind place. A place where everyone feels safe. A place where everyone can share their ideas and feel heard. With kindness and bravery, we can make our communities shine bright, brighter than the biggest star! Thank you for listening to the news from Africa! See you next time, super kids!",
    "summary": "A brave helper named Ilhan Omar was surprised by someone throwing an unknown liquid during a meeting, but she was not hurt and kept helping people.",
    "whyMatters": "This story teaches us that even when surprising things happen, we can be brave and keep helping others, and that it's important for everyone to be safe and kind at meetings.",
    "category": "world",
    "date": "2026-01-28T03:43:02.515Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News%20About%20Our%20Helper%20Ilhan!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-about-our-helper-ilhan",
    "originalLink": "https://www.bbc.com/news/articles/cn9zpee3llxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Who is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?",
    "title": "Who is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?",
    "content": "The US border tsar has long been a ferocious defender of Donald Trump's immigration policies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-28T03:43:07.689Z",
    "image": "https://image.pollinations.ai/prompt/Who%20is%20Tom%20Homan%2C%20Trump's%20'border%20tsar'%20deployed%20to%20Minneapolis%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-is-tom-homan-trumps-border-tsar-deployed-to-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/cjw1pn4lwjqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six English clubs, one huge night - all to play for in Champions League",
    "title": "Six English clubs, one huge night - all to play for in Champions League",
    "content": "With the league phase of the Champions League almost over, which teams can join Arsenal and Bayern Munich in the top eight?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-28T03:43:13.330Z",
    "image": "https://image.pollinations.ai/prompt/Six%20English%20clubs%2C%20one%20huge%20night%20-%20all%20to%20play%20for%20in%20Champions%20League%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-english-clubs-one-huge-night-all-to-play-for-in-champions-league",
    "originalLink": "https://www.bbc.com/sport/football/articles/c3ve1gnk26eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bayern legend? How Kane is viewed in Germany as contract talks begin",
    "title": "Bayern legend? How Kane is viewed in Germany as contract talks begin",
    "content": "Harry Kane is entering the final 18 months of his Bayern Munich contract, and the German champions are eager to keep the prolific striker, as German football writer Constantin Eckner explains.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-28T03:43:18.498Z",
    "image": "https://image.pollinations.ai/prompt/Bayern%20legend%3F%20How%20Kane%20is%20viewed%20in%20Germany%20as%20contract%20talks%20begin%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bayern-legend-how-kane-is-viewed-in-germany-as-contract-talks-begin",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjrzpng1e8zo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Two fans in hospital as Chelsea urge caution after Naples 'incident'",
    "title": "Two fans in hospital as Chelsea urge caution after Naples 'incident'",
    "content": "Travelling Chelsea fans in Naples for Wednesday's Champions League game are told to \"exercise extreme caution\" after two supporters suffer injuries.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-28T03:43:23.667Z",
    "image": "https://image.pollinations.ai/prompt/Two%20fans%20in%20hospital%20as%20Chelsea%20urge%20caution%20after%20Naples%20'incident'%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-fans-in-hospital-as-chelsea-urge-caution-after-naples-incident",
    "originalLink": "https://www.bbc.com/sport/football/articles/c74wdw5n4e5o?at_medium=RSS&at_campaign=rss"
  }
]