[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Money Flowers: A New Gift in Kenya!",
    "content": "<h3>Hello, My Little Friends!</h3>\n\nHello there, awesome explorers! Your friend from Africa is here with some exciting news from Kenya! Kenya is a beautiful country in Africa, full of sunshine, amazing animals, and wonderful people. Today, we're talking about a very special kind of gift that people are giving. It's super interesting!\n\nImagine it's a special day, like your birthday or a holiday. Someone gives you a present! What do you like to get? Maybe a toy car, a new doll, or a yummy treat? Gifts make us feel happy and loved, right?\n\nWell, in Kenya, people have started giving a gift that looks like flowers but is actually something else! Let's find out what it is!\n\n<h3>What Are Cash Bouquets?</h3>\n\nYou know how a beautiful bunch of flowers is called a bouquet? Like a bouquet of red roses or bright yellow sunflowers. They look so pretty and smell so nice!\n\nBut guess what? In Kenya, some people are making bouquets that are not made of flowers at all! They are made of MONEY!\n\nYes, real money notes! People take shiny, colourful money notes and fold them up very carefully. They make them look like pretty flowers, or bows, or even little fans. Then, they put many of these money creations together to make a big, fancy bunch. This is called a \"cash bouquet\"!\n\n\"Cash\" means money, and \"bouquet\" means a bunch of flowers. So, it's a \"money bunch\"! How cool is that? It's like getting a bouquet of paper flowers that you can use to buy your favourite things!\n\n**Did you know?** Kenya is famous for its incredible wildlife! You can see lions, elephants, giraffes, and zebras roaming freely in big national parks. It's like a real-life animal storybook!\n\nPeople arrange different money notes together. Some are small notes, and some are big notes. They make them look very colourful and exciting. Imagine getting a big bunch of bright green, blue, and pink money notes! It would be very exciting, wouldn't it?\n\nThese special \"money flowers\" are very popular for birthdays, weddings, and other big celebrations. It's a very grand way to show someone you care a lot!\n\n<h3>Why Do People Love Them?</h3>\n\nSo, why do people in Kenya love these cash bouquets so much? Well, there are a few reasons!\n\nFirst, real flowers are beautiful, but they don't last very long. After a few days, they start to wilt and dry up. But money? Money lasts! You can use it to buy something you really need or want.\n\nImagine someone gives you a cash bouquet. You can use that money to buy new school books, a warm sweater, or even save it for a big toy you've always wanted! It's very useful, isn't it?\n\nSecond, it's a very exciting way to get money. Instead of just getting money in an envelope, it comes in a beautiful, creative arrangement. It looks like a real piece of art!\n\n**Did you know?** The capital city of Kenya is Nairobi. It's a very busy city with tall buildings, many markets, and even a national park right next to it where you can see animals!\n\nThird, some people feel it's a very kind and thoughtful gift. It shows that the giver wants you to have something you truly desire, rather than just picking any gift. It's like saying, \"Here's a gift that helps you get exactly what makes you happy!\"\n\nSo, for many people, cash bouquets are a super clever and useful gift idea!\n\n<h3>Gifts for Special Days</h3>\n\nOne of the special days when people give gifts is Valentine's Day. It's a day to show love to your family and friends. People often give cards, chocolates, or, yes, flowers!\n\nIn Kenya, for Valentine's Day, instead of a bouquet of red roses, many people started giving bouquets made of money! It became a very big trend.\n\nIt was a way for people to show a lot of love and appreciation. And everyone loved to see the pictures of these amazing money bouquets online!\n\n**Did you know?** Valentine's Day is celebrated in many countries around the world on February 14th. It's a day when people share messages of love and friendship!\n\nBut just like with any big trend, sometimes people start to wonder if it's always the best idea. And that's what started happening in Kenya.\n\n<h3>A Little Problem...</h3>\n\nEven though cash bouquets are fun and useful, some people started to have worries about them. It's like when you have a super fun game, but you need to remember the rules to play it safely!\n\nOne of the main worries was about safety. Imagine carrying a big bunch of money in your hands, walking around outside. What if someone saw it and wanted to take it away from you? That wouldn't be very safe, would it?\n\nIt's always important to be careful with money, especially big amounts. We need to keep our money safe so we can use it for what we need.\n\n**Did you know?** There are many different types of money in the world! Each country has its own special money. In Kenya, the money is called the Kenyan Shilling.\n\nAnother worry was about showing off. Some people thought that giving a huge cash bouquet was less about love and more about showing how much money someone had. Gifts should come from the heart, not just about how big or expensive they are.\n\n<h3>Keeping Your Gifts Safe</h3>\n\nIt's very important to keep ourselves and our belongings safe. If you get a gift, whether it's money or a toy, you want to make sure it stays with you.\n\nSo, if you get a cash bouquet, it's a good idea to put the money away in a safe place quickly. Maybe a safe box at home, or with a trusted grown-up who can help you keep it safe. It's not a good idea to walk around with lots of money showing.\n\nIt's always wise to be aware of your surroundings, just like your parents or teachers tell you to look both ways before crossing the street.\n\n**Did you know?** Flowers have been given as gifts for thousands of years! Different flowers can mean different things. For example, red roses often mean love, and sunflowers can mean happiness!\n\nThis is why some people started saying, \"Maybe we should be a little more careful with these cash bouquets.\" It's about being smart and safe.\n\n<h3>What Do Other People Think?</h3>\n\nNot everyone in Kenya thinks the same way about cash bouquets. Some people still love them and think they are the best gifts ever because they are so useful and exciting.\n\nBut others think that a simple, heartfelt gift is better. They might prefer a single beautiful flower, a thoughtful letter, or a handmade card. They believe that the love and effort put into a gift are more important than how much money it costs.\n\nThey also worry that the idea of giving gifts might change. Gifts should be about showing love and appreciation, not about how much money you can give. What do you think?\n\n**Did you know?** Many countries in Africa have amazing stories and traditions about gift-giving! It's a wonderful part of their culture to share and celebrate with loved ones.\n\nIt's a big discussion happening in Kenya. Should people continue with cash bouquets, or should they go back to more traditional gifts? Or maybe find a way to do both, being safe and thoughtful?\n\n<h3>The Best Gifts Are From the Heart</h3>\n\nSo, my little friends, what have we learned? Cash bouquets are a super interesting and creative way to give money as a gift in Kenya. They can be very useful and exciting!\n\nBut we also learned that it's important to think about safety and the true meaning of giving a gift. A gift should come from your heart, full of love and kindness. It's not just about how much money it costs.\n\nWhether it's a special toy, a warm hug, a kind word, or even a cash bouquet kept safe, the best gifts are always those given with love and a happy heart! Stay curious and kind, everyone!\n",
    "summary": "People in Kenya have started giving special gifts called \"cash bouquets\" where money is folded to look like flowers, but there are discussions about whether this is safe and the best way to show love.",
    "whyMatters": "It's important for us to think about how we give gifts, making sure they are safe for everyone and that they truly show our love and care, not just how much money we have.",
    "category": "world",
    "date": "2026-02-14T07:31:00.706Z",
    "image": "https://image.pollinations.ai/prompt/Money%20Flowers%3A%20A%20New%20Gift%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "money-flowers-a-new-gift-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:31:05.821Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "South Africa to deploy troops to tackle crime gangs",
    "content": "President Cyril Ramaphosa says the army will work with the police to fight organised crime and illegal mining.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T07:31:10.930Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20to%20deploy%20troops%20to%20tackle%20crime%20gangs%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-to-deploy-troops-to-tackle-crime-gangs",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "LIVE: World leaders gather in Munich for 2nd day of security conference",
    "title": "Our World's Big Meeting for Safety!",
    "content": "Hello, hello, wonderful children of Africa! Your friendly news reporter is here with exciting news from far, far away. Imagine a very, very big meeting, like your school assembly, but with grown-ups from all over the world!\n\nThey are not talking about homework, but about something even bigger: how to keep our whole planet safe and happy. This big meeting is happening in a city called Munich. Munich is very far away, in a country called Germany.\n\nGermany is in Europe, a continent far from our beautiful Africa. Important leaders from different countries have gathered there for two whole days to talk about keeping everyone safe.\n\n<h3> What is this Big Meeting All About? </h3>\nIt's called a \"security conference.\" Don't let the big words scare you! \"Security\" just means being safe and protected.\n\nThink about feeling safe at home, safe at school, and safe when you play outside. That's what security is all about! This meeting is where leaders talk about how to make sure countries are safe from harm.\n\nThey want to make sure people can live in peace, go to school, and play without worrying. Sometimes, countries have problems or disagreements, just like friends might have a small fight.\n\nThis meeting is where the grown-up leaders try to find ways to solve those problems peacefully.\n\n**Did you know?** Talking things through is almost always better than fighting! Leaders meet to talk and share ideas so everyone can live happily.\n\n<h3> Who are the Important People There? </h3>\nWow, so many important people! Imagine the very best leaders from some of the biggest countries. They are all together in one big room, listening and sharing.\n\nThese leaders are like the captains of their countries' teams. They work very hard to make sure their people are okay.\n\nOne of the special people there is like a top messenger from America. America is a very big country far away. This person helps America talk to all the other countries.\n\nThey are called a \"diplomat,\" and their job is to make friends and solve problems with other nations.\n\nWe also have the president of Ukraine. Ukraine is a country that has been having a very tough time recently, like a family facing big challenges. Their president is there to ask for help and to talk about keeping his people safe and bringing peace back to his country.\n\nThen there's the Prime Minister of Britain! Britain is another big country, like a friendly neighbour across the sea. Their leader is also there to share ideas on how to make the world a safer place for everyone. It's like when your big brother or sister helps you solve a puzzle.\n\nAnd from a country called Syria, there's a special minister. Syria has also faced many problems. This minister is there to talk about his country's needs and how to help its people find safety and peace. All these leaders have one big wish: to make things better for their homes.\n\n**Did you know?** A country's president or prime minister is chosen by the people to be their leader. It's a very important job, just like being the leader of your class!\n\n<h3> Why Do They Meet So Far Away? </h3>\nThat's a great question! Why don't they just talk on the phone? Well, when problems are very, very big, it's best to meet face-to-face.\n\nIt's like when you need to talk to your best friend about something important – it's better to look them in the eye and chat. These meetings happen in different big cities around the world.\n\nMunich is a lovely city with lots of history. By meeting in person, leaders can shake hands, share meals, and talk for many hours. They can really listen to each other's ideas and try to understand different points of view.\n\nOur world is like one giant neighbourhood, with many different houses (countries). When something bad happens in one house, it can sometimes affect other houses too. So, it's important for all the \"neighbours\" (leaders) to come together and talk about how to keep the whole neighbourhood safe and happy.\n\n**Did you know?** Germany is famous for delicious sausages and beautiful castles! It's also known for being a very organized country.\n\n<h3> What Exactly Do They Talk About? </h3>\nThey talk about all sorts of things that help keep us safe! Imagine if a bully was bothering some kids in the playground. The teachers would talk about how to stop the bully and make sure everyone feels safe again. That's a bit like what these leaders do, but on a much bigger scale!\n\nThey discuss ways to stop disagreements between countries from turning into big fights. They talk about how to help countries that are having a hard time, maybe because of a big storm or because people are not getting along. They also share ideas about how to protect our Earth, like making sure we have clean air and water.\n\nIt's all about making sure that children like you can grow up in a world where you feel safe to learn, play, and dream big dreams. They want every child to have a home, food, and friends. They talk about how to make sure there is enough medicine when people are sick and enough schools for everyone.\n\n**Did you know?** \"Peace\" means a time when there is no fighting or war, and everyone is getting along and feeling safe. It's what these leaders are working towards!\n\n<h3> Why is this Important for Us in Africa? </h3>\nEven though this big meeting is happening far away in Germany, it is super important for us, right here in Africa! We all share the same big world.\n\nWhat happens in one part of the world can affect us, and what happens in Africa can affect others too. When leaders talk about peace and safety, they are talking about peace and safety for *everyone*, no matter where they live.\n\nIf they find good ways to solve problems far away, it helps make the whole world a more peaceful place. And that's good news for all of us!\n\nSometimes, these leaders also talk about how to help countries grow stronger and better. They might talk about sharing good ideas for schools, hospitals, or building roads. Our African leaders also work hard for us, and they often talk with these big world leaders too. We are all connected in this big, beautiful world!\n\nSo, even though we are far away, let's cheer for these leaders! Let's hope they make good plans so that our world can be a safe, happy, and friendly home for all children, everywhere. Keep dreaming big, my little friends!",
    "summary": "Important leaders from different countries are meeting far away in Germany to talk about how to keep everyone in our big world safe and peaceful.",
    "whyMatters": "This meeting is important because when leaders talk together about solving problems and keeping countries safe, it helps make the whole world a friendlier and happier place for all children, including us in Africa.",
    "category": "world",
    "date": "2026-02-14T07:31:34.975Z",
    "image": "https://image.pollinations.ai/prompt/Our%20World's%20Big%20Meeting%20for%20Safety!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-worlds-big-meeting-for-safety",
    "originalLink": "https://www.aljazeera.com/news/liveblog/2026/2/14/live-world-leaders-gather-in-munich-for-2nd-day-of-security-conference?traffic_source=rss"
  },
  {
    "originalTitle": "US ends temporary protected status for Yemeni refugees, asylum seekers",
    "title": "US ends temporary protected status for Yemeni refugees, asylum seekers",
    "content": "Homeland Security Secretary Kristi Noem has determined it is safe for Yemenis to return to their war-torn country.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:31:40.086Z",
    "image": "https://image.pollinations.ai/prompt/US%20ends%20temporary%20protected%20status%20for%20Yemeni%20refugees%2C%20asylum%20seekers%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-ends-temporary-protected-status-for-yemeni-refugees-asylum-seekers",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/us-ends-temporary-protected-status-for-yemeni-refugees-asylum-seekers?traffic_source=rss"
  },
  {
    "originalTitle": "This Valentine’s Day, chocolate comes with new risks",
    "title": "This Valentine’s Day, chocolate comes with new risks",
    "content": "Climate shocks and deforestation are reshaping cocoa supply and pushing prices into a more volatile era.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:31:45.203Z",
    "image": "https://image.pollinations.ai/prompt/This%20Valentine%E2%80%99s%20Day%2C%20chocolate%20comes%20with%20new%20risks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-valentines-day-chocolate-comes-with-new-risks",
    "originalLink": "https://www.aljazeera.com/opinions/2026/2/14/this-valentines-day-chocolate-comes-with-new-risks?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:31:50.826Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US homeland security shutdown could mean airport delays, travel groups say",
    "title": "US homeland security shutdown could mean airport delays, travel groups say",
    "content": "The shutdown won't affect air traffic controllers but some TSA workers may go without pay.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-14T07:31:55.932Z",
    "image": "https://image.pollinations.ai/prompt/US%20homeland%20security%20shutdown%20could%20mean%20airport%20delays%2C%20travel%20groups%20say%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-homeland-security-shutdown-could-mean-airport-delays-travel-groups-say",
    "originalLink": "https://www.bbc.com/news/articles/cwy8dw5zk7yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T07:32:01.047Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:32:06.416Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "title": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "content": "After Igor Tudor agrees to take charge of Tottenham for the remainder of the season, BBC Sport takes a look at what supporters can expect to see from his side.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-14T07:32:11.521Z",
    "image": "https://image.pollinations.ai/prompt/'Intense%2C%20aggressive%2C%20entertaining'%20-%20what%20will%20Tudor%20bring%20to%20Spurs%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "intense-aggressive-entertaining-what-will-tudor-bring-to-spurs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13nkvd2eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Marvellous' Man City set WSL standard in rampant win",
    "title": "'Marvellous' Man City set WSL standard in rampant win",
    "content": "'Marvellous' Manchester City set WSL standard in rampant 6-0 win over bottom side Leicester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T07:32:16.619Z",
    "image": "https://image.pollinations.ai/prompt/'Marvellous'%20Man%20City%20set%20WSL%20standard%20in%20rampant%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "marvellous-man-city-set-wsl-standard-in-rampant-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxwjjqrxeo?at_medium=RSS&at_campaign=rss"
  }
]