[
  {
    "originalTitle": "People cling to treetops as 'worst floods in a generation' sweep Mozambique",
    "title": "Big Water Trouble in Mozambique!",
    "content": "<h3>Hello, Friends! Big News from Mozambique!</h3>\nHi everyone! It's your kid-friendly news reporter from Africa here! Today, we have some important news from a country called Mozambique. It's a beautiful country in Africa, just like ours. Mozambique is on the eastern side of Africa, right next to the big blue ocean. It has lovely beaches and lots of sunshine. But sometimes, nature can bring big surprises.\n\nRecently, Mozambique got a LOT of rain. Not just a little bit, but so much rain that it caused something called a flood. Imagine your bathtub overflowing, but instead of just your bathroom floor, it's a whole big area of land! That's what happened in parts of Mozambique.\n\nDid you know? Mozambique is known for its friendly people and delicious food, especially seafood because it's right by the sea! It's a very special place.\n\n<h3>Water, Water Everywhere!</h3>\nWhen the big rain came, the rivers got too full. The water started to rise, higher and higher. It covered the roads, the fields, and even went inside people's homes. It was like a giant swimming pool, but a very dangerous one. Many people woke up to find water all around them.\n\nThe water was so high that people couldn't walk or drive. Some people had to climb up high to be safe. Where do you think they went? They climbed onto the roofs of their houses! And some even climbed into big, strong trees! Imagine seeing that – people sitting in trees, waiting for help. It sounds like something from a storybook, but it was real. They stayed there, clinging on, waiting for someone to come and get them. It must have been very scary.\n\nDid you know? Climbing trees can be a fun game, but in a flood, it's a way to stay safe from the fast-moving water. Trees have strong branches that can hold people up high.\n\n<h3>Friends from Far Away Come to Help</h3>\nWhen big trouble happens, good friends always come to help. And that's exactly what happened in Mozambique! Countries from all over the world sent their super helpers. People from Brazil, which is a country very far away, came to help. Friends from South Africa, which is a country close by in Africa, also rushed to help. Even friends from the United Kingdom, a country across the ocean, sent their teams.\n\nThese helpers are called rescue teams. They are very brave people. They use special boats to travel through the water. They also use big helicopters that fly in the sky! The helicopters can see where people are stuck and then carefully bring them to safety. The rescue teams helped people from the trees and from their rooftops. They brought them food, clean water, and warm blankets. It's amazing to see how people care for each other.\n\nDid you know? Helicopters are like giant flying fans! They have spinning blades that help them lift off the ground and fly. They are super helpful during floods because they can land in places where boats cannot reach.\n\n<h3>Why So Much Water?</h3>\nYou might be wondering, \"Why did it rain so much?\" Well, sometimes the weather can be a bit wild. In this part of Africa, there can be very big storms, especially around this time of year. These storms bring heavy, heavy rain for many days. It's like a big water tap turned on full blast, and it just doesn't stop!\n\nAll that rain has nowhere to go. The ground can't soak it all up, and the rivers can't hold it all. So, the water just spreads out, causing the floods. This time, the rain was extra, extra big. People are saying it was the \"worst floods in a generation.\" That means it's the biggest flood anyone has seen in a very, very long time. Probably not since your grandparents were children!\n\nDid you know? Rain is super important for life! It helps plants grow, gives us water to drink, and keeps everything fresh. But just like anything, too much of a good thing can sometimes cause problems.\n\n<h3>Helping Hands Make Light Work</h3>\nThe rescue mission is very busy. The brave people are not just saving folks from trees and roofs. They are also taking everyone to safe places. These safe places are often big buildings like schools or community halls. Here, people can stay dry and warm.\n\nThey get hot meals, clean clothes, and doctors are there to make sure everyone is healthy. It's a big job, but everyone is working together like a team. They are making sure that even though people lost their homes, they don't lose hope. They are getting lots of help to feel safe again. People are sharing what they have and comforting each other. It shows how strong people can be when they face a challenge together.\n\nDid you know? Community halls are special places where people from a neighbourhood can meet. During emergencies, they become safe shelters for many families.\n\n<h3>What Happens Next?</h3>\nAfter the floodwaters go down, there's still a lot to do. It's like cleaning up after a giant, muddy party! People will need to fix their homes. Some homes might be too broken and need to be built again. The roads will need to be repaired so cars and buses can drive safely. Farmers will need to plant new seeds in their fields so food can grow.\n\nIt's a long journey, but the people of Mozambique are strong and brave. With the help of their friends from other countries, they will rebuild. They will work together to make their homes and communities safe and happy once more. It will take time, but every little bit of help counts.\n\nDid you know? After floods, the ground can be very muddy. It's important to clean up carefully to stop any germs from spreading.\n\n<h3>We Can Help Too!</h3>\nEven though we might be far away, we can still help! How, you ask? By learning about Mozambique and other countries in Africa. By understanding that sometimes nature can be tough, but people are tougher. We can also be kind to everyone around us, just like the rescue teams are being kind to the people in Mozambique.\n\nBeing a good friend, listening to your teachers, and learning about the world makes you a very helpful person, too! Every little bit of kindness and knowledge helps make our world a better place for everyone.\n\nDid you know? Sharing a smile or a kind word can make a big difference in someone's day, even if you don't know them!\n\n<h3>Sending Our Warmest Wishes</h3>\nSo, let's send our warmest wishes to our friends in Mozambique. We hope the waters go down quickly, and that everyone stays safe and healthy. With so many helpers and so much kindness, we know they will get through this. We wish them lots of sunshine and strong spirits as they rebuild their beautiful country.",
    "summary": "Big floods in Mozambique made many people climb trees and roofs for safety, but brave helpers from different countries are working hard to rescue everyone and bring them to safe places.",
    "whyMatters": "This is important because it shows how too much rain can cause big problems for people's homes and lives, but also how people from all over the world can come together to help each other when times are tough.",
    "category": "world",
    "date": "2026-01-26T07:24:08.245Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Water%20Trouble%20in%20Mozambique!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-water-trouble-in-mozambique",
    "originalLink": "https://www.bbc.com/news/articles/cddgq9z4899o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenya's ex-deputy president alleges assassination attempt in church attack",
    "title": "Kenya News: Our Big Helpers are Keeping Us Safe!",
    "content": "<h3>Hello from Africa!</h3>\nHi everyone! It's your friendly news reporter, Pendo, here from beautiful Africa! I'm so happy to share some important news with you today. We live on such a big and wonderful continent, full of amazing animals and kind people. Sometimes, things happen that make us think, and that's okay. Today, we're talking about a place called Kenya.\n\n<h3>Welcome to Kenya!</h3>\nKenya is a country in Africa. It has sunny beaches and big, open plains where elephants and giraffes roam free! The capital city of Kenya is Nairobi. It's a busy place with lots of cars and tall buildings. Kenya is known for its incredible wildlife and its super fast runners!\nDid you know? Kenya is famous for its long-distance runners! They are super speedy and win many races around the world!\n\n<h3>A Special Place: The Church</h3>\nNow, let's talk about a church. A church is a special building where people go to pray, sing happy songs, and feel peaceful. It's a place where friends and families meet to talk about good things and help each other. Churches are usually very happy and calm places. People often feel safe and loved when they are at church. It’s a place for community and kindness.\n\n<h3>News About a Church</h3>\nRecently, something happened at a church in Kenya. It was a bit sad, because a group of people tried to cause trouble there. No one should ever feel unsafe in a special place like a church. An important person in Kenya, who used to be a very big helper for the whole country, was there. He is called a 'former deputy president.' That's a big title, but it just means he used to be a very important leader, like a very important helper for all the people in Kenya. He helped the president make decisions for everyone.\n\n<h3>About Mr. Ruto</h3>\nThe important helper's name is Mr. William Ruto. He used to be the second-most important leader in Kenya, right after the President! Imagine having a very big job, helping everyone in the whole country. That was his job before. Now he still cares a lot about Kenya and its people. He was at the church, like many other people, when this happened. He said that some people tried to hurt him and others. This made many people feel worried.\nDid you know? Leaders like presidents and their helpers work very hard to make sure their country is a good place for everyone to live and grow up!\n\n<h3>When Trouble Happens</h3>\nWhen we say 'attack,' it means someone tried to do something bad, like hurt people or damage a place. It's like when a naughty person tries to break things or push someone. But we know that trying to hurt people is never okay. This kind of event makes people feel sad and a bit scared. But remember, there are always good people, brave people, who step in to help and make things right again.\n\n<h3>Big Helpers are Here!</h3>\nDon't worry, friends! When something like this happens, there are very clever and brave grown-ups who come to help. The 'interior minister' is one of these grown-ups. He is like the chief protector of the country! He makes sure everyone is safe and that rules are followed. This minister said that what happened at the church was very, very wrong. He said it was a bad, bad thing and should not happen. He is very serious about keeping everyone safe and sound.\n\n<h3>Police to the Rescue!</h3>\nAnd guess what? Our friendly police officers are on the job! The police are like superheroes in uniforms. Their job is to keep everyone safe, find out when bad things happen, and make sure that naughty people don't hurt anyone. When we say they are 'investigating,' it means they are looking for clues, talking to people, and trying to understand exactly what happened. They want to find out who caused the trouble and why. They work hard to protect you and me and everyone in Kenya.\nDid you know? Police officers wear special uniforms so you can always spot them if you need help! They are always ready to assist people who are in trouble or lost.\n\n<h3>Working Together for Safety</h3>\nThe police are very good at their job. They are like a big team, all working together to solve puzzles and keep our communities peaceful. They will find out what happened at the church. It's important for everyone to feel safe, especially in places where people go to feel happy and connected, like a church or a school. Everyone deserves to feel safe wherever they are.\nDid you know? Community means all the people who live together in one area, like your neighborhood or your town. Everyone helps each other in a community!\n\n<h3>Feeling Safe is Important</h3>\nIt's okay to feel a little bit worried when you hear about things like this. But it's also important to remember that most of the time, our world is a safe place. There are many, many good people who work hard every day to keep it that way. When bad things happen, people come together to help each other and make things right again. We are all stronger together.\n\n<h3>Helping Each Other with Ubuntu</h3>\nIn Africa, we believe in 'Ubuntu.' That's a special word that means 'I am because we are.' It means we are all connected, and we help each other. When one person is sad, we all feel it. When someone needs help, we all try to help. So, even when something bad happens, we know that people will come together to make things better. The leaders and the police are working with the people to make sure everyone feels safe and happy again. They are working as one big team.\n\n<h3>Staying Strong</h3>\nSo, remember, even when news sounds a little scary, there are always helpers. The police are helping, the government leaders are helping, and all the kind people in Kenya are helping each other. We wish everyone in Kenya to stay strong and peaceful. Thank you for listening, friends! Until next time, stay safe and keep smiling!",
    "summary": "Something bad happened at a church in Kenya, but friendly police and government helpers are working hard to keep everyone safe and find out what happened.",
    "whyMatters": "It's important to know that when bad things happen, grown-ups like the police and government leaders work together to protect people and make sure everyone feels safe and happy again.",
    "category": "politics",
    "date": "2026-01-26T07:24:34.953Z",
    "image": "https://image.pollinations.ai/prompt/Kenya%20News%3A%20Our%20Big%20Helpers%20are%20Keeping%20Us%20Safe!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenya-news-our-big-helpers-are-keeping-us-safe",
    "originalLink": "https://www.bbc.com/news/articles/cpqyxew338po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Brave Girls Go Back to School!",
    "content": "Hello, amazing kids! Your friend, Reporter Rudo, is here from Africa! \n\nToday, I want to tell you about two very special girls. Their names are Pendo and Zawadi. They are twins! That means they look just like each other, like two peas in a pod. They live in a beautiful part of our big continent, Africa. Pendo and Zawadi are very brave. They love to learn!\n\n<h3>A Sad Time for School</h3>\nSometimes, sad things happen in the world. Pendo and Zawadi's school became a place where people were fighting. This fighting is called war. War makes places unsafe and scary. Because of the war, some of their friends were hurt very badly. It was a very, very sad time. Imagine how sad that must be! The school had to close for a while. Everyone had to leave their homes to find a safe place.\n\n**Did you know?** War is when groups of people fight each other. It makes it very hard for children to go to school or play safely. Children all over the world deserve to feel safe and happy, always!\n\n<h3>Being Brave and Strong</h3>\nPendo and Zawadi were very sad about their friends. They missed them a lot. But even though they were sad and scared, they also felt something very strong inside them. They felt determined! Determined means they really, really wanted something to happen. What did they want? They wanted to go back to school! They knew that learning was super important, even after such difficult times.\n\n**Simple Explanation:** What does \"determined\" mean?\nIt means you have a super strong will to do something. Like when you really, really want to learn to ride your bicycle, even if you fall down sometimes. You don't give up! You keep trying and trying until you do it! That's being determined.\n\n<h3>Why School is So Important</h3>\nWhy did Pendo and Zawadi want to go back so much? School is a special place. It's where we learn amazing things! We learn to read wonderful stories, write important letters, and count numbers. We learn about animals, plants, and far-away places. Our teachers are like superheroes who help us understand the whole world! School is also where we make lots of new friends. We play fun games and laugh together. It's a place where we feel safe, happy, and loved.\n\n**Did you know?** Many children in Africa walk a long, long way just to get to school! They know that learning helps them grow big and strong. Not just their bodies, but their brains too! Education means learning. It's like planting tiny seeds in your brain that grow into big, strong trees of knowledge!\n\n<h3>Their Big Dreams</h3>\nPendo and Zawadi have big dreams. They want to finish their studies. This means they want to learn everything they can, all the way until they are grown-ups. They know that by learning, they can help their families and their community. Maybe one day Pendo will be a kind doctor, helping sick people feel better. Maybe Zawadi will be a wonderful teacher, helping other children learn and dream. Learning opens up a world of possibilities, like a magic key that unlocks many doors!\n\n**Simple Explanation:** What are \"dreams\"?\nDreams are not just what you see when you are sleeping at night! They are also the special wishes you have for your future. What you want to be or do when you grow up! Dreams help us imagine a happy tomorrow.\n\n<h3>Help from Kind People</h3>\nGoing back to school after a sad time is not always easy. But there are kind people who help. Teachers are ready to welcome the children back with warm smiles and open arms. Other grown-ups, like parents and community leaders, work hard to make sure the school is safe and sound again. They help the children feel comfortable and happy, so they can focus on learning and playing. Everyone wants Pendo and Zawadi, and all children, to have a bright and hopeful future.\n\n**Did you know?** Children have rights! One very, very important right is the right to go to school and get an education. Another right is the right to be safe and protected, always!\n\n<h3>Looking Towards a Bright Future</h3>\nPendo and Zawadi are back in their classrooms now. They are learning and playing with their friends. They are remembering their friends who are no longer there, and honoring them by being brave and studying super hard. Their story reminds us that even after sad and scary times, hope can shine very, very bright. Learning is a super power that helps us build a better world for everyone. So, let's cheer for Pendo and Zawadi! And let's all keep learning and dreaming big! Reporter Rudo, signing off! Stay curious, my little stars!",
    "summary": "Brave twin girls, Pendo and Zawadi, are determined to return to school and continue learning, even after sad and scary times caused by war, because they believe education is important for their big dreams.",
    "whyMatters": "This story matters because it shows us that learning is super important, and even when sad things happen, being brave and going to school can help children build a brighter future for themselves and their communities.",
    "category": "world",
    "date": "2026-01-26T07:25:00.284Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Girls%20Go%20Back%20to%20School!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-girls-go-back-to-school",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israel’s war on Gaza live: Pressure mounts on Netanyahu to open Rafah",
    "title": "Israel’s war on Gaza live: Pressure mounts on Netanyahu to open Rafah",
    "content": "The Israeli military ⁠says it launched a 'targeted operation' in northern Gaza to find the last captive's body.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:05.644Z",
    "image": "https://image.pollinations.ai/prompt/Israel%E2%80%99s%20war%20on%20Gaza%20live%3A%20Pressure%20mounts%20on%20Netanyahu%20to%20open%20Rafah%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israels-war-on-gaza-live-pressure-mounts-on-netanyahu-to-open-rafah",
    "originalLink": "https://www.aljazeera.com/news/liveblog/2026/1/26/israels-war-on-gaza-live-pressure-mounts-on-netanyahu-to-open-rafah?traffic_source=rss"
  },
  {
    "originalTitle": "Seahawks defeat Rams to set up Super Bowl 2026 against Patriots",
    "title": "Seahawks defeat Rams to set up Super Bowl 2026 against Patriots",
    "content": "Seattle Seahawks edge Los Angeles Rams 31-27 after New England Patriots score a 10-7 win over the Denver Broncos.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-26T07:25:10.810Z",
    "image": "https://image.pollinations.ai/prompt/Seahawks%20defeat%20Rams%20to%20set%20up%20Super%20Bowl%202026%20against%20Patriots%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "seahawks-defeat-rams-to-set-up-super-bowl-2026-against-patriots",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/26/seahawks-defeat-rams-to-set-up-super-bowl-rematch-against-patriots?traffic_source=rss"
  },
  {
    "originalTitle": "Investigation reveals Israeli campaign to flatten Gaza town of Beit Hanoon",
    "title": "Investigation reveals Israeli campaign to flatten Gaza town of Beit Hanoon",
    "content": "Al Jazeera's Sanad unit analysed satellite images, finding Israel razed homes in the weeks since the ceasefire began.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:15.976Z",
    "image": "https://image.pollinations.ai/prompt/Investigation%20reveals%20Israeli%20campaign%20to%20flatten%20Gaza%20town%20of%20Beit%20Hanoon%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "investigation-reveals-israeli-campaign-to-flatten-gaza-town-of-beit-hanoon",
    "originalLink": "https://www.aljazeera.com/news/2026/1/26/investigation-reveals-israeli-campaign-to-flatten-gaza-town-of-beit-hanoon?traffic_source=rss"
  },
  {
    "originalTitle": "Minneapolis protesters march against ICE as governor urges Trump to remove agents",
    "title": "Minneapolis protesters march against ICE as governor urges Trump to remove agents",
    "content": "Second fatal shooting an 'inflection point' says Tim Walz as protests spread over Saturday's shooting of intensive care nurse Alex Pretti in Minneapolis.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-26T07:25:21.868Z",
    "image": "https://image.pollinations.ai/prompt/Minneapolis%20protesters%20march%20against%20ICE%20as%20governor%20urges%20Trump%20to%20remove%20agents%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "minneapolis-protesters-march-against-ice-as-governor-urges-trump-to-remove-agents",
    "originalLink": "https://www.bbc.com/news/articles/cr571qg4m61o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "title": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
    "content": "Two people have been shot dead by federal agents in the city in recent weeks, leaving many angry and frustrated.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:27.036Z",
    "image": "https://image.pollinations.ai/prompt/'This%20is%20horrifying'%20-%20Minneapolis%20residents%20reel%20from%20second%20deadly%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-is-horrifying-minneapolis-residents-reel-from-second-deadly-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cvg50vv1ezko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "content": "He has been described as an avid outdoorsman who loved mountain biking.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:32.197Z",
    "image": "https://image.pollinations.ai/prompt/Who%20was%20Alex%20Pretti%2C%20the%20intensive%20care%20nurse%20shot%20dead%20in%20Minneapolis%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-was-alex-pretti-the-intensive-care-nurse-shot-dead-in-minneapolis",
    "originalLink": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "title": "Hardly anyone would have picked Carrick to be Man Utd boss - but now?",
    "content": "As Michael Carrick's perfect start at Manchester United continues, is he building a case for the job longer term?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:37.828Z",
    "image": "https://image.pollinations.ai/prompt/Hardly%20anyone%20would%20have%20picked%20Carrick%20to%20be%20Man%20Utd%20boss%20-%20but%20now%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hardly-anyone-would-have-picked-carrick-to-be-man-utd-boss-but-now",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxjdk4rk1xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "title": "Why Arsenal's wobble may not even matter - despite 'feeling pressure'",
    "content": "Arsenal's winless run may normally be cause for concern - but the stats suggest they are still in control of the Premier League title race.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:42.990Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Arsenal's%20wobble%20may%20not%20even%20matter%20-%20despite%20'feeling%20pressure'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-arsenals-wobble-may-not-even-matter-despite-feeling-pressure",
    "originalLink": "https://www.bbc.com/sport/football/articles/cx2xvq5ng0xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Martinez edging closer to Villa career crossroads",
    "title": "Martinez edging closer to Villa career crossroads",
    "content": "Emiliano Martinez is hailed as the world's best goalkeeper at Aston Villa home games - but even though his team are riding high, the Argentina international is at a crossroads.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-26T07:25:48.153Z",
    "image": "https://image.pollinations.ai/prompt/Martinez%20edging%20closer%20to%20Villa%20career%20crossroads%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "martinez-edging-closer-to-villa-career-crossroads",
    "originalLink": "https://www.bbc.com/sport/football/articles/c8j331jxrk2o?at_medium=RSS&at_campaign=rss"
  }
]