[
  {
    "originalTitle": "Influential Ghanaian highlife musician Ebo Taylor dies at 90",
    "title": "Sad News: Ghana's Music Star Ebo Taylor Goes to Sleep at 90",
    "content": "Hello, my super friends! I'm your Kid-Friendly News Reporter for Africa, and I have some news to share from our amazing continent. It's a little sad, but also a time to celebrate a wonderful person.\n\n<h3>A Sad Day for Music</h3>\nToday, we are talking about a very special man from Ghana. His name was Ebo Taylor. He was a super-duper musician! Sadly, he has gone to sleep forever. Ebo Taylor was 90 years old. That's a very, very long life!\n\nHe lived for many years and made so much beautiful music. His music made people happy and made them want to dance. We will remember his happy songs always.\n\n<h3>Who Was Ebo Taylor?</h3>\nEbo Taylor was born in a country called Ghana, right here in Africa! He loved music from a very young age. He learned to play the guitar when he was just a boy.\n\nHe wasn't just a guitar player. He was also a composer. That means he wrote his own songs! He was also a band leader, which means he helped other musicians play together.\n\n<h3>Music from Ghana!</h3>\nGhana is a beautiful country in West Africa. It has sunny beaches and friendly people. Ghana is also famous for its happy music called Highlife.\n\nHighlife music is full of rhythm and joy. It makes you want to clap your hands and tap your feet. It's like a party in your ears!\n\nDid you know? Highlife music started in Ghana a long, long time ago. It's one of Africa's most famous music styles!\n\n<h3>What is Funk Music?</h3>\nNow, let's talk about another type of music called Funk. Funk music comes from far, far away, in a country called America.\n\nFunk music is very groovy. It has a strong beat that makes you want to wiggle and shake. Think of it like a fun, bouncy rhythm!\n\nDid you know? Funk music often uses cool instruments like electric guitars, drums, and even trumpets and saxophones!\n\n<h3>Making New Sounds!</h3>\nEbo Taylor had a brilliant idea. He decided to mix two different kinds of music together. He took the happy Highlife music from Ghana and the groovy Funk music from America.\n\nMixing music is like mixing colours! When you mix blue and yellow, you get green. When Ebo Taylor mixed Highlife and Funk, he made a brand new, exciting sound!\n\nThis new sound was unique and special. It was full of energy and made everyone want to dance. It was truly Ebo's special musical recipe.\n\n<h3>His Amazing Guitar</h3>\nEbo Taylor was known for his amazing guitar playing. He could make his guitar sing! His fingers danced on the strings, creating beautiful melodies.\n\nHe made his guitar sound happy, sometimes a little funky, and always full of life. Many people loved to watch him play.\n\nDid you know? A guitar has strings, and when you pluck them, they make a sound! Ebo Taylor was a master at making those sounds wonderful.\n\n<h3>Music Heard Everywhere!</h3>\nEbo Taylor's songs were so good that other musicians all around the world loved them. They loved his songs so much that they used parts of his music in their own new songs.\n\nThis is called 'sampling'. It's like taking a little piece of Ebo's delicious cake and putting it into your own cake to make it taste extra special!\n\nSo, even if you didn't know Ebo Taylor, you might have heard his music without even knowing it! His sounds traveled across oceans and continents.\n\nDid you know? When music is 'sampled', it means a small part of an old song is used in a brand new song! It's a way to keep great music alive.\n\n<h3>A Long and Happy Life</h3>\nEbo Taylor lived to be 90 years old. That is a lot of birthdays and a lot of happy memories! He spent almost all of his life making music and sharing joy.\n\nHe travelled and played music for many people. He taught younger musicians how to play and helped them find their own musical voices. He was a kind and giving person.\n\n<h3>Why He Was So Special</h3>\nEbo Taylor was special because he was brave enough to try new things with music. He showed everyone that you can mix different cultures and sounds to create something beautiful.\n\nHis music brought smiles to faces and made bodies move. He helped share the happy sounds of Ghana with the whole world. He truly was a star from Africa.\n\n<h3>Let's Remember Ebo Taylor</h3>\nEven though Ebo Taylor has gone to sleep, his music will live on forever. We can still listen to his amazing songs and dance to his rhythms.\n\nLet's remember Ebo Taylor for his wonderful guitar playing, his amazing songs, and the joy he brought to so many people. He will always be a musical hero from Ghana!",
    "summary": "Ghanaian music legend Ebo Taylor, a guitarist and composer who mixed Highlife and Funk to create music loved around the world, has passed away at the age of 90, leaving behind a legacy of joyful sounds.",
    "whyMatters": "Ebo Taylor was important because he created a super cool new kind of music by mixing Ghanaian sounds with other music, making people happy and showing the world the amazing music from Africa.",
    "category": "world",
    "date": "2026-02-08T21:21:59.694Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%3A%20Ghana's%20Music%20Star%20Ebo%20Taylor%20Goes%20to%20Sleep%20at%2090%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-ghanas-music-star-ebo-taylor-goes-to-sleep-at-90",
    "originalLink": "https://www.bbc.com/news/articles/c1e9p04n8y9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ethiopia calls on Eritrea to pull its troops back to the border",
    "title": "Let's Talk About Our Neighbors: Ethiopia and Eritrea!",
    "content": "<h3>Hello, My Little Friends!</h3>\n\nHello, my wonderful friends all across Africa! Your favorite news reporter is here with a very important, but easy-to-understand, story. Today, we're going to talk about two amazing countries that are neighbors. Do you know what neighbors are? They are like the people who live right next door to you! These countries are Ethiopia and Eritrea. They are both in a beautiful part of Africa, full of sunshine and amazing animals.\n\n<h3>Meet Our Neighbors: Ethiopia and Eritrea</h3>\n\nImagine your house, and your friend's house right next to it. Ethiopia is like one big, beautiful house, and Eritrea is another big, beautiful house right beside it. They share a special line that tells them where one country stops and the other begins. We call this line a 'border'. It's not a real painted line you can see from space, but it's a rule that helps countries know their space.\n\nDid you know? Ethiopia is one of the oldest countries in the world! It has a very rich history and amazing stories. It's also famous for being the birthplace of coffee! So, every time you see your parents drink coffee, you can think of Ethiopia!\n\n<h3>What is a Border?</h3>\n\nLet's talk more about borders. Think of your garden. Maybe you have a fence or a little path that shows where your garden ends and your neighbor's garden begins. That's like a border for countries! It helps everyone know their space. Countries have borders so that everyone knows where their land is and where their neighbor's land is. This helps keep things fair and organized. It's like having your own room and knowing where your brother or sister's room begins.\n\n<h3>Soldiers and Their Important Job</h3>\n\nNow, let's talk about 'soldiers'. Soldiers are special people. They wear uniforms, and their very important job is to help keep their country safe. They are like guardians for their country! They help make sure everyone is safe and sound inside their own country. They usually stay inside their country's borders, protecting their home and its people. Their job is to keep peace and order.\n\nDid you know? Africa is the second-largest continent in the world! It has 54 countries, and each one is special in its own way. We have so much to learn about our big, beautiful continent!\n\n<h3>Talking Like Good Neighbors</h3>\n\nSometimes, even good neighbors can have a little misunderstanding or an argument. It's like when you and your friend might not agree on which game to play. When this happens between countries, they talk to each other. Talking is very important to solve problems, just like your teacher tells you! It's always best to use our words and listen.\n\nRight now, Ethiopia is asking its neighbor, Eritrea, to make sure all of its soldiers are staying inside Eritrea's borders. Ethiopia is saying, \"Please, can all your soldiers stay in your own country, right near our shared border?\" This is like asking a friend to keep their toys in their own yard.\n\nDid you know? Eritrea has a beautiful coastline along the Red Sea! It has amazing beaches and islands. Imagine playing in the sand by the sparkling blue water! Many different kinds of fish live in the Red Sea too.\n\n<h3>What Eritrea Says</h3>\n\nEritrea, on the other hand, has said, \"No, that's not true! Our soldiers are not in Ethiopia helping anyone who might be causing trouble.\" They are saying that their soldiers are not doing what Ethiopia is worried about. This is called 'denying' something – it means saying 'no, it didn't happen' or 'no, it's not true'.\n\nSo, we have Ethiopia asking something, and Eritrea saying something else. It's like when two friends have different ideas about what happened. What do good friends do then? They keep talking! They try to understand each other's side of the story. This is how grown-ups solve problems, too.\n\n<h3>Why Is This Important?</h3>\n\nWhy is all this talking important, my little friends? Because everyone wants peace! Peace means being happy, safe, and not having any fights or worries. When countries are at peace, people can go to school, play with their friends, and grow up strong and healthy. It means everyone can live happily in their own homes, in their own countries. Nobody wants to worry about things.\n\nWhen soldiers stay inside their own borders, it helps everyone feel safe. It shows that countries respect each other's space, just like you respect your friend's toys or their turn on the swing. Respect is a very important word, and it means showing care for others and their things.\n\nDid you know? The African proverb says: 'If you want to go fast, go alone. If you want to go far, go together.' This means working together is always better for a long, happy journey! It's better to be friends than to fight.\n\n<h3>Let's All Be Friends!</h3>\n\nSo, what we are hearing is that Ethiopia wants its neighbor, Eritrea, to make sure soldiers are only in Eritrea. And Eritrea says its soldiers are not in Ethiopia doing anything wrong. The grown-ups in charge of these countries are talking about it. They are trying to find the best way forward for everyone.\n\nWe hope that Ethiopia and Eritrea, like good neighbors, will keep talking and work things out. When countries talk kindly and listen to each other, they can find the best way for everyone to live in peace and friendship. That's what we all wish for our big African family! Let's send them happy thoughts for peace and friendship! Remember, even when things are tricky, talking helps a lot.\n\nStay curious, stay kind, and remember to always be a good neighbor, no matter where you are!",
    "summary": "Ethiopia is asking its neighbor Eritrea to make sure all of Eritrea's soldiers stay inside Eritrea near their shared border, while Eritrea says its soldiers are not in Ethiopia helping anyone cause trouble.",
    "whyMatters": "This is important because when neighbor countries talk and respect each other's space, everyone can live safely and happily in peace, like good friends playing together.",
    "category": "world",
    "date": "2026-02-08T21:22:22.083Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Talk%20About%20Our%20Neighbors%3A%20Ethiopia%20and%20Eritrea!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-talk-about-our-neighbors-ethiopia-and-eritrea",
    "originalLink": "https://www.bbc.com/news/articles/cn87lzrj1l7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man named in South Africa's police corruption probe found dead",
    "title": "Learning About Fairness: Our Helpers in Africa!",
    "content": "<h3>Hello, Super Kids of Africa!</h3>\n\nHello everyone! It’s me, your friendly news reporter for Africa. I’m so happy to chat with you today! We live on a big, beautiful continent full of amazing people and places. Today, we’re going to learn about something very important: fairness and how people help to keep us safe.\n\n<h3>What Do Our Police Do?</h3>\n\nHave you ever seen a police officer? They wear uniforms and have special cars. Our police officers are very important helpers in our communities. They are like the referees in a game. Their job is to make sure everyone follows the rules. This helps keep us all safe and happy. They help if someone gets lost, or if there is an accident. They are brave people who work hard every day.\n\nDid you know? In South Africa, police officers are called the South African Police Service, or SAPS! They have different colours on their cars, but they all work for safety.\n\n<h3>Why Are Rules Important?</h3>\n\nImagine playing a game without any rules. It would be very messy, right? No one would know what to do, and it wouldn't be fair. Rules are super important because they help us live together nicely. They tell us what is safe and what is not. They help us treat each other with kindness and respect. When everyone follows the rules, our towns and cities are much happier places to be.\n\nDid you know? Some rules are for big things, like not hurting others. Other rules are for smaller things, like waiting for your turn on the slide! All rules help us live together.\n\n<h3>A Special Big Investigation</h3>\n\nSometimes, even big grown-ups don't always follow the rules. This can happen anywhere, even with people who are supposed to help us, like some police officers. When this happens, it's called \"breaking the rules\" or \"doing things that are not fair.\" When police officers do things that are not fair, it's a very big problem. So, a special group of grown-ups starts a big \"investigation.\" This means they look very carefully for clues and ask many questions. They want to find out what happened and make sure fairness comes back.\n\n<h3>Helping to Find the Truth</h3>\n\nIn South Africa, there was a big investigation like this. It was about some police officers not following the rules. A man named Mr. Wiandre Pretorius was helping with this investigation. He was telling people what he knew to help find the truth. This was a very brave thing to do. When someone tells the truth to help make things fair, it's called being a \"whistleblower.\" They help shine a light on problems.\n\n<h3>What Happened to Mr. Pretorius?</h3>\n\nSadly, we have some news about Mr. Pretorius. He was a person who was helping to find out if some rules were broken. He told people that he had a scary moment recently where someone tried to hurt him because he was helping. That sounded very frightening. Now, we've heard that Mr. Pretorius is no longer with us. Grown-ups are still finding out exactly what happened. It is a sad time when someone who was helping is gone.\n\nDid you know? Even when sad things happen, brave people keep working to make sure our communities stay safe and fair. The investigation is still continuing.\n\n<h3>Working for Fairness and Justice</h3>\n\nEven though this news is a bit sad, it's important to remember that many, many good people are working hard. They want to make sure that everyone, even police officers, follows the rules. This is called working for \"justice.\" Justice means making things fair for everyone. When rules are broken, it's important to fix them. And when someone does something unfair, they should learn why it was wrong. This helps our community stay strong.\n\nDid you know? In South Africa, there are many organisations that work to make sure human rights are protected. This means everyone is treated fairly and with respect!\n\n<h3>Keeping Everyone Safe</h3>\n\nThe grown-ups in charge are working very hard to keep everyone safe. They want to make sure that the police force is full of honest people who always follow the rules. It’s like when your teacher makes sure everyone plays fairly in the classroom. When you see police officers, remember that most of them are really good people who want to help you. They are there to protect you and your family.\n\n<h3>Let's Be Kind and Strong!</h3>\n\nSo, what can we learn from this? We learn that rules are important. We learn that it's brave to tell the truth. And we learn that even when tricky things happen, people keep working together to make things fair. We can all help by being kind to each other and by telling a trusted grown-up if we ever see something that doesn't feel right. Let's keep being super kids, learning and growing and helping our beautiful Africa shine!",
    "summary": "A man named Mr. Wiandre Pretorius, who was bravely helping a big investigation in South Africa about some police officers not following rules, is no longer with us, but grown-ups are still working hard to make sure everything is fair and safe.",
    "whyMatters": "This is important because it shows that rules are for everyone, even police, and many people are working hard to make sure our communities are fair and safe for all kids and grown-ups in Africa.",
    "category": "world",
    "date": "2026-02-08T21:22:44.726Z",
    "image": "https://image.pollinations.ai/prompt/Learning%20About%20Fairness%3A%20Our%20Helpers%20in%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "learning-about-fairness-our-helpers-in-africa",
    "originalLink": "https://www.bbc.com/news/articles/c0j5pg0597po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Venezuela opposition politician Juan Pablo Guanipa released",
    "title": "Venezuela opposition politician Juan Pablo Guanipa released",
    "content": "Machado ally says 'there's a lot to talk about regarding the present and future of Venezuela' after release.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-08T21:22:50.056Z",
    "image": "https://image.pollinations.ai/prompt/Venezuela%20opposition%20politician%20Juan%20Pablo%20Guanipa%20released%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "venezuela-opposition-politician-juan-pablo-guanipa-released",
    "originalLink": "https://www.aljazeera.com/news/2026/2/8/venezuela-opposition-politician-juan-pablo-guanipa-released?traffic_source=rss"
  },
  {
    "originalTitle": "Building collapse in northern Lebanon kills at least six people",
    "title": "Brave Helpers After a Building Falls Down Far Away",
    "content": "<h3>Hello, Friends! News From Far Away</h3>\n\nHello, super kids! It’s your friendly news reporter here, bringing you important news from around the world. Today, we are talking about something sad that happened very far away from our beautiful Africa, in a country called Lebanon. \n\nIt's a place with lots of people, just like our towns and cities. Sometimes, sad things happen, but it’s also a time to remember the brave helpers.\n\n<h3>What Happened in Lebanon?</h3>\n\nImagine a tall building where people live and play. Sadly, a building like that fell down. It was very sudden and made a big mess. This happened in a town in northern Lebanon.\n\nWhen a big building falls, it's called a 'building collapse'. It means the building cannot stand up anymore, and it breaks into many pieces.\n\nSome grown-ups told us that at least six people sadly did not make it. And seven more people got hurt. It makes us feel a little bit sad when we hear this news.\n\n<h3>Meet the Brave Helpers!</h3>\n\nBut here is the good news part! When something like this happens, many, many brave people come to help. They are called 'rescue teams'.\n\nThese teams are like superheroes! They rush to the place where the building fell. Their job is to find anyone who might be stuck under the big pieces of the building.\n\nDid you know? Rescue teams work very hard and fast, even when it's dark or raining. They want to help everyone they can!\n\n<h3>What is Rubble?</h3>\n\nWhen a building falls down, all the pieces of brick, wood, and metal that break off are called 'rubble'. It’s like a giant pile of building blocks, but much bigger and messier.\n\nIt’s very hard to move these big piles of rubble. So, the rescue teams use special tools. They have big machines that can lift heavy pieces.\n\nThey also use their hands to carefully move smaller pieces, looking for people. It takes a lot of strength and care.\n\n<h3>Why Do Buildings Fall Down?</h3>\n\nThat's a very good question! Most buildings are very strong and stay up for a long, long time. But sometimes, buildings can get old, just like our grandparents.\n\nIf a building is very old, its parts might become weak. Or, maybe it was not built strong enough from the start. Bad weather, like strong winds or heavy rain, can also make old buildings weaker.\n\nDid you know? Engineers are special grown-ups who design buildings to be super strong and safe! They make sure buildings can stand up for many, many years.\n\n<h3>How Do Rescuers Find People?</h3>\n\nThis is a really amazing part of the story! Rescue teams don't just use their eyes. They have special friends who help them: dogs!\n\nYes, very smart and brave dogs called 'search and rescue dogs'. These dogs have super noses! They can sniff and find people even when they are buried under the rubble.\n\nDid you know? These special dogs train for a long time to learn how to find people. They are truly heroes with four paws!\n\nThe rescue teams also use special cameras that can go into small spaces. And they listen very carefully for any sounds that might tell them someone is there.\n\n<h3>What Can We Learn?</h3>\n\nThis sad news from Lebanon reminds us that safety is very important. It teaches us to be thankful for our homes and the people who build them strong.\n\nIt also teaches us about helping each other. When something bad happens, people from all over the world, even from Africa, think about the people who are hurting.\n\nWe send them our good thoughts and hopes. And we learn about the amazing work of rescue teams.\n\nDid you know? People in different countries sometimes send help to each other after big problems. They send doctors, food, and even more rescue teams!\n\n<h3>Thinking of Everyone</h3>\n\nSo, while we hear this sad news, let's remember the brave people helping in Lebanon. They are working hard to make things better.\n\nAnd let's think about the people who lost their homes or got hurt. We hope they get well soon and can build new, strong homes.\n\nIt shows us that even when sad things happen, there are always kind and brave people ready to help. And that's a very important message for all of us, no matter where we live in the world.\n\nStay safe and be kind, everyone!",
    "summary": "A building fell down in a country called Lebanon, hurting some people and sadly taking the lives of others, but brave rescue teams are working very hard to find and help everyone.",
    "whyMatters": "This news is important because it shows us that even when sad things happen, there are always brave helpers who come to save people, and it reminds us to be thankful for safe homes and to care about people in other countries.",
    "category": "world",
    "date": "2026-02-08T21:23:07.079Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Helpers%20After%20a%20Building%20Falls%20Down%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-helpers-after-a-building-falls-down-far-away",
    "originalLink": "https://www.aljazeera.com/news/2026/2/8/building-collapse-in-northern-lebanon-kills-at-least-six?traffic_source=rss"
  },
  {
    "originalTitle": "Man City fight back to win 2-1 at Liverpool and keep title hopes alive",
    "title": "Man City fight back to win 2-1 at Liverpool and keep title hopes alive",
    "content": "‌Stoppage-time penalty from Erling Haaland gives City ‍dramatic win and narrows gap to ⁠leaders Arsenal to six points.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "entertainment",
    "date": "2026-02-08T21:23:12.250Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20fight%20back%20to%20win%202-1%20at%20Liverpool%20and%20keep%20title%20hopes%20alive%20realistic%20news%20photography%20context%20Entertainment%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-fight-back-to-win-2-1-at-liverpool-and-keep-title-hopes-alive",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/8/man-city-come-back-to-win-2-1-at-liverpool-and-keep-title-hopes-alive?traffic_source=rss"
  },
  {
    "originalTitle": "Japan's PM Takaichi on course for landslide victory in snap election",
    "title": "Japan's PM Takaichi on course for landslide victory in snap election",
    "content": "A coalition led by current Prime Minister Sanae Takaichi is expected to clinch a decisive win, an exit poll suggests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-08T21:23:17.960Z",
    "image": "https://image.pollinations.ai/prompt/Japan's%20PM%20Takaichi%20on%20course%20for%20landslide%20victory%20in%20snap%20election%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "japans-pm-takaichi-on-course-for-landslide-victory-in-snap-election",
    "originalLink": "https://www.bbc.com/news/articles/cx2y7d2z29xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Thai PM claims election victory with conservatives well ahead of rivals",
    "title": "Thai PM claims election victory with conservatives well ahead of rivals",
    "content": "The ruling conservatives defied opinion polls predicting a win for the reformist People's Party.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-08T21:23:23.132Z",
    "image": "https://image.pollinations.ai/prompt/Thai%20PM%20claims%20election%20victory%20with%20conservatives%20well%20ahead%20of%20rivals%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "thai-pm-claims-election-victory-with-conservatives-well-ahead-of-rivals",
    "originalLink": "https://www.bbc.com/news/articles/cx2jn4z4eq0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russia names three suspects in shooting of general",
    "title": "Russia names three suspects in shooting of general",
    "content": "The suspects include the alleged gunman, Lyubomir Korba, whom Russia says fled to the UAE after the attack.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-08T21:23:28.319Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20names%20three%20suspects%20in%20shooting%20of%20general%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-names-three-suspects-in-shooting-of-general",
    "originalLink": "https://www.bbc.com/news/articles/cy7j6xe8862o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "title": "'Killjoy' - did VAR get late drama in Liverpool v Man City right?",
    "content": "Manchester City's win at Liverpool ended in complete chaos - but did the referee and the VAR get Dominik Szoboszlai's red card right?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "entertainment",
    "date": "2026-02-08T21:23:33.915Z",
    "image": "https://image.pollinations.ai/prompt/'Killjoy'%20-%20did%20VAR%20get%20late%20drama%20in%20Liverpool%20v%20Man%20City%20right%3F%20realistic%20news%20photography%20context%20Entertainment%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killjoy-did-var-get-late-drama-in-liverpool-v-man-city-right",
    "originalLink": "https://www.bbc.com/sport/football/articles/c5yjkgyxk2mo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watch: The Women's Football Show",
    "title": "Watch: The Women's Football Show",
    "content": "Highlights and analysis of all the action from the Women’s Super League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-08T21:23:39.077Z",
    "image": "https://image.pollinations.ai/prompt/Watch%3A%20The%20Women's%20Football%20Show%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "watch-the-womens-football-show",
    "originalLink": "https://www.bbc.co.uk/iplayer/episode/l0057wfc?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I know who I am' - Chelsea boss Bompastor defiant after tough week",
    "title": "'I know who I am' - Chelsea boss Bompastor defiant after tough week",
    "content": "Chelsea manager Sonia Bompastor has not had many tougher weeks in her managerial career and was defiant following their win at Tottenham.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-02-08T21:23:44.235Z",
    "image": "https://image.pollinations.ai/prompt/'I%20know%20who%20I%20am'%20-%20Chelsea%20boss%20Bompastor%20defiant%20after%20tough%20week%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-know-who-i-am-chelsea-boss-bompastor-defiant-after-tough-week",
    "originalLink": "https://www.bbc.com/sport/football/articles/cjwz3nw5xz2o?at_medium=RSS&at_campaign=rss"
  }
]