[
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Nelson Mandela's Special Things Find New Homes!",
    "content": "Hello, my super friends! It's your kid-friendly African News reporter here! I have an exciting story for you today. It's all about a very, very special hero from Africa, Nelson Mandela! We're going to talk about some of his things, like a key, sunglasses, and a shirt. And guess what? His daughter can now sell them! Isn't that interesting?\n\n<h3>Who Was Nelson Mandela?</h3>\nImagine a super brave man. A man who was like a real-life superhero, but without a cape! That was Nelson Mandela. He was from a country called South Africa. He loved all people very much. He wanted everyone to be treated fairly and have freedom. He worked super hard to make his country a happy place for everyone.\n\nDid you know? Nelson Mandela spent many, many years in a prison. He was there because he wanted all people, no matter their skin color, to be equal. He never gave up!\n\n<h3>What Are These Special Things?</h3>\nOkay, so what are these special things we are talking about? There are three of them!\n\nFirst, there is a **prison key**. Now, this is not just any key you use to open your house door. This key is super special because it was used at the prison where Nelson Mandela lived for a long, long time. It reminds us of his bravery and how he never gave up, even when things were hard.\n\nSimple explanation: A prison is a place where grown-ups go if they break the rules. But Nelson Mandela was in prison because he wanted to make things fair for everyone. He wanted peace and kindness. This key is a symbol of his long journey.\n\nNext, there are his **cool sunglasses**. Do you wear sunglasses when it's sunny? Nelson Mandela did too! These weren't just any sunglasses. They were *his* sunglasses. He wore them when he was meeting important people and working for peace. These sunglasses saw many important moments in history!\n\nAnd last, there is his **favourite shirt**. We all have clothes we love to wear, right? This shirt was one of Nelson Mandela's special shirts. It was part of his everyday life. Clothes can hold special memories. This shirt is like a soft hug from history, reminding us of him.\n\n<h3>Why Are These Things So Important?</h3>\nYou might be thinking, \"Why are these things so important?\" Well, they are like treasures! They help us remember Nelson Mandela and his super brave journey. They remind us of the important lessons he taught us: to be free, to be fair, and to never, ever give up on what is right. These items are like clues to his amazing life.\n\nDid you know? Nelson Mandela is loved by people all over the world, not just in Africa!\n\n<h3>What Happened with the Court?</h3>\nSo, Nelson Mandela's daughter, her name is Makaziwe, wanted to sell these special things. When you \"sell\" something, it means someone else can buy it and take care of it.\n\nBut the grown-ups who work for the government, we call them \"the authorities,\" said, \"Wait! These items are super important for all of South Africa!\" They felt these things were part of the \"country's heritage.\"\n\nSimple explanation: \"Heritage\" means very old and special things, like stories, buildings, or objects, that belong to a country and help tell its amazing history. Like your grandma's special necklace that has been in your family for a long time!\n\nThe government was also worried that the items might be \"exported.\" Simple explanation: \"Export\" means taking something from one country to another country. They wanted them to stay in South Africa.\n\nSo, they had a \"court battle.\" Simple explanation: A court battle is when people have a very big disagreement, and a special judge listens to both sides to help decide what is fair and right. It's like having a referee in a game!\n\n<h3>Good News! What Was Decided?</h3>\nThe judge listened very carefully to everyone. And guess what? The judge decided that Nelson Mandela's daughter, Makaziwe, *can* sell these items! This is good news for her. It means these special things can find new homes where people will love them and keep them safe. It's a way for more people to remember Nelson Mandela.\n\nDid you know? Judges help make sure rules are followed and everyone is treated fairly!\n\n<h3>What Does This Mean for Us?</h3>\nEven if these special things go to new places, the most important part of Nelson Mandela is still with us. His amazing story will always live in our hearts. It reminds us to be brave, to be kind, and to always work for peace and fairness, just like he did. His spirit lives on!\n\nDid you know? Nelson Mandela won a super important award called the Nobel Peace Prize because he worked so hard to bring peace to the world!\n\n<h3>Conclusion</h3>\nSo, a special key, cool sunglasses, and a beloved shirt will now have new adventures. But the biggest treasure, Nelson Mandela's lessons, will always stay in our hearts. That's all for today from your African News friend! See you next time!",
    "summary": "Nelson Mandela's daughter can now sell some of his special things, like his prison key, sunglasses, and a shirt, after a judge said it was okay.",
    "whyMatters": "It matters because these items help us remember Nelson Mandela and his brave fight for fairness and peace for everyone in Africa and the world.",
    "category": "world",
    "date": "2026-01-24T03:23:35.574Z",
    "image": "https://image.pollinations.ai/prompt/Nelson%20Mandela's%20Special%20Things%20Find%20New%20Homes!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nelson-mandelas-special-things-find-new-homes",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:23:40.723Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "title": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "content": "Reinforcements are sent to the town of Bor, a strategic staging post on the way to the capital, Juba.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:23:45.864Z",
    "image": "https://image.pollinations.ai/prompt/South%20Sudan%20army%20chief%20gives%20soldiers%20seven%20days%20to%20crush%20rebellion%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-sudan-army-chief-gives-soldiers-seven-days-to-crush-rebellion",
    "originalLink": "https://www.bbc.com/news/articles/cj0nn0dvg6jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russian ‘shadow fleet’ tanker diverted to French port by naval forces",
    "title": "Russian ‘shadow fleet’ tanker diverted to French port by naval forces",
    "content": "French prosecutors say Russia-linked tanker 'Grinch' under investigation after interception in western Mediterranean.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:23:51.079Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20%E2%80%98shadow%20fleet%E2%80%99%20tanker%20diverted%20to%20French%20port%20by%20naval%20forces%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-shadow-fleet-tanker-diverted-to-french-port-by-naval-forces",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/russian-shadow-fleet-tanker-diverted-to-french-port-by-naval-forces?traffic_source=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,430",
    "title": "Russia-Ukraine war: List of key events, day 1,430",
    "content": "These are the key developments from day 1,430 of Russia’s war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:23:56.209Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C430%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1430",
    "originalLink": "https://www.aljazeera.com/news/2026/1/23/russia-ukraine-war-list-of-key-events-day-1430?traffic_source=rss"
  },
  {
    "originalTitle": "In US ally Thailand, feelings of betrayal after Trump’s visa freeze",
    "title": "In US ally Thailand, feelings of betrayal after Trump’s visa freeze",
    "content": "Thais who planned to build a life in the US express shock at inclusion on list of blacklisted countries.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:24:01.339Z",
    "image": "https://image.pollinations.ai/prompt/In%20US%20ally%20Thailand%2C%20feelings%20of%20betrayal%20after%20Trump%E2%80%99s%20visa%20freeze%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "in-us-ally-thailand-feelings-of-betrayal-after-trumps-visa-freeze",
    "originalLink": "https://www.aljazeera.com/news/2026/1/23/in-us-ally-thailand-feelings-of-betrayal-after-trumps-visa-freeze?traffic_source=rss"
  },
  {
    "originalTitle": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "title": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "content": "The US president's comments have been condemned by international allies, including UK veterans and politicians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T03:24:06.971Z",
    "image": "https://image.pollinations.ai/prompt/Harry%20says%20sacrifices%20by%20Nato%20troops%20in%20Afghanistan%20deserve%20'respect'%20%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "harry-says-sacrifices-by-nato-troops-in-afghanistan-deserve-respect",
    "originalLink": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "content": "Brits, Canadians and Danes were among those who saw the toughest fighting, writes the BBC's security correspondent.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:24:12.110Z",
    "image": "https://image.pollinations.ai/prompt/Frank%20Gardner%3A%20Not%20only%20Americans%20risked%20life%20and%20limb%20to%20serve%20in%20Afghanistan%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "frank-gardner-not-only-americans-risked-life-and-limb-to-serve-in-afghanistan",
    "originalLink": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "High stakes but low expectations for Ukraine talks with Russia and US",
    "title": "High stakes but low expectations for Ukraine talks with Russia and US",
    "content": "Donald Trump is pushing hard for a peace deal - but major issues between Russia and Ukraine are still unresolved, writes Sarah Rainsford.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:24:17.242Z",
    "image": "https://image.pollinations.ai/prompt/High%20stakes%20but%20low%20expectations%20for%20Ukraine%20talks%20with%20Russia%20and%20US%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "high-stakes-but-low-expectations-for-ukraine-talks-with-russia-and-us",
    "originalLink": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Euros abuse made me not want to leave hotel - Carter",
    "title": "Euros abuse made me not want to leave hotel - Carter",
    "content": "England defender Jess Carter says abuse of female footballers is getting worse and that she has had to step back from social media after receiving racist messages during Euro 2025.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-24T03:24:22.556Z",
    "image": "https://image.pollinations.ai/prompt/Euros%20abuse%20made%20me%20not%20want%20to%20leave%20hotel%20-%20Carter%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "euros-abuse-made-me-not-want-to-leave-hotel-carter",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd0y353v2x5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spurs open talks to sign Liverpool's Robertson",
    "title": "Spurs open talks to sign Liverpool's Robertson",
    "content": "Tottenham enter into talks with Liverpool as they look to secure a deal for left-back Andy Robertson.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T03:24:27.695Z",
    "image": "https://image.pollinations.ai/prompt/Spurs%20open%20talks%20to%20sign%20Liverpool's%20Robertson%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spurs-open-talks-to-sign-liverpools-robertson",
    "originalLink": "https://www.bbc.com/sport/football/articles/c79rr2440elo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palmer 'very, very happy' at Chelsea, says Rosenior",
    "title": "Our Friend Cole Palmer is Super Happy!",
    "content": "Hello, wonderful friends! Your super news reporter from Africa is here!\nToday, we have some exciting news about a super talented football player.\nHis name is Cole Palmer. He plays for a big, famous team called Chelsea.\n\n<h3>Who is Cole Palmer?</h3>\nCole Palmer is a young man who is very, very good at playing football.\nHe is a \"forward.\" This means he tries his best to score goals for his team!\nHe runs super fast and kicks the ball with amazing skill.\nMany people love to watch him play because he is so talented and fun to watch.\n\n<h3>What is Chelsea Football Club?</h3>\nChelsea is a really famous football team from a country called England.\nTheir team wears bright blue jerseys. Blue is their special, favourite colour!\nThey play in a big, exciting stadium with lots and lots of cheering fans.\nIt’s like a big family of players all working together to win games and have fun.\n\n<h3>Did You Know? Amazing Football Facts!</h3>\nDid you know that football is the most popular sport in the whole wide world?\nLots of kids in Africa love to play football too, just like Cole Palmer!\nYou can play with your friends, even with just one ball and some open space. It’s so much fun!\n\n<h3>A Little Story About Feelings</h3>\nSometimes, grown-up people talk about players moving to different teams.\nRecently, some grown-ups were saying that Cole Palmer might be \"homesick.\"\nHomesick means you miss your home, your family, or your friends very much.\nIt's like when you go to school for the first time, and you miss your mum or dad a little bit.\n\n<h3>It's Okay to Miss Home Sometimes</h3>\nFeeling homesick is a normal feeling. Everyone feels it sometimes, even grown-ups like teachers.\nMaybe when you visit your grandma's house, you miss your own bed or your favourite toy at home.\nBut a special friend of Cole Palmer says he is not homesick at all! He is happy!\n\n<h3>A Special Friend Speaks Up!</h3>\nCole Palmer has a good friend and a coach named Liam Rosenior.\nLiam Rosenior said something very important and kind to everyone.\nHe said Cole Palmer is \"very, very happy\" at Chelsea! What wonderful news!\nThat's super excellent news, isn't it? He feels good and likes where he is playing his football.\n\n<h3>What Does \"Very, Very Happy\" Mean?</h3>\nIt means Cole loves playing for Chelsea with all his heart and a big smile.\nHe likes his teammates and his coaches very much. They are like his second family.\nHe enjoys going to practice every single day to get stronger and better at football.\nAnd he loves trying his best to score amazing goals for his team in the bright blue jersey!\n\n<h3>Did You Know? About Good Friends!</h3>\nDid you know that having good friends around you can make you feel super happy and strong?\nWhen someone supports you and says kind words, it helps you feel brave and confident to do anything!\nLiam Rosenior is being a very good friend and helper to Cole Palmer. That is so kind!\n\n<h3>Why Do People Talk About Other Teams?</h3>\nSometimes, other big football teams might want a really good player like Cole Palmer.\nThere were talks about another famous team called Manchester United.\nManchester United is another big team, and their special colours are red and white!\nThey might have wanted Cole to play for them and wear their red shirt instead.\n\n<h3>But Cole Likes His Team!</h3>\nEven though other teams might be interested, Cole is happy right where he is.\nHe is focusing all his energy on playing his very best football for Chelsea.\nHe is concentrating on helping his blue team win all their games and make their fans proud!\nThat shows how loyal and dedicated he is to his blue club and his friends in the team.\n\n<h3>Working Hard and Having Fun!</h3>\nCole Palmer works very hard every single day to be a super player for his team.\nHe practices his kicks, his passes, and his running skills. He wants to be the best!\nHe does this so he can be the very best player he can be for his team and for himself.\nAnd he gets to have lots of fun doing what he loves the most – playing football!\n\n<h3>Did You Know? About Practice!</h3>\nDid you know that practicing something every day makes you much, much better at it?\nJust like practicing your ABCs or counting helps you in school every single day to learn!\nHard work helps you reach your big, wonderful dreams. So keep trying your best!\n\n<h3>Dreams Come True!</h3>\nCole Palmer probably dreamed of playing for a big, famous team when he was a tiny little boy, just like you!\nNow, his dream has come true! He is living his dream right now, playing football.\nHe is playing football in front of many happy people and scoring fantastic goals.\nAnd he is doing a truly great job! We are so proud of him and his hard work.\n\n<h3>Staying Positive and Strong!</h3>\nIt's important to always stay positive and think happy thoughts, even when things are hard.\nWhen you feel good in your heart, you play good on the field! It helps so much.\nCole Palmer is showing everyone that he is strong, happy, and ready for anything.\nHe is ready to keep scoring amazing, super goals for Chelsea! Go Cole!\n\n<h3>Our Special Message to Cole!</h3>\nWe wish Cole Palmer all the very best from Africa! We are cheering for you!\nKeep shining bright on the football field with your blue team and your big smile!\nWe are so happy that you are happy with your wonderful blue team and all your friends there.\nKeep smiling and playing your amazing, cheerful football for everyone to enjoy!\n\n<h3>Did You Know? About Cheering!</h3>\nDid you know that cheering loudly for your favorite team can make the players feel super special?\nYour happy cheers give them more energy to run faster and score more goals for you!\nSo, let's cheer super loud for Cole Palmer and Chelsea! Hip hip hooray!\n\n<h3>Conclusion</h3>\nSo, there you have it, our dear friends!\nCole Palmer is happy at Chelsea. He is doing super well and working hard.\nAnd he is ready to keep playing his wonderful, happy football for everyone to see and enjoy.\nRemember to always be happy and chase your dreams with a big smile, just like Cole!\nThis is your African news reporter, signing off! See you next time for more fun news!",
    "summary": "Cole Palmer, a super football player for the famous Chelsea team, is very happy playing for his team, even though some people thought he might be sad or homesick.",
    "whyMatters": "It matters because it's good to know our favourite players are happy and enjoying what they do, and it reminds us to stay positive and love our own games and dreams too!",
    "category": "world",
    "date": "2026-01-24T03:24:57.233Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Friend%20Cole%20Palmer%20is%20Super%20Happy!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-friend-cole-palmer-is-super-happy",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy8ylx03yqqo?at_medium=RSS&at_campaign=rss"
  }
]