[
  {
    "originalTitle": "Robert Mugabe's son charged with attempted murder in South Africa",
    "title": "Robert Mugabe's son charged with attempted murder in South Africa",
    "content": "Bellarmine Mugabe and one other man have not commented on the charges after a 23-year-old was shot.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:53:59.704Z",
    "image": "https://image.pollinations.ai/prompt/Robert%20Mugabe's%20son%20charged%20with%20attempted%20murder%20in%20South%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "robert-mugabes-son-charged-with-attempted-murder-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/cz9qk9y4d32o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Affront to humanity': Sudan slams Uganda for hosting RSF paramilitary boss",
    "title": "'Affront to humanity': Sudan slams Uganda for hosting RSF paramilitary boss",
    "content": "Sudan accuses Uganda of flouting international law by meeting Rapid Support Forces boss Mohamed Hamdan Dagalo.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-23T12:54:04.845Z",
    "image": "https://image.pollinations.ai/prompt/'Affront%20to%20humanity'%3A%20Sudan%20slams%20Uganda%20for%20hosting%20RSF%20paramilitary%20boss%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "affront-to-humanity-sudan-slams-uganda-for-hosting-rsf-paramilitary-boss",
    "originalLink": "https://www.bbc.com/news/articles/c20lwznegk4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Fishermen's Fun Day: A Festival for Peace in Nigeria!",
    "content": "Hello, my super friends across Africa and the world! It's your friendly reporter here, bringing you some super exciting news from a beautiful country called Nigeria. Nigeria is a very big country in Africa, full of amazing people and stories.\n\nGuess what? There was a fantastic festival there! A festival is like a big party that happens every year. This one was all about fishing, but it had a very special secret. It was also about bringing people together and making sure everyone stayed friends. How cool is that?\n\n<h3>A Big Day for Fishing!</h3>\n\nImagine a bright sunny day. Lots of people are gathered by a big river. They are all excited because it's time for a very special fishing contest! A contest is like a game where everyone tries their best to win. In this contest, people wanted to catch the biggest fish!\n\nFishermen, young and old, stood by the water. They had their fishing nets and lines ready. Some wore colorful clothes, and their smiles were even brighter. Everyone was waiting for the signal to start.\n\nWhen the signal came, whoosh! The nets flew into the water. People waited patiently, hoping to feel a big tug. Catching a fish can be tricky, but it's very exciting! Everyone wanted to show off their biggest catch.\n\nDid you know? Nigeria has many long rivers and lakes, perfect places for fish to live and grow big! Many different kinds of fish swim in Nigerian waters.\n\n<h3>Fun and Games for Everyone</h3>\n\nBut this festival was not just about fishing. Oh no, it was much more than that! A festival is a time for everyone to have fun together. There was lots of music playing. People were dancing with happy feet and singing along.\n\nLittle children ran around, playing games and laughing. Grown-ups were chatting, telling stories, and sharing food. Imagine yummy treats and delicious smells all around! It was a day full of joy and friendship.\n\nPeople from many different villages came to this festival. It was a chance for them to see each other, say hello, and have a good time. Festivals are wonderful because they bring communities closer.\n\nDid you know? Nigeria is famous for its lively music and dances! Music is a big part of their celebrations.\n\n<h3>Why Do They Fish? It's Special!</h3>\n\nNow, here's the super special secret about this fishing festival. It wasn't just for fun or to catch fish. This festival had a very important job. It helped to bring peace to the villages nearby.\n\nWhat is peace? Peace means being friends, not fighting, and being happy together. When there is peace, everyone feels safe and loved. Sometimes, people in different villages might have small disagreements. This festival helps them forget those little problems.\n\nThis fishing contest has been happening for a very, very long time. It started many years ago, and it grew from efforts to make sure everyone stayed friends. It's like a special promise to always live in peace.\n\nDid you know? When people share good times and laughter, it helps them forget their differences and become better friends!\n\n<h3>Making Friends, Not Fights</h3>\n\nSo, how does fishing help with peace? Well, when people from different places come together for something fun like a fishing contest, they meet each other. They see each other's smiles and hear each other's laughter.\n\nThey stand side-by-side, trying to catch fish. They cheer for each other. They share tips. This helps them remember that even if they live in different villages, they are all part of one big community, like a big family.\n\nWhen you play and have fun with someone, it's harder to be angry with them later. This festival helps everyone remember that being friends is much better than having any arguments. It helps to make their friendship strong, like super glue!\n\nDid you know? Sharing a meal or playing a game together is one of the best ways to make new friends and keep old ones strong!\n\n<h3>The Big Catch!</h3>\n\nAfter hours of careful fishing, the time came to see who had the biggest catch! Everyone gathered around, eyes wide with excitement. Fishermen brought their fish to be measured. Cheers erupted when a really big fish was shown!\n\nThe person who caught the biggest fish was a winner! But really, everyone felt like a winner because they had such a wonderful day. They had spent time with friends and family, enjoyed the music, and helped make their community peaceful.\n\nWinning a prize is nice, but the biggest prize was the joy and friendship shared by everyone at the festival. It showed that good fun can bring good things, like peace, to a whole community.\n\n<h3>A Message of Peace from Nigeria</h3>\n\nThis amazing fishing festival in Nigeria teaches us a very important lesson. It shows us that even simple things, like a fishing contest, can have a big purpose. They can help people live together in peace and happiness.\n\nNigeria is a country that loves to celebrate, and it loves peace. This festival is a beautiful example of how traditions can help build strong and friendly communities. It's a reminder that we can all work together to make the world a more peaceful place.\n\nDid you know? Nigeria is home to over 200 million people, making it the most populated country in Africa! All these people working together can do amazing things.\n\nWhat a truly wonderful story from Africa! It shows us how fun and games can also make the world a better, kinder, and more peaceful place for everyone. Keep shining, Nigeria! And keep being friends, everyone! ",
    "summary": "In Nigeria, a lively fishing festival brings people together for a fun competition and celebration, but its most important goal is to help different communities stay friends and live in peace.",
    "whyMatters": "This festival is important because it uses fun and games to help people from different villages be friends and stop any fighting, making everyone happy and safe together.",
    "category": "world",
    "date": "2026-02-23T12:54:32.686Z",
    "image": "https://image.pollinations.ai/prompt/Fishermen's%20Fun%20Day%3A%20A%20Festival%20for%20Peace%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fishermens-fun-day-a-festival-for-peace-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Activists hang Andrew arrest photo at Louvre Museum",
    "title": "Activists hang Andrew arrest photo at Louvre Museum",
    "content": "Political activists hung a photo of the UK’s former Prince Andrew on the day of his arrest in the Louvre museum.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:54:38.800Z",
    "image": "https://image.pollinations.ai/prompt/Activists%20hang%20Andrew%20arrest%20photo%20at%20Louvre%20Museum%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "activists-hang-andrew-arrest-photo-at-louvre-museum",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/23/activists-hang-andrew-arrest-photo-at-louvre-museum?traffic_source=rss"
  },
  {
    "originalTitle": "‘You either fight or die’: Kenyans tricked into joining Russia-Ukraine war",
    "title": "‘You either fight or die’: Kenyans tricked into joining Russia-Ukraine war",
    "content": "More than 1,000 Kenyans and people from 36 African nations are fighting for Russia, many of them recruited fraudulently.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:54:43.925Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98You%20either%20fight%20or%20die%E2%80%99%3A%20Kenyans%20tricked%20into%20joining%20Russia-Ukraine%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "you-either-fight-or-die-kenyans-tricked-into-joining-russia-ukraine-war",
    "originalLink": "https://www.aljazeera.com/features/2026/2/23/you-either-fight-or-die-kenyans-tricked-into-joining-russia-ukraine-war?traffic_source=rss"
  },
  {
    "originalTitle": "US military begins withdrawing from key base in northeastern Syria",
    "title": "US military begins withdrawing from key base in northeastern Syria",
    "content": "Pullout comes after Syrian forces take control of northeast region from Kurdish-led SDF.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:54:49.074Z",
    "image": "https://image.pollinations.ai/prompt/US%20military%20begins%20withdrawing%20from%20key%20base%20in%20northeastern%20Syria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-military-begins-withdrawing-from-key-base-in-northeastern-syria",
    "originalLink": "https://www.aljazeera.com/news/2026/2/23/us-military-begins-withdrawing-from-key-base-in-northeastern-syria?traffic_source=rss"
  },
  {
    "originalTitle": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "content": "Steve Rosenberg reports on the economic consequences of Russia's war, and how people are coping.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:54:54.487Z",
    "image": "https://image.pollinations.ai/prompt/Four%20years%20into%20its%20full-scale%20war%20in%20Ukraine%2C%20Russia%20is%20feeling%20the%20effects%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "four-years-into-its-full-scale-war-in-ukraine-russia-is-feeling-the-effects",
    "originalLink": "https://www.bbc.com/news/articles/c4gj20xzw39o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "title": "A Brave Message from Far Away: Stopping Big Fights!",
    "content": "Hello, my dear friends, all across our amazing continent of Africa! It's me, your kid-friendly news reporter, here to share some super important news from far, far away. We're going to talk about a place called Ukraine and its brave leader, President Zelensky. He has a very important message for the whole world!\n\n<h3>News From Far Away</h3>\n\nImagine a country very far from us, across big oceans and lands. This country is called Ukraine. For a long time now, there has been a big problem there – a war. A war is when people fight very seriously, and it makes many, many people very sad. Homes get broken, and children sometimes have to leave their schools, their toys, and their friends. It's not a happy thing at all.\n\n<h3>Who is President Zelensky?</h3>\n\nThe leader of Ukraine is a very brave man named President Zelensky. He is like the head teacher of his whole country, trying his best to keep all his students, his people, safe and happy. He talks to leaders from other countries, asking for help and hoping for peace. He wants the fighting to stop so that children in Ukraine can play and learn safely again, just like you do.\n\nDid you know? Ukraine is a very big country in Europe! It has beautiful golden fields where lots and lots of sunflowers grow tall and bright!\n\n<h3>Talking to a Reporter</h3>\n\nPresident Zelensky recently sat down with a kind reporter from a big news company called the BBC. The reporter's name is Jeremy Bowen. Imagine talking to someone from a different school, telling them all about what's happening in your school. That's a bit like what President Zelensky did. He wanted the whole world to know about the sad things happening in Ukraine.\n\nHe spoke about the war and how super important it is for everyone to try and stop it. He said something very big, about stopping a \"World War Three.\"\n\n<h3>What is \"World War Three\"?</h3>\n\nNow, \"World War Three\" sounds like a very scary thing, doesn't it? It means a war that could get so, so big, it might involve many, many countries all over the world. Like if all the schools in your town, and then all the schools in your region, and then all the schools in your country started having big fights. No one wants that!\n\nPresident Zelensky is saying that the fighting in Ukraine is already very serious. He worries it could grow even bigger if people don't work together to make it stop. He wants to make sure this big, big war never, ever happens anywhere.\n\nDid you know? A \"reporter\" is someone who travels to places and asks questions to find out what is really happening. Then they tell everyone the news so we can all learn!\n\n<h3>Four Years of Fighting</h3>\n\nThis sad war in Ukraine has been going on for a very, very long time. Soon, it will be four whole years since it started. Four years is a long time for a child! It's like starting school and almost finishing primary school, with fighting still happening all that time. Imagine not being able to celebrate your birthday or go to a friend's party because of fighting. That's why President Zelensky wants peace so badly. He wants the children to have their childhoods back.\n\n<h3>Why Must It Be Stopped?</h3>\n\nPresident Zelensky believes that the person who started this fighting, another leader called Mr. Putin, needs to stop. When someone is doing something that hurts many people, it's important for everyone to say, \"Please stop!\" It's like when friends argue in the playground, and someone needs to be brave and say, \"Let's be kind instead and talk about it.\"\n\nStopping the war means saving lives. It means children can go back to school and learn. It means families can live in their homes again without fear of big bangs or having to run away. It means bringing back happiness and smiles to many, many people.\n\nDid you know? When countries talk to each other to solve problems instead of fighting, it's called \"diplomacy.\" It's like when you talk through a problem with your friend instead of yelling or hitting!\n\n<h3>Helping Each Other</h3>\n\nEven though Ukraine is far away, many good people around the world are trying to help. Some send food and medicine to people who need it. Some help children find safe places to stay, away from the fighting. It shows that even when sad things happen, people can still be kind and help each other. Our world is like a very big family. When one part of the family is hurting, it's important for other parts to try and help.\n\nDid you know? Many children around the world learn about peace in their schools. They learn how to share and be kind to avoid arguments and fighting, because peace makes everyone happy!\n\n<h3>Hope for Peace</h3>\n\nPresident Zelensky's words remind us all that peace is very, very important. He hopes that by speaking out, more people will understand how serious the situation is. He hopes that leaders from all over the world will come together and find a way to make the fighting stop forever. He wants everyone to work together for a better world.\n\nJust like we learn to share our toys and be kind to our friends in school, countries need to learn to share the world and be kind to each other. We all wish for a world where children everywhere can grow up safe and happy, without any wars. Let's all hope and pray for peace in Ukraine and all over the world. Thank you for listening, my friends!",
    "summary": "President Zelensky of Ukraine spoke to a reporter, saying that the big fight in his country, which has been going on for almost four years, is very serious and must be stopped to prevent an even bigger war that could involve many countries.",
    "whyMatters": "This is important because war makes many children sad and unsafe, so President Zelensky is asking everyone to help stop the fighting in his country and work for peace so that children everywhere can live happily and safely.",
    "category": "world",
    "date": "2026-02-23T12:55:18.468Z",
    "image": "https://image.pollinations.ai/prompt/A%20Brave%20Message%20from%20Far%20Away%3A%20Stopping%20Big%20Fights!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-brave-message-from-far-away-stopping-big-fights",
    "originalLink": "https://www.bbc.com/news/articles/cvgj9p15y87o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Cartel henchmen unleash violence after top drug lord killed in Mexico",
    "title": "Cartel henchmen unleash violence after top drug lord killed in Mexico",
    "content": "The death of the most-wanted Jalisco cartel chief sparks retaliatory violence in at least a dozen states in Mexico.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:55:23.598Z",
    "image": "https://image.pollinations.ai/prompt/Cartel%20henchmen%20unleash%20violence%20after%20top%20drug%20lord%20killed%20in%20Mexico%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cartel-henchmen-unleash-violence-after-top-drug-lord-killed-in-mexico",
    "originalLink": "https://www.bbc.com/news/articles/c795qgejzpxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How ruthless Arsenal exposed Tottenham's weaknesses",
    "title": "How ruthless Arsenal exposed Tottenham's weaknesses",
    "content": "MOTD pundit Danny Murphy explains why, as well as Arsenal's superior quality in Sunday's north London derby, they exploited Tottenham's tactical weakness too.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:55:29.153Z",
    "image": "https://image.pollinations.ai/prompt/How%20ruthless%20Arsenal%20exposed%20Tottenham's%20weaknesses%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-ruthless-arsenal-exposed-tottenhams-weaknesses",
    "originalLink": "https://www.bbc.com/sport/football/articles/c86yjp6037jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Man Utd fans should be glad if Maguire extends stay",
    "title": "Why Man Utd fans should be glad if Maguire extends stay",
    "content": "Fans should welcome the belief of sources on all sides that Harry Maguire will remain at Manchester United at least for next season, writes Simon Stone.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:55:34.292Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Man%20Utd%20fans%20should%20be%20glad%20if%20Maguire%20extends%20stay%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-man-utd-fans-should-be-glad-if-maguire-extends-stay",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg4gvxw24l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "title": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "content": "Wolves striker Tolu Arokodare and Sunderland winger Romaine Mundle are the latest Premier League players to be sent racist abuse on social media this weekend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T12:55:39.426Z",
    "image": "https://image.pollinations.ai/prompt/'Appalling%20weekend'%20-%20Arokodare%20%26%20Mundle%20latest%20players%20to%20be%20racially%20abused%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "appalling-weekend-arokodare-and-mundle-latest-players-to-be-racially-abused",
    "originalLink": "https://www.bbc.com/sport/football/articles/cz6egezw1d3o?at_medium=RSS&at_campaign=rss"
  }
]