[
  {
    "originalTitle": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "title": "Big Wind Visits Our Friends in Madagascar",
    "content": "<h3>Hello from Africa!</h3>\nHi, everyone! I'm your friendly news reporter for Africa. I have an important story to tell you today. It's about a country called Madagascar. Madagascar is a big island. It is off the coast of Africa, in the big blue ocean. It's a beautiful place with many special animals.\n\nSometimes, big storms can happen. A very big storm came to Madagascar recently. It was called a cyclone. A cyclone is like a very, very strong wind. It spins around super fast. It also brings lots and lots of rain. Imagine a giant spinning top of wind and water!\n\n<h3>What Happened in Madagascar?</h3>\nThis big wind, the cyclone, hit a part of Madagascar very hard. It came with very strong winds. The winds blew and blew. They blew so hard that things broke. Many trees were pushed over. They fell onto the roads. This made it hard for cars to drive.\n\n**Did you know?** A cyclone is like a hurricane or a typhoon! They are all big storms with strong winds and heavy rain. They just have different names in different parts of the world!\n\nThe big wind also knocked down power poles. Power poles carry electricity to our homes. When they fall, the lights go out. People cannot watch TV or use their fridges. It makes it dark at night.\n\n<h3>Homes and Roofs Need Help</h3>\nMany homes in the town were damaged. The wind was so strong it ripped off roofs. Imagine your roof just flying away! Many people lost their roofs. Almost all the roofs in one town were gone. That is ninety percent of roofs! That's a very big number.\n\nWhen your roof is gone, it's hard to stay safe and dry. The rain can come inside. Your furniture gets wet. It makes it difficult to sleep. People need new roofs to keep their families safe.\n\nBecause roads had fallen trees and broken poles, it was hard to get help to everyone. It was hard to bring food and water. It was hard to bring blankets and shelter. People needed help quickly.\n\n<h3>What is a Cyclone?</h3>\nLet's talk a little more about what a cyclone is. It starts over warm ocean water. The warm water makes the air rise. This rising air creates an empty space. More air rushes in to fill it. As the earth spins, this air starts to spin too. It gets faster and faster.\n\nIt becomes a huge storm system. It brings incredibly strong winds. It also brings very heavy rain. Sometimes, the ocean water can also rise. This is called a storm surge. It can cause floods.\n\n**Did you know?** Cyclones can be as wide as a whole country! They are huge spinning storms that can be seen from space!\n\n<h3>People Are Helping Each Other!</h3>\nEven though things were difficult, people in Madagascar are brave. They are helping each other. Neighbours are helping neighbours. They are sharing what they have. They are looking for safe places.\n\nRescue workers are also there. These are very brave people. They work hard to clear the roads. They try to get help to everyone. They bring food and water. They bring medicines and blankets. They help people who are hurt.\n\nOther countries are also sending help. People from all over the world care about our friends in Madagascar. They want to help them rebuild their homes. They want to help them feel safe again.\n\n<h3>Learning About Madagascar</h3>\nMadagascar is a really special place. It is the fourth-largest island in the world! It has unique animals you can't find anywhere else. Lemurs are one of the most famous animals there. They are cute little creatures with long tails.\n\n**Did you know?** Madagascar has trees called Baobab trees that look like they are growing upside down! They are very old and tall.\n\nIt's a country with lots of different plants and flowers. It has beautiful beaches and forests. The people of Madagascar have warm hearts. They love their country very much.\n\n<h3>Working Together to Rebuild</h3>\nIt will take some time to fix everything. But people are working together. They will clear the roads. They will fix the power lines. They will build new roofs for homes. It's a big job, but they are strong.\n\nChildren in Madagascar are also helping in small ways. Maybe they help clear small branches. Maybe they share their toys with friends. Everyone can do something to help.\n\nIt shows us how important it is to be kind. It shows us how important it is to help others. Especially when they have a difficult time. We are all part of the big African family. We care about each other.\n\n<h3>What We Can Learn</h3>\nThis story teaches us about nature's power. It also teaches us about people's strength. When things are tough, we can be brave. We can help each other. We can always find hope.\n\nAlways remember to listen to grown-ups during storms. Stay safe indoors. And if you see someone who needs help, be kind. That's the best way to be a good friend and neighbour.\n\nLet's send our love and strength to our friends in Madagascar. We hope they will be safe and strong as they rebuild.\n",
    "summary": "A very big wind called a cyclone brought strong winds and heavy rain to Madagascar, damaging many homes and roads, but people are bravely helping each other to clean up and rebuild.",
    "whyMatters": "This is important because it tells us about big storms and how they can affect people's homes and lives, but also how people come together to help their friends and neighbours when times are hard.",
    "category": "world",
    "date": "2026-02-11T17:03:51.603Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Wind%20Visits%20Our%20Friends%20in%20Madagascar%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-wind-visits-our-friends-in-madagascar",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ghanaians embrace 'Fugu Day' after online mockery of traditional outfits",
    "title": "Ghana's Happy Fugu Day!",
    "content": "<h3>Hello from Your Kid Reporter!</h3>\nHi, everyone! It's your friend, your Kid Reporter, here with super exciting news from our amazing continent, Africa! Today, we're flying over to a sunny country called Ghana. Something very happy and colourful is happening there! It's all about special clothes and being super proud of who you are. Get ready to clap your hands and smile!\n\n<h3>What is Fugu?</h3>\nHave you ever seen a special shirt that looks super cool? In Ghana, there's a special outfit called Fugu. It's not just any shirt; it's a very famous and beautiful piece of clothing! Fugu clothes are often made of strong, colourful fabric. They have lovely patterns and sometimes cool embroidery. Embroidery means pretty designs sewn onto the cloth with colourful thread. Men and women wear Fugu. It makes them look very smart and happy! It's often worn for parties, special days, and even just to feel good.\n\n<h3>Ghana is a Cool Country!</h3>\nGhana is a fantastic country in West Africa. It has lovely beaches, busy markets, and super friendly people. People in Ghana love their culture and traditions. Clothes are a big part of their culture. Fugu is one of the most loved clothes there. Imagine a whole country loving one type of clothing so much! It's a real treasure for them.\n\n<h3>A Little Chat Online</h3>\nNow, something fun happened on the internet. Do you know what the internet is? It's like a giant magic window where people from all over the world can talk to each other! People share pictures and ideas. One day, people from Ghana and people from another country, Zambia, were chatting online. Sometimes, when friends chat, they might tease each other a little bit. It's like friendly jokes. Some people online were talking about Ghanaian traditional clothes, including the Fugu. Maybe some thought it looked a bit different. But guess what? This friendly chat made something wonderful happen!\n\n<h3>Let's Be Proud!</h3>\nThe people in Ghana heard the chats. Did they feel sad? No way! They felt super proud! They said, \"Hey! We love our Fugu! It is beautiful and special to us!\" They wanted to show everyone how much they loved their clothes. They wanted to show the whole world that Fugu is amazing. This is called showing your pride! It means you love something from your country or your family very much. And you want everyone to know it! It made them want to celebrate their clothes even more.\n\n<h3>Hooray for Fugu Day!</h3>\nBecause everyone felt so proud, someone had a super smart idea! \"Let's have a Fugu Day!\" they said. What is Fugu Day? It's a special day when everyone in Ghana, or anyone who loves Fugu, gets to wear their beautiful Fugu! Imagine seeing so many people wearing bright, colourful Fugu all at once! It's like a big, happy, colourful parade! Fugu Day is a way to celebrate their culture. It's a way to say, \"This is us! And we are amazing!\" It's a day to remember how special their clothes are. They wear it to work, to school, and everywhere!\n\n<h3>Why Fugu is So Special</h3>\nFugu is more than just clothes. It tells a story. It tells the story of Ghana. It shows the history and the art of the people. When someone wears Fugu, they are showing where they come from. They are showing their identity. Identity means who you are and where your family is from. It helps people feel connected to each other. It's like wearing a superhero costume, but your superpower is your culture! It makes people feel strong and happy about their heritage.\n\n<h3>Did You Know? Fun Facts!</h3>\n*   **Did you know?** Many countries in Africa have their own special traditional clothes! They are all different and all beautiful!\n*   **Did you know?** Fugu is sometimes called 'Northern Smock' because it comes from the northern parts of Ghana! It's a very old tradition.\n*   **Did you know?** Some Fugu shirts are worn with matching trousers and hats! They make a complete, smart outfit.\n*   **Did you know?** Wearing traditional clothes helps keep our history alive and exciting for future kids like you! It's like a living storybook.\n*   **Did you know?** The colours and patterns on Fugu can sometimes tell a story or mean something special about the person wearing it!\n\n<h3>Wear Your Own Beautiful Clothes!</h3>\nSo, Fugu Day in Ghana is a very happy event. It shows us that it's good to be proud of who you are and where you come from. It teaches us to love our own special clothes and traditions. Whether it's a Fugu from Ghana, a kitenge from East Africa, or any special outfit from your own home, wear it with a big smile! Because our cultures are what make us all unique and wonderful. Let's all celebrate our beautiful Africa and all its amazing clothes! Thank you for listening, super friends! See you next time for more happy news!",
    "summary": "People in Ghana are celebrating their beautiful Fugu clothes with a special 'Fugu Day' after online chats made them feel even prouder of their culture and identity.",
    "whyMatters": "This is important because it shows how people can be proud of their culture and special clothes, even when others talk about them. It teaches us to love who we are and where we come from, and to celebrate our unique heritage!",
    "category": "technology",
    "date": "2026-02-11T17:04:14.358Z",
    "image": "https://image.pollinations.ai/prompt/Ghana's%20Happy%20Fugu%20Day!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ghanas-happy-fugu-day",
    "originalLink": "https://www.bbc.com/news/articles/cgqg8xegxqxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Her sons were killed by Islamist militants. She's among thousands who had to flee",
    "title": "Her sons were killed by Islamist militants. She's among thousands who had to flee",
    "content": "Yameogo Aminata says her four sons were slaughtered and her daughter is missing.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:04:19.477Z",
    "image": "https://image.pollinations.ai/prompt/Her%20sons%20were%20killed%20by%20Islamist%20militants.%20She's%20among%20thousands%20who%20had%20to%20flee%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "her-sons-were-killed-by-islamist-militants-shes-among-thousands-who-had-to-flee",
    "originalLink": "https://www.bbc.com/news/articles/c5yk3d56dgwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why is the issue of Syrian prisoner repatriation from Lebanon complicated?",
    "title": "Going Home: Why It's a Tricky Puzzle for Our Syrian Friends!",
    "content": "Jambo, amazing friends! It’s your super-duper kid-friendly news reporter from sunny Africa here! I hope you're all having a wonderful day, filled with smiles and sunshine. Today, we're going to talk about a very important story, like a big puzzle we need to solve together. It’s about some friends from a faraway land called Syria who want to go back home.\n\n<h3>Friends from Syria Want to Go Home!</h3>\n\nImagine you went on a long trip to visit your auntie or uncle in another town, and you stayed there for a while. You’d have fun, but eventually, you would really want to go back to your own bed, your own toys, and your own family, right? That’s how many people feel!\n\nOur friends in this story are from a country called Syria. They have been staying in another country, right next door, called Lebanon. And now, many of them really, really want to go back home to Syria.\n\n<h3>Who Are Our Syrian Friends?</h3>\n\nIn this story, we are talking about some Syrian friends who were in special places in Lebanon. These places are called jails, where people stay if they have done something wrong.\n\nSometimes, during very confusing and difficult times, people might be held there for different reasons. It’s a bit like when someone has to go to a special timeout spot, but much, much bigger and more serious. But even when people are in such places, they are still people with families who love them and homes they miss.\n\n<h3>Where is Syria?</h3>\n\nSyria is a beautiful country, just like many countries in Africa have amazing places! It’s in a part of the world called the Middle East. Syria has big cities, lovely farms, and lots of history.\n\nFor a long, long time, people have lived there, built homes, and made memories. But for a few years now, Syria has been having some really, really big problems. It’s like a very, very big argument, or a fight, in their country. Because of this big problem, many people had to leave their homes to find safety.\n\n*Did you know?* Countries have special lines called \"borders\" that show where one country ends and another begins. When people travel, they cross these borders!\n\n<h3>Where is Lebanon?</h3>\n\nNext to Syria, there is a kind country called Lebanon. It’s a beautiful place with mountains and a lovely sea! When the big problems started in Syria, many Syrian people needed a safe place to go. Lebanon opened its doors and said, \"Come, stay with us, you are welcome!\"\n\nIt’s like when a kind neighbour helps you when you need it most. Many Syrian families found a safe place to live in Lebanon.\n\n*Did you know?* Helping your neighbours is a wonderful thing to do! It shows kindness and care, just like people in Lebanon showed to their Syrian friends.\n\n<h3>What Does \"Going Home\" Mean?</h3>\n\n\"Going home\" for these Syrian friends means a special word: repatriation. It means sending people back to their home country. It sounds simple, doesn’t it? Like packing your bag and getting on a bus to go home after a fun trip!\n\nEveryone usually loves going home, right? To their family, their friends, their own bed, and their familiar streets. So, you would think everyone would just go home easily. But with this story, it's a little bit like a big, tricky puzzle.\n\n*Did you know?* Most people, no matter where they are from, feel happiest and safest when they are with their families in their own homes. Home is where the heart is!\n\n<h3>The Tricky Puzzle: Why Is It Not So Easy?</h3>\n\nNow, here’s the tricky part, like a difficult level in a video game! It's not just about saying \"go home!\" and everyone goes. There are many reasons why this is a big puzzle, and we call these reasons \"political baggage.\"\n\nIt just means there are many different ideas, rules, and worries from both countries that make it not so simple.\n\n<h3>Worries from Syria's Side</h3>\n\nImagine you have a messy room, and you want to clean it up. If many, many people come back at once, it might be hard for Syria to make sure everyone has a home, food, and a safe place.\n\nAlso, during the big problems in Syria, some people might have done things that were not good. The leaders in Syria want to be sure that when people come back, everyone will be safe, and there won't be new problems starting again. They want to know who is coming back and why.\n\nIt's like wanting to know who is coming to your birthday party to make sure everyone has fun and is safe!\n\n*Did you know?* When a country has big problems like a fight, it takes a long, long time to fix everything and make it safe and peaceful again.\n\n<h3>Worries from Lebanon's Side</h3>\n\nLebanon was very kind and welcomed many Syrian people. But Lebanon is a small country, and it’s also had its own problems sometimes. When so many people come to stay, it can put a lot of pressure on the country.\n\nLebanon needs to make sure it has enough schools, hospitals, and jobs for everyone who lives there. So, the leaders in Lebanon want to help their Syrian friends go home safely. But they also need to make sure that when people leave, it's done in a way that is good for everyone, and that the Syrian friends are truly going to a safe place.\n\nThey don't want to send someone home if it's not safe for them.\n\n*Did you know?* Sharing can be hard sometimes! Countries, like friends, have to think about how to share their resources fairly so everyone has enough.\n\n<h3>Safety is Super Important!</h3>\n\nThe biggest worry for everyone is safety. Is it truly safe for these Syrian friends to go back home? Will their homes still be there? Will they have food and clean water? Will they be able to go to school or find a job?\n\nThese are very important questions. No one wants to send someone to a place where they might not be safe or happy. It’s like making sure your little brother or sister has a safe path to walk to school.\n\n*Did you know?* Everyone in the world deserves to feel safe and have a home where they are loved. It's one of the most important things!\n\n<h3>What Happens Now?</h3>\n\nSo, what’s happening now to solve this big puzzle? Many clever people, including leaders from Syria and Lebanon, and kind people from big organisations around the world, are talking. They are having meetings, sharing ideas, and trying to find the best way forward.\n\nIt’s like when you and your friends try to solve a tricky riddle together. You all put your heads together to find the answer! They want to make sure everyone is treated fairly and kindly, and most importantly, safely.\n\n*Did you know?* Talking about problems calmly and listening to each other's ideas is the best way to find solutions, whether it's with your friends or between countries!\n\n<h3>Hopes for a Happy Home</h3>\n\nEveryone hopes that soon, our Syrian friends will be able to go back to their own homes, safely and happily. They want to be reunited with their families, rebuild their lives, and bring peace back to their beautiful country. It's a journey that needs lots of care, kindness, and smart thinking.\n\nSo, while it’s a tricky puzzle, many good people are working very hard to find a solution. Let's send positive thoughts and wishes to our Syrian and Lebanese friends, hoping that peace and happiness will come to everyone very soon!\n\nThank you for listening, amazing friends! Keep spreading kindness wherever you go. Habari Gani! (That means \"What's the news?\" in Swahili, and the news is, we hope for peace!)",
    "summary": "Many Syrian friends who were in special places in Lebanon want to go back home to Syria, but it's a tricky puzzle because both countries have worries about safety and how to make sure everyone is cared for.",
    "whyMatters": "This story matters because everyone deserves to feel safe, be with their family, and live happily in their own home, and we hope the countries can help our friends get there.",
    "category": "world",
    "date": "2026-02-11T17:04:50.524Z",
    "image": "https://image.pollinations.ai/prompt/Going%20Home%3A%20Why%20It's%20a%20Tricky%20Puzzle%20for%20Our%20Syrian%20Friends!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "going-home-why-its-a-tricky-puzzle-for-our-syrian-friends",
    "originalLink": "https://www.aljazeera.com/features/2026/2/11/why-is-the-issue-of-syrian-prisoner-repatriation-from-lebanon-complicated?traffic_source=rss"
  },
  {
    "originalTitle": "Cyclone slams into Madagascar, killing at least 20 people",
    "title": "Cyclone slams into Madagascar, killing at least 20 people",
    "content": "Officials in Madagascar say building collapses are responsible for many of the confirmed 20 deaths from Cyclone Gezani.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:04:55.688Z",
    "image": "https://image.pollinations.ai/prompt/Cyclone%20slams%20into%20Madagascar%2C%20killing%20at%20least%2020%20people%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cyclone-slams-into-madagascar-killing-at-least-20-people",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/cyclone-slams-into-madagascar-killing-at-least-20-people?traffic_source=rss"
  },
  {
    "originalTitle": "Atletico Madrid vs Barcelona: Copa del Rey – team news, start time, lineups",
    "title": "Atletico Madrid vs Barcelona: Copa del Rey – team news, start time, lineups",
    "content": "All to know as La Liga leaders Barcelona clash with Atletico Madrid in the first leg of their Copa del Rey semifinal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:05:00.805Z",
    "image": "https://image.pollinations.ai/prompt/Atletico%20Madrid%20vs%20Barcelona%3A%20Copa%20del%20Rey%20%E2%80%93%20team%20news%2C%20start%20time%2C%20lineups%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "atletico-madrid-vs-barcelona-copa-del-rey-team-news-start-time-lineups",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/11/atletico-madrid-vs-barcelona-copa-del-rey-team-news-start-time?traffic_source=rss"
  },
  {
    "originalTitle": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "title": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "content": "Members of the remote community have spoken of their fear and uncertainty after nine people were killed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:05:06.539Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20terrifying'%3A%20Tumbler%20Ridge's%20tight-knit%20community%20in%20shock%20after%20shooting%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-terrifying-tumbler-ridges-tight-knit-community-in-shock-after-shooting",
    "originalLink": "https://www.bbc.com/news/articles/cddn078mnn5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "title": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "content": "Lyse Doucet is in Iran for the first time since the crackdown on nationwide anti-government protests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-11T17:05:11.657Z",
    "image": "https://image.pollinations.ai/prompt/Watch%3A%20BBC%20in%20Tehran%20sees%20government's%20'political%20reply'%20to%20massive%20protests%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "watch-bbc-in-tehran-sees-governments-political-reply-to-massive-protests",
    "originalLink": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "title": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "content": "Madagascar's disaster management says roads are inaccessible with trees uprooted, power poles down and ninety percent of roofs ripped off.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:05:16.752Z",
    "image": "https://image.pollinations.ai/prompt/Powerful%20cyclone%20kills%20at%20least%2020%20as%20it%20tears%20through%20Madagascar%20port%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "powerful-cyclone-kills-at-least-20-as-it-tears-through-madagascar-port",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "title": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "content": "Thomas Frank's sacking came as no surprise on Wednesday. His appointment by Tottenham was a gamble that ended in a storm of toxicity, writes Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-11T17:05:22.084Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Frank%20at%20Tottenham%20was%20a%20gamble%20that%20ended%20in%20bitter%20failure%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-frank-at-tottenham-was-a-gamble-that-ended-in-bitter-failure",
    "originalLink": "https://www.bbc.com/sport/football/articles/c783jxqlpv9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Clubs to vote on expanding Championship play-offs",
    "title": "Clubs to vote on expanding Championship play-offs",
    "content": "EFL clubs will vote on expanding play-offs in the Championship from four to six teams at a meeting next month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T17:05:27.194Z",
    "image": "https://image.pollinations.ai/prompt/Clubs%20to%20vote%20on%20expanding%20Championship%20play-offs%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "clubs-to-vote-on-expanding-championship-play-offs",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dnll5gp1go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "De Zerbi leaves Marseille by mutual consent",
    "title": "De Zerbi leaves Marseille by mutual consent",
    "content": "Roberto de Zerbi, who led Marseille to second in Ligue 1 last season, leaves following their Champions League exit and a 5-0 defeat by Paris St-Germain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-11T17:05:32.300Z",
    "image": "https://image.pollinations.ai/prompt/De%20Zerbi%20leaves%20Marseille%20by%20mutual%20consent%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "de-zerbi-leaves-marseille-by-mutual-consent",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgqejpj4d80o?at_medium=RSS&at_campaign=rss"
  }
]