[
  {
    "originalTitle": "Russian 'pick-up artist' accused of secretly filming women in Ghana",
    "title": "It's Good to Ask Permission!",
    "content": "<h3>Hello, Wonderful Kids of Africa!</h3>\nHi everyone! It's your friendly news reporter here, bringing you stories from our amazing continent, Africa.\nToday, we have an important story to share that teaches us all about being kind, respectful, and always asking first.\nThese are super important lessons for all of us, no matter how old we are, from little kids to grown-ups!\nWe want to make sure everyone feels safe and happy in our communities and everywhere they go.\nAnd that means understanding how to treat others the right way, with love and care.\n\n<h3>A Story from Ghana</h3>\nDid you know Ghana is a beautiful country in West Africa? It has lovely beaches, yummy food, and lots of friendly people!\nIn Ghana, something happened that taught us a big lesson about showing respect to others.\nA man from a far-away country, Russia, was visiting Ghana.\nHe was taking videos of people he met while he was there.\nBut here's the tricky part: he didn't always ask for their permission first.\nHe just filmed them without asking if it was okay to do so.\nThis made some of the people in Ghana feel very uncomfortable and a little bit sad.\nIt's not nice when someone does something to you or takes your picture if you don't want them to.\n\n<h3>Why Asking is So Important</h3>\nImagine your friend comes over to your house and takes your favorite toy without asking you first.\nHow would that make you feel? Maybe a little sad, or confused, or even a little bit mad, right?\nIt feels unfair because it's your toy, and you didn't get to say \"yes\" or \"no\" before they took it.\nTaking someone's picture or video without asking is a bit like that.\nIt feels like someone is taking something that belongs to you – your image, your moment, your private space.\nEveryone has a special right called \"privacy.\"\nPrivacy means you get to decide who sees you and how. It's like having your own special bubble!\nIt means you get to decide if someone can take your picture or video.\nWhen you ask for permission, you are showing that you respect others and their feelings.\nYou are saying, \"I care about how you feel and what you want.\"\nDid you know that asking for permission is super important? It shows you respect others and care about how they feel!\n\n<h3>Ghana Wants Help to Make Things Right</h3>\nThe grown-ups in Ghana heard about what the man was doing, and they understood it wasn't fair.\nThey knew it was not a kind or respectful thing to do to their people.\nSo, the country of Ghana decided to speak up about it.\nThey said, \"This is not okay, and we need to fix this problem.\"\nGhana then asked the country of Russia for help with this situation.\nThey want Russia to send the man back to Ghana so he can talk about what happened.\nIt's like when you have a problem with a friend, and a grown-up helps you talk about it to find a solution.\nGhana wants to make sure that all its people are always treated with respect, no matter what.\nAnd that visitors to Ghana also follow these important rules of kindness and asking first.\n\n<h3>Your Body, Your Rules!</h3>\nThis story reminds us of something very, very important for all of you, amazing kids.\nYour body is yours, and your personal space is yours. You are in charge of it!\nNo one should ever touch you in a way that makes you feel uncomfortable or scared.\nAnd no one should ever take a picture or video of you without asking you first if it's okay.\nIf someone tries to do this, it's okay to say \"NO!\" very loudly and clearly.\nAnd then, you should tell a trusted grown-up right away, like your parents, a teacher, or a family member.\nDid you know that everyone has a right to their own private space? It means you get to decide who touches you or takes your picture!\nAlways remember, you are in charge of your own body and your own choices. This is a big part of feeling safe and happy every day.\n\n<h3>Being a Good Global Friend</h3>\nWhen we travel to different places, like visiting another town or country, it's important to be a good guest.\nWe should try to learn about the rules and customs of that place and be polite.\nAnd we should always treat everyone we meet with kindness and respect, just like we would at home.\nThis man from Russia did not show enough respect for the people in Ghana.\nHe forgot to ask for permission, which is a very important rule everywhere you go in the world.\nDid you know that taking a picture or video of someone without asking is like taking their toy without asking? It's not fair!\nThis event is a lesson for everyone, all around the world.\nIt teaches us that being polite and asking first makes a huge difference in how people feel.\nIt helps us all live together peacefully and happily, no matter where we are from.\n\n<h3>What Happens Next?</h3>\nThe grown-ups in Ghana and Russia are working together now to sort this problem out.\nThey are trying to make sure that justice is served for everyone involved.\nJustice means making sure that things are fair for everyone and that people who do wrong understand why.\nIt means that when someone does something that is not right, they need to understand why it was wrong.\nAnd they need to learn to do better and be more respectful next time.\nThis story helps us all remember to be thoughtful and kind in everything we do.\nAlways ask before you take something. Always ask before you touch someone. And always ask before you film someone.\nIt's a simple rule that makes the world a much better and safer place for all of us, kids and grown-ups alike!\nDid you know that grown-ups have rules to keep everyone safe and happy? These rules help us live together nicely and fairly!",
    "summary": "In Ghana, grown-ups are working to teach everyone that it's super important to always ask for permission before taking pictures or videos of people, to show respect and protect everyone's privacy.",
    "whyMatters": "This is important because it teaches us to be kind, respectful, and always ask for permission, making sure everyone feels safe and that their private space is respected.",
    "category": "world",
    "date": "2026-02-15T17:21:50.003Z",
    "image": "https://image.pollinations.ai/prompt/It's%20Good%20to%20Ask%20Permission!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "its-good-to-ask-permission",
    "originalLink": "https://www.bbc.com/news/articles/c9wn5p299eko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "Helping Our Babies Stay Healthy in Africa!",
    "content": "<h3>Hello, Little Explorers!</h3>\n\nHello, amazing kids! It’s your friendly African news reporter here, ready to share some important news with you. Today, we're talking about something very special: making sure all our tiny babies in Africa grow up strong and healthy. \n\nWe care so much about every single child, and grown-ups are always working hard to protect them from sickness. Let's learn about some news from a country called Guinea-Bissau.\n\n<h3>What is This Big News About?</h3>\n\nThere’s a big plan happening in a country in Africa called Guinea-Bissau. Some clever doctors and helpers want to try a new way to keep babies safe from a sickness. They want to test a special medicine or shot (we call it a vaccine) for babies.\n\nThis medicine is to help babies fight off a 'bad bug' called Hepatitis B. It’s like a tiny shield to keep them safe! But there's a little problem, and big doctors' groups are talking about it.\n\n<h3>What is Hepatitis B?</h3>\n\nImagine a very tiny, invisible bug that can make people very, very sick. That's a bit like Hepatitis B! It's a kind of sickness that can hurt your body inside, especially a part called the liver. The liver helps you digest food and stay healthy.\n\nTiny babies can get this sickness from their mothers. It can make them feel very weak and unwell. Sometimes, it can cause problems for a very long time if they don't get help. It's a serious sickness for little ones.\n\nDid you know? Getting a special shot, like a tiny prick, can help babies fight off this bad bug and stay healthy! It's like giving them a superhero shield before the bug even tries to attack.\n\n<h3>What is a 'Trial' or 'Test'?</h3>\n\nWhen doctors want to know if a new medicine or a special shot (like a vaccine) works really well and is safe, they do something called a 'trial' or a 'test'. It's like when you try a new game to see if it's fun and works properly.\n\nThey give the new medicine to some people to see if it makes them better or stops them from getting sick. They watch very carefully to make sure it helps and doesn't cause any problems. This is how we find new ways to stay healthy!\n\nDid you know? All the good medicines and special shots you might have had, like for measles or polio, were tested many times to make sure they were safe and worked perfectly before anyone used them widely!\n\n<h3>The Problem: Not All Babies Get Help</h3>\n\nHere’s where the big doctors are getting worried. In this special test in Guinea-Bissau, some of the new babies will get the medicine to fight the 'bad bug' (Hepatitis B). That sounds great, right?\n\nBut, other babies in the same test will NOT get the medicine, even though we already know it can help them! They would just be watched, and not given the proven medicine.\n\nThis makes many people, especially big health experts, feel it's not fair. They say if there's a medicine that we already know helps babies stay healthy, all babies should get it, especially if they are part of a test.\n\n<h3>Who Said it's Not Fair?</h3>\n\nA very important group called the WHO (World Health Organization) said this plan is 'not fair'. The WHO is like a super big team of doctors, nurses, and health helpers from all over the world. They work together to make sure everyone on Earth can be as healthy as possible.\n\nThey want to make sure doctors always follow rules that are fair and kind to everyone, especially when testing new medicines. The WHO wants all babies to get the best care and protection possible.\n\nDid you know? The WHO helps countries fight many sicknesses all over the world, like malaria, measles, and polio. They share important health information and send helpers to places that need them most!\n\n<h3>Why is it Important to Be Fair?</h3>\n\nImagine if you were playing a game with your friends, and only some friends got to use the best toys or have a turn. That wouldn't feel very fair, would it? It's the same for medicine and health.\n\nEvery single baby, no matter where they live, deserves a chance to be healthy and strong. If there is a medicine that we know works to stop a bad sickness like Hepatitis B, then all babies should get it.\n\nIt’s about being kind and making sure everyone has the same chance to be safe. That’s why the WHO wants to make sure the plan for these babies is changed so that everyone gets the help they need.\n\n<h3>What Happens Next?</h3>\n\nNow, because the WHO and many other smart people have said this plan isn't fair, the doctors and helpers who are organizing the test are talking about it again. They want to find a better way to do the test.\n\nThey want to make sure that they can still learn about new medicines but do it in a way that is fair and safe for all the babies. We hope they will come up with a plan where every baby gets the medicine that can protect them.\n\nDid you know? Guinea-Bissau is a beautiful country in West Africa. It has a long coastline with many lovely islands! People there speak Portuguese and many other local languages.\n\n<h3>Why Does This Matter to You?</h3>\n\nThis story shows us how much grown-ups care about keeping children healthy and safe. It teaches us a very important lesson about fairness and kindness.\n\nEvery child in Africa, and everywhere in the world, deserves to be strong, happy, and protected from sickness. By learning about these things, you can also understand how important it is to be fair to everyone.\n\nLet’s always hope for the best for our babies and children across Africa, making sure they get all the help they need to grow up big and healthy!\n\n<h3>A Big Hug for Our African Babies!</h3>\n\nSo, remember, kids: there are many people working hard to make sure you and all children have a healthy future. Keep learning, keep asking questions, and always be kind and fair! Until next time, stay healthy and happy!",
    "summary": "Big health groups say it's not fair to give some babies a special medicine for a sickness called Hepatitis B in a test, but not give it to other babies, because we already know the medicine helps them.",
    "whyMatters": "This is important because it teaches us that everyone, especially tiny babies, deserves fair and safe chances to get healthy medicine, and big doctors' groups like WHO want to make sure all children are treated kindly.",
    "category": "world",
    "date": "2026-02-15T17:22:12.034Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Our%20Babies%20Stay%20Healthy%20in%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-our-babies-stay-healthy-in-africa",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "content": "Bouquets of cash have been blooming in popularity in Kenya but recent warnings may slow the trend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:17.153Z",
    "image": "https://image.pollinations.ai/prompt/Kenyans%20drop%20flowers%20for%20Valentine's%20bouquets%20of%20cash.%20Not%20everyone%20is%20impressed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenyans-drop-flowers-for-valentines-bouquets-of-cash-not-everyone-is-impressed",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US ‘not disputing’ European assessment of Navalny poisoning, Rubio says",
    "title": "US ‘not disputing’ European assessment of Navalny poisoning, Rubio says",
    "content": "Secretary of state says Washington will 'not fight' European partners on their findings as UK considers new sanctions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:22.459Z",
    "image": "https://image.pollinations.ai/prompt/US%20%E2%80%98not%20disputing%E2%80%99%20European%20assessment%20of%20Navalny%20poisoning%2C%20Rubio%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says?traffic_source=rss"
  },
  {
    "originalTitle": "Thousands of Western nationals fought Israel’s war on Gaza: What to know",
    "title": "Thousands of Western nationals fought Israel’s war on Gaza: What to know",
    "content": "Thousands of Western citizens joined the Israeli military in its war on Gaza that killed over 72,000 Palestinians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:27.584Z",
    "image": "https://image.pollinations.ai/prompt/Thousands%20of%20Western%20nationals%20fought%20Israel%E2%80%99s%20war%20on%20Gaza%3A%20What%20to%20know%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "thousands-of-western-nationals-fought-israels-war-on-gaza-what-to-know",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/thousands-of-western-nationals-fought-israels-war-on-gaza-what-to-know?traffic_source=rss"
  },
  {
    "originalTitle": "As Sudanese city returns to life after two-year siege, drone threat lingers",
    "title": "As Sudanese city returns to life after two-year siege, drone threat lingers",
    "content": "Markets reopen in Dilling, South Kordofan’s second largest city. Yet residents face persistent aerial attacks.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "business",
    "date": "2026-02-15T17:22:32.696Z",
    "image": "https://image.pollinations.ai/prompt/As%20Sudanese%20city%20returns%20to%20life%20after%20two-year%20siege%2C%20drone%20threat%20lingers%20realistic%20news%20photography%20context%20Business%20%26%20Finance%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "as-sudanese-city-returns-to-life-after-two-year-siege-drone-threat-lingers",
    "originalLink": "https://www.aljazeera.com/features/2026/2/15/as-sudanese-city-returns-to-life-after-two-year-siege-drone-threat-lingers?traffic_source=rss"
  },
  {
    "originalTitle": "Iran ready to discuss compromises to reach nuclear deal, minister tells BBC in Tehran",
    "title": "Iran ready to discuss compromises to reach nuclear deal, minister tells BBC in Tehran",
    "content": "Majid Takht-Ravanchi, Iran's deputy foreign minister, tells the BBC's Lyse Doucet that the ball was \"in America's court to prove that they want to do a deal\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-15T17:22:38.138Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20ready%20to%20discuss%20compromises%20to%20reach%20nuclear%20deal%2C%20minister%20tells%20BBC%20in%20Tehran%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-ready-to-discuss-compromises-to-reach-nuclear-deal-minister-tells-bbc-in-tehran",
    "originalLink": "https://www.bbc.com/news/articles/clyz4y3zwz5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ukraine's ex-energy minister detained while attempting to leave country",
    "title": "Ukraine's ex-energy minister detained while attempting to leave country",
    "content": "His detention comes as he faces legal proceedings after being dismissed in a corruption scandal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:43.278Z",
    "image": "https://image.pollinations.ai/prompt/Ukraine's%20ex-energy%20minister%20detained%20while%20attempting%20to%20leave%20country%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ukraines-ex-energy-minister-detained-while-attempting-to-leave-country",
    "originalLink": "https://www.bbc.com/news/articles/c4g5380xwqjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Eleven killed in Israeli strikes on Gaza, rescuers say",
    "title": "Eleven killed in Israeli strikes on Gaza, rescuers say",
    "content": "The Palestinian Red Crescent say a strike on a tent encampment in northern Gaza killed at least six people.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:48.394Z",
    "image": "https://image.pollinations.ai/prompt/Eleven%20killed%20in%20Israeli%20strikes%20on%20Gaza%2C%20rescuers%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eleven-killed-in-israeli-strikes-on-gaza-rescuers-say",
    "originalLink": "https://www.bbc.com/news/articles/c8r15eyvk2do?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pereira announced as Forest boss on 18-month deal",
    "title": "Pereira announced as Forest boss on 18-month deal",
    "content": "Nottingham Forest appoint Vitor Pereira on an 18-month deal as the 57-year-old becomes the club's fourth manager of the campaign.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:53.652Z",
    "image": "https://image.pollinations.ai/prompt/Pereira%20announced%20as%20Forest%20boss%20on%2018-month%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pereira-announced-as-forest-boss-on-18-month-deal",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62678ldqmpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I'm buzzing' - Man Utd's Skinner toasts seventh-straight win",
    "title": "'I'm buzzing' - Man Utd's Skinner toasts seventh-straight win",
    "content": "Manchester United are getting the job done when it matters most - and their seven-game winning streak has gone under the radar.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:22:58.769Z",
    "image": "https://image.pollinations.ai/prompt/'I'm%20buzzing'%20-%20Man%20Utd's%20Skinner%20toasts%20seventh-straight%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "im-buzzing-man-utds-skinner-toasts-seventh-straight-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/cze0pyjl6jlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Leeds beat Birmingham on penalties in FA Cup",
    "title": "Leeds beat Birmingham on penalties in FA Cup",
    "content": "Watch highlights as Leeds United hold their nerve to beat Championship oppponents Birmingham City 4-2 on penalties and reach the FA Cup fifth round.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T17:23:03.896Z",
    "image": "https://image.pollinations.ai/prompt/Leeds%20beat%20Birmingham%20on%20penalties%20in%20FA%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "leeds-beat-birmingham-on-penalties-in-fa-cup",
    "originalLink": "https://www.bbc.com/sport/football/videos/c98qyd0vdeeo?at_medium=RSS&at_campaign=rss"
  }
]