[
  {
    "originalTitle": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "title": "A Big Windy Story from Madagascar!",
    "content": "<h3>Hello from Sunny Africa!</h3>\nHi everyone! It's your friendly reporter here, bringing you important news from our amazing continent, Africa! Today, we're going to talk about a very special island country called Madagascar. It's a big, beautiful island in the wide, blue ocean, right off the coast of Africa. Madagascar is a magical place, home to many unique animals like the jumping lemurs and color-changing chameleons!\n\n<h3>What Happened in Madagascar?</h3>\nA few days ago, something very big and very windy visited Madagascar. It was a super-duper strong storm called a 'cyclone'. Can you say cyclone? Sy-clone! This cyclone brought a lot of rain and incredibly strong winds. It was like a giant invisible hand pushing everything very, very hard.\n\nDid you know? Madagascar is the fourth biggest island in the whole world! It's even bigger than some countries!\n\n<h3>What is a Cyclone?</h3>\nImagine a giant spinning top that's made of wind and rain, way up in the sky. That's a bit like what a cyclone is! It's a huge weather system that spins round and round, collecting lots of warm, wet air from the ocean. When it spins faster and faster, it creates very, very strong winds and pours down a huge amount of rain.\n\nCyclones usually form over warm oceans, and when they reach land, they can be very powerful. Think of it like a big, whirly dance in the sky that can sometimes be a bit too strong!\n\nDid you know? In other places around the world, people call these big storms 'hurricanes' or 'typhoons', but they are all very strong, spinning storms!\n\n<h3>What Did the Big Storm Do?</h3>\nWhen this strong cyclone landed in Madagascar, it caused a lot of trouble. The winds were so incredibly strong that they pulled big trees right out of the ground! Imagine a giant tree just falling over like a toy block. These fallen trees blocked the roads, making it really hard for cars and trucks to drive through.\n\nThis meant that sometimes, people couldn't get where they needed to go, and it was hard for helpers to reach everyone who needed help. It was like giant puzzle pieces blocking all the paths!\n\nAlso, the tall poles that carry electricity wires fell down. When power poles fall, it means that homes don't have electricity. So no lights, no TV, and no charging up phones or toys. It makes everything a bit darker and harder to do.\n\nAnd sadly, the wind was so strong that it ripped off the roofs of many houses. Imagine your roof, which keeps you safe from the rain and sun, just flying away! In some places, almost all the roofs were gone – that's ninety out of every hundred roofs! This meant many families didn't have a safe, dry home anymore.\n\nVery, very sadly, some people lost their lives because of this big, strong storm. Our hearts are very sad for them and their families.\n\nDid you know? Trees have very deep roots that usually hold them super-tight to the ground, but a cyclone's winds can be even stronger than those roots!\n\n<h3>Helping Hands Are Coming!</h3>\nEven though the storm was scary and caused a lot of damage, there is good news! When big troubles happen, people are always ready to help! Many kind helpers are working very, very hard in Madagascar right now.\n\nThey are busy clearing the fallen trees from the roads so that cars and trucks can pass again. They are also bringing important things like food, clean water, and safe places for people who lost their homes to stay.\n\nFriends from other countries around the world are also sending help. Everyone wants to make sure the people of Madagascar can get back on their feet. It takes time to clean up and rebuild, but people are strong and kind, and they are working together.\n\nDid you know? Many people around the world help each other when big natural disasters happen. It shows how caring and helpful humans can be!\n\n<h3>Why is Madagascar So Special?</h3>\nMadagascar is not just a place where big storms happen; it's a truly amazing and unique country! It's famous all over the world for its special animals and plants that you can't find anywhere else.\n\nLike the lemurs! They are cute, fuzzy animals, a bit like monkeys, with big eyes and long tails. They love to swing through the trees. There are also tiny chameleons that can change their skin color to hide! And the famous baobab trees, which look like they are growing upside down because their branches look like roots in the sky.\n\nThe people of Madagascar are called Malagasy (Mah-lah-GAH-see). They are known for being very welcoming, loving music, dancing, and telling wonderful stories. They are also very resilient, which means they are good at bouncing back and staying strong even after hard times.\n\nDid you know? Over 80% of the animals and plants in Madagascar are found nowhere else on Earth! It's like a special nature treasure island!\n\n<h3>Staying Safe from Big Storms</h3>\nSometimes, big storms like cyclones can be scary, but people learn how to be safe when they know a storm is coming. Scientists and weather experts watch the sky and the ocean very carefully using special tools.\n\nThey can give warnings to people when a big storm is on its way. This helps everyone prepare, maybe by going to a safer place, or making sure their homes are as strong as possible. Being prepared helps everyone stay safe.\n\nDid you know? Weather scientists use special satellites high up in space to take pictures of storms and watch them move across the ocean!\n\n<h3>Our Hearts are With Madagascar!</h3>\nIt's sad when such powerful storms cause trouble and make people sad. But we know the people of Madagascar are very brave and strong. With the help of kind friends from all over the world, they will work together to rebuild their homes and their lives.\n\nOur thoughts and good wishes are with everyone in Madagascar. Let's hope for lots of sunshine and blue skies for them very, very soon! And let's remember the wonderful spirit of the people of Madagascar.\n\nDid you know? Even a small act of kindness, like thinking good thoughts for someone far away, can make a difference and show we care!\n",
    "summary": "A very strong storm called a cyclone hit the beautiful island of Madagascar in Africa, causing big damage by knocking down trees and power poles, ripping off many roofs, and sadly taking some lives, but people are now working hard to help and rebuild.",
    "whyMatters": "This is important because a very strong storm made many people in Madagascar sad and broke their homes and roads, so now they need help to fix everything and get back to being safe and happy again.",
    "category": "world",
    "date": "2026-02-11T15:57:03.084Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Windy%20Story%20from%20Madagascar!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-windy-story-from-madagascar",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Her sons were killed by Islamist militants. She's among thousands who had to flee",
    "title": "Mama Aminata's Brave Journey: Finding a Safe Home",
    "content": "<h3>Hello, Super Reporters!</h3>\nHello, amazing friends! It's your friendly news reporter here, bringing you a very important story from our wonderful continent of Africa. Today, we're going to talk about someone very brave named Mama Aminata. She is a mum, just like your mum, who loves her family very much. She lives in a beautiful part of Africa, where the sun shines bright and the people have big, kind hearts. But sometimes, even in beautiful places, sad things happen. Mama Aminata's story helps us remember to be kind and helpful to everyone.\n\n<h3>Mama Aminata's Home</h3>\nMama Aminata used to live in a lovely village. She had a home where she cooked yummy meals and told stories to her children. She had four sons and one daughter. Imagine a family full of laughter and play! Her children were her sunshine. They would help her with chores, play games together, and learn about the world. Every day was special in their home, filled with the warmth of family love. Their village was a place where neighbours helped neighbours, and everyone knew each other.\n\n<h3>When Troubles Came</h3>\nOne day, some bad people started causing trouble in Mama Aminata's village. These bad people are sometimes called 'militants'. They want to fight and make people scared. They did not want people to live in peace. When things became very unsafe, Mama Aminata had to make a very hard choice. She had to leave her home, her village, and all her belongings behind. This is called 'fleeing' – it means running away quickly from danger to find a safe place.\n\nDid you know? Fleeing is when people have to leave their homes because it's not safe. Imagine having to pack a small bag and leave everything you know to find safety!\n\n<h3>A Mother's Sadness</h3>\nIn this sad time, Mama Aminata faced great sorrow. She shared that her four sons were lost, and her daughter is missing. It means her sons are not with her anymore, and she doesn't know where her daughter is. This is a very, very sad thing for any mum. Imagine how much she misses them and wishes they were safe with her. She is very strong, even with a broken heart. She hopes every day to find her daughter and for peace to return.\n\n<h3>Not Alone in Her Journey</h3>\nMama Aminata is not alone in her brave journey. Thousands and thousands of other people, just like her, also had to leave their homes because of these bad people. Imagine a long line of families, holding hands, walking to find a new, safe place to live. These people are called 'displaced people' because they have been moved from their home. They all share the same hope: to find peace and safety.\n\nDid you know? Africa is a huge continent with many different countries and cultures. When people have to move, they often try to stay close to their home country or find safety in a nearby town.\n\n<h3>A New Place, New Friends</h3>\nWhen people flee, they often go to a place called a 'refugee camp' or a new town. A refugee camp is a safe place where many families live together in tents or small shelters. Here, people try to build new lives. Children go to temporary schools, learning and playing, even though they miss their old homes. People get food, water, and medicines from big helper organisations. They make new friends and try to help each other feel better.\n\nLife in these new places can be hard. There might not be enough food or toys. But people are strong. They work together, share what they have, and always look for ways to smile and be kind. Mama Aminata, like many other mothers, tries to make a new 'home' in this new place, filled with as much love as she can give.\n\n<h3>Helping Hands from Around the World</h3>\nMany wonderful people and big groups, like the United Nations (UN) and other charities, work very hard to help families like Mama Aminata's. They bring food, build schools, and give doctors to help people. They want everyone to be safe and healthy. These helpers come from all over the world, showing us that kindness has no borders.\n\nDid you know? The United Nations is like a big team of countries that work together to solve problems in the world, like helping people who have to flee their homes.\n\n<h3>Hope for Peace</h3>\nMama Aminata and all the thousands of people who had to leave their homes have one big wish: peace. They want the fighting to stop so they can go back to their villages. They want to rebuild their homes, plant their crops, and live without fear. They dream of a day when all children can play safely outside and all mums and dads can feel calm and happy.\n\nWe can all hope for peace. We can be kind to everyone we meet, whether they are from our village or from far away. Every small act of kindness helps to make our world a better, more peaceful place. Remember Mama Aminata and her brave heart. Let's send her, and all those like her, our biggest hopes for a safe and happy future!\n\nDid you know? When people help each other, it makes everyone stronger. It's like a big team effort to make the world a happier place!",
    "summary": "Mama Aminata, a brave mum in Africa, had to leave her home with thousands of others because of bad people, and she hopes for peace and to find her missing daughter.",
    "whyMatters": "This story matters because it shows us that some people in Africa have to leave their homes to find safety, and it reminds us to be kind, help others, and hope for peace for everyone.",
    "category": "world",
    "date": "2026-02-11T15:57:23.412Z",
    "image": "https://image.pollinations.ai/prompt/Mama%20Aminata's%20Brave%20Journey%3A%20Finding%20a%20Safe%20Home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mama-aminatas-brave-journey-finding-a-safe-home",
    "originalLink": "https://www.bbc.com/news/articles/c5yk3d56dgwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A simple guide to the crisis in South Sudan",
    "title": "A simple guide to the crisis in South Sudan",
    "content": "The political rift that could spiral into conflict again after the vice-president was accused of treason.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-11T15:57:28.552Z",
    "image": "https://image.pollinations.ai/prompt/A%20simple%20guide%20to%20the%20crisis%20in%20South%20Sudan%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-simple-guide-to-the-crisis-in-south-sudan",
    "originalLink": "https://www.bbc.com/news/articles/c7933p4xe7po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Cyclone slams into Madagascar, killing at least 20 people",
    "title": "Big Storm Visits Our Friends in Madagascar!",
    "content": "<h3>Hello, My Little Friends!</h3>\n\nHello, hello, my wonderful little friends all across Africa! It’s your friendly news reporter here. Today, we have some important news to share from a very special place not too far from us. It’s about a big, big storm that visited our friends in a beautiful country called Madagascar. Sometimes, nature can be very strong, and it’s good to understand what happens and how people help each other.\n\n<h3>Where is Madagascar?</h3>\n\nFirst, let's find Madagascar on our map! Imagine our big continent of Africa. Now, look to the right, out into the big blue ocean. Can you see a very large island there? That's Madagascar! It’s a bit like a giant leaf floating in the water. Madagascar is famous for its amazing animals that you can't find anywhere else, like the bouncy lemurs! It’s a truly wonderful place with kind people and beautiful nature.\n\nDid you know? Madagascar is the fourth biggest island in the whole wide world! That’s super big!\n\n<h3>What is a Cyclone?</h3>\n\nNow, let's talk about what a cyclone is. Imagine a giant, super-fast fan spinning in the sky. That’s a bit like a cyclone! It’s a very big storm with super strong winds that can blow very, very hard. It also brings lots and lots of rain, like a million tiny waterfalls all at once. These storms form over warm ocean waters and can travel for many days.\n\nWhen a cyclone comes, it can make trees sway and bend, and sometimes even knock them over! The rain can make rivers get very full and spill over, which we call a flood. Cyclones have different names, and the one that visited Madagascar was called Cyclone Gezani.\n\nDid you know? In other parts of the world, people call these big storms by different names, like hurricanes or typhoons! But they are all giant spinning storms!\n\n<h3>Cyclone Gezani Arrives!</h3>\n\nRecently, Cyclone Gezani decided to visit Madagascar. It came sweeping in from the big ocean, bringing its strong winds and heavy rains. When the cyclone hit the land, it was very powerful. It made a lot of noise and shook things up. People had to be very careful and stay inside their homes, just like grown-ups tell us to do when there’s bad weather.\n\nThe wind blew so hard, it sounded like a giant roar. The rain poured down, making everything very wet. It was a very scary time for many people and families living in Madagascar. They tried their best to be safe and protect their homes and their loved ones from the storm's power.\n\n<h3>What Happened to Houses?</h3>\n\nBecause of the super strong winds and all the heavy rain from Cyclone Gezani, some houses got very, very damaged. Imagine a gust of wind so strong it could push your toy car across the room – now imagine that wind blowing on a whole house! Some houses are made with materials that are not as strong as others, and the cyclone was just too powerful for them. The strong winds ripped off roofs, and the heavy rain made the ground very soft. When the ground gets soft, it’s harder for houses to stand up tall, and sometimes parts of them can fall down.\n\nSadly, because some houses fell down, some people got very hurt. And very, very sadly, some grown-ups did not make it. Our hearts are with the families who lost their loved ones. It’s a very sad time for them, and we think of them and wish them comfort. This is why it’s so important to have strong houses and to listen to warnings when big storms are coming.\n\n<h3>Brave Helpers Are There!</h3>\n\nBut even in sad times, there is always hope and kindness! Many brave helpers are in Madagascar right now. These are people who wear special uniforms, like rescue workers and doctors. They are working super hard to help everyone who needs it. They are looking for people who might be stuck, giving first aid to those who are hurt, and making sure everyone has safe places to stay.\n\nOther kind people and groups are sending help too. They are bringing yummy food, clean water to drink, warm blankets, and clothes for families who lost their homes or things in the storm. It’s wonderful to see so many people coming together like a big family to help our friends in Madagascar. They are showing so much courage and love.\n\nDid you know? When big disasters happen, people from all over the world often send help, like food, medicine, and doctors, to the places that need it most. It's a wonderful way to show we care!\n\n<h3>How We Stay Safe From Big Storms</h3>\n\nWhat can we learn from this, my little friends? When big storms, like cyclones, are coming, it’s super important to listen to your grown-ups. They will tell you the safest things to do. Sometimes it means staying inside, away from windows. Sometimes it means moving to a safer place if your house is not strong enough. Always remember to stay calm and follow the rules your parents or teachers tell you.\n\nIt’s also important to remember that after a storm, it’s good to be careful. Don't touch fallen power lines or play in floodwaters, because they can be very dangerous. Always wait for a grown-up to tell you it’s safe to go outside and play again.\n\n<h3>Madagascar Will Shine Again!</h3>\n\nEven though Cyclone Gezani brought some sad and difficult times to Madagascar, the people there are very strong and brave. With the help of all the kind people around the world, they will work together to rebuild their homes and their lives. They will clean up and help their beautiful country shine brightly again.\n\nLet’s send our thoughts and good wishes to our friends in Madagascar. Remember to always be kind to each other, and when big things happen, look for the helpers. They are always there, making the world a better place. Stay safe and keep smiling, my little friends! See you next time!\n\n",
    "summary": "A big storm called Cyclone Gezani hit Madagascar, a large island near Africa, causing strong winds and heavy rain that damaged houses and sadly hurt some people, but many brave helpers are there to support everyone.",
    "whyMatters": "This is important because it shows us how powerful nature can be and how people help each other after a big storm, reminding us to be safe and kind.",
    "category": "world",
    "date": "2026-02-11T15:57:54.157Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Storm%20Visits%20Our%20Friends%20in%20Madagascar!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-storm-visits-our-friends-in-madagascar",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/11/cyclone-slams-into-madagascar-killing-at-least-20-people?traffic_source=rss"
  },
  {
    "originalTitle": "Atletico Madrid vs Barcelona: Copa del Rey – team news, start time, lineups",
    "title": "Atletico Madrid vs Barcelona: Copa del Rey – team news, start time, lineups",
    "content": "All to know as La Liga leaders Barcelona clash with Atletico Madrid in the first leg of their Copa del Rey semifinal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T15:57:59.294Z",
    "image": "https://image.pollinations.ai/prompt/Atletico%20Madrid%20vs%20Barcelona%3A%20Copa%20del%20Rey%20%E2%80%93%20team%20news%2C%20start%20time%2C%20lineups%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "atletico-madrid-vs-barcelona-copa-del-rey-team-news-start-time-lineups",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/11/atletico-madrid-vs-barcelona-copa-del-rey-team-news-start-time?traffic_source=rss"
  },
  {
    "originalTitle": "Bulgaria’s president picks senior central bank official as acting PM",
    "title": "A New Helper is Chosen for a Country Far Away!",
    "content": "Jambo, amazing friends! It's your kid-friendly news reporter here, bringing you super exciting news from around the world! Today, we're flying all the way to a country called Bulgaria. It's very far from Africa, across big oceans and many lands. But even far away, countries need leaders to help everyone live happily and safely, just like our leaders here in Africa work hard for us!\n\n<h3>Meet the President of Bulgaria!</h3>\nImagine your school. You have a head teacher, right? Someone who is in charge of everything, making sure the school runs smoothly and everyone is happy. Well, a country also has a very important leader. In Bulgaria, they have a leader called a President. His name is President Rumen Radev.\n\nHe is like the biggest head of the country, looking out for all the people who live there. The President helps make big decisions and makes sure the country stays strong.\n\nDid you know? Many countries have a President! It's a very important job, like being the captain of a big ship, guiding it through the waters.\n\n<h3>A Special Helper: Andrey Gurov</h3>\nNow, President Radev had a very important job to do. He needed to pick a special helper for the country. This helper is called an 'acting Prime Minister'. An acting Prime Minister is like a substitute teacher who comes to help your class when your main teacher is away. They make sure everything still runs well until your main teacher comes back, or a new main teacher is chosen.\n\nSo, President Radev looked for someone really smart and good at helping with important things. He chose a person named Andrey Gurov! Andrey Gurov used to work at something called a 'central bank'. Wow, that sounds like a big word, doesn't it?\n\nWhat is a central bank? Imagine a giant piggy bank for the whole country! The central bank helps to look after all the money in the country. It makes sure money is safe and used wisely. So, Andrey Gurov is someone who knows a lot about money and how to manage big important things.\n\nDid you know? Money helps us buy things we need, like food and clothes, and things we like, like toys! Managing a country's money is a very, very big job.\n\n<h3>What is an Acting Prime Minister's Job?</h3>\nAndrey Gurov is now going to be the temporary leader of the government. The government is like a big team of people who work together to make rules and help the country. Think of it like a sports team, where everyone has a job to do to win the game. The government team helps everyone in the country.\n\nBut remember, Andrey Gurov is just the 'acting' Prime Minister. This means he will be helping for a little while, not forever. He has a very special and important task to do. His main job is to help prepare for something called 'snap elections'.\n\nIt's like when your class needs a new class monitor, and a substitute teacher helps get ready for everyone to vote for the new monitor. Andrey Gurov will make sure everything is ready for the country to choose a new, permanent government team.\n\nDid you know? In some countries, the Prime Minister is the main leader, and the President has a different role! It's interesting how different countries choose to run things!\n\n<h3>What are 'Snap Elections'?</h3>\nThis is a super interesting part! 'Snap elections' just means that people will vote for their new leaders sooner than they thought. Usually, countries have elections every few years, like a big schedule. But sometimes, things happen, and they need to vote a bit earlier. This is called a 'snap' election.\n\nWhy do they need snap elections? Sometimes the old government team might not be agreeing on everything, or they might have finished their time earlier than expected. So, the President says, \"Okay, it's time for the people to choose a new team now! Let's vote again quickly!\"\n\nSo, Andrey Gurov's most important job is to make sure these quick elections happen fairly and correctly. Everyone needs to have a chance to vote for the people they think will be the best leaders for their country.\n\nDid you know? When you vote, you get to choose who you want to lead. It's like choosing which game to play or which story to read – but for a whole country! It's a powerful way for people to have their say.\n\n<h3>Why is This News Important?</h3>\nEven though Bulgaria is far away, this news shows us how countries choose their leaders and how governments work to help everyone. It tells us that leaders are always working to make sure their countries are safe, happy, and that people have a chance to choose who helps them.\n\nAndrey Gurov will be a temporary helper, making sure that Bulgaria can choose its next big team of leaders. It's all about teamwork and helping a country move forward!\n\nSo, remember, friends, whether it's in Africa or far away in Bulgaria, leaders work hard to make good things happen. And choosing who helps lead is a very important job for everyone!\n\nThat's all for today's news from me, your friendly reporter! Keep shining bright!",
    "summary": "Andrey Gurov has been chosen by Bulgaria's President to be a temporary leader (acting Prime Minister) who will help organise new elections for the country to choose its next government.",
    "whyMatters": "This is important because it shows how countries make sure they always have someone in charge to help them, and how people get to choose their leaders through voting, even when things change quickly.",
    "category": "politics",
    "date": "2026-02-11T15:58:18.353Z",
    "image": "https://image.pollinations.ai/prompt/A%20New%20Helper%20is%20Chosen%20for%20a%20Country%20Far%20Away!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-new-helper-is-chosen-for-a-country-far-away",
    "originalLink": "https://www.aljazeera.com/news/2026/2/11/bulgarias-president-picks-senior-central-bank-official-as-acting-pm?traffic_source=rss"
  },
  {
    "originalTitle": "Tumbler Ridge mass shooting: What we know so far",
    "title": "Tumbler Ridge mass shooting: What we know so far",
    "content": "Nine people have been killed and 25 injured in the shootings at a school and home in a rural community in western Canada.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T15:58:24.177Z",
    "image": "https://image.pollinations.ai/prompt/Tumbler%20Ridge%20mass%20shooting%3A%20What%20we%20know%20so%20far%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tumbler-ridge-mass-shooting-what-we-know-so-far",
    "originalLink": "https://www.bbc.com/news/articles/c1e98w35qyjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "title": "Watch: BBC in Tehran sees government's 'political reply' to massive protests",
    "content": "Lyse Doucet is in Iran for the first time since the crackdown on nationwide anti-government protests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-11T15:58:29.314Z",
    "image": "https://image.pollinations.ai/prompt/Watch%3A%20BBC%20in%20Tehran%20sees%20government's%20'political%20reply'%20to%20massive%20protests%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "watch-bbc-in-tehran-sees-governments-political-reply-to-massive-protests",
    "originalLink": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "title": "Powerful cyclone kills at least 20 as it tears through Madagascar port",
    "content": "Madagascar's disaster management says roads are inaccessible with trees uprooted, power poles down and ninety percent of roofs ripped off.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T15:58:34.462Z",
    "image": "https://image.pollinations.ai/prompt/Powerful%20cyclone%20kills%20at%20least%2020%20as%20it%20tears%20through%20Madagascar%20port%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "powerful-cyclone-kills-at-least-20-as-it-tears-through-madagascar-port",
    "originalLink": "https://www.bbc.com/news/articles/c931zzzep0eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "title": "Why Frank at Tottenham was a gamble that ended in bitter failure",
    "content": "Thomas Frank's sacking came as no surprise on Wednesday. His appointment by Tottenham was a gamble that ended in a storm of toxicity, writes Phil McNulty.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-11T15:58:40.074Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Frank%20at%20Tottenham%20was%20a%20gamble%20that%20ended%20in%20bitter%20failure%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-frank-at-tottenham-was-a-gamble-that-ended-in-bitter-failure",
    "originalLink": "https://www.bbc.com/sport/football/articles/c783jxqlpv9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Clubs to vote on expanding Championship play-offs",
    "title": "Clubs to vote on expanding Championship play-offs",
    "content": "EFL clubs will vote on expanding play-offs in the Championship from four to six teams at a meeting next month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-11T15:58:45.207Z",
    "image": "https://image.pollinations.ai/prompt/Clubs%20to%20vote%20on%20expanding%20Championship%20play-offs%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "clubs-to-vote-on-expanding-championship-play-offs",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dnll5gp1go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "De Zerbi leaves Marseille by mutual consent",
    "title": "De Zerbi leaves Marseille by mutual consent",
    "content": "Roberto de Zerbi, who led Marseille to second in Ligue 1 last season, leaves following their Champions League exit and a 5-0 defeat by Paris St-Germain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-11T15:58:50.339Z",
    "image": "https://image.pollinations.ai/prompt/De%20Zerbi%20leaves%20Marseille%20by%20mutual%20consent%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "de-zerbi-leaves-marseille-by-mutual-consent",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgqejpj4d80o?at_medium=RSS&at_campaign=rss"
  }
]