[
  {
    "originalTitle": "Nigeria remembers master wood carver",
    "title": "Nigeria Says Goodbye to a Super Carving Star!",
    "content": "<h3>Hey Everyone, Your Kid Reporter Here!</h3>\nHey everyone! Your kid reporter here, bringing you some super cool news from our wonderful home, Africa! Today, we have a story about a very special person in Nigeria. His name was Mr. Kasali Akangbe Ogun. Can you say that with me? Kah-sah-lee Ah-kang-bay Oh-goon. He was a super-duper artist! He used wood to make amazing things. Sadly, Mr. Kasali has gone to be with the stars. He was buried, which means his family and friends said goodbye in a special way. He lived a long life, filling it with beautiful art and sharing his amazing talent with everyone.\n\n<h3>What is Wood Carving?</h3>\nDo you know what wood carving is? It's like magic! Imagine a big piece of wood, maybe from a tree. An artist takes special tools, like sharp little knives and chisels. They use these tools very carefully to cut, shape, and smooth the wood. Slowly, slowly, a beautiful shape starts to appear! It could be an animal, a person's face, a powerful mask, or a cool pattern. It takes a lot of skill, a steady hand, and lots of patience.\n\nThink about drawing, but instead of paper and pencils, you're using wood and tools! Mr. Kasali was a \"master\" wood carver. That means he was super, super good at it! He was one of the best and could make wood come alive with his clever hands. He made many, many beautiful things that people loved to look at.\n\n<b>Did you know?</b> Wood carving has been around for thousands and thousands of years! People used to carve tools, cooking utensils, and even big statues long before we had phones or cars! It's an ancient art!\n\n<h3>A Family of Artists!</h3>\nGuess what? Mr. Kasali didn't just learn carving from anywhere. His family was full of wood carvers! It was like a special family secret, passed down from one generation to another. His dad carved, and his granddad carved, and maybe even his great-granddad carved too! Imagine everyone in your family being super good at drawing or playing music! That's how it was for Mr. Kasali with carving.\n\nThey shared their tips and tricks for carving. They learned how to pick the best wood from the forest – wood that was strong and good for carving. They also learned how to make the sharpest tools. This made them very special artists in their community. Their family art was a special gift they shared with the world.\n\n<h3>Keeping Old Stories Alive</h3>\nMr. Kasali loved carving, but he loved something else even more. He wanted to \"preserve local traditions.\" Wow, those are big words! Let's make them simple. \"Traditions\" are like old, special ways of doing things that people have done for a very long time.\n\nMaybe it's a special dance your family does, or a yummy food you eat only on holidays, or a special story that everyone knows. Mr. Kasali used his carvings to tell these old stories and show these old ways. He carved pictures of how people lived a long time ago in Nigeria.\n\nHe carved masks that people used in special dances and ceremonies. He wanted to make sure these important old ways didn't get forgotten. He wanted kids like you to know about the amazing history and culture of Nigeria. His art helped teach people about their past.\n\n<b>Did you know?</b> Different woods have different colors and strengths! Some woods are light and soft, and some are dark and very hard. Artists choose the right wood for their project, depending on what they want to make!\n\n<h3>Why is This Important for Us Kids?</h3>\nWhy is it so important to keep these old traditions and stories alive? Because they tell us who we are! They tell us where we come from. They teach us about our grandmas and grandpas, and their grandmas and grandpas too! Mr. Kasali knew that his carvings were like a time machine. They could show us how things were, long, long ago.\n\nAnd when we know our past, we can understand our present better. It makes our community strong and special! It makes us proud of where we come from. Mr. Kasali's art helps keep the spirit of Nigeria alive for future generations. It's like a big, beautiful history book made out of wood!\n\n<h3>Saying Goodbye</h3>\nMr. Kasali got a little sick for a short time. Then, he went to rest. His family and friends held a special ceremony to say goodbye. This is called a burial. It's a time for people to remember all the good things about the person who has passed away. They might share happy stories, sing special songs, or say prayers. It's a way to show love and respect for someone who has left us. Even though he is gone, his carvings are still here!\n\nThey are like little pieces of Mr. Kasali, still sharing their beauty and stories with us. They remind us of his talent and his love for his culture. These beautiful pieces of art will live on for many, many years, teaching new kids about the rich history of Nigeria.\n\n<b>Did you know?</b> Wood carvings can last for hundreds of years if they are looked after properly! Imagine your great-great-grandchildren looking at a beautiful carving made by Mr. Kasali today!\n\n<h3>Let's Remember Mr. Kasali!</h3>\nSo, what can we learn from Mr. Kasali Akangbe Ogun? We learn that art is important! It helps us express ourselves and share wonderful stories. We learn that our traditions are like treasures. We should cherish them and learn about them from our families and communities.\n\nAnd we learn that one person, like Mr. Kasali, can make a big difference! He helped keep the amazing culture of Nigeria alive through his beautiful hands. His legacy, which means all the great things he left behind, will continue to inspire us. Let's all try to find something special in our own families or communities and learn more about it! Maybe you can even try drawing or creating something with your hands, just like Mr. Kasali! That's all for now, from your kid reporter! Stay curious and keep exploring!",
    "category": "world",
    "date": "2026-01-20T03:40:06.731Z",
    "image": "https://image.pollinations.ai/prompt/Nigeria%20Says%20Goodbye%20to%20a%20Super%20Carving%20Star!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nigeria-says-goodbye-to-a-super-carving-star",
    "originalLink": "https://www.bbc.com/news/articles/cgqelez1kwwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 160 churchgoers kidnapped in twin Nigeria attacks - clergy",
    "title": "Good News Reporters: Helping Our Friends in Nigeria!",
    "content": "<h3>Hello, Little News Explorers!</h3>\nHello, everyone! It’s your friend, your Kid-Friendly News Reporter from Africa, here to share some important news. We want to talk about our friends in a country called Nigeria. Nigeria is a very big and beautiful country right here in Africa, full of wonderful people and amazing stories.\n\n<h3>What Happened in Nigeria?</h3>\nSometimes, sad things happen. Recently, in a place in Nigeria called Kurmin Wali, some bad people caused trouble. They went into two churches when people were inside. Churches are special places where people go to pray, sing, and be together on a Sunday.\n\n<h3>People Were at Church</h3>\nOn this day, many grown-ups and some children were at church. They were doing their Sunday service. This is like a special gathering. Everyone was happy to be together, listening to stories and singing songs.\n\n<h3>What Does 'Kidnapped' Mean?</h3>\nWhen the bad people came, they took some of the grown-ups and children away. This is called 'kidnapping'. It means someone is taken away by force. It makes everyone feel very worried and sad. No one should ever be taken away from their homes or safe places like church.\n\n<h3>More Than 160 Friends Taken</h3>\nMany people were taken, more than 160 of our friends. Think of how many children are in your school; it was like that many people, or even more. This makes us feel a big sadness in our hearts for them and their families.\n\n<h3>Where is Kurmin Wali?</h3>\nThis happened in a place called Kurmin Wali. It is in a part of Nigeria called Kaduna state. Nigeria is a very large country with many states, like different parts of a big puzzle. Kaduna state is just one of these important pieces.\n\n<h3>Police and Helpers Are Busy</h3>\nBut here’s some important news: many good people are working very hard! The police in Nigeria are looking for our friends. The police are like special helpers who keep us safe and find people who are lost or in trouble. They are searching everywhere to bring everyone back home.\n\n<h3>Did You Know?</h3>\nDid you know that Nigeria is the most populated country in Africa? It has so many wonderful people, speaking over 500 different languages! Isn't that amazing? It’s a country full of diverse cultures and traditions.\n\n<h3>Why Do Bad Things Happen?</h3>\nSometimes, bad people do things that are not kind or right. We might not always understand why. But what we do know is that most people in the world are good. And when bad things happen, the good people work even harder to help.\n\n<h3>Our Friends in Nigeria Need Us</h3>\nRight now, our friends in Kurmin Wali need our thoughts and prayers. Even though we are far away, we can send them good wishes. We can wish for them to be strong and to come home safely very soon.\n\n<h3>Being Kind and Strong</h3>\nIt’s okay to feel a little bit sad when we hear news like this. But it’s also important to remember to be brave and strong. We must always be kind to each other and help our neighbours. That's how we make the world a better place.\n\n<h3>How Can We Help?</h3>\nWhat can we do? We can listen to our grown-ups. They keep us safe. We can also be extra kind to our friends and family. A simple smile or a helping hand can make a big difference in someone's day. We can also draw pictures of hope for Nigeria.\n\n<h3>Remembering Our Community</h3>\nRemember, we are all part of one big family here in Africa and around the world. When one part of our family is hurting, we all feel it. But we also share our strength and our hope with each other.\n\n<h3>Looking Forward with Hope</h3>\nWe believe that the police and all the helpers will find our friends. We believe they will be safe and sound back with their families. We send all our love and hope to the people of Kurmin Wali and all of Nigeria.\n\n<h3>Did You Know?</h3>\nDid you know that many Nigerian children love to play football? It's a very popular sport there! They also enjoy telling traditional stories and singing beautiful songs. They have so much joy to share with the world.\n\n<h3>Let's Stay Safe and United!</h3>\nAlways remember to stay safe and listen to your grown-ups. They are there to protect you. And let's always remember to be kind and helpful. That's the best way to make sure our communities are strong and happy. We are all united in our hope for a better tomorrow.\n\n<h3>A Big Thank You!</h3>\nThank you for listening, little news reporters! Let’s keep sending our positive thoughts and hopes to everyone in Nigeria. We’ll be back with more news soon. Bye for now!",
    "summary": "More than 160 churchgoers, including children, were taken by bad people from two churches in Nigeria, but police are working hard to bring them home safely.",
    "whyMatters": "This matters because it's very sad when people are taken away from safe places like church, and it reminds us to be kind, strong, and hope for everyone's safety in our big African family.",
    "category": "world",
    "date": "2026-01-20T03:40:24.778Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News%20Reporters%3A%20Helping%20Our%20Friends%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-reporters-helping-our-friends-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "title": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "content": "The Ethiopian Orthodox festival of Timket, or Epiphany, commemorates the baptism of Jesus in the Jordan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:40:29.917Z",
    "image": "https://image.pollinations.ai/prompt/Drums%2C%20chants%20and%20celebrations%20as%20Ethiopians%20mark%20the%20baptism%20of%20Jesus%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "drums-chants-and-celebrations-as-ethiopians-mark-the-baptism-of-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cr4k3p6x1q5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Denmark sends more troops to Greenland amid tensions with Trump",
    "title": "Denmark sends more troops to Greenland amid tensions with Trump",
    "content": "Nordic country dispatches 'substantial contribution' of troops to the Arctic territory amid standoff with Washington.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:40:35.146Z",
    "image": "https://image.pollinations.ai/prompt/Denmark%20sends%20more%20troops%20to%20Greenland%20amid%20tensions%20with%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "denmark-sends-more-troops-to-greenland-amid-tensions-with-trump",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/denmark-sends-more-troops-to-greenland-amid-tensions-with-trump?traffic_source=rss"
  },
  {
    "originalTitle": "UK to consider Australia-style ban on social media for children",
    "title": "UK to consider Australia-style ban on social media for children",
    "content": "UK ministers will visit Australia to gather information on the social media ban for under-16s implemented last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:40:40.292Z",
    "image": "https://image.pollinations.ai/prompt/UK%20to%20consider%20Australia-style%20ban%20on%20social%20media%20for%20children%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-to-consider-australia-style-ban-on-social-media-for-children",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/uk-to-consider-australia-style-ban-on-social-media-for?traffic_source=rss"
  },
  {
    "originalTitle": "More than 100 vehicle pile-up leaves US motorists stranded in snowstorm",
    "title": "More than 100 vehicle pile-up leaves US motorists stranded in snowstorm",
    "content": "US weather forecasters warn of extremely cold temperatures, potential for winter storms across several states.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:40:45.444Z",
    "image": "https://image.pollinations.ai/prompt/More%20than%20100%20vehicle%20pile-up%20leaves%20US%20motorists%20stranded%20in%20snowstorm%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-than-100-vehicle-pile-up-leaves-us-motorists-stranded-in-snowstorm",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/more-than-100-vehicle-pile-up-leaves-us-motorists-stranded-in-snowstorm?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "content": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:40:51.064Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20he%20will%20'100%25'%20carry%20out%20Greenland%20tariffs%20threat%2C%20as%20EU%20vows%20to%20protect%20its%20interests%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-he-will-100percent-carry-out-greenland-tariffs-threat-as-eu-vows-to-protect-its-interests",
    "originalLink": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Europe is at a total loss': Russia gloats over Greenland tensions",
    "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
    "content": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-20T03:40:56.199Z",
    "image": "https://image.pollinations.ai/prompt/'Europe%20is%20at%20a%20total%20loss'%3A%20Russia%20gloats%20over%20Greenland%20tensions%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "europe-is-at-a-total-loss-russia-gloats-over-greenland-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Italian fashion designer Valentino dies aged 93",
    "title": "Italian fashion designer Valentino dies aged 93",
    "content": "One of the giants of 20th century fashion, his creations were worn by celebrities including Elizabeth Taylor, Julia Roberts and Gwyneth Paltrow.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:41:01.334Z",
    "image": "https://image.pollinations.ai/prompt/Italian%20fashion%20designer%20Valentino%20dies%20aged%2093%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "italian-fashion-designer-valentino-dies-aged-93",
    "originalLink": "https://www.bbc.com/news/articles/cdx4rpxxvg7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "title": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "content": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:41:06.887Z",
    "image": "https://image.pollinations.ai/prompt/Saved%20by%20'special%20talent'%20-%20but%20did%20penalty%20award%20wrong%20Brighton%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "saved-by-special-talent-but-did-penalty-award-wrong-brighton",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Under-pressure Frank 'feeling trust' of Spurs board",
    "title": "Under-pressure Frank 'feeling trust' of Spurs board",
    "content": "Tottenham head coach Thomas Frank says lunch with board members is an \"extremely good sign\" despite pressure mounting on him during an underwhelming season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T03:41:12.029Z",
    "image": "https://image.pollinations.ai/prompt/Under-pressure%20Frank%20'feeling%20trust'%20of%20Spurs%20board%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "under-pressure-frank-feeling-trust-of-spurs-board",
    "originalLink": "https://www.bbc.com/sport/football/articles/czjgp2x072po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City sign Guehi from Palace - what will he bring?",
    "title": "Man City sign Guehi from Palace - what will he bring?",
    "content": "Man City sign Crystal Palace captain Marc Guehi for £20m - but what will the England defender add to Pep Guardiola's side?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-20T03:41:17.173Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20sign%20Guehi%20from%20Palace%20-%20what%20will%20he%20bring%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-sign-guehi-from-palace-what-will-he-bring",
    "originalLink": "https://www.bbc.com/sport/articles/cwy8lve847eo?at_medium=RSS&at_campaign=rss"
  }
]