[
  {
    "originalTitle": "Nigeria remembers master wood carver",
    "title": "Our African Hero: Master Kasali, The Wood Artist!",
    "content": "<h3>A Sad Day in Nigeria</h3>\nHello, my amazing friends! Your Kid Reporter is here with some news from our wonderful continent, Africa. We have some sad news from Nigeria, a big country in West Africa. A very special man named Kasali Akangbe Ogun has gone to be with his ancestors. He was a master at making beautiful things from wood. He passed away after being a little bit sick. People in Nigeria are remembering him and all the amazing art he made. We want to tell you all about him!\n\n<h3>Who Was Master Kasali?</h3>\nKasali Akangbe Ogun was not just any person. He was a very, very talented artist. He could take a simple piece of wood and turn it into something magical. He made statues, masks, and other wonderful decorations. Imagine taking a plain block of wood and making a smiling face or a fierce animal! That's what Master Kasali could do. He used his hands and special tools to bring wood to life.\n\n<h3>What is Wood Carving?</h3>\nWood carving is a very old art form. It's like drawing, but instead of paper and pencils, artists use wood and special tools. They use sharp knives and chisels to cut away tiny pieces of wood. Slowly, slowly, a shape begins to appear! It needs a lot of patience and skill. Imagine trying to cut a perfect circle from a block of wood with a small knife! That's how tricky it can be.\n\nDid you know? People have been carving wood for thousands of years! Even before we had pencils, people were making art from wood. They used wood to tell stories and make important figures.\n\n<h3>A Family of Artists!</h3>\nMaster Kasali was extra special because he came from a very old family of wood carvers. His father was a wood carver, and his grandfather was a wood carver, and maybe even his great-grandfather too! It was like a family secret, passed down from one person to the next. They taught each other how to choose the best wood and how to make the most beautiful carvings.\n\nImagine if everyone in your family was really good at telling stories, or playing music! That's how it was for Kasali's family with wood carving. This special skill was part of their family's history. They learned from each other, making their art even more powerful.\n\nDid you know? In many parts of Africa, skills like carving, weaving, and drumming are taught in families, generation after generation! It helps keep old traditions alive and makes families proud.\n\n<h3>Keeping Traditions Alive</h3>\nMaster Kasali really loved the old ways. He wanted to keep the local traditions of his people strong. What are traditions? Traditions are special ways of doing things that people have done for a very long time. It could be how they tell stories, how they dance, what songs they sing, or how they make art.\n\nBy carving wood in the traditional ways, Master Kasali helped his people remember their history and their culture. He wanted future generations, like you, to know about these beautiful customs. He showed how art can be a bridge between the past and the future.\n\nDid you know? Every country and every community has its own special traditions! They are like treasures that tell us who we are and where we come from. They make us unique and special.\n\n<h3>Our Wonderful Nigeria</h3>\nNigeria is a very big and vibrant country in West Africa. It's known for its rich history, amazing music, delicious food, and incredible art. Master Kasali's art is a part of this rich heritage. Many different groups of people live in Nigeria, and they all have their own unique cultures and traditions.\n\nMaster Kasali's carvings often showed stories and symbols from his own people. His art helped to show the world the beauty of Nigerian culture. It's a country full of creativity and wonderful people.\n\nDid you know? Nigeria is the most populated country in Africa! That means lots and lots of friendly people live there. It's a land of many languages and exciting festivals!\n\n<h3>What He Left For Us</h3>\nEven though Master Kasali is gone, his art will live forever. His carvings are in homes, in museums, and in the hearts of many people. Each piece of wood he carved tells a story. It's like he left us many beautiful books made of wood. These carvings teach us about his people, their beliefs, and their way of life.\n\nThey remind us of the power of art to share stories without words. His work is a gift to Nigeria and to the whole world. His legacy will inspire new artists for many years to come.\n\n<h3>Saying Goodbye</h3>\nMaster Kasali Akangbe Ogun was buried by his family and friends. A burial is a special way to say goodbye to someone we love. It's a time for people to remember the person, share stories, and comfort each other. Even though they are sad, they are also thankful for all the beauty Master Kasali brought into the world with his hands.\n\nIt's a time to celebrate his life and his amazing talent. People will remember him for his kindness and his incredible skill. It's a way to honor a life well-lived.\n\n<h3>Why This Matters To You!</h3>\nWhy is this news important for you, my young friends? Because Master Kasali showed us how important it is to be proud of who we are and where we come from. He showed us that our traditions are like special jewels that we should keep safe. He taught us that art can be a way to tell stories and connect with our past.\n\nMaybe one day you will also find a special talent and use it to share your own culture with the world! Look around you, what beautiful art or traditions do you see in your own community? You too can be a hero by sharing your unique gifts!",
    "summary": "Nigeria remembers Kasali Akangbe Ogun, a wonderful wood carver who kept old traditions alive, as he is laid to rest.",
    "whyMatters": "It's important because Master Kasali showed us how art can tell stories and keep our culture and traditions strong for everyone to learn from.",
    "category": "world",
    "date": "2026-01-20T05:25:24.717Z",
    "image": "https://image.pollinations.ai/prompt/Our%20African%20Hero%3A%20Master%20Kasali%2C%20The%20Wood%20Artist!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-african-hero-master-kasali-the-wood-artist",
    "originalLink": "https://www.bbc.com/news/articles/cgqelez1kwwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 160 churchgoers kidnapped in twin Nigeria attacks - clergy",
    "title": "A Message of Hope for Our Friends in Nigeria",
    "content": "<h3>Hello, My Young Friends!</h3>\nHi everyone! It's me, your kid-friendly news reporter, here to share something important from our big, beautiful continent, Africa. We are going to talk about some news from a country called Nigeria. Sometimes, news can be a little bit sad, but it's important to understand it. And always remember to keep hope in our hearts. We learn about these things so we can be kind and thoughtful helpers in the world.\n\n<h3>What Happened in Nigeria?</h3>\nLast Sunday, a special day when many people go to church to pray and sing, something sad happened in a place called Kurmin Wali, in Nigeria. Some people, who we call \"bad people\" because they do wrong things, came into two churches. They took away many churchgoers.\n\nChurchgoers are just people who love to go to church to worship God and spend time with their community. It was a big number of people, more than 160 men, women, and even some children, who were taken from their churches. This is called being \"kidnapped.\"\n\nBeing kidnapped means they were taken away when they didn't want to go. It's a scary thing when people are taken away like this. Everyone who knows them is very worried and wants them to come home safely.\n\n<h3>Where Did This Happen?</h3>\nThis sad event happened in a country called Nigeria. Nigeria is a very big country in West Africa. It has lots of people, beautiful places, and many different languages. Our African continent is full of amazing countries, and Nigeria is one of them.\n\nSpecifically, it happened in a state called Kaduna. Think of a state like a big area or region inside a country. And Kurmin Wali is a smaller town or village within Kaduna state. So, imagine a small village in a big area, in a big country in Africa. That's where our friends were.\n\n<h3>Who Are the People Taken?</h3>\nThe people taken away were churchgoers. They were just like your parents, grandparents, aunties, uncles, and friends who go to their places of worship. They went to church on Sunday to pray, to sing happy songs, and to listen to stories. It's a place where people feel safe and together.\n\nMany families were there, hoping for a peaceful Sunday. But then, the bad people came and took them away. It's like someone took your friend from school during playtime. Everyone would be very sad and want them back. The leaders of the churches, called clergy, are very sad too. They are trying their best to help everyone.\n\n<h3>Why Do Bad Things Like This Happen?</h3>\nSometimes, there are bad people in the world who make wrong choices. They do things that hurt others. These people are sometimes called \"gangs.\" They think taking people will help them get what they want, like money.\n\nBut doing wrong things is never the right way. It makes many people sad and scared. It's important to remember that most people in the world are good and kind. These bad things are done by a small group. We must always choose kindness and help each other, so the good in the world is stronger than the bad.\n\n<h3>What Are People Doing to Help?</h3>\nEven though this is sad, there are many good people working hard to help. The police in Nigeria are working very hard. Their job is to keep people safe and to find those who do wrong things. They are looking for the missing people and trying to bring them back home to their families.\n\nPeople in the community are also helping. They are praying for their friends and neighbors to return safely. They are also sharing information and helping the police in any way they can. Everyone is working together. It shows how strong people can be when they care about each other.\n\n<h3>Did You Know? Facts</h3>\n*   **Did you know?** Nigeria is the most populated country in Africa! That means lots and lots of people live there!\n*   **Did you know?** There are over 500 different languages spoken in Nigeria! Imagine hearing so many different ways to say \"hello\"!\n*   **Did you know?** Churches are special places where people gather to worship and learn about their faith. They are often very beautiful buildings.\n*   **Did you know?** When something bad happens, communities often become stronger. People help each other more and show extra kindness.\n*   **Did you know?** Police officers are real-life heroes who work hard every day to protect us and keep us safe from bad people.\n\n<h3>How Can We Help?</h3>\nEven if we are far away, we can still help in our hearts. We can send our good thoughts and prayers to the people in Nigeria. We can wish for the kidnapped people to come home soon. We can also learn to be kind to everyone around us. When we are kind, we make our own communities stronger and safer.\n\nAlways listen to your parents and teachers about how to stay safe. They know best how to protect you. Remember, helping others and being kind is like spreading sunshine in the world!\n\n<h3>Let's Keep Hope Alive!</h3>\nIt's so important to remember that even when bad things happen, we must never lose hope. Good people are always working to make things right. And many people around the world care deeply about each other.\n\nLet's keep thinking about our friends in Nigeria, and hope they are safe and come home soon. Let's keep believing in kindness, strength, and the power of people helping people. Together, we can make Africa, and the world, a safer place for everyone. Thank you for listening, my wonderful young friends.",
    "summary": "Sadly, over 160 people were taken from two churches in Nigeria by bad people, and many good people are working hard to bring them home safely.",
    "whyMatters": "It is important because everyone in Africa and around the world deserves to be safe, happy, and free to go to their churches or other special places without fear.",
    "category": "world",
    "date": "2026-01-20T05:25:48.713Z",
    "image": "https://image.pollinations.ai/prompt/A%20Message%20of%20Hope%20for%20Our%20Friends%20in%20Nigeria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-message-of-hope-for-our-friends-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "title": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "content": "The Ethiopian Orthodox festival of Timket, or Epiphany, commemorates the baptism of Jesus in the Jordan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:25:53.877Z",
    "image": "https://image.pollinations.ai/prompt/Drums%2C%20chants%20and%20celebrations%20as%20Ethiopians%20mark%20the%20baptism%20of%20Jesus%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "drums-chants-and-celebrations-as-ethiopians-mark-the-baptism-of-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cr4k3p6x1q5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bangladeshi youth toppled Hasina. Now they could decide next prime minister",
    "title": "Bangladeshi youth toppled Hasina. Now they could decide next prime minister",
    "content": "Young people, who make up 44 percent of voters, ousted Hasina. But they've never seen a competitive election, until now.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:25:59.179Z",
    "image": "https://image.pollinations.ai/prompt/Bangladeshi%20youth%20toppled%20Hasina.%20Now%20they%20could%20decide%20next%20prime%20minister%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladeshi-youth-toppled-hasina-now-they-could-decide-next-prime-minister",
    "originalLink": "https://www.aljazeera.com/features/2026/1/20/bangladeshi-youth-toppled-hasina-now-they-could-decide-next-prime-minister?traffic_source=rss"
  },
  {
    "originalTitle": "North Korea’s Kim Jong Un fires vice premier, publicly rebukes officials",
    "title": "North Korea’s Kim Jong Un fires vice premier, publicly rebukes officials",
    "content": "Kim condemns 'incompetent' party members for delays in government projects in advance of key ruling party meeting.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:04.329Z",
    "image": "https://image.pollinations.ai/prompt/North%20Korea%E2%80%99s%20Kim%20Jong%20Un%20fires%20vice%20premier%2C%20publicly%20rebukes%20officials%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "north-koreas-kim-jong-un-fires-vice-premier-publicly-rebukes-officials",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/north-koreas-kim-jong-un-fires-vice-premier-publicly-rebukes-officials?traffic_source=rss"
  },
  {
    "originalTitle": "Denmark sends more troops to Greenland amid tensions with Trump",
    "title": "Denmark sends more troops to Greenland amid tensions with Trump",
    "content": "Nordic country dispatches 'substantial contribution' of troops to the Arctic territory amid standoff with Washington.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:09.478Z",
    "image": "https://image.pollinations.ai/prompt/Denmark%20sends%20more%20troops%20to%20Greenland%20amid%20tensions%20with%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "denmark-sends-more-troops-to-greenland-amid-tensions-with-trump",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/denmark-sends-more-troops-to-greenland-amid-tensions-with-trump?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "content": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:14.953Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20he%20will%20'100%25'%20carry%20out%20Greenland%20tariffs%20threat%2C%20as%20EU%20vows%20to%20protect%20its%20interests%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-he-will-100percent-carry-out-greenland-tariffs-threat-as-eu-vows-to-protect-its-interests",
    "originalLink": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
    "title": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
    "content": "Transatlantic relations aren't broken, though they are damaged. And if Europeans want to try to cut through with Trump, they'll have to stick together, writes Europe Editor Katya Adler",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:20.114Z",
    "image": "https://image.pollinations.ai/prompt/Confronted%20over%20Greenland%2C%20Europe%20is%20ditching%20its%20softly-softly%20approach%20to%20Trump%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "confronted-over-greenland-europe-is-ditching-its-softly-softly-approach-to-trump",
    "originalLink": "https://www.bbc.com/news/articles/c0lx7j1lrwro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spanish PM vows to find cause of deadly high-speed train crash",
    "title": "Spanish PM vows to find cause of deadly high-speed train crash",
    "content": "Pedro Sanchez announces three days of mourning after at least 40 people died in Sunday's collision in  southern Spain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:25.266Z",
    "image": "https://image.pollinations.ai/prompt/Spanish%20PM%20vows%20to%20find%20cause%20of%20deadly%20high-speed%20train%20crash%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spanish-pm-vows-to-find-cause-of-deadly-high-speed-train-crash",
    "originalLink": "https://www.bbc.com/news/articles/c2d7rk0865go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "title": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "content": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:30.802Z",
    "image": "https://image.pollinations.ai/prompt/Saved%20by%20'special%20talent'%20-%20but%20did%20penalty%20award%20wrong%20Brighton%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "saved-by-special-talent-but-did-penalty-award-wrong-brighton",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Under-pressure Frank 'feeling trust' of Spurs board",
    "title": "Under-pressure Frank 'feeling trust' of Spurs board",
    "content": "Tottenham head coach Thomas Frank says lunch with board members is an \"extremely good sign\" despite pressure mounting on him during an underwhelming season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T05:26:35.948Z",
    "image": "https://image.pollinations.ai/prompt/Under-pressure%20Frank%20'feeling%20trust'%20of%20Spurs%20board%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "under-pressure-frank-feeling-trust-of-spurs-board",
    "originalLink": "https://www.bbc.com/sport/football/articles/czjgp2x072po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City sign Guehi from Palace - what will he bring?",
    "title": "Man City sign Guehi from Palace - what will he bring?",
    "content": "Man City sign Crystal Palace captain Marc Guehi for £20m - but what will the England defender add to Pep Guardiola's side?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-20T05:26:41.103Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20sign%20Guehi%20from%20Palace%20-%20what%20will%20he%20bring%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-sign-guehi-from-palace-what-will-he-bring",
    "originalLink": "https://www.bbc.com/sport/articles/cwy8lve847eo?at_medium=RSS&at_campaign=rss"
  }
]