[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "Sad News for Our Friends in Ghana",
    "content": "<h3>Hello, Friends!</h3>\nHi there, my wonderful little friends! I am your friendly news reporter for Africa. I love telling you about important things happening around our big, beautiful continent and sometimes, even far away. Africa is a place full of sunshine, amazing animals, and lots of lovely people like you! We live in many different countries, speak many languages, and have lots of fun.\n\n<h3>News from Far Away</h3>\nSometimes, we hear news that is a little bit sad. This news comes from a place very, very far from our homes in Africa. It is about a big fight between two countries. This fight is called a war. A war is when people from different countries or groups fight each other, and it is a very sad thing. It makes many people unhappy and scared. The countries fighting right now are called Russia and Ukraine. They are on a different continent, far, far away from Africa.\n\n<h3>Our Friends from Ghana</h3>\nToday, we are going to talk about a country in Africa called Ghana. Ghana is a beautiful country in West Africa. It has sunny beaches and big, green forests. People in Ghana are very friendly and welcoming. (Did you know? Ghana is famous for its delicious cocoa, which is used to make chocolate! It also has a lot of gold!)\n\n<h3>Sad News for Families</h3>\nNow, for the sad part of our news today. A leader from Ghana, who we call a minister, told us something that made many people sad. He said that 55 people who come from Ghana have sadly passed away in the far-away war between Russia and Ukraine. When we say \"passed away,\" it means they are no longer with us. They have left this world. It is a very, very sad thing for their families and friends.\n\n<h3>A Big Number</h3>\nFifty-five people is a big number. It means many families in Ghana are now missing their loved ones. This is the highest number of people from just one African country who have passed away in this war. It means that more people from Ghana have been affected than from any other country in Africa during this fight. This makes us all feel sad for our Ghanaian brothers and sisters.\n\n<h3>Why Were They There?</h3>\nYou might be wondering, \"Why were people from Ghana so far away?\" Well, many people from Africa, just like from other parts of the world, sometimes go to other countries. They go there for different reasons. Some go to study at big schools, called universities. Some go to work and learn new things. And some might go to visit family or friends. These Ghanaian people were living their lives far away when the war suddenly started. They were just trying to live their lives, just like you and I.\n\n<h3>What Does This Mean for Africa?</h3>\nAfrica is a continent that loves peace and harmony. We want everyone to be safe and happy. (Did you know? Africa is the second-largest continent in the world! It has 54 different countries and thousands of different cultures and languages!) When sad things like this happen to people from one of our African countries, it makes all of us feel it. We care about each other. It shows us that war can affect people from all over the world, even if it's happening far away.\n\n<h3>Ghana's Government is Helping</h3>\nThe leaders and government of Ghana are doing their very best to help. They are trying to find out exactly what happened to all the people. They are also working very hard to help the families who are feeling so sad and lost. And they are trying to bring back other Ghanaians who are still in those far-away countries safely to their homes in Ghana. It is a big job, but they are doing it with care.\n\n<h3>Did You Know? About Peace</h3>\nDid you know that peace is one of the most important things in the world? Peace means that everyone is happy, safe, and living together without fighting. When there is peace, kids can play outside, go to school, and learn wonderful new things without being scared. Families can be together, laugh, and share stories. We can all grow up strong and kind. Imagine a world where everyone is always peaceful and kind to each other – wouldn't that be wonderful?\n\n<h3>Hoping for a Better World</h3>\nWe all hope and pray that the fighting between Russia and Ukraine will stop very, very soon. We send our warmest thoughts and our deepest love to the families in Ghana who have lost their loved ones. We also hope for the safety of all people everywhere, especially those who are caught in places where there is war. (Did you know? Many people from different countries work together to try and bring peace to places where there is fighting.) We want a world where every child and every family can live in peace and happiness.\n\n<h3>Let's Be Kind</h3>\nEven though this news is sad, it reminds us of something very important. It reminds us to always be kind to each other. Be kind to your friends, be kind to your family, and be kind to everyone you meet. Kindness is like a warm ray of sunshine that makes everyone feel good inside. When we are kind, we are helping to build a more peaceful world, right here where we are. Let's make our corner of Africa, and the world, full of kindness and love.\n\n<h3>Stay Safe, Little Ones!</h3>\nThank you for listening, my dear friends. Always remember to stay safe, listen to your parents and teachers, and never stop dreaming of a bright and peaceful future for Africa and for the whole world. Until next time, keep shining your wonderful lights!",
    "summary": "We learned today that many people from Ghana sadly passed away because of a war happening very far away, and Africa wants peace for everyone.",
    "whyMatters": "This is important because it shows that sad things can happen far away, but we must always wish for peace and safety for all our African friends and everyone in the world.",
    "category": "world",
    "date": "2026-02-28T19:17:36.336Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20for%20Our%20Friends%20in%20Ghana%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-for-our-friends-in-ghana",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Happy News: Justice for Children in Burkina Faso!",
    "content": "<h3>Justice Served!</h3>\nWe have some very important and happy news to share from a country in Africa called Burkina Faso! A grown-up who did very bad things to two little girls has been stopped. He will now stay in jail for a very, very long time. This means he cannot hurt anyone ever again. This is good news because it shows that justice was done!\n\nJustice means that when someone does something wrong, the right thing happens to make things fair and safe for everyone. It means that bad actions have consequences, and people who do wrong are held responsible.\n\nDid you know? Burkina Faso is a beautiful country in West Africa! It has warm sunshine and many wonderful people.\n\n<h3>What Happened?</h3>\nThis grown-up had a special job. He was from a country far away called America, and he was living in Burkina Faso for his work. But even though he had an important job, he did something terribly, terribly wrong. He hurt two young girls.\n\nThe girls' mother was very sick and sad. When someone in a family is sick, we should all be kind and try to help them. We should make them feel loved and safe. But this man did not help. Instead, he used this sad and difficult time to do bad things to the girls. He made them feel very unsafe and scared. This is never, ever okay.\n\nGrown-ups should always protect children, especially when a family is having a hard time or feeling sad. Children need grown-ups to be kind and keep them safe, not hurt them.\n\nDid you know? Grown-ups called \"police\" and \"judges\" work very hard in many countries, including Burkina Faso, to make sure everyone follows the rules and stays safe!\n\n<h3>A Special Job, But Big Rules</h3>\nThis man was called a \"diplomat.\" A diplomat is like a special messenger or a representative. They work for their country in another country. Their job is usually to help their country and the country they are in be friends and work together on important things.\n\nBut even if someone has a very important job like a diplomat, they *must* follow all the rules. The rules are there to keep everyone safe, especially children. No one, no matter how important they seem, is allowed to hurt a child or make them feel unsafe. Everyone must follow the law.\n\nPeople who tell us about the court case said this man took advantage of the girls' family when they were sad and scared because the mother was sick. This is a very serious and very wrong thing to do. Taking advantage of someone in need is never acceptable.\n\nDid you know? Every country has rules, and everyone living in that country must follow them! These rules help keep peace and order.\n\n<h3>Why This Is Important</h3>\nThis news shows us something very important: when someone does something bad, they will be caught, and there will be consequences. Consequences mean what happens after you do something. For this man, the consequence is staying in jail for a very, very long time. This is called \"life in prison.\"\n\nIt means he cannot hurt anyone ever again. This outcome helps to protect other children and shows that serious wrongs are addressed seriously. It's a reminder that justice is powerful.\n\nIt's important for everyone to feel safe. Especially children. Children have a right to be safe, to play, to learn, and to grow up without anyone hurting them. No one should ever make a child feel scared or uncomfortable.\n\nWhen bad things happen, it's very brave to tell a grown-up you trust. Like your mum, dad, an auntie, uncle, teacher, or another trusted family member. They will listen to you and help you. They will make sure you are safe.\n\nDid you know? You have a special right called \"the right to be safe\"! All children around the world have this right, and many grown-ups work hard to protect it.\n\n<h3>Who Can You Trust?</h3>\nSometimes, grown-ups can make mistakes, and sometimes, very rarely, a grown-up might do something bad. It's important to remember that most grown-ups are kind, loving, and want to help you. They want to see you happy and safe.\n\nIf someone ever makes you feel uncomfortable, or asks you to keep a secret that feels wrong, or touches you in a way you don't like, you must tell a trusted adult. It’s important to speak up!\n\nA trusted adult is someone who listens to you carefully, believes you, and helps you. They will keep you safe and make sure you get the help you need. You can always tell them anything that worries you.\n\nDid you know? It's never your fault if someone hurts you or makes you feel unsafe. And it's never too late to tell someone you trust. Your voice is important!\n\n<h3>Working Together for Safety</h3>\nThe police, the courts, and good people everywhere work together to make sure bad people are stopped and children are protected. This story from Burkina Faso shows that justice works! It shows that people care very much about children's safety and well-being.\n\nLet's all remember to be kind to each other, to help those in need, and to always speak up if we see something that is not right. By doing this, we can make our world a safer and happier place for everyone, especially for all the children.\n\nDid you know? Many brave people in Africa and all over the world work every day to protect children and make sure they can grow up happy and safe!",
    "summary": "A man who worked for America was sent to jail for a very long time because he hurt two young girls in Burkina Faso, showing that justice helps keep children safe.",
    "whyMatters": "This is important because it shows that no one is above the rules, and people who hurt children will be stopped, helping all kids feel safer and know they can speak up to a trusted adult if they ever need help.",
    "category": "world",
    "date": "2026-02-28T19:17:57.161Z",
    "image": "https://image.pollinations.ai/prompt/Happy%20News%3A%20Justice%20for%20Children%20in%20Burkina%20Faso!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "happy-news-justice-for-children-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "title": "Epstein tried to buy a palace in Morocco days before his arrest in 2019",
    "content": "The disgraced financier was in talks to buy luxury abode Bin Ennakhi - but the purchase was never completed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:02.278Z",
    "image": "https://image.pollinations.ai/prompt/Epstein%20tried%20to%20buy%20a%20palace%20in%20Morocco%20days%20before%20his%20arrest%20in%202019%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "epstein-tried-to-buy-a-palace-in-morocco-days-before-his-arrest-in-2019",
    "originalLink": "https://www.bbc.com/news/articles/c1w5848vq51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Suspected Iranian drone hits Bahrain high-rise building",
    "title": "Suspected Iranian drone hits Bahrain high-rise building",
    "content": "A suspected Iranian drone struck a high-rise building in Bahrain.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-28T19:18:07.541Z",
    "image": "https://image.pollinations.ai/prompt/Suspected%20Iranian%20drone%20hits%20Bahrain%20high-rise%20building%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suspected-iranian-drone-hits-bahrain-high-rise-building",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/28/suspected-iranian-drone-hits-bahrain-high-rise-building?traffic_source=rss"
  },
  {
    "originalTitle": "Nine months after 12-day war, US, Israel seek to topple Iran’s leaders",
    "title": "News from Far Away Lands: Wishing for Peace!",
    "content": "<h3>Hello, Friends! Your African News Reporter Here!</h3>\nHello, my amazing friends! It's your friendly news reporter, from right here in beautiful Africa. I hope you're all having a wonderful day, learning and playing!\n\nToday, we have some news from far, far away. It's about some countries that are having a little bit of a disagreement. It's important to know about what happens around the world, even when it's far from our homes.\n\nWe always want everyone to be happy and safe, right? Just like when you play with your friends, sometimes there are good times and sometimes there are little wobbles.\n\n<h3>Far Away Countries</h3>\nToday, we are going to talk about three countries that are very, very far from Africa. Imagine flying in an airplane for a long, long time! These countries are called the United States, Israel, and Iran. Can you say those names? United States, Israel, Iran. Good job!\n\nDid you know? The world is made up of many, many countries, just like a big puzzle! Each country has its own people, its own languages, and its own special stories. Isn't that amazing?\n\nThe United States is a very big country. It is across a huge ocean. Israel and Iran are in a part of the world called the Middle East. It's also far from us, but closer to each other.\n\n<h3>What Are Countries?</h3>\nYou might be asking, \"What is a country?\" Well, a country is like a very, very big neighbourhood. It has lots of towns, cities, and villages. All the people who live in a country usually share some things, like the same rules and sometimes the same language.\n\nImagine your school. Your school has rules, and teachers help you follow them. A country is much bigger, and it has leaders who help everyone follow the rules and live happily.\n\nDid you know? Africa itself is a huge continent with many, many different countries! We have Ghana, Nigeria, Kenya, South Africa, and so many more! We are all neighbours on this big continent.\n\n<h3>Meet the Leaders</h3>\nEvery country has people who help lead it. We call them \"leaders.\" These leaders are like the head teachers of a very big school. They try to make good decisions for everyone in their country. They want to keep their people safe and happy.\n\nSometimes, leaders from different countries talk to each other. They talk about things that are important for their countries and for the world. Just like you talk to your friends when you need to decide what game to play.\n\n<h3>Why Do Countries Disagree?</h3>\nSometimes, countries and their leaders don't always agree on everything. Just like you might have different ideas from your friends sometimes. Maybe you want to play football, and your friend wants to play tag! It's normal to have different ideas.\n\nFor the United States, Israel, and Iran, they have had some disagreements for a long time. These disagreements are about many different things, like how they think things should be done in their part of the world.\n\nDid you know? Talking is a very important way to solve disagreements! When you talk and listen to each other, you can often find a way to be friends again or understand each other better.\n\n<h3>What Does \"Attacks\" Mean?</h3>\nOur news today talks about \"attacks.\" Now, this word can sound a bit scary, but let's understand what it means in a simple way. When the news says \"attacks,\" it means that these countries are doing things that make each other unhappy or worried.\n\nIt's like when friends shout at each other or do things that hurt feelings. Sometimes, it can mean that they are doing things to stop the other country from doing something they don't like. It's not about being friendly and playing together. It's about serious disagreements.\n\nIt makes people sad when countries are not getting along. Everyone wants to live in peace, where people are kind and safe.\n\n<h3>Making Things Shaky</h3>\nThe news also said that these actions \"risk destabilising the Middle East.\" What does \"destabilising\" mean? Imagine building a tall tower with blocks. If someone pushes a block out from the bottom, the tower might get shaky, right? It might even fall down!\n\nWhen countries disagree strongly, and do things that make each other upset, it can make things \"shaky\" or \"unstable\" in their part of the world. This means people can feel worried, not safe, and it can make everyday life harder for them.\n\nIt's like the playground becoming a bit unsafe because kids are arguing. Did you know? When things are \"stable,\" it means they are steady and calm, like a strong tree that doesn't wobble much in the wind. We want countries to be stable and peaceful!\n\n<h3>What Do We Want? Peace!</h3>\nFrom Africa, we always wish for peace for everyone, everywhere. Peace means being safe, being kind, and helping each other. It means talking things through when there are problems, instead of making things shaky.\n\nWhen countries have disagreements, we hope they can find ways to talk and become friends again. Or at least, find a way to live side-by-side without making things difficult for each other.\n\n<h3>Talking Helps</h3>\nThink about your own life. If you have a problem with a friend, what do you do? You talk to them, right? You tell them how you feel, and you listen to how they feel. And then you try to find a solution together.\n\nCountries are much bigger than friends, but the idea is similar. Talking, listening, and trying to understand each other are very important. It's how we build bridges, not walls, between people and places.\n\nDid you know? Many wise people around the world believe that talking is the best way to solve problems. It's much better than making things shaky or doing things that hurt.\n\n<h3>Our Message From Africa</h3>\nHere in Africa, we believe in ubuntu – it means \"I am because we are.\" It means we are all connected, and we should care for each other. So, even though these countries are far away, we care about them.\n\nWe want them to find peace. We hope that the leaders of the United States, Israel, and Iran can find good ways to talk and sort out their disagreements. We wish for them to stop doing things that make others worried.\n\n<h3>Let's Hope for Peace</h3>\nSo, my young friends, that's our news from far away today. It's a reminder that even in big countries, people sometimes have disagreements. But our biggest hope is always for peace.\n\nLet's all keep hoping that these countries can find a way to be peaceful neighbours. Let's send them our good wishes from Africa, wishing for calm, kindness, and smiles for everyone.\n\nThank you for listening, and remember to be kind to your neighbours and friends today! See you next time for more news from around the world!",
    "summary": "Some countries far away, the United States, Israel, and Iran, are having disagreements, and we hope they can talk and find a peaceful way to be good neighbours.",
    "whyMatters": "It matters because when countries don't get along, it can make people in those places worried and unsafe, and we all want everyone to be happy, safe, and live in peace.",
    "category": "world",
    "date": "2026-02-28T19:18:31.287Z",
    "image": "https://image.pollinations.ai/prompt/News%20from%20Far%20Away%20Lands%3A%20Wishing%20for%20Peace!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-from-far-away-lands-wishing-for-peace",
    "originalLink": "https://www.aljazeera.com/editorial/2026/2/28/nine-months-after-12-day-war-us-israel-seek-to-topple-irans-leaders?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan edge last-ball thriller against Sri Lanka but exit T20 World Cup",
    "title": "Pakistan edge last-ball thriller against Sri Lanka but exit T20 World Cup",
    "content": "Pakistan needed to beat Sri Lanka by a substantial margin to leapfrog New Zealand into second semifinal qualifying spot.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:36.397Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20edge%20last-ball%20thriller%20against%20Sri%20Lanka%20but%20exit%20T20%20World%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-edge-last-ball-thriller-against-sri-lanka-but-exit-t20-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/28/pakistan-edge-last-ball-thriller-against-sri-lanka-but-exit-t20-world-cup?traffic_source=rss"
  },
  {
    "originalTitle": "Inside Iran, panic as strikes hit but for some it's a moment of relief",
    "title": "Inside Iran, panic as strikes hit but for some it's a moment of relief",
    "content": "Iranians talk about what is happening inside the country, despite an almost total internet blackout.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:41.767Z",
    "image": "https://image.pollinations.ai/prompt/Inside%20Iran%2C%20panic%20as%20strikes%20hit%20but%20for%20some%20it's%20a%20moment%20of%20relief%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "inside-iran-panic-as-strikes-hit-but-for-some-its-a-moment-of-relief",
    "originalLink": "https://www.bbc.com/news/articles/c05v8jzjn40o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Luxury Dubai hotel hit as Iran launches retaliatory strikes across region",
    "title": "Luxury Dubai hotel hit as Iran launches retaliatory strikes across region",
    "content": "Smoke and flames rose from Dubai's Fairmont The Palm hotel as civilian targets came under fire along with the US military bases across the middle east.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:46.879Z",
    "image": "https://image.pollinations.ai/prompt/Luxury%20Dubai%20hotel%20hit%20as%20Iran%20launches%20retaliatory%20strikes%20across%20region%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "luxury-dubai-hotel-hit-as-iran-launches-retaliatory-strikes-across-region",
    "originalLink": "https://www.bbc.com/news/articles/c204px4zddro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At least 20 killed after military plane carrying banknotes crashes in Bolivia",
    "title": "At least 20 killed after military plane carrying banknotes crashes in Bolivia",
    "content": "Police fire tear gas to disperse crowds allegedly trying to take banknotes from the crash site.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:52.017Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2020%20killed%20after%20military%20plane%20carrying%20banknotes%20crashes%20in%20Bolivia%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-20-killed-after-military-plane-carrying-banknotes-crashes-in-bolivia",
    "originalLink": "https://www.bbc.com/news/articles/c0rjpxxpp49o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Celtic & Rangers face double jeopardy in derby like no other",
    "title": "Celtic & Rangers face double jeopardy in derby like no other",
    "content": "BBC Scotland chief sportswriter Tom English sets the scene going into a compelling Old Firm spectacle on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:18:57.368Z",
    "image": "https://image.pollinations.ai/prompt/Celtic%20%26%20Rangers%20face%20double%20jeopardy%20in%20derby%20like%20no%20other%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "celtic-and-rangers-face-double-jeopardy-in-derby-like-no-other",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj98yny3m3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More VAR challenge trials expected during two-year review",
    "title": "More VAR challenge trials expected during two-year review",
    "content": "Pierluigi Collina says there will be further trials of a challenge system as part of a two-year review of VAR.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:19:02.484Z",
    "image": "https://image.pollinations.ai/prompt/More%20VAR%20challenge%20trials%20expected%20during%20two-year%20review%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "more-var-challenge-trials-expected-during-two-year-review",
    "originalLink": "https://www.bbc.com/sport/football/articles/cdxzerk1yr9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Out of absolutely nothing' - Lamine Yamal's solo stunner",
    "title": "'Out of absolutely nothing' - Lamine Yamal's solo stunner",
    "content": "Lamine Yamal goes on a brilliant solo run before curling an effort into the far corner to score his second goal, en route to his first career hat-trick in Barcelona's 4-1 win over Villarreal in La Liga.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-28T19:19:07.592Z",
    "image": "https://image.pollinations.ai/prompt/'Out%20of%20absolutely%20nothing'%20-%20Lamine%20Yamal's%20solo%20stunner%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "out-of-absolutely-nothing-lamine-yamals-solo-stunner",
    "originalLink": "https://www.bbc.com/sport/football/videos/cddn50mjy23o?at_medium=RSS&at_campaign=rss"
  }
]