[
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "Helping Babies Be Healthy! A Story About Medicine in Africa",
    "content": "<h3>Hello, My Amazing Friends!</h3>\n<p>Hello, hello, my wonderful friends all over Africa! I am your friendly news reporter. Today, we have an important story. It's about keeping our little baby brothers and sisters safe and healthy. It's also about fairness!</p>\n<p>Our story takes us to a lovely country called Guinea-Bissau. It is in West Africa, just like many of our homes. Do you know where that is? Maybe find it on a map with your teacher!</p>\n\n<h3>What is Hepatitis B?</h3>\n<p>Sometimes, little babies can get sick. There is a sickness called \"Hepatitis B.\" It's like a tiny, tiny bug that can make people feel unwell. This bug can hurt a special part of your body. It's called your liver. Your liver helps you digest food and stay strong. It's a very important worker inside you!</p>\n<p>Did you know? Your liver is about the size of a soccer ball for a grown-up! It works hard every day to keep you healthy.</p>\n<p>Babies can sometimes get this bug from their mommy when they are born. But don't worry, there are ways to help them!</p>\n\n<h3>What is a Special Medicine?</h3>\n<p>For Hepatitis B, there is a special medicine. We call it a \"treatment\" or a \"vaccine.\" It's like a shield or a superhero power for your body. This medicine helps your body fight off the tiny bug. It stops the bug from making you sick. It makes babies strong and healthy.</p>\n<p>Doctors and nurses often give babies this special medicine soon after they are born. This is because it works best to protect them right away. It's like putting on your rain jacket before it rains!</p>\n<p>Did you know? Vaccines have helped save millions and millions of lives around the world! They are super important for keeping kids healthy.</p>\n\n<h3>A Big Idea for Guinea-Bissau</h3>\n<p>Now, some people had a big idea. These people got money from America, far away across the ocean. They wanted to do a \"study\" or a \"trial\" in Guinea-Bissau. A \"study\" means they want to try something to see if it works best. They wanted to see if giving babies a different kind of medicine for Hepatitis B would be good.</p>\n<p>This sounds like a good idea, right? Helping babies is always good. But there was a problem. A very important group of helpers said \"Wait a minute!\"</p>\n\n<h3>Who is the WHO?</h3>\n<p>The important group is called the WHO. WHO stands for \"World Health Organization.\" Imagine a team of the best doctors and health helpers from all over the world. That's the WHO! Their job is to make sure everyone stays healthy. They also make sure things are fair when it comes to medicine and health.</p>\n<p>Did you know? The WHO works in almost every country in the world! They help make sure everyone gets good healthcare.</p>\n\n<h3>The Problem: Not Fair!</h3>\n<p>The WHO looked at the big idea for the babies in Guinea-Bissau. And they said, \"This is not fair!\" They used a big word: \"unethical.\" \"Unethical\" means something is not right or not fair. It means it goes against what is good and kind.</p>\n<p>Here's why they said it wasn't fair. The people with the money from America wanted to give the special medicine to *some* babies. But they planned *not* to give it to *other* babies. They wanted to compare the two groups.</p>\n<p>But wait! There is already a good medicine that helps babies with Hepatitis B. It already works. So, the WHO asked, \"Why would you not give this good medicine to *all* the babies?\"</p>\n<p>Did you know? Fairness is important in everything we do, from sharing toys to helping people get well!</p>\n\n<h3>Why Fairness Matters So Much</h3>\n<p>Imagine you have a big basket of delicious fruit. You want to share it with your friends. But you only give fruit to half of your friends. The other half gets nothing. That wouldn't feel very fair, would it?</p>\n<p>It's the same with medicine that can save babies' lives. If there is already a good medicine that works, every baby who needs it should get it. It's not fair to say, \"You get the help, but you don't,\" especially when we know the medicine works.</p>\n<p>The WHO wants to protect all babies. They want to make sure that no baby misses out on important medicine that can keep them healthy. They want to make sure all studies are done in a way that is kind and safe for everyone, especially the smallest and most vulnerable.</p>\n\n<h3>What Happens Now?</h3>\n<p>Because the WHO said this was not fair, everyone is now talking about it. They are thinking very carefully. The goal is always to keep babies safe and healthy.</p>\n<p>It means that if we are trying new ways to help, we must always make sure everyone gets the best care we already have. No baby should be left without help if a good help already exists.</p>\n<p>This story reminds us that kindness and fairness are super important. Even when we are trying to discover new things, we must always remember to protect everyone. Especially our tiny, precious babies.</p>\n<p>Thank you for listening, my dear friends. Stay curious and stay kind! Until next time, keep shining!</p>",
    "summary": "The World Health Organization (WHO) says it is not fair to give a sickness medicine to only some babies in Guinea-Bissau while not giving it to others, especially since a good medicine already exists.",
    "whyMatters": "It is important because all babies deserve to be safe and healthy, and we must always be fair and kind when helping people with medicine, making sure everyone gets the best care available.",
    "category": "world",
    "date": "2026-02-15T04:18:48.633Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Babies%20Be%20Healthy!%20A%20Story%20About%20Medicine%20in%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-babies-be-healthy-a-story-about-medicine-in-africa",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Money Flowers? A Fun New Way to Share Love in Kenya!",
    "content": "<h3>Hello, Amazing Friends!</h3>\n\nHello, hello, everyone! It’s your friendly reporter, Leo, here with some exciting news from beautiful Africa! Today, we’re flying over to a wonderful country called Kenya. It’s a place with sunny skies, amazing animals, and super friendly people. And guess what? They have a new and very interesting way to show love! Are you ready to hear about it?\n\n<h3>What is Valentine's Day?</h3>\n\nFirst, let’s talk about a special day called Valentine’s Day. Have you heard of it? It’s a day we celebrate in many parts of the world. It usually happens in February. On this day, people like to show extra love and kindness to the people they care about. It could be your mom, your dad, your grandparents, or even your best friend! People often give cards, little gifts, or lovely red roses. Red is the color of love, you know!\n\n**Did you know?** Valentine's Day is named after a kind person from a long, long time ago. It's a day to remember to be extra sweet to others!\n\n<h3>Flowers or Money?</h3>\n\nNow, imagine this: When you think of a gift, what comes to mind? Maybe a new toy? A yummy treat? Or perhaps a beautiful bunch of flowers? For many years, people loved to give bouquets of fresh, colorful flowers on Valentine’s Day. A bouquet is like a big bunch of flowers tied together with a pretty ribbon. They smell so sweet and look so nice!\n\nBut in Kenya, something new and super cool is happening! Instead of just flowers, people are now giving 'bouquets' made of… money! Yes, you heard me right! Little paper money notes are being rolled up and arranged to look like a beautiful bunch of flowers. Isn’t that amazing and a little bit funny?\n\n<h3>Why Money Flowers?</h3>\n\nSo, why are people in Kenya doing this? Well, think about it. Flowers are lovely, but they don't last very long, do they? After a few days, they start to wilt and lose their bright colors. But money? Money can last for a long, long time! And you can use money to buy many things you need or want.\n\nImagine getting a money bouquet. You could use that money to buy new books for school, or maybe some delicious food, or even save it up for a really big toy you want! So, some people think a money bouquet is a very helpful and practical gift. It’s a gift that keeps on giving!\n\n**Did you know?** The word 'money' comes from an old Roman temple where money was made a long, long time ago!\n\n<h3>How Do They Look?</h3>\n\nThese money bouquets are not just regular money tied together. Oh no! They are made to look very special and pretty. People carefully fold and roll up the money notes. Then, they arrange them with colorful ribbons, shiny paper, and sometimes even a few real flowers to make it extra fancy. They put a lot of effort into making them look like a true work of art! It’s like a super creative way to give a gift.\n\nImagine opening a gift and seeing all those colorful money notes arranged like petals of a flower. It would be a big surprise, wouldn't it? It’s like getting a magic flower that can help you buy things!\n\n<h3>Where is Kenya?</h3>\n\nLet’s quickly fly back to our map! Kenya is a wonderful country in East Africa. It has sunny beaches, tall mountains, and big plains where amazing animals like lions, elephants, and giraffes live. The people of Kenya are known for their warm smiles and rich cultures. Nairobi is the capital city, a busy and exciting place! It’s a country full of life and new ideas, just like these money bouquets.\n\n**Did you know?** Kenya is home to the Great Migration, where millions of wildebeest and zebras travel across the land. It's one of the biggest animal shows on Earth!\n\n<h3>But Wait, Some Grown-ups Have Worries</h3>\n\nEven though money bouquets are fun and exciting, some grown-ups in Kenya are a little bit worried about them. It’s important to talk about why.\n\n**Worry Number 1: Safety.** Imagine someone walking around with a very big and beautiful bouquet made of lots of money. Everyone can see it, right? Sometimes, showing off a lot of money can make people unsafe. It’s usually better to keep special gifts private and not let everyone know how much money you have. Grown-ups want everyone to be safe and sound.\n\n**Worry Number 2: What is True Love?** Another worry is about what Valentine’s Day is really about. Is it about how much money you can give? Or is it about showing someone you truly care for them? A small gift that you made yourself, or a heartfelt card, or even just a warm hug can mean so much more than a very expensive gift. Love comes from the heart, not just from money.\n\n**Did you know?** A hug can make you feel happy and loved! It's a wonderful way to show you care.\n\n<h3>The Real Meaning of Gifts</h3>\n\nSo, what's the most important thing to remember? Gifts are wonderful, but the real reason we give them is to show love, appreciation, and kindness. It doesn't matter if it's a super fancy money bouquet or a little drawing you made with crayons. What matters is the thought and love you put into it.\n\nIt’s good to be creative, like the people making money bouquets. But it's also good to remember that showing love can be as simple as helping with chores, sharing your toys, or just saying a kind word to someone. These things don't cost any money at all!\n\n<h3>Be Kind, Be Safe, Be Loving!</h3>\n\nSo, there you have it! A fun and interesting story from Kenya about money bouquets. It's a new way to celebrate, but it also reminds us to think about what really matters: showing love in a safe and true way. Whether you give flowers, money, or just a big smile, remember to be kind, be safe, and spread love everywhere you go!\n\nThis is Leo, your kid-friendly reporter, signing off from Africa. Stay curious, stay happy, and keep shining brightly! Bye for now!",
    "category": "world",
    "date": "2026-02-15T04:19:05.521Z",
    "image": "https://image.pollinations.ai/prompt/Money%20Flowers%3F%20A%20Fun%20New%20Way%20to%20Share%20Love%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "money-flowers-a-fun-new-way-to-share-love-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:19:10.681Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gunmen kill at least 32 people in northern Nigeria, residents say",
    "title": "Gunmen kill at least 32 people in northern Nigeria, residents say",
    "content": "Witnesses say the motorcycle riding gunmen attacked three communities in northern Nigeria, killing and abducting dozens.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:19:16.164Z",
    "image": "https://image.pollinations.ai/prompt/Gunmen%20kill%20at%20least%2032%20people%20in%20northern%20Nigeria%2C%20residents%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gunmen-kill-at-least-32-people-in-northern-nigeria-residents-say",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/gunmen-kill-at-least-32-people-in-northern-nigeria-residents-say?traffic_source=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,452",
    "title": "Big News From Far Away: A Story of Helping and Hope!",
    "content": "Hello, my wonderful friends from Africa! It's me, your friendly news reporter, here to share some important news with you. Today, we're going to talk about something happening very far away, in a place called Europe. It's a bit of a serious story, but it's also about hope and people helping each other.\n\n<h3>Hello, Friends from Africa!</h3>\nI hope you are all having a super day, playing games and learning new things at school! My name is [Your Reporter Friend], and I love sharing news with you. We live on a beautiful continent called Africa, full of sunshine, amazing animals, and lots of friendly people.\n\nSometimes, we hear about things happening in other parts of the world. It’s important to know what’s going on, even when it’s far from our homes. Today, we are going to learn about two countries, Russia and Ukraine, that are very, very far away from us.\n\nDid you know? Our world is a giant ball called Earth! Africa is just one part of this big world. There are many other countries and continents all around us. Knowing about them helps us understand our world better.\n\n<h3>What's Happening Far, Far Away?</h3>\nImagine two friends who used to play together, but now they are having a very big disagreement. This is a bit like what is happening between two countries called Russia and Ukraine. They are not playing nicely, and it has been going on for a very long time. This is what grown-ups call a 'war'.\n\nA 'war' means that people in these two countries are not agreeing, and there is a lot of fighting. This fighting makes loud noises, and sometimes, homes and schools get broken. It makes people very sad and scared. No one likes fighting, especially when it goes on for a long, long time.\n\nIt’s important to remember that this fighting is happening far, far away from Africa. We in Africa are safe and sound, and we pray for peace for everyone in the world.\n\nDid you know? Ukraine is a country known for its beautiful sunflower fields! Sunflowers are big, yellow flowers that always turn to face the sun. They bring a lot of joy.\n\n<h3>Day 1,452: A Long, Long Time</h3>\nThe news talked about \"Day 1,452.\" That's a super big number, isn't it? Let's think about it. One year has 365 days. So, 1,452 days is much, much longer than just one year. It's like going to school for many, many years without stopping for a long holiday!\n\nThis means the disagreement between Russia and Ukraine has been going on for over three years. Imagine not being able to play with your friends, or having your school closed for such a long time. It makes life very difficult for the children and grown-ups there.\n\nEvery day that passes is another day of hoping for peace. People around the world, including many kind hearts in Africa, wish for this fighting to stop. We want everyone to be safe and happy again.\n\nDid you know? The number 1,452 is quite big! If you count one day at a time, it would take you more than three years to count up to this number! That's a lot of sunrises and sunsets.\n\n<h3>People Helping Each Other</h3>\nEven though it’s a sad story, there's also a lot of kindness happening. When people are in trouble, other kind people from all over the world come to help. This is like when your friend falls, and you help them up.\n\nMany people from different countries are sending food, clothes, and toys to the children and families in Ukraine. They are also helping people find safe places to stay if their homes are broken. These helpers are truly amazing!\n\nImagine if your friend needed help, you would want to help them, right? That's what these kind people are doing. They are showing that even when there's fighting, there's also a lot of love and care in the world.\n\nDid you know? Many aid workers, who are like super helpers, travel to different countries to help people in need. They bring medicines, build shelters, and make sure children can still learn and play.\n\n<h3>What Do People Need?</h3>\nBecause of the fighting, many children in Ukraine cannot go to their schools. Their schools might be damaged, or it might not be safe to go outside. This means they miss their teachers and their friends.\n\nSometimes, families have to leave their homes and go to another city or country to be safe. It’s hard to leave your home and all your toys behind. They need new places to live and new friends to play with.\n\nPeople also need warm clothes, especially when it gets cold. They need yummy food to eat every day. And most importantly, they need to feel safe and loved.\n\nDid you know? Many children in Ukraine love playing football, just like many children in Africa! They also enjoy drawing pictures and reading stories. These are things that make children happy everywhere.\n\n<h3>Our Wish for the World</h3>\nAs your African news reporter, my biggest wish, and I know it's your wish too, is for everyone in the world to live in peace. Peace means no fighting, no loud noises, and everyone being friends.\n\nWe hope that Russia and Ukraine can find a way to stop the fighting very soon. We wish for all the children there to go back to school, play with their friends, and feel safe in their own beds every night.\n\nEven though this is happening far away, it reminds us to be kind to each other every day in our own homes and schools. Let's always choose friendship over fighting.\n\nDid you know? When children around the world sing songs, they often sing about peace and happiness. Music is a beautiful way to share our hopes for a better world.\n\nLet's always remember to be good friends and to spread kindness wherever we go. Thank you for listening, my wonderful friends! See you next time with more news from our amazing world.",
    "summary": "Far away, two countries, Russia and Ukraine, have been disagreeing for a very long time, making people sad, but lots of kind helpers are sending food and toys, and we all hope for peace.",
    "whyMatters": "This news is important because it shows us that fighting is sad and hurts people's homes, but it also shows how kind people from all over the world help each other, and it reminds us to always be friends and wish for peace.",
    "category": "world",
    "date": "2026-02-15T04:19:38.394Z",
    "image": "https://image.pollinations.ai/prompt/Big%20News%20From%20Far%20Away%3A%20A%20Story%20of%20Helping%20and%20Hope!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-news-from-far-away-a-story-of-helping-and-hope",
    "originalLink": "https://www.aljazeera.com/news/2026/2/15/russia-ukraine-war-list-of-key-events-day-1452?traffic_source=rss"
  },
  {
    "originalTitle": "US army launches retaliatory strikes on dozens of ISIL targets in Syria",
    "title": "US army launches retaliatory strikes on dozens of ISIL targets in Syria",
    "content": "Operation Hawkeye has killed and captured more than 50 ISIL fighters after hitting about 100 targets.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:19:43.555Z",
    "image": "https://image.pollinations.ai/prompt/US%20army%20launches%20retaliatory%20strikes%20on%20dozens%20of%20ISIL%20targets%20in%20Syria%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-army-launches-retaliatory-strikes-on-dozens-of-isil-targets-in-syria",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/us-army-launches-retaliatory-strikes-on-dozens-of-isil-targets-in-syria?traffic_source=rss"
  },
  {
    "originalTitle": "Russia killed opposition leader Alexei Navalny using dart frog toxin, UK says",
    "title": "Russia killed opposition leader Alexei Navalny using dart frog toxin, UK says",
    "content": "There is no innocent explanation for the toxin being found in samples taken from Navalny's body, Foreign Office says.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:19:49.348Z",
    "image": "https://image.pollinations.ai/prompt/Russia%20killed%20opposition%20leader%20Alexei%20Navalny%20using%20dart%20frog%20toxin%2C%20UK%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-killed-opposition-leader-alexei-navalny-using-dart-frog-toxin-uk-says",
    "originalLink": "https://www.bbc.com/news/articles/cwyk4lz4e3eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rubio says US and Europe 'belong together' despite tensions",
    "title": "Rubio says US and Europe 'belong together' despite tensions",
    "content": "The US secretary of state reassures European leaders that the Trump administration backs the transatlantic alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:19:54.501Z",
    "image": "https://image.pollinations.ai/prompt/Rubio%20says%20US%20and%20Europe%20'belong%20together'%20despite%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rubio-says-us-and-europe-belong-together-despite-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c2lrdq47149o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Motorbike raids on villages kill at least 30 in Nigeria",
    "title": "Motorbike raids on villages kill at least 30 in Nigeria",
    "content": "Assailants shot dead or cut the throats of their victims, lit homes on fire and abducted multiple people in Niger state, Nigeria.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-15T04:19:59.626Z",
    "image": "https://image.pollinations.ai/prompt/Motorbike%20raids%20on%20villages%20kill%20at%20least%2030%20in%20Nigeria%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "motorbike-raids-on-villages-kill-at-least-30-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/ckg1y0nk641o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'The officials looked petrified' - was Villa Park chaos advert for VAR?",
    "title": "'The officials looked petrified' - was Villa Park chaos advert for VAR?",
    "content": "Newcastle United beat Aston Villa in the FA Cup fourth round in a match dominated by a number of controversial decisions without VAR.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:20:05.143Z",
    "image": "https://image.pollinations.ai/prompt/'The%20officials%20looked%20petrified'%20-%20was%20Villa%20Park%20chaos%20advert%20for%20VAR%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-officials-looked-petrified-was-villa-park-chaos-advert-for-var",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70ke0zglk5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kane reaches 500 goals - what other records could he break?",
    "title": "Kane reaches 500 goals - what other records could he break?",
    "content": "Bayern Munich striker Harry Kane became the first Englishman to reach 500 career goals on Saturday, but what other records could he break?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:20:10.301Z",
    "image": "https://image.pollinations.ai/prompt/Kane%20reaches%20500%20goals%20-%20what%20other%20records%20could%20he%20break%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kane-reaches-500-goals-what-other-records-could-he-break",
    "originalLink": "https://www.bbc.com/sport/football/articles/c743xp1xw9yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "title": "Brilliant Mansfield pile pressure on Parker - is his time up at Burnley?",
    "content": "Burnley manager Scott Parker is under increasing pressure as the Premier League side are dumped out of the FA Cup by League One Mansfield.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-15T04:20:15.449Z",
    "image": "https://image.pollinations.ai/prompt/Brilliant%20Mansfield%20pile%20pressure%20on%20Parker%20-%20is%20his%20time%20up%20at%20Burnley%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brilliant-mansfield-pile-pressure-on-parker-is-his-time-up-at-burnley",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy0dnxwxyl0o?at_medium=RSS&at_campaign=rss"
  }
]