[
  {
    "originalTitle": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria, witnesses say",
    "title": "Sad News from Our African Family: Staying Safe Underground",
    "content": "<h3>Hello, Super Friends!</h3>\n\nHello, my super friends and amazing explorers! Today, I have some very, very sad news to share with you from our big family in Africa. This sad news comes from a country called Nigeria, which is a very big and beautiful place in West Africa. Sometimes, bad things happen, and it's important for us to learn about them gently and understand why safety is so important.\n\n<h3>What Happened in Nigeria?</h3>\n\nMany brave workers, who we call miners, were deep, deep under the ground. They were working in a place called a mine. Sadly, these workers got very sick because of some bad air. This air was so tricky because you couldn't see it, and you couldn't smell it either! It made them very tired, and then they fell asleep. Many of these brave people are no longer with us. This is a very sad time for their families and for everyone in Nigeria and across Africa. We are all sending our love and kind thoughts to them.\n\n<h3>What is a Mine?</h3>\n\nDid you know that some people work deep, deep under the ground? This place is called a mine. Miners are very special workers who go into these deep tunnels. They go there to find valuable things like shiny rocks, important metals, or even a special kind of rock called coal that can make electricity. It's a very hard and important job because the things they find help us make many of the things we use every day, like phones, cars, and even some toys! Imagine going into a dark, underground cave every day to find treasures. That's what miners do!\n\n<h3>What is Carbon Monoxide?</h3>\n\nNow, let's talk about that sneaky, bad air. It has a big name: carbon monoxide. But you can just think of it as 'invisible bad air.' This is a very special kind of air that you cannot see with your eyes. You cannot smell it with your nose. You cannot even taste it with your tongue! It's like a super-duper invisible friend that isn't really a friend at all. It's very dangerous.\n\nDid you know that the air we breathe to live is called oxygen? Oxygen is very good for us. Carbon monoxide is not good. When there is too much carbon monoxide, it tries to take the place of the good oxygen in our bodies. That's why it's so tricky and scary.\n\n<h3>Why is Carbon Monoxide Dangerous?</h3>\n\nWhen you breathe in too much of this invisible bad air, carbon monoxide, it makes you very, very sick. Your body needs good, fresh oxygen to work, just like a car needs fuel. When carbon monoxide gets into your body, it stops the good oxygen from getting to where it needs to go. People can start to feel dizzy, like they've been spinning around too much. They might get a headache, or their tummy might feel funny.\n\nThen, they can get very, very sleepy. So sleepy that they fall asleep without even knowing it. And sadly, if there's too much carbon monoxide for too long, they might not wake up again. This is why it's so important for places where people work to be safe and have good, clean air.\n\n<h3>How Did This Sad Thing Happen?</h3>\n\nIn Nigeria, our friends, the miners, were working very deep inside the ground. The tunnels where they worked are called poorly ventilated tunnels. This means that the air inside these tunnels got old and couldn't get out very easily. And new, fresh air couldn't get in easily either. So, the bad air, the carbon monoxide, started to build up inside.\n\nBecause there were not enough big fans or open spaces to bring in fresh, good air, the carbon monoxide just kept getting more and more. Eventually, there was so much bad air that it made everyone sick, and they collapsed. It was a terrible accident that could have been stopped if the air was cleaner.\n\nDid you know that Nigeria is a very big country in Africa? It has many different languages and amazing music! It is also home to millions of wonderful people.\n\n<h3>Thinking About Safety</h3>\n\nThis very sad event teaches us something very, very important. Safety first! It reminds everyone that when people work in places like mines, or even in our homes, we need to make sure there is always good, fresh air. In mines, there should be special machines that check the air all the time, like a special nose, to make sure there is no bad gas.\n\nThere should also be big fans, like giant wind machines, to blow out the old, bad air and bring in new, fresh, good air. It's like having open windows for underground tunnels! Safety rules are there to protect everyone and keep them healthy. We need to follow them very carefully.\n\nDid you know that in some mines, engineers (who are like super-smart builders) design special tunnels and systems to make sure air flows properly?\n\n<h3>Remembering Our Friends</h3>\n\nWe are all very, very sad for the miners and their families in Nigeria. They were brave people who worked hard every day to help their families and their country. When sad things like this happen, it's important to remember them and to send love and strength to everyone who is hurting. We are a big African family, and we care for each other.\n\n<h3>What Happens Now?</h3>\n\nWhen something so sad happens, people don't just forget about it. People in Nigeria, and all over the world, are now looking very, very carefully at how to make mines much safer. They want to make sure this never, ever happens again. They will check all the air systems, all the fans, and all the safety rules. They want to make sure everything is working perfectly to keep every single worker safe.\n\nDid you know that safety helmets with lights are very important for miners because it is so dark underground?\n\n<h3>A Message from Africa</h3>\n\nWe, as children of Africa, send our prayers, our kind thoughts, and our deepest sympathies to our Nigerian brothers and sisters. Let's always remember to be kind and help each other. And let's hope that all the places where people work, especially those deep underground, are always safe and full of good, fresh air. Stay safe, everyone! Always remember that safety is the most important thing for all of us.\n",
    "summary": "At least 30 brave miners in Nigeria sadly died from breathing in invisible, bad air called carbon monoxide, which built up in unsafe tunnels deep underground.",
    "whyMatters": "This sad event reminds us how important it is for all workplaces, especially mines, to be very safe with lots of fresh air so that people can work and stay healthy.",
    "category": "world",
    "date": "2026-02-19T01:48:23.606Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Our%20African%20Family%3A%20Staying%20Safe%20Underground%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-our-african-family-staying-safe-underground",
    "originalLink": "https://www.bbc.com/news/articles/cwyk6nr80kxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Social media suspended in Gabon for 'spreading of false information'",
    "title": "Gabon Says 'Hold On!' to Some Online Chats!",
    "content": "<h3>Hello, Amazing Explorers!</h3>\nWelcome back to African News for Kids! Your friendly reporter from Africa is here to share some interesting news with you. Today, we're going on an adventure to a beautiful country called Gabon! It's in Central Africa, right by the big, blue Atlantic Ocean. Imagine sunshine, green trees, and maybe even elephants and gorillas living there!\n\n<h3>What Happened in Gabon?</h3>\nSomething important happened recently in Gabon. The grown-ups there decided to press a 'pause' button on some special apps and websites that people use to chat and share pictures online. We call these 'social media'. So, for a little while, people in Gabon can't use some of their favourite online chat tools.\n\n<h3>What is 'Social Media' Anyway?</h3>\nHave you ever seen your mom or dad look at their phone and talk to friends who live far away? Or share a picture of something fun they did? That's a bit like social media! It's a way for people to connect with others using computers, tablets, or phones. Think of apps like WhatsApp, Facebook, or TikTok. They let you send messages, see photos, and watch short videos.\n\nDid you know? Billions of people all around the world use social media every day to talk to their friends and family!\n\n<h3>Why Did They Press 'Pause'?</h3>\nNow, you might be wondering, 'Why would they stop people from talking to friends?' That's a great question! The grown-ups in Gabon said they had to press 'pause' because of something called 'false information'.\n\n<h3>What is 'False Information'?</h3>\n'False information' sounds like a big word, right? But it's actually quite simple. It just means stories or pictures that are NOT true. It's like if someone told you that a purple monster lives under your bed, but there's really just dust bunnies!\n\nSometimes, people accidentally share untrue stories, and sometimes, people do it on purpose to make others confused, scared, or even angry. When untrue stories spread very fast, they can make things difficult for everyone. It's like playing a game where someone keeps changing the rules – it's not fair and can make the game stop being fun.\n\n<h3>Why is False Information Bad?</h3>\nImagine your friend tells you that school is closed tomorrow because of a huge dinosaur. You get all excited, but then you go to school and it's open! You feel tricked, right? That's what false information can do. It can make people believe things that aren't real, which can cause problems. It might make them worry for no reason, or make bad decisions.\n\nDid you know? It's always a good idea to ask a grown-up if a story you hear sounds too amazing or too scary to be true!\n\n<h3>Who Made This Decision? The Rules Keepers!</h3>\nSo, who decided to press this 'pause' button? It was a group of grown-ups called the 'media regulator'. Think of them like the rules keepers for all the news and information people see on TV, hear on the radio, and read online. Their job is to make sure that the news is fair, true, and doesn't cause problems.\n\nThey are like the referees in a game, making sure everyone plays by the rules and that the game is fun and safe for everyone. When they saw too many untrue stories being shared, they decided to step in to help keep people safe and calm.\n\n<h3>What Does 'Until Further Notice' Mean?</h3>\nWhen the media regulator said the 'pause' would be in place 'until further notice,' it means they don't know exactly when the social media apps will start working again. It's like when your teacher says, 'Playtime is suspended until further notice' – it means playtime is stopped, and you have to wait for your teacher to tell you when it can start again.\n\nSo, people in Gabon are waiting patiently for the rules keepers to say it's okay to use those online chat tools again. They will start them again when they feel sure that most of the false information has gone away, and people can share true and helpful stories.\n\n<h3>How Does This Affect People in Gabon?</h3>\nIt might be a little tricky for people in Gabon right now. They might not be able to send quick messages to their friends or see funny videos from their cousins. They might miss talking to family members who live far away. But it also means they might spend more time talking to people face-to-face, playing games outside, or reading books!\n\nDid you know? Gabon is home to some amazing animals, like forest elephants and mandrills, which are colourful monkeys! People there also love music and dancing.\n\n<h3>Why is Telling the Truth So Important?</h3>\nThis news reminds us how important it is to always tell the truth. When we tell the truth, people trust us. When we hear true stories, we feel safe and understand the world better. It helps us learn and grow without being confused.\n\nEven for us, it's good to remember to share only true things with our friends and family, whether we're talking or drawing pictures. Always be a truth-teller!\n\n<h3>What Else Can We Do?</h3>\nIf you can't chat online, there are so many other fun things to do! You can tell stories to your family, draw pictures, play outside, read a wonderful book, or even help a grown-up with something around the house. Connecting with people doesn't always have to be online!\n\nSo, that's the news from Gabon! It's all about making sure that the stories we share are true and helpful. Keep being curious, keep asking questions, and always be kind!\n\nYour friendly reporter, over and out!",
    "summary": "Gabon has stopped some online chat apps and websites because too many untrue stories, called 'false information', were being shared, and this pause will last until the problem is fixed.",
    "whyMatters": "This is important because untrue stories can confuse or scare people, so the grown-ups in Gabon are trying to keep everyone safe and make sure people share only what is true.",
    "category": "world",
    "date": "2026-02-19T01:48:41.891Z",
    "image": "https://image.pollinations.ai/prompt/Gabon%20Says%20'Hold%20On!'%20to%20Some%20Online%20Chats!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gabon-says-hold-on-to-some-online-chats",
    "originalLink": "https://www.bbc.com/news/articles/cx2rg2vndk1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Turkey's president rejects Israel's recognition of Somaliland",
    "title": "Turkey's president rejects Israel's recognition of Somaliland",
    "content": "He made the comment on an official visit to Ethiopia, saying it could prove dangerous for a volatile region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-19T01:49:04.133Z",
    "image": "https://image.pollinations.ai/prompt/Turkey's%20president%20rejects%20Israel's%20recognition%20of%20Somaliland%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "turkeys-president-rejects-israels-recognition-of-somaliland",
    "originalLink": "https://www.bbc.com/news/articles/c0lj0plkg09o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,456",
    "title": "Russia-Ukraine war: List of key events, day 1,456",
    "content": "These are the key developments from day 1,456 of Russia's war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T01:49:09.365Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C456%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1456",
    "originalLink": "https://www.aljazeera.com/news/2026/2/19/russia-ukraine-war-list-of-key-events-day-1456?traffic_source=rss"
  },
  {
    "originalTitle": "White House says Iran would be ‘wise’ to take deal amid military buildup",
    "title": "White House says Iran would be ‘wise’ to take deal amid military buildup",
    "content": "The latest threats come amid ratcheting tensions between the US and Iran despite second round of indirect nuclear talks.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T01:49:14.506Z",
    "image": "https://image.pollinations.ai/prompt/White%20House%20says%20Iran%20would%20be%20%E2%80%98wise%E2%80%99%20to%20take%20deal%20amid%20military%20buildup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "white-house-says-iran-would-be-wise-to-take-deal-amid-military-buildup",
    "originalLink": "https://www.aljazeera.com/news/2026/2/18/white-house-says-iran-would-be-wise-to-take-deal-amid-military-buildup?traffic_source=rss"
  },
  {
    "originalTitle": "US is withdrawing all 1,000 troops from Syria: WSJ report",
    "title": "US is withdrawing all 1,000 troops from Syria: WSJ report",
    "content": "The report says US officials expect troops to withdraw from remaining positions within two months.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-19T01:49:19.639Z",
    "image": "https://image.pollinations.ai/prompt/US%20is%20withdrawing%20all%201%2C000%20troops%20from%20Syria%3A%20WSJ%20report%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-is-withdrawing-all-1000-troops-from-syria-wsj-report",
    "originalLink": "https://www.aljazeera.com/news/2026/2/18/us-is-withdrawing-all-1000-troops-from-syria-wsj-report?traffic_source=rss"
  },
  {
    "originalTitle": "Eight skiers found dead after California avalanche",
    "title": "Eight skiers found dead after California avalanche",
    "content": "Fifteen skiers went missing on Tuesday following a massive avalanche in California's Lake Tahoe region. One person remains missing but is presumed dead.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T01:49:25.292Z",
    "image": "https://image.pollinations.ai/prompt/Eight%20skiers%20found%20dead%20after%20California%20avalanche%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "eight-skiers-found-dead-after-california-avalanche",
    "originalLink": "https://www.bbc.com/news/articles/cvg19dp4vxgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal",
    "title": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal",
    "content": "The president's comments come just a day after the US gave its official backing to the UK's Chagos deal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-19T01:49:30.429Z",
    "image": "https://image.pollinations.ai/prompt/Do%20not%20give%20away%20Diego%20Garcia%2C%20Trump%20tells%20UK%20in%20fresh%20attack%20on%20Chagos%20deal%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "do-not-give-away-diego-garcia-trump-tells-uk-in-fresh-attack-on-chagos-deal",
    "originalLink": "https://www.bbc.com/news/articles/c309qqyer8yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Hamas is reasserting control in Gaza despite its heavy losses fighting Israel",
    "title": "Hamas is reasserting control in Gaza despite its heavy losses fighting Israel",
    "content": "Gazans say Hamas is again extending its control over security, tax revenue and government services.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T01:49:35.565Z",
    "image": "https://image.pollinations.ai/prompt/Hamas%20is%20reasserting%20control%20in%20Gaza%20despite%20its%20heavy%20losses%20fighting%20Israel%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "hamas-is-reasserting-control-in-gaza-despite-its-heavy-losses-fighting-israel",
    "originalLink": "https://www.bbc.com/news/articles/c98g1klxnpxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Bottle word will be used' for Arsenal - is title 'in Man City's hands'?",
    "title": "'Bottle word will be used' for Arsenal - is title 'in Man City's hands'?",
    "content": "After blowing a two-goal lead to draw against the Premier League's bottom club Wolves, there will be no dodging the questions on whether Arsenal are mentally ready to end their 22-year wait to become champions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T01:49:41.167Z",
    "image": "https://image.pollinations.ai/prompt/'Bottle%20word%20will%20be%20used'%20for%20Arsenal%20-%20is%20title%20'in%20Man%20City's%20hands'%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bottle-word-will-be-used-for-arsenal-is-title-in-man-citys-hands",
    "originalLink": "https://www.bbc.com/sport/football/articles/czj1nm9jdy3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "title": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "content": "A Ricardo Calafiori own goal in the 94th minute gives Wolves a point. as the Premier League's bottom side come back from two goals down against leaders Arsenal at Molineux.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T01:49:46.295Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20squander%20two-goal%20lead%20as%20Wolves%20score%20late%20to%20earn%20draw%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-squander-two-goal-lead-as-wolves-score-late-to-earn-draw",
    "originalLink": "https://www.bbc.com/sport/football/videos/cn4gjldn03yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gordon channels Shearer after breaking his record ",
    "title": "Gordon channels Shearer after breaking his record ",
    "content": "Newcastle's Anthony Gordon only had one thought in his mind as his side faced Qarabag in the Champions League...",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T01:49:51.420Z",
    "image": "https://image.pollinations.ai/prompt/Gordon%20channels%20Shearer%20after%20breaking%20his%20record%20%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gordon-channels-shearer-after-breaking-his-record",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20z9xqdz2lo?at_medium=RSS&at_campaign=rss"
  }
]