[
  {
    "originalTitle": "'Affront to humanity': Sudan slams Uganda for hosting RSF paramilitary boss",
    "title": "News Flash: Countries, Neighbors, and Making Friends!",
    "content": "Hello, hello, my wonderful friends! Your kid-friendly news reporter is here from beautiful Africa! Today, we have an important story about two countries that are neighbors. These countries are called Sudan and Uganda.\n\n<h3>A Big Problem in Sudan</h3>\nImagine two friends in your class who are having a big argument. That’s a bit like what is happening in a country called Sudan right now. Sudan is a very big country in Africa, with lots of lovely people and animals.\n\nSadly, there has been some fighting in Sudan. Two big groups of people with soldiers are not getting along. One group is the country's main army. The other group is called the Rapid Support Forces, or RSF for short.\n\nThis fighting makes many children and families in Sudan very sad. It can be scary when there is fighting. People wish for peace so they can go to school and play safely.\n\nDid you know? Sudan is the third-largest country in Africa! That's a huge place, with lots of space for adventures when it is peaceful.\n\n<h3>Who are the RSF?</h3>\nLet's talk a little more about one of the groups fighting. It's called the Rapid Support Forces, or RSF. They are like a big group of soldiers. But they are not the main army of Sudan.\n\nThis group, the RSF, has a leader. His name is Mr. Mohamed Hamdan Dagalo. He is a very important person for the RSF.\n\nWhen we say 'paramilitary,' it means a group of soldiers who are not officially part of the country's main army. They have their own leaders and rules, which can sometimes cause problems.\n\n<h3>Uganda and the Meeting</h3>\nNow, let's talk about Uganda. Uganda is another wonderful country in Africa. It is a neighbor to Sudan, just like your house might have a neighbor next door.\n\nUganda is famous for its beautiful lakes and amazing animals, like mountain gorillas! It's a country full of smiles and friendly people.\n\nGuess what happened? Some important people from Uganda met with Mr. Mohamed Hamdan Dagalo. Remember, he is the leader of the RSF group that is fighting in Sudan.\n\nThis meeting happened recently. The people from Uganda talked with the RSF leader.\n\nDid you know? Uganda is home to over half of the world's mountain gorillas! They live high up in the mountains.\n\n<h3>Why Sudan is Unhappy</h3>\nWhen Sudan heard about this meeting, they became very, very upset. Imagine if you were trying to fix a problem with a friend, and another friend went to play only with the person you were arguing with. You might feel a bit sad or angry, right?\n\nSudan feels that Uganda should not be talking to the leader of the RSF right now. They think it's not fair. They believe Uganda should be helping to stop the fighting, not meeting with one of the groups causing it.\n\nSudan says that Uganda is not following the special rules that all countries try to follow. These rules are like 'friendly neighbor rules' for countries around the world.\n\nThese rules help countries be kind to each other. They help countries work together for peace. Sudan feels Uganda broke one of these important rules.\n\n<h3>What are 'Friendly Rules' for Countries?</h3>\nJust like you have rules at school or at home, countries also have rules. These are called 'international laws.' But for us, let's call them 'friendly rules for countries.'\n\nThese rules help all countries live together peacefully. They make sure everyone plays fair. They say that countries should respect each other.\n\nOne of these rules is about not taking sides when other countries are having a big fight. It's usually best to help them find a way to stop fighting and become friends again.\n\nSudan is saying that Uganda seemed to take a side by meeting with the RSF leader. This made Sudan feel like their neighbor wasn't being a good friend during a tough time.\n\nDid you know? When countries talk and solve problems together, it's called 'diplomacy.' It's like having a big chat to make things better!\n\n<h3>What Does This Mean for Peace?</h3>\nWhen countries get angry with each other, it can make it harder to bring peace. Everyone, especially children, wants peace in Sudan. Peace means children can laugh, play, and go to school every single day without fear.\n\nWhen neighbors argue, it takes a lot of talking and understanding to fix things. We all hope that Sudan and Uganda can talk nicely and understand each other's feelings.\n\nLeaders need to work together to stop the fighting in Sudan. They need to help make sure all children are safe. This is why these 'friendly rules' are so important.\n\n<h3>What Happens Next?</h3>\nSudan wants Uganda to explain why they met the RSF leader. They want to understand. They hope that Uganda will now help more to stop the fighting in Sudan.\n\nThey also want all other countries in Africa and around the world to help. They want everyone to encourage peace and safety for the people of Sudan.\n\nWe all hope that leaders in Sudan can stop the fighting very soon. We hope that all countries can be good neighbors and friends. This way, all children in Africa can grow up in peace and happiness.\n\nDid you know? The African continent is made up of 54 different countries, all trying to work together for a better future! Isn't that amazing?\n\nLet’s send a big wish for peace to all our friends in Sudan! Until next time, keep smiling and learning!",
    "summary": "Sudan is very upset because its neighbor, Uganda, had a meeting with the leader of the Rapid Support Forces (RSF), a group fighting in Sudan.",
    "whyMatters": "It is important for countries to be good neighbors and follow friendly rules to help bring peace, especially when there is fighting, so all children and families can be safe and happy.",
    "category": "government",
    "date": "2026-02-23T07:51:33.036Z",
    "image": "https://image.pollinations.ai/prompt/News%20Flash%3A%20Countries%2C%20Neighbors%2C%20and%20Making%20Friends!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "news-flash-countries-neighbors-and-making-friends",
    "originalLink": "https://www.bbc.com/news/articles/c20lwznegk4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "content": "Days of competition culminate in a fishing contest rooted in efforts to cement local peace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:51:38.197Z",
    "image": "https://image.pollinations.ai/prompt/Catch%20of%20the%20day%3A%20Pictures%20from%20spectacular%20Nigerian%20fishing%20festival%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "catch-of-the-day-pictures-from-spectacular-nigerian-fishing-festival",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Good News! Rules Are For Everyone in Cameroon!",
    "content": "<h3>Hello from Africa!</h3>\nHi everyone! It's me, your friendly news reporter for kids in Africa! I'm so happy to be here to tell you about something important that happened in a beautiful country called Cameroon. News helps us learn about our world and what's happening to people just like us.\n\nToday, we're talking about rules. Rules are very important! We have rules at home, at school, and even big countries have rules. Rules help us stay safe and happy. When someone breaks a rule, it's not fair to others.\n\n<h3>Meet Cameroon!</h3>\nCameroon is a wonderful country in Africa. It's on the west side of our continent, near the big ocean. It has lots of beautiful forests, mountains, and even sandy beaches! Many different people live in Cameroon, and they speak many different languages.\n\nDid you know? Some people in Cameroon speak French, and others speak English! That's like having many friends who speak different words but still play together.\n\n<h3>Who Are Soldiers?</h3>\nNow, let's talk about soldiers. Soldiers are brave men and women who wear special uniforms. Their job is to protect their country and its people. They work hard to keep everyone safe and make sure there is peace. They are like very special helpers for the country.\n\nThey have important jobs, like making sure bad things don't happen. Sometimes, they help when there are big problems or arguments in a place. They have very strict rules they must follow too.\n\n<h3>Who Are Civilians?</h3>\nThen there are civilians. Who are civilians? That's you and me! Civilians are regular people who live in a country. We are not soldiers; we don't wear uniforms to fight. We are children, mothers, fathers, teachers, doctors, and everyone else who lives a normal life. Our safety is very important.\n\nCivilians rely on soldiers and police to keep them safe. We trust them to follow the rules and protect us, not hurt us. Everyone in a country should feel safe in their homes and communities.\n\n<h3>A Sad Story from Cameroon</h3>\nOnce upon a time, not so long ago, something very sad happened in a part of Cameroon. Some soldiers, who are supposed to keep people safe, did something very, very wrong. They hurt 21 innocent civilians.\n\nThis made everyone very sad. Hurting people is always, always wrong. It doesn't matter who you are or what uniform you wear. Everyone knows that it's wrong to hurt another person. It's against the most important rules of all.\n\n<h3>Why Did This Happen?</h3>\nThis happened in a place called the 'Anglophone region' of Cameroon. Remember how I said some people speak French and some speak English? Well, sometimes, the people who speak English feel like they are not treated fairly. This can lead to big arguments.\n\nIt's like when you and your friends have a big argument, and it makes everyone feel unhappy. Soldiers were sent there to try and help keep the peace during these arguments. But sometimes, even people who are supposed to help make big mistakes.\n\nDid you know? 'Anglophone' just means 'English-speaking'. It's a big word for something simple!\n\n<h3>Rules Are For Everyone!</h3>\nWhat happens when someone breaks a very important rule? We learn that everyone must follow rules. No one is above the rules, not even soldiers. When someone does something wrong, especially something very bad like hurting people, there must be a way to make things fair.\n\nThat's where something called a 'court' comes in. A court is a special place where judges listen to what happened. They are like very important referees who make sure everyone is treated fairly and that the rules are followed.\n\n<h3>What is a Prison Sentence?</h3>\nIn this story, three soldiers went to court. The judges listened very carefully to everything that happened. They decided that these soldiers had broken very serious rules by hurting civilians. So, the judges gave them something called 'prison sentences.'\n\nWhat does 'prison sentence' mean? It means they have to go to a special place called a prison or jail. They will stay there for a long time. This is a way to show that what they did was very wrong and that there are serious consequences for breaking big rules.\n\nDid you know? Sending someone to prison is called 'justice'. Justice means making things fair for everyone.\n\n<h3>Why This is Good News!</h3>\nThis news might sound a little sad because people were hurt. But there is also good news in this story! It is very rare for soldiers to get prison sentences for things like this. 'Rare' means it doesn't happen often. This is a special thing.\n\nWhy is it special? It shows that in Cameroon, even brave soldiers must follow the rules. It shows that leaders care about civilians and want to keep them safe. It means that everyone, no matter how important their job, must be held accountable for their actions.\n\nThis makes us feel safer. It helps build trust between the people and their protectors. It sends a message that bad actions will not be ignored. It shows that the rules of fairness and safety are for absolutely everyone.\n\n<h3>Let's Be Kind and Follow Rules!</h3>\nSo, what do we learn from this story? We learn that rules are super important. We learn that everyone deserves to be safe. And we learn that when bad things happen, we try our best to make things fair again.\n\nLet's all remember to be kind to each other, follow the rules, and help make our communities and countries safe and happy places for everyone. Thank you for listening, and see you next time with more news from Africa!",
    "summary": "In Cameroon, three soldiers received rare prison sentences for hurting 21 innocent civilians, showing that everyone, even soldiers, must follow important rules and face consequences for bad actions.",
    "whyMatters": "This is important because it shows that everyone in Cameroon, even people with big jobs like soldiers, must follow rules and protect civilians, making sure everyone is treated fairly and kept safe.",
    "category": "technology",
    "date": "2026-02-23T07:52:04.585Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Rules%20Are%20For%20Everyone%20in%20Cameroon!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-rules-are-for-everyone-in-cameroon",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "The Ukraine war in numbers: People, territory, money",
    "title": "The Ukraine war in numbers: People, territory, money",
    "content": "Four years into Russia's grinding war on Ukraine, Al Jazeera looks at the costs — to people, territory and treasuries.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:09.910Z",
    "image": "https://image.pollinations.ai/prompt/The%20Ukraine%20war%20in%20numbers%3A%20People%2C%20territory%2C%20money%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "the-ukraine-war-in-numbers-people-territory-money",
    "originalLink": "https://www.aljazeera.com/news/2026/2/23/the-ukraine-war-in-numbers-people-territory-money?traffic_source=rss"
  },
  {
    "originalTitle": "ICC to hold hearings on charges against ex-Philippine President Duterte",
    "title": "ICC to hold hearings on charges against ex-Philippine President Duterte",
    "content": "Duterte faces three counts of crimes against humanity allegedly committed during his time as president and Davao mayor.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:15.060Z",
    "image": "https://image.pollinations.ai/prompt/ICC%20to%20hold%20hearings%20on%20charges%20against%20ex-Philippine%20President%20Duterte%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "icc-to-hold-hearings-on-charges-against-ex-philippine-president-duterte",
    "originalLink": "https://www.aljazeera.com/news/2026/2/23/icc-to-hold-hearings-on-charges-against-ex-philippine-president-duterte?traffic_source=rss"
  },
  {
    "originalTitle": "How Modi ‘broke down walls’ between India, Israel – at Palestine’s expense",
    "title": "How Modi ‘broke down walls’ between India, Israel – at Palestine’s expense",
    "content": "Under Modi, India, a long supporter of the Palestinian cause, has found a friend in Israel's Netanyahu despite genocide.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:20.216Z",
    "image": "https://image.pollinations.ai/prompt/How%20Modi%20%E2%80%98broke%20down%20walls%E2%80%99%20between%20India%2C%20Israel%20%E2%80%93%20at%20Palestine%E2%80%99s%20expense%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-modi-broke-down-walls-between-india-israel-at-palestines-expense",
    "originalLink": "https://www.aljazeera.com/features/2026/2/23/how-modi-broke-down-walls-between-india-israel-at-palestines?traffic_source=rss"
  },
  {
    "originalTitle": "Zelensky tells BBC Putin has started WW3 and must be stopped",
    "title": "A Big Wish for Peace: Stopping a Fight Far Away!",
    "content": "<h3>Hello from Your Kid-Friendly Reporter!</h3>\nHello, my wonderful friends all over Africa! It's me, your reporter, here to share a very important story with you today. It's about a place far, far away, a country called Ukraine. Even though it's far, what happens there matters to many people, and we all wish for peace and happiness for everyone.\n\nToday, we are talking about something very serious. It's about a big problem, a big fight, that has been going on for a long time. Our hearts in Africa feel for everyone affected by big problems like this.\n\n<h3>Meet Ukraine: A Land of Sunflowers</h3>\nImagine a beautiful country filled with bright yellow sunflowers. That's Ukraine! It's a land where children love to play, learn, and grow, just like you.\n\nDid you know? Sunflowers are the national flower of Ukraine! They turn their faces to follow the sun, which is a lovely symbol of hope and happiness.\n\nUkraine is a country in Europe. It has many friendly people and beautiful cities. But right now, there is a big problem happening there.\n\n<h3>A Big Problem Started</h3>\nAbout four years ago, a big, sad problem started. A country nearby, called Russia, started a fight with Ukraine. It's like when two friends have a very big disagreement, but this is between two countries.\n\nThis big fight made many people in Ukraine very, very sad. Many children and their families had to leave their homes to find safe places. They had to say goodbye to their toys and their schools.\n\nThink about having to leave your home and all your things. It's a very difficult and scary thing to do. That's what many people in Ukraine have been through.\n\n<h3>Who is President Zelenskyy?</h3>\nEvery country has a leader, someone like the head of a very big family. For Ukraine, the leader is President Zelenskyy. He is like a captain trying to steer his ship through a big storm.\n\nPresident Zelenskyy's job is to protect his people and his country. He is working very, very hard to keep everyone safe and to make the big fight stop. He is a very brave man.\n\nHe talks to other leaders around the world, asking for help. He wants everyone to know what is happening in Ukraine and to help bring peace back.\n\n<h3>Who is President Putin?</h3>\nOn the other side of this big fight is President Putin. He is the leader of Russia, the country that started the fight with Ukraine. Many people around the world, including President Zelenskyy, want President Putin to stop the fight.\n\nPresident Putin made the choice to start this big problem. Now, many people are asking him to choose peace instead. They want him to stop the fighting so that everyone can be safe and happy again.\n\nDid you know? Russia is the biggest country in the world! It is so big it stretches across two continents!\n\n<h3>Why This Fight is So Important to Stop</h3>\nPresident Zelenskyy recently spoke to a news reporter from the BBC. He said that this fight is so big and serious that it could cause problems for many, many more people around the world. He wants everyone to understand that this problem needs to be stopped quickly.\n\nIt's like when a small fire can become a very big fire if no one puts it out. President Zelenskyy wants to put out this big fight before it gets even bigger and makes more people sad or unsafe.\n\nMany countries around the world are helping Ukraine. They are sending food, clothes, and special helpers to keep people safe. This shows that people everywhere care about each other.\n\nDid you know? When countries help each other, it's called international cooperation. It means working together like good friends!\n\n<h3>Africa Cares About Peace</h3>\nEven though Ukraine is far from us in Africa, we care very much about peace. In Africa, we know how important it is for everyone to live together happily and safely. We wish for peace for all children and families in Ukraine.\n\nOur continent is full of kind hearts that want to see problems solved with talking and understanding, not fighting. We believe that every child deserves a safe place to live, learn, and play.\n\nWe send our hopes and good wishes from all the way here in Africa to the children and families in Ukraine. We want them to know that people care about them.\n\n<h3>Kids Around the World Want Peace Too!</h3>\nKids in Ukraine just want to go to school, play with their friends, and sleep safely in their beds. Just like you!\n\nWhen there is fighting, it makes it hard for children to do these things. That's why leaders like President Zelenskyy are working so hard to stop it. They want a world where kids can just be kids.\n\nWhat can we do? We can hope for peace. We can be kind to everyone around us, showing that we believe in friendship and helping. Every little bit of kindness makes our world a better place.\n\n<h3>What Happens Next?</h3>\nMany people are talking and trying to find a way to stop the big fight in Ukraine. President Zelenskyy is still asking for help, hoping that all the world leaders will work together to make President Putin stop.\n\nOur biggest wish, from your friendly reporter here in Africa, is for peace to come back to Ukraine very soon. We hope that all the children can return to their homes, play with their friends, and live happily ever after.\n\nLet's all keep hoping for a world where everyone is safe, happy, and friends! Until next time, stay kind, my friends!\n",
    "summary": "Ukraine's brave leader, President Zelenskyy, is asking the world to help stop a big fight started by Russia's President Putin, because he believes this serious problem could get worse for everyone if it doesn't end soon, and people everywhere, including us in Africa, wish for peace.",
    "whyMatters": "This story matters because a big fight far away makes many people sad, and when leaders ask for help to stop it, it shows that everyone needs to work together to keep the world safe and peaceful for all children and families.",
    "category": "world",
    "date": "2026-02-23T07:52:40.804Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Wish%20for%20Peace%3A%20Stopping%20a%20Fight%20Far%20Away!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-wish-for-peace-stopping-a-fight-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cvgj9p15y87o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "content": "Steve Rosenberg reports on the economic consequences of Russia's war, and how people are coping.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:45.939Z",
    "image": "https://image.pollinations.ai/prompt/Four%20years%20into%20its%20full-scale%20war%20in%20Ukraine%2C%20Russia%20is%20feeling%20the%20effects%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "four-years-into-its-full-scale-war-in-ukraine-russia-is-feeling-the-effects",
    "originalLink": "https://www.bbc.com/news/articles/c4gj20xzw39o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Violence erupts in Mexico after drug lord El Mencho killed",
    "title": "Violence erupts in Mexico after drug lord El Mencho killed",
    "content": "The death of the most-wanted Jalisco cartel chief sparks retaliatory violence in at least a dozen states in Mexico.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:51.085Z",
    "image": "https://image.pollinations.ai/prompt/Violence%20erupts%20in%20Mexico%20after%20drug%20lord%20El%20Mencho%20killed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "violence-erupts-in-mexico-after-drug-lord-el-mencho-killed",
    "originalLink": "https://www.bbc.com/news/articles/c795qgejzpxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'They were attacking from every angle in the end' - why Spurs couldn't keep Arsenal out",
    "title": "'They were attacking from every angle in the end' - why Spurs couldn't keep Arsenal out",
    "content": "MOTD pundit Danny Murphy explains why, as well as Arsenal's superior quality in Sunday's north London derby, they exploited Tottenham's tactical weakness too.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:52:56.667Z",
    "image": "https://image.pollinations.ai/prompt/'They%20were%20attacking%20from%20every%20angle%20in%20the%20end'%20-%20why%20Spurs%20couldn't%20keep%20Arsenal%20out%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "they-were-attacking-from-every-angle-in-the-end-why-spurs-couldnt-keep-arsenal-out",
    "originalLink": "https://www.bbc.com/sport/football/articles/c86yjp6037jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Man Utd fans should be glad if Maguire extends stay",
    "title": "Why Man Utd fans should be glad if Maguire extends stay",
    "content": "Fans should welcome the belief of sources on all sides that Harry Maguire will remain at Manchester United at least for next season, writes Simon Stone.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:53:01.828Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Man%20Utd%20fans%20should%20be%20glad%20if%20Maguire%20extends%20stay%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-man-utd-fans-should-be-glad-if-maguire-extends-stay",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg4gvxw24l0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "title": "'Appalling weekend' - Arokodare & Mundle latest players to be racially abused",
    "content": "Wolves striker Tolu Arokodare and Sunderland winger Romaine Mundle have become the latest Premier League players to be sent racist abuse on social media this weekend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-23T07:53:06.972Z",
    "image": "https://image.pollinations.ai/prompt/'Appalling%20weekend'%20-%20Arokodare%20%26%20Mundle%20latest%20players%20to%20be%20racially%20abused%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "appalling-weekend-arokodare-and-mundle-latest-players-to-be-racially-abused",
    "originalLink": "https://www.bbc.com/sport/football/articles/cz6egezw1d3o?at_medium=RSS&at_campaign=rss"
  }
]