[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Wow! Money Flowers are Blooming in Kenya!",
    "content": "Hi everyone! It's your friendly news reporter, Pendo, here from beautiful Africa! I have some super fun and interesting news from Kenya. Are you ready for a cool story about gifts and surprises?\n\nGuess what people in Kenya are doing? Instead of giving regular flowers for Valentine's Day, they are giving *money flowers*! Yes, you heard me right – flowers made of money! It's a very creative and surprising way to give a gift.\n\n<h3>What is a Cash Bouquet?</h3>\n\nImagine a big bunch of flowers. But instead of petals and leaves, you see lots of bright, crisp banknotes, folded carefully to look like roses or other pretty shapes! That's a cash bouquet!\n\nIt's like getting a giant, fancy wallet that you can admire before you spend the money. People wrap them up in colourful paper and ribbons, just like real flower bouquets.\n\nIt's a very special kind of gift. You get to see the money in a super creative way, and then you can use it to buy something you really, really want or need.\n\nDid you know? Did you know that in Kenya, our money is called 'Shillings'? So these bouquets are full of Kenyan Shillings!\n\n<h3>Why Money Flowers?</h3>\n\nWhy do people love these money flowers so much? Well, sometimes it's hard to know exactly what someone wants for a gift. Maybe you give someone a toy they already have, or a book they've already read!\n\nWith money, the person who gets the gift can choose! Maybe they want a new toy, or new school books, or to help their family buy food. Money can be very helpful!\n\nIt's like saying, 'I love you, and I want you to have something *you* really want!' It makes people feel happy and special because they can pick their own perfect gift.\n\n<h3>Showing Love on Valentine's Day</h3>\n\nThis special gift became super popular around Valentine's Day. Valentine's Day is a time when we show people we love how much they mean to us.\n\nMany people give cards, chocolates, or flowers. But in Kenya, some people started giving these amazing cash bouquets to their mums, dads, aunties, uncles, and friends! It’s a huge surprise when you open it!\n\nIt's a big, 'I love you!' present that can also do useful things. Imagine getting a gift that's beautiful AND you can use it to buy something cool!\n\nDid you know? Did you know Valentine's Day is celebrated on February 14th every year in many countries all around the world, even here in Africa? It's a day to spread love!\n\n<h3>A Little Worry About the Money</h3>\n\nNow, here's a little secret, my friends. Grown-ups sometimes worry about things, even fun things like money flowers. They want to make sure everything is good and safe for everyone.\n\nSome grown-ups, like people who work in important offices, started asking questions. They wondered, 'Where does all this money come from?' And 'Is it good, honest money?'\n\nIt's like when you have a cookie, and your mum asks, 'Did you wash your hands before eating it?' She wants to make sure everything is safe and clean for you. Money needs to be safe and clean too!\n\nMoney is great, but we need to make sure it comes from good, honest places. Sometimes, if money comes from a not-so-good place, it can cause problems for people and for our country. That's why being careful is important.\n\nSo, the grown-ups just want to make sure that everyone is using money in a good, honest way. They want to keep everyone safe and happy, and make sure our country's money system is strong and fair.\n\nDid you know? Did you know that there are special banks where grown-ups keep their money safe, just like you might keep your toys safe in a box? Banks help keep money secure!\n\n<h3>Being Smart with Money</h3>\n\nThis whole story about cash bouquets teaches us something important: it's good to be smart with money! Money is a tool that helps us in many ways.\n\nMoney helps us buy things we need like food, clothes, and school supplies. And sometimes, it helps us buy things we want like toys or treats. But it's also important to know where money comes from and to use it wisely.\n\nSaving money in a piggy bank or a real bank is a super smart idea. It helps you get bigger things later, like a new bicycle, or helps you when you really need it, like for a special class.\n\nSo, whether it's a cash bouquet or just a few Shillings you find, let's always think about how we get our money and how we spend it. Being responsible with money is a great skill!\n\n<h3>Lots of Ways to Show You Care!</h3>\n\nEven with the talks about money, it's good to remember that showing love doesn't *always* have to be with money. There are so many wonderful ways to show you care.\n\nA big hug, a handmade card, helping with chores around the house, or just saying 'I love you' can make someone's day super bright! These gifts come from your heart.\n\nThe most important gift of all is kindness and love, from our hearts. Those gifts don't cost any money at all! They make everyone feel good, inside and out.\n\nDid you know? Did you know that Kenya is famous for its amazing wildlife, like lions and elephants, living in big, beautiful parks? That's another wonderful gift from Africa to the world!\n\n<h3>Your African News Pal Says...</h3>\n\nSo, my dear friends, whether it's flowers, money, or a big smile, giving gifts is all about making people happy and showing them you care. It’s fun to be creative with gifts, but it’s also important to be smart and safe.\n\nKeep learning, keep smiling, and I'll be back with more fun news from our amazing continent, Africa! Bye for now!",
    "summary": "In Kenya, people started giving special bouquets made of money instead of flowers for Valentine's Day, but some grown-ups are asking questions to make sure the money is safe and comes from good places.",
    "whyMatters": "This story matters because it shows us fun new ways people give gifts, but also teaches us to be careful and smart about where money comes from and how we use it, keeping everyone safe and happy.",
    "category": "world",
    "date": "2026-02-14T10:21:56.724Z",
    "image": "https://image.pollinations.ai/prompt/Wow!%20Money%20Flowers%20are%20Blooming%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wow-money-flowers-are-blooming-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:22:01.857Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:22:06.986Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "‘Bangladesh will be better’: BNP victory puts nation at crossroads",
    "title": "‘Bangladesh will be better’: BNP victory puts nation at crossroads",
    "content": "The victorious Bangladesh Nationalist Party supporters are jubilant, but analysts warn of challenges ahead.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:22:12.195Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Bangladesh%20will%20be%20better%E2%80%99%3A%20BNP%20victory%20puts%20nation%20at%20crossroads%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladesh-will-be-better-bnp-victory-puts-nation-at-crossroads",
    "originalLink": "https://www.aljazeera.com/features/2026/2/14/bangladesh-will-be-better-bnp-victory-puts-nation-at-crossroads?traffic_source=rss"
  },
  {
    "originalTitle": "Two Philippine senators named ‘co-perpetrators’ in Duterte ICC case",
    "title": "Two Philippine senators named ‘co-perpetrators’ in Duterte ICC case",
    "content": "Former Philippine justice secretary Vitaliano Aguirre II also among eight current, past officials named in complaint.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-14T10:22:17.320Z",
    "image": "https://image.pollinations.ai/prompt/Two%20Philippine%20senators%20named%20%E2%80%98co-perpetrators%E2%80%99%20in%20Duterte%20ICC%20case%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-philippine-senators-named-co-perpetrators-in-duterte-icc-case",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/two-philippine-senators-named-co-perpetrators-in-duterte-icc-case?traffic_source=rss"
  },
  {
    "originalTitle": "Indian national admits role in plot to assassinate US Sikh leader",
    "title": "Indian national admits role in plot to assassinate US Sikh leader",
    "content": "Prosecutors say plot to kill Sikh leader in US linked to Indian government employee, an allegation New Delhi denies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-14T10:22:22.441Z",
    "image": "https://image.pollinations.ai/prompt/Indian%20national%20admits%20role%20in%20plot%20to%20assassinate%20US%20Sikh%20leader%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "indian-national-admits-role-in-plot-to-assassinate-us-sikh-leader",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/indian-national-admits-role-in-us-sikh-leaders-assassination-plot?traffic_source=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:22:27.881Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Big Search for Grandma Thembi in Our Village!",
    "content": "Hello, super detective friends! It's your kid-friendly news reporter here, bringing you important news from right here in our wonderful Africa! Today, we have a special story about helping a very important person in our community. Get ready to put on your thinking caps and learn about how everyone works together!\n\n<h3>A Friendly Face is Missing!</h3>\nIn a lovely village called Sunny Savannah, where the sun always shines bright and the birds sing sweet songs, there lives a very kind lady. Her name is Grandma Thembi. Grandma Thembi is 84 years old, which means she has seen many, many sunny days and told countless wonderful stories. She loves to bake delicious mandazi for the children and always has a warm hug ready. Everyone in Sunny Savannah Village loves Grandma Thembi very much. She lives in a pretty little house with a colourful garden full of bright flowers and sweet-smelling jasmine.\n\nBut a little while ago, something happened. Grandma Thembi was not in her house. Her neighbours noticed that her garden gate was open, and she wasn't sitting on her usual chair telling stories. Nearly two weeks ago, she wasn't there when her friend came to visit for their afternoon tea. Everyone started to feel a little bit worried. Where could Grandma Thembi be? It's like playing hide-and-seek, but no one knew the hiding spot, and it wasn't a game. It made everyone's hearts feel a bit fluttery, like tiny butterflies.\n\n<h3>Our Brave Police Are Helping!</h3>\nWhen someone is missing, especially someone as important as Grandma Thembi, what do we do? We call our brave police officers! The police are like our village superheroes. They wear special uniforms, drive cool cars with flashing lights, and their job is to help everyone stay safe and find things that are lost. Our police officers from the Sunny Savannah Police Station heard about Grandma Thembi. They knew they had to help find her. They are very good at looking for clues and putting pieces of a puzzle together.\n\nJust a few days ago, our amazing police officers started a very important search. This search happened very close to Grandma Thembi’s home. They were looking everywhere, using their sharp eyes and their clever brains. They wanted to make sure they checked every single place nearby. They walked around her house, looked in her beautiful garden, and even checked the paths leading to the nearby market and the big mango tree where kids often play. They want to leave no stone unturned, just like when you try to find a lost pebble.\n\n<h3>What is a 'Search'?</h3>\nDid you know? A 'search' is when many people look for something or someone very, very carefully! Imagine you lose your favourite toy car. You look under the bed, behind the curtains, and in your toy box, right? That's a mini-search! When someone important like Grandma Thembi is missing, the police do a very big search. They look in many, many places, sometimes even using special tools or friendly police dogs to help smell for clues. They are like super-detectives, looking for any little hint that might tell them where Grandma Thembi went. \n\nThey don't just peek quickly; they look very, very slowly and carefully. They bend down to look at footprints, they check under bushes, and they talk to people who live nearby. Every little thing can be a clue! A clue is like a small piece of a puzzle. When you put all the clues together, they might show you the whole picture and help find Grandma Thembi. The police are trained to spot these clues, even tiny ones that you and I might miss. They are so good at their jobs, working day and night to keep us safe!\n\n<h3>How Everyone is Helping</h3>\nIt's not just the police who are helping! Everyone in Sunny Savannah Village wants to help find Grandma Thembi. Her neighbours, who share tea with her every afternoon, are helping. The children, who love her mandazi, are making \"Welcome Home Grandma Thembi\" drawings to put on her door. Even the market sellers are keeping an extra eye out for her, asking everyone if they have seen her. This is what we call a \"community effort.\"\n\nWhen everyone in a village or town works together for a good cause, that's a community effort! People are talking to each other, sharing what they saw or heard. \"Did you see Grandma Thembi yesterday?\" \"Was she walking towards the river?\" These questions are important. They help the police gather more information, just like adding more pieces to a giant puzzle. Some grown-ups are helping to put up posters with Grandma Thembi’s picture, so everyone knows who to look for. It shows how much love there is in Sunny Savannah Village.\n\n<h3>Why We Care So Much</h3>\nWhy is it so important to find Grandma Thembi? Because she is part of our family, our village family! When someone is missing, it makes everyone feel sad and worried. We want to make sure she is safe and sound, back in her cosy home, telling stories and baking yummy treats. Older people like Grandma Thembi are very special. They have so much wisdom and so many stories to share. They are like living history books, full of amazing adventures and lessons.\n\nDid you know? It's very important to look after our elders, the older people in our community. They have lived long lives and have so much to teach us. When we take care of them, we show them respect and love. It's like taking care of a precious treasure! So, finding Grandma Thembi is not just about a missing person; it's about making sure our beloved elder is safe and loved. We all miss her warm smile and gentle words.\n\n<h3>Working Together Makes Us Strong!</h3>\nThis big search near Grandma Thembi's home is still going on. The police are working very hard, and the community is helping with all their hearts. It reminds us that when we work together, we are strong. When we care for each other, our village becomes an even happier and safer place for everyone. We believe that with everyone helping, Grandma Thembi will be found soon, safe and sound. \n\nLet's all send our good thoughts to Grandma Thembi and thank our brave police officers and all the wonderful people in Sunny Savannah Village for their hard work. Remember, always look out for your neighbours and your family. And if you ever see something that doesn't feel right, tell a trusted grown-up! Our community is like a big, warm blanket that keeps everyone safe. Keep being super, super helpers, my friends!",
    "summary": "Brave police officers and kind villagers are working together in a big search to find Grandma Thembi, a beloved 84-year-old elder who went missing from her home in Sunny Savannah Village.",
    "whyMatters": "It matters because everyone in our community cares deeply about each other, especially our elders, and we all want to make sure Grandma Thembi is safe and happy back home.",
    "category": "world",
    "date": "2026-02-14T10:22:50.831Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Search%20for%20Grandma%20Thembi%20in%20Our%20Village!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-search-for-grandma-thembi-in-our-village",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T10:22:55.971Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:23:01.491Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Villa are still relying on old guard - and can it last?",
    "title": "Why Villa are still relying on old guard - and can it last?",
    "content": "Aston Villa's old guard have taken the club to new heights - but how long can it last?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T10:23:06.626Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Villa%20are%20still%20relying%20on%20old%20guard%20-%20and%20can%20it%20last%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-villa-are-still-relying-on-old-guard-and-can-it-last",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dny1gjde8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A 'very special' FA Cup win and why managing Ronaldo is 'easy'",
    "title": "A 'very special' FA Cup win and why managing Ronaldo is 'easy'",
    "content": "Portugal manager Roberto Martinez sits down with Kelly Somers to talk about his life in football.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-14T10:23:11.768Z",
    "image": "https://image.pollinations.ai/prompt/A%20'very%20special'%20FA%20Cup%20win%20and%20why%20managing%20Ronaldo%20is%20'easy'%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-very-special-fa-cup-win-and-why-managing-ronaldo-is-easy",
    "originalLink": "https://www.bbc.com/sport/football/articles/c98gy904nggo?at_medium=RSS&at_campaign=rss"
  }
]