[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Our Big Fishing Fun in Nigeria!",
    "content": "<h3>Hello, Super Friends!</h3>\n\nHello, amazing friends from all over Africa! Your friend is here with some super exciting news from a faraway land. It's about a festival, a celebration full of joy and big fish!\n\nImagine a place where people sing and dance. They are all getting ready for something special. This special thing happens in a wonderful country called Nigeria.\n\nNigeria is a very big country in Africa. It has lots of different people and amazing traditions. Today, we are talking about one of the most exciting ones!\n\n<h3>What is This Festival All About?</h3>\n\nThis festival is like a giant party! But it's not just any party. It's a fishing party! People come from all over to catch the biggest and best fish.\n\nIt's called a fishing festival. For many days, everyone gets ready. They make sure their nets are strong. They clean their boats. The air is buzzing with excitement!\n\nChildren run around, giggling. They help their parents. They can't wait to see who will catch the giant fish. It's a very happy time for everyone.\n\nDid you know? Nigeria is in West Africa! It's famous for its beautiful rivers and lakes, which are perfect for fishing!\n\n<h3>Where Does This Fun Happen?</h3>\n\nThis amazing festival happens in different parts of Nigeria. Imagine a big river, wide and shiny under the sun. That's where the magic happens!\n\nPeople gather near the riverbanks. They set up their little camps. They share stories and laughter. It's like a giant picnic before the big event.\n\nIt's usually in a special town or village that has a lot of water nearby. Water is very important for life and for fish!\n\nDid you know? Rivers like the Niger River are very important in Nigeria! They help people travel and catch fish.\n\n<h3>Who Gets to Join the Fun?</h3>\n\nEverybody! Not just the grown-ups who are good at fishing. Kids, grandmas, grandpas – everyone comes to watch and cheer.\n\nThe main stars are the brave fishermen. They are strong and know a lot about fish. They will go into the water with their nets and poles.\n\nFamilies come together. It's a time for cousins to play. It's a time for friends to meet. It's a time for everyone to feel like one big family.\n\nDid you know? In many African cultures, festivals are a way for whole communities to come together and celebrate their shared history and future!\n\n<h3>Getting Ready for the Big Catch!</h3>\n\nBefore the main fishing day, there's lots to do. Fishermen check their tools. They make sure everything is perfect.\n\nThey prepare their boats. Some boats are made from big trees. They are called canoes. They must be very strong to hold the fishermen and their big catches.\n\nPeople also cook delicious food. They make special traditional dishes. These foods give them energy for all the excitement.\n\nDid you know? Some fishing nets can be very big! Fishermen throw them out wide to catch many fish at once.\n\n<h3>The Big Fishing Day Arrives!</h3>\n\nFinally, the day everyone has been waiting for is here! The sun rises, and the river is full of boats.\n\nFishermen get into their boats. They paddle out into the water. Everyone on the shore cheers loudly!\n\nThey throw their nets into the water. Then they wait patiently. Sometimes they sing songs to help them wait.\n\nDid you know? Fish are very smart! Sometimes they can hide from the nets. Fishermen need to be even smarter!\n\n<h3>What Kind of Fish Do They Catch?</h3>\n\nIn the rivers of Nigeria, there are many types of fish. Some are big, some are small. All are yummy!\n\nThey might catch Tilapia, which is a very popular fish. Or Catfish, which has long whiskers like a cat!\n\nSometimes, they catch really huge fish! These are the ones everyone wants to see. They bring great honor to the fisherman who catches them.\n\nDid you know? Some Catfish can grow to be longer than a grown-up person's arm!\n\n<h3>A Special Reason for the Festival</h3>\n\nNow, here's the super important part. This festival is not just about catching fish. It's about something even bigger.\n\nIt's about peace. Sometimes, people in villages might have small arguments. They might disagree about things.\n\nThis festival helps everyone remember to be friends again. It helps them work together and share. It helps them forget their small problems.\n\nWhen everyone comes together, they laugh and celebrate. They remember they are all part of one community. This makes them feel peaceful and happy.\n\nDid you know? 'Peace' means everyone is kind to each other and there are no fights. It's a very important thing for all of us!\n\n<h3>More Fun Than Just Fishing!</h3>\n\nEven after the fishing contest, the fun keeps going! There is lots of music. People play drums and other instruments.\n\nThere is dancing! Everyone dances to the rhythm of the drums. Kids try to copy the grown-ups' moves.\n\nAnd of course, there is delicious food to eat. They cook the fish they caught! They share it with everyone. It's a giant feast!\n\nDid you know? African music is famous all over the world! It has amazing rhythms that make you want to dance!\n\n<h3>Who Wins the Big Prize?</h3>\n\nAt the end of the festival, there are prizes. The person who catches the biggest fish gets a special award. It's a great honor!\n\nEveryone cheers for the winners. But really, everyone who joined in is a winner. They helped make the festival special.\n\nThe prizes can be useful things for their homes or even a special title. But the best prize is the happiness and friendship shared.\n\nDid you know? Winning a prize is fun, but being a good friend and helping your community is even better!\n\n<h3>Why This Festival is Super Special!</h3>\n\nThis fishing festival in Nigeria is super special because it shows us many things. It shows us how to work hard. It shows us how to share.\n\nMost importantly, it shows us how to live in peace. When people come together like this, they build a strong and happy community.\n\nIt's a wonderful tradition that teaches important lessons to kids and grown-ups. It reminds us that we are all connected.\n\nSo next time you hear about a festival, remember this one from Nigeria. It's full of fish, fun, and friendship!\n\nDid you know? Festivals like this help keep old traditions alive for new generations to enjoy!\n\n<h3>Goodbye for Now!</h3>\n\nThat's all the exciting news from Nigeria for today! I hope you learned something new and wonderful. Keep exploring, keep learning, and always be kind!\n\nYour kid-friendly reporter from Africa, signing off!\n",
    "summary": "Kids in Nigeria celebrate a super fun fishing festival that helps everyone be friends and have a great time catching fish together!",
    "whyMatters": "This festival is important because it brings people together from all over to have fun, makes them happy, and helps them live in peace, like one big family working together.",
    "category": "world",
    "date": "2026-02-22T01:46:48.451Z",
    "image": "https://image.pollinations.ai/prompt/Our%20Big%20Fishing%20Fun%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "our-big-fishing-fun-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rules for Everyone! Soldiers Go to Jail in Cameroon!",
    "content": "<p>Hi friends! Your Africa News Reporter is here with a very important story from our big continent, Africa! Today, we're talking about something important that happened in a country called Cameroon. It’s a story about why rules are so important and how everyone, even grown-ups in uniforms, must follow them.</p>\n\n<h3>Who Are Soldiers?</h3>\n<p>Soldiers are like very special helpers in uniforms. They work very hard to keep everyone safe in a country. Think of them as super protectors! They have a big job to make sure people can live without fear. They protect borders and help when there are big problems. Soldiers have special training to be strong and brave.</p>\n<p>They also have very important rules to follow, just like you have rules at home and at school. Rules help us live together happily and safely! Imagine playing a game without any rules – it would be very messy and not fun for anyone, right? That’s why rules are so important for everyone.</p>\n<p>Did you know? Cameroon is a beautiful country in Africa. It has amazing beaches, tall mountains, and big forests! Lots of different kinds of animals live there, like elephants and monkeys.</p>\n\n<h3>What Went Wrong?</h3>\n<p>Sadly, in one part of Cameroon, something very, very sad and wrong happened. Some soldiers, who are supposed to keep people safe, actually hurt some grown-ups who were not soldiers. These grown-ups were just everyday people, trying to live their lives. We call these everyday people 'civilians.'</p>\n<p>The soldiers did something very bad that made many people sad and scared. It's never okay to hurt people, especially when your job is to protect them. When things like this happen, it makes people feel unsafe and unhappy.</p>\n<p>Did you know? Africa is a very big continent with many, many countries. Cameroon is one of them! People in Africa speak so many different languages, it’s like a big chorus of voices!</p>\n\n<h3>What Is Justice?</h3>\n<p>When something wrong happens, like the soldiers hurting people, we need something called 'justice.' Justice means making things fair again. It means that if someone breaks the rules, especially big, important rules like not hurting others, they need to learn from their mistake and face consequences.</p>\n<p>It's like when you accidentally break a toy, your grown-up talks to you about it, right? Or if you take someone else's crayon without asking, you might have to give it back and say sorry. Justice is a bigger version of that. It's about making sure that everyone is treated fairly and that those who do wrong learn that their actions have consequences.</p>\n<p>Justice helps everyone feel like the world is a fair place. It makes people feel safer and helps them trust that rules are important and will be followed by everyone.</p>\n<p>Did you know? In many African cultures, people believe it's very important for everyone to live together peacefully, like a big family. Sharing and helping each other is a big part of life!</p>\n\n<h3>The Special Decision</h3>\n<p>So, what happened to these soldiers who broke the rules and hurt innocent people? A very important judge, who helps make sure things are fair and that laws are followed, decided what should happen. This judge decided that three of these soldiers needed to go to a special place called jail.</p>\n<p>Jail is a place where grown-ups go when they do something very wrong. It's a place for them to think about their actions, to learn that what they did was not right, and to pay for their mistakes. It's not a fun place, but it's important for justice to happen.</p>\n<p>This decision shows that even people in uniform, who have a big job, must follow the rules and can’t hurt others without facing big consequences. It's a message that says everyone must be held responsible for what they do.</p>\n\n<h3>Why This Is Important News</h3>\n<p>This news is very, very important because it doesn't happen very often. Sometimes, when soldiers do something wrong, it can be hard to make sure they follow the rules and face consequences. But this time, it shows that *everyone*, even soldiers, must follow the rules of the country. No one is above the rules!</p>\n<p>This decision sends a clear message: rules are for everyone. It means that the country of Cameroon cares about its people and wants to make sure everyone is safe. It shows that they are trying to make things better and fairer for all the people living there.</p>\n<p>Did you know? Cameroon has over 200 different languages spoken there, like a big beautiful rainbow of voices! Imagine how many different ways people say \"hello\"!</p>\n\n<h3>Hoping for Peace and Safety</h3>\n<p>When rules are followed and justice is made, it helps everyone feel safer and happier. People in Cameroon, especially in the part where this happened, want peace and safety for their families and friends. They want to be able to go about their day without being scared.</p>\n<p>This decision helps people feel that good things can happen and that fairness is very important. It brings a little bit of hope that things can get better and that everyone will work together to keep the country safe and peaceful.</p>\n<p>Did you know? When people work together to follow rules and be kind to each other, a country can become very strong and happy. It's like when all the players on a team work together, they can win the game!</p>\n\n<h3>What Does It Mean for Us?</h3>\n<p>This story teaches us a big lesson: Rules are for everyone! They help us all live happily and safely together, whether we are kids, grown-ups, or even soldiers. And when rules are broken, it's important to make things fair again through justice. It's like when you play a game, and everyone follows the rules, the game is fun and fair for everyone!</p>\n<p>So, let's always remember to be kind, follow the rules, and help make our world a fair and safe place for everyone! That's all for now from your Africa News Reporter! Stay safe and keep smiling!</p>",
    "summary": "Three soldiers in Cameroon were sent to jail for hurting many civilians, showing that everyone, even protectors in uniforms, must follow the rules and face consequences for bad actions to ensure fairness and safety.",
    "whyMatters": "This is important because it shows that even grown-ups who are soldiers must follow rules, and when they do something wrong, they go to jail. It means that rules are for everyone, and it helps people feel safer and that things can be fair in Cameroon.",
    "category": "technology",
    "date": "2026-02-22T01:47:10.195Z",
    "image": "https://image.pollinations.ai/prompt/Rules%20for%20Everyone!%20Soldiers%20Go%20to%20Jail%20in%20Cameroon!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rules-for-everyone-soldiers-go-to-jail-in-cameroon",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "Uh Oh! A Sickness for Farm Animals in South Africa!",
    "content": "<h3>Hello, Super Reporters from Africa!</h3>\n\nHi everyone! It's your friendly news reporter, here with an important story from a beautiful country called South Africa. Sometimes, even in the most wonderful places, things happen that need our attention. Today, we're going to talk about a sickness that is making some farm animals unwell. Don't worry, we'll explain everything simply!\n\nImagine your favourite farm animals – big, strong cows, fluffy sheep, and playful goats. They are super important friends to many families in South Africa, and all over Africa! But right now, some of them are facing a bit of a challenge because of a sickness called Foot-and-Mouth Disease. It sounds a bit scary, but let's learn about it together.\n\n<h3>What is Foot-and-Mouth Disease?</h3>\n\nFoot-and-Mouth Disease is a special kind of germ that makes certain animals very sick. It's like when you catch a cold, but it's much more serious for animals! This germ loves to make little sores or blisters on the animals' mouths and on their feet. Imagine having a sore in your mouth, it would be hard to eat, wouldn't it? And sores on your feet would make it very hard to walk or run and play!\n\nThis disease is not usually a danger to people, so you don't need to worry about catching it yourself. It mostly makes farm animals feel very, very poorly. It's important to remember that this sickness is different from something called 'hand, foot, and mouth disease' that some children can get. Our animal friends have their own special sickness to deal with.\n\nDid you know? This animal sickness spreads super, super fast! That's why grown-ups need to work quickly to help the animals get better and stop more animals from getting sick.\n\n<h3>Who Gets This Sickness?</h3>\n\nOnly certain farm animals can get Foot-and-Mouth Disease. The animals that usually get sick are cows, sheep, goats, and pigs. These animals are often called 'livestock' because they help farmers in many ways.\n\nCows give us delicious milk, which we use for drinking, making cheese, and yummy yogurt! Sheep give us warm wool for clothes and sometimes meat. Goats can give milk and meat too. And pigs also provide meat.\n\nSo, when these important animals get sick, it's a big problem not just for them, but for the farmers who care for them and for all the people who rely on their products. Healthy animals mean happy farmers and happy families who have enough food.\n\n<h3>What Happens When Animals Get Sick?</h3>\n\nWhen a cow, sheep, goat, or pig catches Foot-and-Mouth Disease, they start to feel really unwell. The first things you might notice are little red spots that turn into blisters, especially in their mouths and on their tongues. These blisters can be very painful, making it hard for the animals to eat their food.\n\nImagine trying to eat your favourite snack with a sore mouth – it would be tough! Because they can't eat well, the animals become weak and lose a lot of energy. They might also get blisters on their feet, making it painful to stand up or walk around. They just want to rest because they feel so tired and sore.\n\nThis makes the animals very uncomfortable and sad, and it also means they can't produce as much milk or grow as big and strong. It's a tough time for them, and for their owners.\n\n<h3>Why is This Bad News for Farmers?</h3>\n\nFarmers in South Africa, just like farmers all over Africa, work incredibly hard every single day. They wake up early to feed their animals, make sure they have clean water, and keep them safe. Their animals are not just sources of food; they are often like part of the family and also a way for the farmers to earn money to care for their own families.\n\nWhen their animals get Foot-and-Mouth Disease, it’s very, very sad news. If their cows can't give milk, or their sheep can't grow strong wool, or their animals become too sick to sell, the farmers lose a lot of money. This means they might not have enough money to buy food for their families, send their children to school, or fix things around their homes.\n\nDid you know? Farmers are like real-life superheroes! They work so hard to grow our food and take care of animals so we can all be strong and healthy. When their animals get sick, it makes their super important job much harder.\n\n<h3>What Are the Helpers Doing to Stop It?</h3>\n\nWhen a big problem like this happens, grown-ups called 'government officials' – who are like special helpers for the whole country – step in to help. They know how important farm animals are, so they have started a special program to help stop the sickness. This program is all about giving the animals special medicine shots, called 'vaccines'.\n\nImagine you get a special shot at the doctor to stop you from getting a bad flu. It's similar to that! These vaccines teach the animals' bodies how to fight off the Foot-and-Mouth germ. It's like giving them a shield to protect them from the sickness. The helpers are working hard to give these shots to as many animals as possible.\n\nDid you know? Vaccines are amazing! They help animals (and people!) stay strong by teaching their bodies how to fight off tiny, invisible germs before they can make them sick. It's like a secret training for their immune system!\n\n<h3>Why Is It Important to Be Fast?</h3>\n\nThe helpers know that with Foot-and-Mouth Disease, time is super important. Remember how we said the sickness spreads very, very quickly? Well, the faster they can give the special medicine shots to the animals, the faster they can stop the germs from jumping from one animal to another. This helps protect more animals from getting sick.\n\nIf the helpers are slow, more animals might get sick, and the problem could get even bigger and harder to stop. So, everyone wants these special shots to be given out as quickly as possible to keep the animals safe and healthy. It's like putting out a small fire before it becomes a huge one!\n\nSome people were a little bit unhappy because they felt the helpers started giving the shots a bit slowly. They wanted the helpers to jump into action even faster. When something so important like this happens, everyone hopes for the fastest help possible to save the animals and support the farmers.\n\n<h3>What Does This Mean for Africa?</h3>\n\nHealthy farm animals are super important for all of Africa. Many families in different African countries rely on their animals for food, for milk, and for a way to earn money. When animals are healthy, families are strong, children can go to school, and communities thrive.\n\nSo, when there's a problem with animal health in one country like South Africa, it's a reminder that we all need to care about what happens to our animal friends. We wish all the animals getting the shots a speedy recovery and hope the helpers can stop the sickness for good!\n\nDid you know? Animals are not just pets; they are often a very important part of how families make a living in Africa, providing food and income. Keeping them healthy means keeping families strong and happy!\n\n<h3>How Can We Help (Even Though We Are Small)?</h3>\n\nEven though we are young, we can still help! Here are some things you can do:\n\n*   **Be Smart:** If you ever see farm animals, remember not to touch them without asking a grown-up first, especially if they look unwell. It's always good to be careful.\n*   **Wash Your Hands:** Always wash your hands with soap and water after playing outside, especially if you've been near any animals.\n*   **Tell a Grown-Up:** If you ever see an animal that looks sick or hurt, tell a grown-up right away. They will know what to do.\n*   **Learn More:** Keep learning about animals and how important they are. The more you know, the more you can understand and help!\n\nWe know that the grown-ups and helpers are working very hard to protect the animals and support the farmers. Let's send our best wishes to all the farm animals in South Africa to get well soon! Thank you for being such amazing, caring reporters! Keep shining brightly, Africa!",
    "summary": "Farm animals like cows, sheep, and goats in South Africa are getting sick with Foot-and-Mouth Disease, which makes them sore and weak, causing big worries for farmers who need healthy animals for food and income, and government helpers are giving special medicine shots to stop the sickness from spreading quickly.",
    "whyMatters": "This is important because healthy farm animals mean happy farmers, yummy food like milk and meat for everyone, and strong families across Africa, so when animals get sick, it affects many people's lives and their ability to get food and earn money.",
    "category": "world",
    "date": "2026-02-22T01:47:40.133Z",
    "image": "https://image.pollinations.ai/prompt/Uh%20Oh!%20A%20Sickness%20for%20Farm%20Animals%20in%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uh-oh-a-sickness-for-farm-animals-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pakistan carries out strikes in Afghanistan after spate of suicide attacks",
    "title": "Pakistan carries out strikes in Afghanistan after spate of suicide attacks",
    "content": "Afghan sources say the Pakistani strikes hit the border provinces of Paktika and Nangarhar.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:47:45.443Z",
    "image": "https://image.pollinations.ai/prompt/Pakistan%20carries%20out%20strikes%20in%20Afghanistan%20after%20spate%20of%20suicide%20attacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pakistan-carries-out-strikes-in-afghanistan-after-spate-of-suicide-attacks",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/pakistan-carries-out-strikes-in-afghanistan-after-islamabad-suicide-attack?traffic_source=rss"
  },
  {
    "originalTitle": "Nico O’Reilly double seals key 2-1 win for Man City over Newcastle United",
    "title": "Nico O’Reilly double seals key 2-1 win for Man City over Newcastle United",
    "content": "Manchester City's win cut Arsenal's lead at the top of the Premier League to two points.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:47:50.590Z",
    "image": "https://image.pollinations.ai/prompt/Nico%20O%E2%80%99Reilly%20double%20seals%20key%202-1%20win%20for%20Man%20City%20over%20Newcastle%20United%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nico-oreilly-double-seals-key-2-1-win-for-man-city-over-newcastle-united",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/21/nico-oreilly-double-seals-key-2-1-win-for-man-city-over-newcastle-united?traffic_source=rss"
  },
  {
    "originalTitle": "Trump’s tariff regime has been ruled unlawful. What are the implications?",
    "title": "Trump’s tariff regime has been ruled unlawful. What are the implications?",
    "content": "The US Supreme Court has struck down President Donald Trump's central policy.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:47:55.733Z",
    "image": "https://image.pollinations.ai/prompt/Trump%E2%80%99s%20tariff%20regime%20has%20been%20ruled%20unlawful.%20What%20are%20the%20implications%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-tariff-regime-has-been-ruled-unlawful-what-are-the-implications",
    "originalLink": "https://www.aljazeera.com/video/inside-story/2026/2/21/trumps-tariff-regime-ruled-unlawful-what-are-the-implications?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:48:01.579Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "title": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "content": "Far-left militants are suspected of being behind Quentin Deranque's death and the party of Jean-Luc Mélenchon is being widely condemned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-22T01:48:06.731Z",
    "image": "https://image.pollinations.ai/prompt/Killing%20of%20nationalist%20student%20leaves%20French%20far%20left%20in%20deep%20trouble%20as%20elections%20loom%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killing-of-nationalist-student-leaves-french-far-left-in-deep-trouble-as-elections-loom",
    "originalLink": "https://www.bbc.com/news/articles/cnv61zv534eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nasa astronauts' moon mission delayed due to rocket issue",
    "title": "Nasa astronauts' moon mission delayed due to rocket issue",
    "content": "The mission to the far side of the Moon and back will be postponed after problems with were spotted with its rocket, a Nasa official said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T01:48:11.896Z",
    "image": "https://image.pollinations.ai/prompt/Nasa%20astronauts'%20moon%20mission%20delayed%20due%20to%20rocket%20issue%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nasa-astronauts-moon-mission-delayed-due-to-rocket-issue",
    "originalLink": "https://www.bbc.com/news/articles/c626v265zqlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "O'Reilly scores twice as Man City beat Newcastle",
    "title": "O'Reilly scores twice as Man City beat Newcastle",
    "content": "Manchester City move to within two points of Premier League leaders Arsenal with a tense victory against Newcastle United at Etihad Stadium.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:48:17.505Z",
    "image": "https://image.pollinations.ai/prompt/O'Reilly%20scores%20twice%20as%20Man%20City%20beat%20Newcastle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oreilly-scores-twice-as-man-city-beat-newcastle",
    "originalLink": "https://www.bbc.com/sport/football/videos/cre09v8yglqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "title": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "content": "Chelsea make it 17 points dropped from winning positions in the Premier League this season as Zian Flemming's 93rd-minute header gives Burnley a 1-1 draw, after Wesley Fofana is sent off at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T01:48:22.639Z",
    "image": "https://image.pollinations.ai/prompt/Ten-man%20Chelsea%20drop%20points%20again%20as%20Burnley%20score%20stoppage-time%20equaliser%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ten-man-chelsea-drop-points-again-as-burnley-score-stoppage-time-equaliser",
    "originalLink": "https://www.bbc.com/sport/football/videos/cedz2v0edpgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late Abraham goal rescues point for Villa against Leeds",
    "title": "Late Abraham goal rescues point for Villa against Leeds",
    "content": "Tammy Abraham comes off the bench to score an 88th minute equaliser to cancel out Anton Stach's spectacular freekick, as Aston Villa rescue a 1-1 draw against Leeds United at Villa Park in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T01:48:27.784Z",
    "image": "https://image.pollinations.ai/prompt/Late%20Abraham%20goal%20rescues%20point%20for%20Villa%20against%20Leeds%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-abraham-goal-rescues-point-for-villa-against-leeds",
    "originalLink": "https://www.bbc.com/sport/football/videos/cy8gn54mr0jo?at_medium=RSS&at_campaign=rss"
  }
]