[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "content": "Bouquets of cash have been blooming in popularity in Kenya but recent warnings may slow the trend.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:40:53.056Z",
    "image": "https://image.pollinations.ai/prompt/Kenyans%20drop%20flowers%20for%20Valentine's%20bouquets%20of%20cash.%20Not%20everyone%20is%20impressed%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kenyans-drop-flowers-for-valentines-bouquets-of-cash-not-everyone-is-impressed",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:40:58.228Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "Africa's Big Game: New Rules in the World!",
    "content": "Hey everyone! Get ready for some exciting news from our big continent, Africa!\n\nImagine you and your friends are playing a game. Suddenly, one of the main players changes the rules a little bit. That's a bit like what's happening in the big world right now!\n\nThe big leader of America, the US President, has made some new ideas about how countries should talk to each other and work together.\n\nNow, Africa, our wonderful home, is busy figuring out what these new ideas mean for us. We want to make sure Africa is heard and respected!\n\n<h3>Who is the US President?</h3>\n\nFirst, let's talk about the US President. This is the leader of a very big country called America, also known as the United States.\n\nJust like your school has a head teacher, a country has a leader. The US President is a very important leader in the world.\n\nWhen this leader makes big decisions, it can affect many other countries, even our friends here in Africa.\n\n*Did you know?* The USA has a really big statue called the Statue of Liberty! It's a symbol of freedom and welcome for many people.\n\n<h3>Countries Talking Together</h3>\n\nSo, what does it mean when countries \"talk together\"? This is called \"international relations.\" It's a fancy way of saying how countries are friends and neighbours.\n\nImagine your family talking to another family about sharing toys or helping each other. Countries do the same thing!\n\nThey talk about important things. Like sharing food, making sure everyone is healthy, or even playing games (like sports competitions!).\n\nSometimes, countries need to make new rules or change old ones. Just like when you decide new rules for a game to make it fair for everyone.\n\nThese talks help countries get along and help each other. It's like a big team meeting for all the countries in the world.\n\n<h3>Africa Wants a Seat at the Table!</h3>\n\nNow, this is super important for Africa. Imagine there's a big meeting where all the grown-ups decide things that affect you.\n\nAfrica wants to be *at the table* in that meeting. This means Africa wants to be part of the talking and the deciding.\n\nWe don't want other countries to decide *for* us. We want to share our ideas and help make good choices for everyone.\n\nThe original story asked, \"A seat at the table or on the menu?\" Being \"on the menu\" would mean other countries decide things *about* Africa, without us being there. No thank you!\n\nAfrica has so many clever people and wonderful ideas. We need to be heard and valued!\n\n*Did you know?* Africa is the second-largest continent in the world, with 54 amazing countries! Each one is special and unique.\n\n<h3>What Does Africa Care About?</h3>\n\nWhat kinds of things does Africa want to talk about at this big world table? Lots of important things!\n\n**Peace:** We want all our countries to be peaceful and safe. This way, kids like you can learn and play without worry.\n\n**Health:** We want good hospitals and doctors so everyone can be healthy and strong. We want medicines to help us when we are sick.\n\n**Learning:** We want more schools and good teachers so every child can learn and grow up to be brilliant. Education is super important!\n\n**Trade:** This means buying and selling things. Africa wants to sell its wonderful goods to other countries and buy things we need. This helps our families and communities grow stronger and richer.\n\n*Did you know?* Africa has the biggest desert in the world, the Sahara Desert! It's super hot and sandy, and home to amazing animals like camels.\n\n<h3>Working Together Makes Us Stronger</h3>\n\nAfrica knows that working together is the best way. Our African countries often meet together to share ideas and plans.\n\nThey talk about how to help each other and how to speak with one strong voice to the rest of the world.\n\nWhen our leaders from different African countries agree on something, they can tell the US President and other world leaders their ideas.\n\nIt's like when you and your friends agree on a game to play – it's more fun and stronger when everyone is on the same team!\n\nThis helps make sure Africa's ideas are heard very clearly. It helps us stand up for what is right for our continent.\n\n<h3>You Can Help Too!</h3>\n\nEven though you are still young, you can help Africa be strong! Every little bit makes a difference.\n\nHow? By learning in school, being kind to your friends, and taking care of our beautiful land and animals.\n\nWhen you do your best, you are helping your community and your country. You are helping Africa!\n\nThe more we learn and grow, the stronger Africa becomes! We are all part of Africa's big family.\n\n*Did you know?* The Nile River, which flows through many African countries, is one of the longest rivers in the world! It brings water to many people and animals.\n\n<h3>Africa's Bright Future!</h3>\n\nSo, the big world game might have some new rules, but Africa is ready! We are strong and smart.\n\nOur leaders are working hard to make sure Africa has its special place at the big table. They are making sure our voices are heard.\n\nWe will share our voices, our ideas, and our hopes for a wonderful future for all of us.\n\nAfrica is full of smart, strong, and brave people. We are ready for any new changes and we will shine brightly!\n\nLet's cheer for Africa! Hooray for our amazing continent!",
    "summary": "Africa is learning how to work with new world changes to make sure its voice is heard and important decisions are made together, not just by others.",
    "whyMatters": "It's important because Africa wants to help make the big decisions that affect its people and its future, so everyone can live happily and safely with their voices respected.",
    "category": "world",
    "date": "2026-02-14T13:41:19.744Z",
    "image": "https://image.pollinations.ai/prompt/Africa's%20Big%20Game%3A%20New%20Rules%20in%20the%20World!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "africas-big-game-new-rules-in-the-world",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Swear words fly as cheating allegations made in curling at Winter Olympics",
    "title": "Cool Ice Games and Playing Fair!",
    "content": "Hi everyone! It's your friend, Imani, reporting to you from sunny Africa! I hope you are all ready for some super fun news from a very cold place far, far away. Today, we're going to talk about a special big party called the Winter Olympics, where amazing athletes play sports on snow and ice!\n\n<h3>What is Curling? A Cool Game on Ice!</h3>\nHave you ever heard of a game called curling? It's a really unique sport played on a big sheet of ice! Imagine a very slippery, long table. Instead of rolling marbles, players slide big, heavy stones across the ice. These stones are round and have a handle.\n\nThe goal is to get your stone to stop as close as possible to a target area called the 'house'. It looks a bit like a big circle drawn on the ice.\n\nTeams take turns sliding their stones. It's like a gentle push, but it needs a lot of skill and a good aim! Two other players on the team run in front of the stone with brooms. They sweep the ice really, really fast!\n\nWhy do they sweep? Sweeping makes the ice a tiny bit warmer and smoother right in front of the stone. This helps the stone glide further and straighter. It's super clever and needs lots of teamwork!\n\nDid you know? The special stones used in curling are very heavy! They are made from a special type of rock called granite, which is found only in a few places in the world, like Scotland!\n\n<h3>The Winter Olympics: A Big Sporty Party!</h3>\nEvery four years, athletes from all over the world gather for a huge celebration of sports called the Winter Olympics. It's like a giant sports festival, but only for games played on snow and ice!\n\nImagine people skiing down huge mountains, skating gracefully on ice, or zooming really fast on sleds. These games are very exciting to watch!\n\nAthletes train for many, many years to become good enough to play in the Winter Olympics. They come to show their skills and try to win shiny medals for their country.\n\nDid you know? The very first Winter Olympics was held a very long time ago, in 1924! Many countries that don't have snow, like some in Africa, still send amazing athletes to compete!\n\n<h3>Meet the Champion Teams: Sweden and Canada</h3>\nIn the sport of curling, there are some teams that are really, really good. They are like the champions! Two of these top teams are from countries far away called Sweden and Canada. Both of these teams have many strong players and have won lots of games.\n\nWhen Sweden and Canada play each other, everyone knows it will be a super exciting match. People love to watch them because they play so well. They are both known for being very skilled and smart in their curling strategies.\n\nThese teams have spent so much time practicing together. They know how to slide the stones just right and how to sweep perfectly. This makes their games very competitive and fun to watch!\n\n<h3>A Very Exciting Game!</h3>\nRecently, at the Winter Olympics, these two champion teams, Sweden and Canada, played a very important curling game. Everyone was watching because it was such a big match. The game was close and exciting, with each team trying their very best to win.\n\nPlayers were sliding stones, sweeping the ice, and talking to each other to make the best moves. It was a really intense game, meaning everyone was focused and trying hard. You could feel the excitement building up!\n\nEach team wanted to score more points than the other. They were pushing their stones and sweeping with all their might. It was a true test of their skills and teamwork on the slippery ice.\n\n<h3>A Little Problem on the Ice</h3>\nBut then, something happened that made the game a bit sad. During the match, there was a big talk because one team thought the other team might not have followed all the rules exactly right.\n\nIt was a misunderstanding, or maybe one team felt the other was not playing as fairly as they should. Sometimes, even in big games, grown-ups can get very upset when they think something is not fair.\n\nBecause they were so upset, some grown-ups said words that are not polite. These were not kind words that we should use, especially when we are playing games. It made everyone feel a little worried and disappointed.\n\nDid you know? Playing fairly means everyone follows the rules and treats each other with respect, even when the game is very important!\n\n<h3>Why Rules and Kindness Matter in Sports</h3>\nThis moment on the ice reminds us all of something very important: rules are there to make games fun and fair for everyone. When we follow the rules, every player has a good chance to win, and the game is exciting for everyone.\n\nIt's also super important to be kind and respectful, even if you are trying very hard to win. Sometimes, in the heat of a game, people can get carried away, but it's always best to be a good sport. A good sport means you are polite, you follow the rules, and you shake hands at the end, win or lose.\n\nWhen we play fair and are kind, we make friends, and sports become even more enjoyable. Winning is great, but being a good friend and a good player is even better!\n\nDid you know? Good sportsmanship means cheering for your teammates, congratulating your opponents, and always trying your best without being mean!\n\n<h3>What We Can Learn From This</h3>\nSo, what can we learn from this game with the champion curling teams? We learn that even the very best players in the world can have tough moments. They might get upset, or there might be misunderstandings.\n\nBut it's always best to try and talk things out calmly. We should remember that sports are about fun, friendship, and trying our very best. It's about respecting the game, the rules, and each other.\n\nWe want everyone to enjoy playing, and to learn to be good friends on and off the field. Because that's what makes sports truly wonderful!\n\nSo, my dear friends, remember to always play fair, be kind to your teammates and your opponents, and most importantly, have fun! That's the real win in any game! Until next time, stay happy and play fair!",
    "summary": "At the Winter Olympics, two top curling teams, Sweden and Canada, had a tense game where they disagreed about fair play and used some impolite words, reminding everyone why following rules and being kind are so important in sports.",
    "whyMatters": "This story matters because it teaches us that even champions need to remember to play by the rules and be kind to each other, so everyone can have fun and enjoy the game fairly.",
    "category": "world",
    "date": "2026-02-14T13:41:42.079Z",
    "image": "https://image.pollinations.ai/prompt/Cool%20Ice%20Games%20and%20Playing%20Fair!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cool-ice-games-and-playing-fair",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/curse-words-fly-as-cheating-allegations-made-in-curling-at-winter-olympics?traffic_source=rss"
  },
  {
    "originalTitle": "ICU patients’ lives at risk in Gaza’s Al-Aqsa Hospital amid Israel’s war",
    "title": "ICU patients’ lives at risk in Gaza’s Al-Aqsa Hospital amid Israel’s war",
    "content": "The hospital may be forced in the coming hours to ration electricity so that certain wards can be prioritised.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:41:47.254Z",
    "image": "https://image.pollinations.ai/prompt/ICU%20patients%E2%80%99%20lives%20at%20risk%20in%20Gaza%E2%80%99s%20Al-Aqsa%20Hospital%20amid%20Israel%E2%80%99s%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "icu-patients-lives-at-risk-in-gazas-al-aqsa-hospital-amid-israels-war",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/icu-patients-lives-at-risk-in-gazas-al-aqsa-hospital-amid-israels-war?traffic_source=rss"
  },
  {
    "originalTitle": "India vs Pakistan match is a godsend for T20 World Cup hosts Sri Lanka",
    "title": "A Super Cricket Match Makes Sri Lanka Smile!",
    "content": "Hello, super friends! It's your kid-friendly reporter, always bringing you exciting news from our amazing continent, Africa, and beyond! Today, we have a super special story about a big game that is making lots of people happy. It's all about cricket! This story is from a beautiful island country called Sri Lanka. Let’s find out why everyone is so excited! \n\n<h3>What is Cricket, You Ask?</h3>\nCricket is a super fun sport. It is played with a bat and a ball. Two teams play against each other to score points. Players hit the ball very hard and then run between two sticks called wickets. It’s a bit like baseball, but it has its own special rules and traditions! Many people around the world love to play and watch cricket. It’s a game that needs skill and teamwork.\n\nDid you know? Cricket is one of the most popular sports in the world, especially in countries like India, Pakistan, and Sri Lanka! Millions of people watch it!\n\n<h3>Meet India and Pakistan</h3>\nImagine two big countries that really, really love cricket. These countries are India and Pakistan. When their cricket teams play each other, it’s a very, very big deal. Everyone gets super excited to watch this special match. It's like the biggest party ever for cricket fans!\n\nTheir matches are always full of thrills and cheers. People gather with their families and friends to watch. They cheer very loudly for their favorite team. It’s a friendly competition, but everyone wants their team to win! It’s a day full of fun and excitement.\n\n<h3>The Super Exciting Match!</h3>\nGuess what? India and Pakistan are going to play a cricket match soon! This is not just any match. It's happening at a very important event called the T20 World Cup. Many people will gather in Sri Lanka to watch these two amazing teams play against each other. It’s a truly special game that everyone looks forward to.\n\nIt will be a day full of fun and cheering. Fans will wear their team colours. They will sing songs and clap their hands very loudly for every good shot or wicket. Everyone is waiting for this super exciting game to begin because it promises to be full of action and great plays.\n\n<h3>What is the T20 World Cup?</h3>\nThe T20 World Cup is a very big cricket tournament. Teams from many different countries come together to play. They all want to win the big trophy! T20 is a special kind of cricket. It is very fast and exciting because the games don't last all day. This means there is lots of action quickly! It's designed to be a quick and thrilling version of cricket.\n\nTeams try to score as many runs as they can in a limited number of turns. It keeps everyone on the edge of their seats! It's a champion's tournament where only the best teams play to see who is the world's best.\n\nDid you know? T20 cricket games are usually finished in about three hours, making them very popular for watching quickly and for families to enjoy together!\n\n<h3>Hello, Sri Lanka! The Host Country</h3>\nThis big T20 World Cup is happening in a beautiful country called Sri Lanka. Sri Lanka is a lovely island with beautiful beaches, green forests, and very friendly people. Being a \"host country\" means Sri Lanka welcomes all the teams from around the world. They help to make sure all the games happen smoothly and that everyone has a good time.\n\nThey get ready for lots of visitors to come and watch the games. Sri Lanka works hard to make everyone feel happy and safe. They prepare the big cricket stadiums, tidy up the grounds, and make sure there's enough food and drink for all the fans. It's a big job, but they do it with a smile!\n\nDid you know? Sri Lanka is an island country, which means it is surrounded by water on all sides! It looks a bit like a teardrop shape on a map.\n\n<h3>Oh Dear! Sri Lanka Was Worried</h3>\nNow, here is a little secret. Sri Lanka was a bit worried not long ago. The team from Pakistan almost said they would not come to play! Oh no! If a big team like Pakistan does not play, fewer people will come to watch the games. This would make Sri Lanka quite sad.\n\nWhy would they be sad? Because when people come to watch the games, they buy tickets to get into the stadium. They buy yummy snacks and drinks like popcorn and juice. They might also buy souvenirs like hats and shirts. Many visitors also stay in hotels and eat at restaurants. All this helps Sri Lanka make money. This money helps them pay for the games and other important things for their country, like building schools or roads. If a big team didn't come, there would be less money.\n\n<h3>But Now... Hooray!</h3>\nBut guess what happened? Pakistan decided to come and play after all! Hooray! Everyone in Sri Lanka is super happy now. This means the big match between India and Pakistan will happen. Lots and lots of people will come to Sri Lanka from all over the world to see this exciting game.\n\nThey will fill the stadiums with cheers and smiles. The shops will be busy selling food, drinks, and souvenirs. Hotels will be full of happy visitors who have come to enjoy the cricket and the beautiful country. This is very good news for Sri Lanka! It means more fun for everyone and more help for the country's economy. Happy faces all around!\n\n<h3>Why This Match is Good News for Everyone</h3>\nThis cricket match is more than just a game. It brings people together from different places and cultures. It shows how sports can make friends and create happiness for everyone. When many people visit Sri Lanka, it helps the country's economy. This means more jobs for people in shops and hotels, and more money to make the country even better.\n\nIt’s a big party that helps everyone. Sri Lanka gets to show off its beautiful country to the world, letting everyone see how wonderful it is. All the fans get to watch amazing cricket and make happy memories. It's a win-win for everyone involved, a true celebration of sport and unity!\n\nDid you know? When countries host big sports events, it often helps their shops and restaurants because so many people visit and spend money in their towns!\n\n<h3>Get Ready for Fun!</h3>\nSo, get ready to imagine all the fun and excitement! The India vs. Pakistan match is going to be super special. It’s not just a game; it's a celebration of sports, friendship, and happy times for Sri Lanka. We will be cheering along with everyone else! What a wonderful day for cricket and for the lovely people of Sri Lanka!",
    "summary": "A very exciting cricket match between India and Pakistan is happening in Sri Lanka, which is great news because it means lots of fun and help for the host country.",
    "whyMatters": "This match is super important because it brings much joy and many visitors to Sri Lanka, helping the country earn money and share its beauty with the world.",
    "category": "world",
    "date": "2026-02-14T13:42:13.152Z",
    "image": "https://image.pollinations.ai/prompt/A%20Super%20Cricket%20Match%20Makes%20Sri%20Lanka%20Smile!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-super-cricket-match-makes-sri-lanka-smile",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/india-vs-pakistan-match-is-a-godsend-for-t20-world-cup-hosts-sri-lanka?traffic_source=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:42:18.820Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Police activity under way near Nancy Guthrie's home",
    "content": "A search has been carried out in Tuscon, Arizona, close to where the 84-year-old was abducted nearly two weeks ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:42:24.010Z",
    "image": "https://image.pollinations.ai/prompt/Police%20activity%20under%20way%20near%20Nancy%20Guthrie's%20home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-activity-under-way-near-nancy-guthries-home",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T13:42:29.180Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "content": "Chelsea striker Liam Delap turns in \"top\" performance in the 4-0 win over Hull City with a hat-trick of assists after missing a sitter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:42:34.612Z",
    "image": "https://image.pollinations.ai/prompt/'It%20was%20silly%20from%20me'%20-%20'brilliant'%20Delap%20recovers%20from%20error%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "it-was-silly-from-me-brilliant-delap-recovers-from-error",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Villa are still relying on old guard - and can it last?",
    "title": "Why Villa are still relying on old guard - and can it last?",
    "content": "Aston Villa's old guard have taken the club to new heights - but how long can it last?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:42:39.770Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Villa%20are%20still%20relying%20on%20old%20guard%20-%20and%20can%20it%20last%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-villa-are-still-relying-on-old-guard-and-can-it-last",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9dny1gjde8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Guimaraes set to be out for two months with injury",
    "title": "Guimaraes set to be out for two months with injury",
    "content": "Newcastle United captain Bruno Guimaraes is expected to be out for a couple of months after sustaining a hamstring injury.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T13:42:44.931Z",
    "image": "https://image.pollinations.ai/prompt/Guimaraes%20set%20to%20be%20out%20for%20two%20months%20with%20injury%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guimaraes-set-to-be-out-for-two-months-with-injury",
    "originalLink": "https://www.bbc.com/sport/football/articles/cj320gmz40no?at_medium=RSS&at_campaign=rss"
  }
]