[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Brave Girls Show Big Courage to Learn!",
    "content": "Hello, my wonderful friends across Africa! Your kid-friendly news reporter is here with a very special story today. It's about two super brave girls who live right here on our amazing continent. They are twin sisters, and they are showing us all what it means to be strong and determined. Let's meet them!\n\n<h3>Hello, Brave Twin Sisters!</h3>\nImagine having a best friend who is just like you! That's what these two sisters have. They are twins! They live in a place that faced some very sad times, but they are full of hope and big dreams. They love going to school, just like many of you. School is a happy place where they learn new things every day.\n\nThey told us that their friends are a very important part of their school life. Playing games, sharing secrets, and learning together makes school extra special. These girls have big smiles and even bigger hearts.\n\n<h3>A School Full of Fun</h3>\nBefore the sad times, their school was a busy and joyful place. Every morning, the twins would walk to school, excited to see their friends and teachers. They would learn to read stories, write their names, and count numbers. They loved drawing pictures and singing songs.\n\nTheir classroom was full of laughter and learning. They had many classmates, and they played together during break time. It was a place where they felt safe and happy, full of friends and fun. Learning was an adventure for them.\n\nDid you know? Many children across Africa love going to school! It's a special place to learn about the world and make lifelong friends.\n\n<h3>When Sadness Came to Visit</h3>\nOne day, something very sad happened in their town. There was a big, noisy fight. People call this a 'war.' During this scary time, there were loud bangs and sounds that made everyone very, very afraid. It was not safe for anyone, especially children.\n\nThe fighting was very close to their school. It broke things and made many people sad. The twins remember this time clearly. They told us that some of their friends were hurt very badly during these sad events. Sadly, some of their friends even died because of the fighting.\n\nThis made the twins and all the children very sad and scared. It's very hard when you lose your friends, especially when you are young. Their hearts were full of grief for their lost classmates.\n\nSimple explanation: 'War' is when people fight in a very big and dangerous way, often with loud machines and weapons. It brings a lot of sadness and can hurt many people and places.\n\n<h3>Choosing Courage, Choosing School</h3>\nBecause it was not safe, their school had to close for a while. The children could not go to learn or play. Everyone stayed home, hoping the scary times would end. It was a very hard time for everyone.\n\nBut guess what? After a while, things became a little bit safer. And the twin girls made a very brave decision! Even though they were still sad about their friends, and maybe a little bit scared, they chose to go back to school. They showed incredible courage.\n\nThey could have stayed home, feeling sad and afraid. But they knew something important: their friends who were gone would have wanted them to keep learning. They wanted to make their friends proud. So, with brave hearts, they stepped back into their school.\n\nDid you know? Courage means being brave even when you are scared. These twin girls have huge courage in their hearts!\n\n<h3>Why School is a Super Power!</h3>\nGoing back to school after such a sad time is not easy, but the twins know why it's so important. School is like a superpower! It helps you learn to read amazing stories and write your own. It helps you learn numbers to count anything you want, from fruits to stars.\n\nSchool helps you become smart and strong in your mind. It teaches you how to think, solve problems, and understand the world around you. When you learn, you can dream big dreams for your future. Learning opens up so many possibilities for you and your family.\n\nSimple explanation: 'Education' is another word for learning. It is one of the most powerful tools children can have to build a happy and bright future for themselves and their communities.\n\n<h3>Dreaming Big Dreams for Tomorrow</h3>\nThe twins are determined to finish all their schooling. They want to learn everything they can. They told us they want to be successful and help their families and their country. Maybe one day they will be doctors, teachers, or even leaders!\n\nEvery time they open a book or listen to their teacher, they remember their friends. They know that by learning and working hard, they are honoring the memory of those they lost. They are building a brighter future, not just for themselves, but for everyone around them.\n\nDid you know? When children go to school, they help their whole community grow stronger and more peaceful. Education can change the world!\n\n<h3>Let's All Be Brave Learners!</h3>\nThese twin sisters teach us a very big lesson. Even when life is hard, or when you feel sad, never give up on learning. Your school is a special and important place. Cherish your friends, listen to your teachers, and learn as much as you can.\n\nEvery child, everywhere in Africa and the world, deserves to go to school and feel safe. Let's all hope for peace so that no child has to face such sad times again. Let's celebrate the courage of these twin girls and all children who strive to learn and dream big! You are all amazing!\n\nDid you know? Many organizations work hard to make sure children in places affected by war can still go to school safely and get the support they need to learn and grow.",
    "summary": "Two brave twin sisters in Africa have returned to school after losing friends in a war, showing immense courage and determination to learn and build a brighter future.",
    "whyMatters": "This story matters because it shows how strong children can be even after very sad times, reminding us that learning is super important and can bring hope for a better future for all kids in Africa.",
    "category": "world",
    "date": "2026-01-24T21:14:40.400Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Girls%20Show%20Big%20Courage%20to%20Learn!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-girls-show-big-courage-to-learn",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "content": "The authorities tried to stop their export arguing they were part of the country's heritage.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:14:45.587Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20prison%20key%2C%20sunglasses%20and%20shirt%20can%20be%20sold%20after%20daughter%20wins%20court%20battle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-prison-key-sunglasses-and-shirt-can-be-sold-after-daughter-wins-court-battle",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland's Big Adventure!",
    "content": "Hey Super Kids! Get ready for a super special story from a place in Africa called Somaliland! It's a land with big dreams, and its leader just went on a very important trip.\n\n<h3>Meet Somaliland!</h3>\nSomaliland is a beautiful, sunny place on the map of Africa. It has lovely beaches and busy towns. It's a part of Africa that wants to be its own country.\n\nImagine your school is part of a bigger school, but you want to be your *own* school with your *own* name and rules! That's a bit like Somaliland. They have their own government and their own money.\n\nThey have been working very hard for a long, long time to be seen as a truly independent country by everyone in the world. It’s a bit like when you work hard to build the tallest tower with your blocks!\n\nDid you know? Somaliland is in East Africa, right next to the big blue ocean! People there love to tell stories and drink delicious tea. They have many animals too, like camels! Camels are super important there for travel and milk.\n\n<h3>The President's Special Trip</h3>\nEvery country, or place that wants to be a country, has a special leader. For Somaliland, this leader is called the President. He is like the head teacher of the whole country!\n\nThe President's job is to help his people. He wants to make sure everyone has good homes, good schools, and good jobs. He tries to make Somaliland a happy and safe place.\n\nRecently, the President of Somaliland went on a very important trip far, far away. He traveled a long way across the world to meet important people. It was a very big adventure for him and for Somaliland!\n\nHe went to tell people all about Somaliland. He wanted to show them what a great place it is. He wanted to find new friends and helpers for his country.\n\n<h3>Showing Off Somaliland's Good Ideas</h3>\nWhen the President went on his trip, he met many important people. One of them was a very well-known person called Mr. Donald Trump Jr. His dad used to be the President of a very big country far away, called America.\n\nMeeting Mr. Trump Jr. was important. The Somaliland President wanted to \"pitch business opportunities\" to him. What does that mean? It means he showed Mr. Trump Jr. all the good ideas for new shops and factories in Somaliland!\n\nImagine you have a great idea for a new game or a new kind of yummy snack. You would tell your friends or your parents about it, right? You would show them how exciting it could be!\n\nThat's what the President did! He showed how people could start new farms, new toy factories, or new computer companies in Somaliland. He showed how they could build new schools or hospitals.\n\nWhy is this a good idea? Because when new shops and factories open, they create jobs for people! More jobs mean more families can earn money. This helps everyone buy food, clothes, and go to school.\n\nDid you know? When a new business starts, it can be like planting a seed! That seed grows into a big tree that helps many people by giving them fruits (like jobs and good things to buy!).\n\n<h3>A New Friend from Israel</h3>\nOn his trip, the Somaliland President met another very special person. He met the leader from a country called Israel. This leader is also like the \"head teacher\" of Israel.\n\nThis meeting was very important because Israel has done something amazing for Somaliland. Israel has said, \"Yes, Somaliland! We see you as your *own* special country!\"\n\nMost countries in the world have not said this yet. So, Israel saying this is a huge, huge deal for Somaliland. It's like when your best friend says, \"Yes! Your new club is the best!\" even if other kids haven't joined yet.\n\nHaving Israel as a friend is wonderful. It means Israel will help Somaliland. They can share ideas, trade things, and work together. This helps Somaliland grow stronger and closer to its dream of being recognised by everyone.\n\nDid you know? Israel is a country far away in the Middle East. It's famous for its old, old cities and its clever scientists who invent many new things! They have deserts and beaches too.\n\n<h3>Why This All Matters for Somaliland</h3>\nAll these meetings and new friends are super important for the people of Somaliland. They are working hard to build a bright future.\n\nWhen new businesses come, there are more jobs. This means families can be happier and healthier. They can send their children to school and have better homes.\n\nWhen more countries like Israel recognise Somaliland, it helps Somaliland become stronger in the world. It shows that Somaliland is a safe and good place to live and work.\n\nIt helps Somaliland get closer to its biggest dream: to be a fully independent country that all the countries in the world say \"hello\" to.\n\nSomaliland wants to show everyone that it is a peaceful and stable place. It wants to be known for its kind people, its beautiful land, and its exciting opportunities.\n\n<h3>A Bright Future Ahead!</h3>\nThe Somaliland President's trip was a big step for his country. He worked hard to make new friends and share Somaliland's good ideas.\n\nThese steps help Somaliland on its journey to become a truly recognised and successful country. It shows that with hard work and good friends, big dreams can come true!\n\nSo, let's cheer for Somaliland and its brave President! They are building a wonderful future for all the children and families in their special corner of Africa.",
    "summary": "The President of Somaliland took a big trip to find new friends, like Israel, and share good ideas to help his country grow and become a recognised country.",
    "whyMatters": "This helps Somaliland get more jobs, build better schools, and get closer to being a fully independent country that everyone knows about.",
    "category": "world",
    "date": "2026-01-24T21:15:08.575Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland's%20Big%20Adventure!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somalilands-big-adventure",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ceasefire between Syrian army and Kurdish-led forces extended for 15 days",
    "title": "Happy News! A Special Break from Fighting in Syria!",
    "content": "Hello, my lovely friends! Your friendly news reporter from Africa is here with some very important and happy news from a faraway land called Syria. Sometimes, grown-ups in different places have big disagreements, just like sometimes you might have a disagreement with your friend about who gets to play with a toy first.\n\nToday, we are talking about a big country far away from us. It is called Syria. And guess what? The people there are getting a special break from fighting! This is super good news because it means people can be safer and happier.\n\n<h3>What is a Ceasefire?</h3>\nImagine you and a friend are playing, and suddenly you start to argue. A grown-up comes and says, \"Okay, everybody stop! Let's take a break.\" That's a bit like a ceasefire! A ceasefire means that people who were fighting agree to stop for a little while.\n\nIt's like a special timeout for everyone. When there is a ceasefire, no one shoots or fights. It makes everything calm and peaceful for a bit. This is very important because fighting makes people sad and scared. Peace makes people happy and safe.\n\nDid you know? \"Ceasefire\" is a big word, but it just means \"stop fighting\"! It's like pressing a pause button on a video game.\n\n<h3>Who are the People in Syria?</h3>\nIn Syria, there are different groups of people. One group is like the country's main helpers, called the Syrian army. Another group is like their neighbours and friends, who we can call the Kurdish friends. Sometimes, these groups have big disagreements and fights.\n\nIt's very sad when friends or neighbours fight. Everyone wants to live in peace and safety. So, when they agree to stop fighting, it is a very big step towards making everyone happy.\n\nThese groups were fighting, but now they have agreed to stop. And not just for a little while, but they are going to stop for even longer!\n\n<h3>A Special Break for Peace!</h3>\nThis special stop-fighting time was supposed to end soon. But guess what? The grown-ups in Syria have decided to make it longer! They have decided to 'extend' it. \"Extend\" means to make something last longer.\n\nSo, this break from fighting will now last for 15 more days! Wow, that's a whole lot of extra time for peace. For 15 more days, the people in Syria can feel a bit safer. This is wonderful news for everyone, especially for the children there.\n\nDid you know? 15 days is about two weeks and one day! That's a long time for a special peace break.\n\n<h3>Why is This Break Important?</h3>\nMaking the ceasefire longer is a very important decision. It was decided by the grown-ups who help run the country, like the Syrian defence ministry. They are like the people who make sure the country is safe and everyone follows the rules.\n\nThey decided to make the peace break longer for a very special reason. There are some other people, who we call ISIS. These ISIS people have done some very unkind things and made a lot of trouble. Some of these ISIS people are being held in special places, like prisoners.\n\nDid you know? In many countries, grown-ups called a \"ministry\" help to look after different parts of the country, like keeping people safe or looking after schools.\n\n<h3>Who are the ISIS People?</h3>\nISIS is a name for a group of people who are not kind. They cause problems and make people scared. They are not like friendly neighbours or good friends. So, when people cause a lot of trouble, sometimes they need to be kept in special places, away from others, so they can't cause more trouble. These people are called \"prisoners.\"\n\nRight now, some of these ISIS prisoners are in places that were looked after by the Kurdish friends. But the grown-ups want to move them to a new, safe place. And moving lots of people safely takes time and a lot of planning.\n\nThis is why they need the extra 15 days of peace. It's like if you have a big puzzle to move from one table to another. You need to be very careful and slow so you don't drop any pieces. Moving people safely is even harder!\n\n<h3>Moving People Safely</h3>\nThe grown-ups want to make sure these prisoners are moved safely from one building to another. Imagine you have a lot of toys in one box, and you need to put them into a new box across the room. You wouldn't want to run and bump into things, would you? You would walk slowly and carefully.\n\nThis is the same idea. They want to move the ISIS prisoners without any more fighting or trouble. This needs everyone to be calm and peaceful. So, the longer ceasefire helps everyone work together to do this important job safely.\n\nDid you know? When countries make a peace agreement, it often involves a lot of grown-ups talking and planning very carefully. It's like solving a very big and important puzzle!\n\n<h3>What Does This Mean for Children?</h3>\nWhen there is peace, even for a little while, it means children in Syria can feel a bit safer. They might be able to go outside and play. They might be able to go to school and learn new things. They might not hear scary noises.\n\nPeace helps everyone to be happy and to grow up safely. We, in Africa, always wish for peace for everyone in the world. It makes us happy to hear about any step towards making the world a safer and kinder place for all children.\n\nSo, this news about an extended ceasefire in Syria is a big smile for peace! Let's hope that this break helps the grown-ups make even more peace, so children in Syria can play and learn without any worries for a very long time.\n\nSending lots of love and hopes for peace from your African news friend!",
    "summary": "A special agreement to stop fighting in Syria, called a ceasefire, has been made longer by 15 days so that grown-ups can safely move some people who cause trouble, called ISIS prisoners, to new, safe places.",
    "whyMatters": "This is important because it means there will be more peace and safety for people in Syria, especially children, allowing grown-ups to do a big and important job of moving people safely without more fighting.",
    "category": "technology",
    "date": "2026-01-24T21:15:27.503Z",
    "image": "https://image.pollinations.ai/prompt/Happy%20News!%20A%20Special%20Break%20from%20Fighting%20in%20Syria!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "happy-news-a-special-break-from-fighting-in-syria",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/ceasefire-between-syrian-army-and-kurdish-led-forces-extended-for-15-days?traffic_source=rss"
  },
  {
    "originalTitle": "US-brokered Russia-Ukraine talks close with no breakthrough",
    "title": "US-brokered Russia-Ukraine talks close with no breakthrough",
    "content": "On eve of day 2 of talks in UAE capital, Russian attacks cut off about 1.2 million from power in sub-zero temperatures.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:15:32.717Z",
    "image": "https://image.pollinations.ai/prompt/US-brokered%20Russia-Ukraine%20talks%20close%20with%20no%20breakthrough%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-brokered-russia-ukraine-talks-close-with-no-breakthrough",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/us-brokered-talks-on-ukraine-close-with-no-breakthrough?traffic_source=rss"
  },
  {
    "originalTitle": "LIVE: Villarreal vs Real Madrid – La Liga",
    "title": "LIVE: Villarreal vs Real Madrid – La Liga",
    "content": "Follow our live build-up, with full team news coverage, before our comprehensive text commentary stream.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:15:37.895Z",
    "image": "https://image.pollinations.ai/prompt/LIVE%3A%20Villarreal%20vs%20Real%20Madrid%20%E2%80%93%20La%20Liga%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "live-villarreal-vs-real-madrid-la-liga",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/1/24/live-villarreal-vs-real-madrid-la-liga?traffic_source=rss"
  },
  {
    "originalTitle": "Trump threatens Canada with 100% tariffs over China trade deal",
    "title": "Trump threatens Canada with 100% tariffs over China trade deal",
    "content": "Trump made the threat in a social media post as tensions rise between the US and its northern neighbour.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:15:43.686Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20Canada%20with%20100%25%20tariffs%20over%20China%20trade%20deal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-canada-with-100percent-tariffs-over-china-trade-deal",
    "originalLink": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
    "title": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
    "content": "The US president's praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T21:15:48.864Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20UK%20soldiers%20in%20Afghanistan%20'among%20greatest%20of%20all%20warriors'%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-uk-soldiers-in-afghanistan-among-greatest-of-all-warriors",
    "originalLink": "https://www.bbc.com/news/articles/c3edwx37pd9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Two days of peace talks end as Russia continues Ukraine attacks",
    "title": "Two days of peace talks end as Russia continues Ukraine attacks",
    "content": "There is no apparent breakthrough as the three-way talks conclude and Russia maintains its bombardment.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:15:54.028Z",
    "image": "https://image.pollinations.ai/prompt/Two%20days%20of%20peace%20talks%20end%20as%20Russia%20continues%20Ukraine%20attacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "two-days-of-peace-talks-end-as-russia-continues-ukraine-attacks",
    "originalLink": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Adli's stoppage-time winner ends Liverpool unbeaten run in thriller",
    "title": "Adli's stoppage-time winner ends Liverpool unbeaten run in thriller",
    "content": "Amine Adli scores a stoppage-time winner as Bournemouth end Liverpool's 13-game unbeaten run in a thrilling match at Vitality Stadium.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:15:59.693Z",
    "image": "https://image.pollinations.ai/prompt/Adli's%20stoppage-time%20winner%20ends%20Liverpool%20unbeaten%20run%20in%20thriller%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "adlis-stoppage-time-winner-ends-liverpool-unbeaten-run-in-thriller",
    "originalLink": "https://www.bbc.com/sport/football/videos/c86vg6x9097o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bowen leads West Ham to important win over Sunderland ",
    "title": "Bowen leads West Ham to important win over Sunderland ",
    "content": "A fantastic first-half performance helps West Ham blow away Sunderland and move to within two points of 17th-placed Nottingham Forest and safety.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:16:04.862Z",
    "image": "https://image.pollinations.ai/prompt/Bowen%20leads%20West%20Ham%20to%20important%20win%20over%20Sunderland%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bowen-leads-west-ham-to-important-win-over-sunderland",
    "originalLink": "https://www.bbc.com/sport/football/videos/cy7mj1237zpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late Romero header rescues draw for Tottenham at Burnley",
    "title": "Late Romero header rescues draw for Tottenham at Burnley",
    "content": "Cristian Romero rescues a point for Tottenham Hotspur late on just as under-pressure head coach Thomas Frank faced further embarrassment against struggling Burnley at Turf Moor.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T21:16:10.028Z",
    "image": "https://image.pollinations.ai/prompt/Late%20Romero%20header%20rescues%20draw%20for%20Tottenham%20at%20Burnley%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-romero-header-rescues-draw-for-tottenham-at-burnley",
    "originalLink": "https://www.bbc.com/sport/football/videos/cm2jm2kn39go?at_medium=RSS&at_campaign=rss"
  }
]