[
  {
    "originalTitle": "Sudan war crimes saw 6,000 killed in three days, UN says",
    "title": "Sudan war crimes saw 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in the city of el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:40:28.631Z",
    "image": "https://image.pollinations.ai/prompt/Sudan%20war%20crimes%20saw%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudan-war-crimes-saw-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "Super Heroes for Safety! South Africa's Plan to Keep Everyone Safe",
    "content": "Hello, my amazing friends! It’s your friendly news reporter, here from the beautiful land of Africa! Today, we have some important news from a wonderful country called South Africa. It's a place with sunny skies, amazing animals, and friendly people, just like you!\n\n<h3>What's Happening in South Africa?</h3>\nSometimes, in different places, there can be people who don't follow the rules. They might do things that are not good for everyone. In South Africa, there are some groups of people called \"crime gangs.\" These gangs sometimes do bad things that hurt others or break the rules.\n\nThey might take things that don't belong to them or cause trouble in communities. This can make people feel a little bit unsafe, and that's not what we want for anyone.\n\nThere's also something called \"illegal mining.\" Imagine digging deep into the ground to find precious treasures like shiny gold or sparkly diamonds. That's mining! But sometimes, people dig in places where they are not allowed to. They don't follow the special rules for safe digging.\n\nThis is called \"illegal mining,\" and it can be very dangerous. It can hurt the land, pollute the water, and even put people working there in harm's way.\n\n<h3>Who is President Ramaphosa?</h3>\nSouth Africa has a very important leader. He is like the head of the whole country! His name is President Cyril Ramaphosa. He cares a lot about all the people in South Africa, especially children like you.\n\nDid you know? A President is like the main helper for a whole country. They make big decisions to keep everyone safe and make sure things run well! President Ramaphosa wants everyone to be safe and happy.\n\nPresident Ramaphosa has a big job to make sure the country is a good place to live. He wants to stop the bad things that crime gangs and illegal mining cause. He is always thinking about how to make life better for everyone.\n\n<h3>Our Brave Police and Army</h3>\nDo you know who helps keep us safe every day? Yes, our wonderful police officers! They wear special uniforms and drive cool cars. They help people follow the rules and stop bad things from happening.\n\nBut sometimes, when there are very big problems or a lot of bad guys, the police need extra help. That's where the \"army\" comes in! The army is a group of very brave men and women.\n\nThey are strong and trained to protect the country. The army usually protects the country from dangers from other countries. But sometimes, they also help inside the country when there's a really big problem.\n\n<h3>Working Together to Make Things Safe</h3>\nOur President, Cyril Ramaphosa, has made a very important announcement. He said that the army will come and help the police! They will work together as a super team, just like your favorite superheroes.\n\nTheir mission is to fight these crime gangs and stop illegal mining. This means that more strong, brave, and helpful people will be out there.\n\nDid you know? Working together is always stronger! When the police and the army join forces, they become a super-duper team, ready to solve big problems!\n\nThey will be working hard to make sure everyone is safe and sound. They want to stop the people who are doing bad things. They want to make sure that children can play safely and that families feel secure in their homes. This big plan is all about making South Africa even safer and happier.\n\n<h3>What is \"Organised Crime\"?</h3>\nWhen we say \"organised crime,\" it means groups of people who plan to do bad things together. It's not just one person doing something wrong, but a whole team of bad guys.\n\nImagine a group of bullies planning to cause trouble at the playground. That's a bit like it, but much bigger and more serious. The police and army want to stop these groups from planning and doing things that hurt people or break laws.\n\nThey want to make sure no one is afraid and everyone can live in peace. Stopping these groups helps make communities calm and friendly for everyone.\n\n<h3>What is \"Illegal Mining\"?</h3>\nLet's talk more about \"illegal mining.\" Imagine there's a big treasure underground, like sparkly diamonds or shiny gold. People want to dig for it!\n\nBut digging for these treasures needs special permission. It also needs to be done very carefully and safely so no one gets hurt. It protects the environment too.\n\nIllegal mining is when people dig for these treasures without permission. They might use dangerous ways that can hurt the land, pollute the water, or even hurt the workers. It's like digging in your friend's backyard without asking, and making a big, dangerous mess!\n\nDid you know? South Africa is famous for its gold and diamonds! Many beautiful pieces of jewelry come from there. But it's important to mine them safely and legally, to protect both people and our amazing planet.\n\nThe army and police want to stop this because it's dangerous, bad for the environment, and unfair to those who follow the rules.\n\n<h3>Why is This Important for Everyone?</h3>\nThis big plan by President Ramaphosa is very important. When crime goes down, everyone feels safer. When illegal mining stops, the land and water are protected. It means more good things for everyone.\n\nIt means kids like you can go to school and play outside without worry. It means families can live peacefully in their homes and neighborhoods. It means the country's treasures are taken care of in the right way, for all to enjoy.\n\nIt’s about building a brighter, safer, and happier future for South Africa, where everyone can grow up strong and healthy.\n\n<h3>How We All Help Keep Our Homes Safe</h3>\nEven though the police and army are doing a big job, we can all help too! How? By being kind to each other every day. By following the rules at home and at school.\n\nBy listening to your parents and teachers, you help keep your own little world safe and happy. When we all do our part to be good citizens, we make our communities stronger.\n\nDid you know? Every single person, even a small child, can make a positive difference by being kind, helpful, and following the rules! Your good actions make the world a better place.\n\nSo, this news is good news! It means that the grown-ups in charge are working very hard. They are making sure that South Africa stays a wonderful and safe place for everyone to grow up and live in.\n\n<h3>Amazing South Africa!</h3>\nSouth Africa is a truly amazing place! It has beautiful beaches, huge mountains, and incredible wildlife like lions, elephants, and giraffes! It's a land of many different cultures and languages, all living together in harmony.\n\nThis effort to keep the country safe helps protect all that beauty and goodness. It ensures that future generations, like you, can enjoy all the wonderful things South Africa has to offer.\n\nSo let’s cheer for President Ramaphosa, the police, and the army! They are working hard to be our safety superheroes!\n\nDid you know? South Africa has 11 official languages! That's a lot of ways to say \"hello\"! It shows how many wonderful different people live there.\n\nAnd that's the news from sunny Africa today! Stay safe, be kind, and keep shining bright!",
    "summary": "The President of South Africa is sending the army to help the police stop crime gangs and illegal digging, to keep everyone safe and happy.",
    "whyMatters": "This is important because it means adults are working hard to stop bad things from happening, making sure children and families in South Africa can live safely and peacefully.",
    "category": "politics",
    "date": "2026-02-13T18:40:52.848Z",
    "image": "https://image.pollinations.ai/prompt/Super%20Heroes%20for%20Safety!%20South%20Africa's%20Plan%20to%20Keep%20Everyone%20Safe%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "super-heroes-for-safety-south-africas-plan-to-keep-everyone-safe",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:40:57.983Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mass burial for dozens of Palestinians who couldn’t be identified",
    "title": "Mass burial for dozens of Palestinians who couldn’t be identified",
    "content": "Health officials have buried the bodies of 53 unidentified Palestinians and dozens of organs and remains.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:03.215Z",
    "image": "https://image.pollinations.ai/prompt/Mass%20burial%20for%20dozens%20of%20Palestinians%20who%20couldn%E2%80%99t%20be%20identified%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mass-burial-for-dozens-of-palestinians-who-couldnt-be-identified",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/13/mass-burial-for-dozens-of-palestinians-who-couldnt-be-identified?traffic_source=rss"
  },
  {
    "originalTitle": "Ukraine’s Heraskevych has appeal for Winter Olympic reinstatement dismissed",
    "title": "A Big Rule at the Winter Games: What Happened to Vladyslav's Helmet?",
    "content": "<h3>Hello, Super Sports Fans!</h3>\nHi everyone! It's your kid-friendly news reporter here, bringing you exciting stories from around the world. Today, we have a story about a brave athlete and some very important rules in sports. We're going to talk about the Winter Olympics! These are big games where athletes compete in sports on ice and snow. Imagine sliding very fast!\n\n<h3>Meet Vladyslav from Ukraine!</h3>\nOur story is about a young man named Vladyslav Heraskevych. He comes from a country far away called Ukraine. Ukraine is in Europe, a continent far from Africa. Vladyslav is a super strong and fast athlete. He loves a sport called bobsleigh. It's a very thrilling sport!\n\n**Did you know?** Ukraine has many beautiful sunflower fields! Sunflowers can grow taller than you!\n\n<h3>What is Bobsleigh?</h3>\nImagine getting into a super-fast sled. This sled is called a bobsleigh! Athletes, sometimes one, two, or even four people, jump into this special sled. They then zoom down a very twisty, icy track at super-high speeds. It's like a rollercoaster on ice! They need to be very brave and work together as a team. Bobsleigh is one of the coolest (and coldest!) sports at the Winter Olympics.\n\n**Did you know?** Bobsleighs can go faster than a car on a highway, sometimes over 150 kilometers per hour! That's super speedy!\n\n<h3>Why Do Athletes Wear Helmets?</h3>\nWhen you ride a bicycle, what do you wear to keep your head safe? A helmet! Athletes like Vladyslav wear helmets too, especially in fast sports like bobsleigh. These helmets are very strong. They protect the athletes' heads from bumps and falls. Safety is always number one in sports! Helmets can also look really cool, with bright colors and designs.\n\n<h3>The Big Olympic Rules!</h3>\nThe Olympics are super special. They bring people from all over the world together. Athletes from different countries come to play sports, make friends, and show their best skills. To keep everything fair and friendly, the Olympics have very important rules. These rules are like the rules you have in your games at school. One of the biggest rules is that the Olympics are only about sports. They are not about politics or showing messages about countries fighting. This is called a \"sacred principle.\" It means it's a very, very important idea.\n\n**Did you know?** The first Olympic Games happened a very, very long time ago in Greece! That's many, many years before your grandparents were born!\n\n<h3>What Happened with Vladyslav's Helmet?</h3>\nWell, Vladyslav was competing in his bobsleigh race. He had his helmet on, just like all the other athletes. But on his helmet, he had put some pictures. These pictures were a message. The message was about peace in his country, Ukraine. While peace is a wonderful thing, the Olympic rules say no messages or pictures about politics on your uniform or equipment. The Olympics want all athletes to just focus on sports and friendship, not on country problems. So, because of the pictures on his helmet, he broke this big rule.\n\n<h3>What Does \"Appeal Dismissed\" Mean?</h3>\nWhen Vladyslav broke the rule, the people who run the Olympics had to make a decision. They said the pictures on his helmet were not allowed. Vladyslav felt sad and wanted to explain. So, he asked them to look at the decision again. This is called an \"appeal.\" It's like asking your teacher to please re-think a decision. But after listening to him, the Olympic officials said, \"No, the rule is very clear.\" So, his \"appeal was dismissed.\" This means his request to change the decision was not accepted. The original decision stayed the same. It can be hard when a decision doesn't go your way, but rules are rules.\n\n**Did you know?** There are special judges at the Olympics whose job it is to make sure everyone follows the rules perfectly!\n\n<h3>Why Are Rules So Important?</h3>\nRules help us play fair. Imagine playing football or netball without any rules. It would be very messy, wouldn't it? Rules make sure everyone has a fair chance. They help us respect each other and keep the game fun for everyone. The Olympic rules are there to make sure that the games are only about sports and friendship, and not about anything else. It helps all the athletes focus on their amazing skills and making new friends. It creates a space where everyone feels equal and just enjoys the sport.\n\n<h3>Playing Fair, Always!</h3>\nSo, even though Vladyslav is a great athlete and wanted to share an important message, he learned a valuable lesson about following rules. Rules are there to protect the spirit of the games and make sure everyone plays fair. It reminds us all that when we play, whether it's bobsleigh or soccer, we must always respect the rules. That's how we show good sportsmanship and make sports fun for everyone! Keep cheering for your favorite athletes and remember, playing fair is the best way to win!",
    "summary": "Vladyslav Heraskevych, a bobsleigh athlete from Ukraine, had his request to be allowed back into the Winter Olympics turned down because pictures on his helmet broke a very important Olympic rule about keeping sports separate from messages about countries' problems.",
    "whyMatters": "This story shows us that even great athletes must follow all the rules in big sports games like the Olympics, because rules help everyone play fair and keep the games only about sports and friendship, not about problems between countries.",
    "category": "world",
    "date": "2026-02-13T18:41:23.635Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Rule%20at%20the%20Winter%20Games%3A%20What%20Happened%20to%20Vladyslav's%20Helmet%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-rule-at-the-winter-games-what-happened-to-vladyslavs-helmet",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/13/ukraines-heraskevych-has-appeal-for-reinstatement-dismissed-by-sport-court?traffic_source=rss"
  },
  {
    "originalTitle": "Real Madrid vs Real Sociedad: La Liga – teams, start time, lineups",
    "title": "Real Madrid vs Real Sociedad: La Liga – teams, start time, lineups",
    "content": "Real Madrid have the chance to move to the top of La Liga, and silence their own fans, when Sociedad visit Bernabeu.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:28.788Z",
    "image": "https://image.pollinations.ai/prompt/Real%20Madrid%20vs%20Real%20Sociedad%3A%20La%20Liga%20%E2%80%93%20teams%2C%20start%20time%2C%20lineups%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "real-madrid-vs-real-sociedad-la-liga-teams-start-time-lineups",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/13/real-madrid-vs-real-sociedad-la-liga-teams-start-time-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:34.338Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bangladesh Nationalist Party sweeps to victory in first election since Gen Z uprising",
    "title": "Bangladesh Nationalist Party sweeps to victory in first election since Gen Z uprising",
    "content": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:39.476Z",
    "image": "https://image.pollinations.ai/prompt/Bangladesh%20Nationalist%20Party%20sweeps%20to%20victory%20in%20first%20election%20since%20Gen%20Z%20uprising%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladesh-nationalist-party-sweeps-to-victory-in-first-election-since-gen-z-uprising",
    "originalLink": "https://www.bbc.com/news/articles/cgrzwn4yg7jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six possible effects of Trump's climate policy change ",
    "title": "Six possible effects of Trump's climate policy change ",
    "content": "The announcement on Thursday removes the legal bedrock for much of US environmental legislation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:44.620Z",
    "image": "https://image.pollinations.ai/prompt/Six%20possible%20effects%20of%20Trump's%20climate%20policy%20change%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-possible-effects-of-trumps-climate-policy-change",
    "originalLink": "https://www.bbc.com/news/articles/cd03ee39945o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tudor agrees deal to become Spurs' interim boss",
    "title": "Tudor agrees deal to become Spurs' interim boss",
    "content": "Igor Tudor agrees a deal to become Tottenham interim head coach until the end of the season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:50.165Z",
    "image": "https://image.pollinations.ai/prompt/Tudor%20agrees%20deal%20to%20become%20Spurs'%20interim%20boss%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tudor-agrees-deal-to-become-spurs-interim-boss",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg87wlv7lmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pereira signs deal as Forest boss until end of next season",
    "title": "Pereira signs deal as Forest boss until end of next season",
    "content": "Vitor Pereira has signed a deal until the end of next season to become Nottingham Forest's fourth manager of the campaign.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T18:41:55.302Z",
    "image": "https://image.pollinations.ai/prompt/Pereira%20signs%20deal%20as%20Forest%20boss%20until%20end%20of%20next%20season%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pereira-signs-deal-as-forest-boss-until-end-of-next-season",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9wnrqwzrneo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City's Rodri charged over 'not fair' referee comments",
    "title": "Man City's Rodri charged over 'not fair' referee comments",
    "content": "Manchester City midfielder Rodri is charged with misconduct by the Football Association following comments he made about referees following his side's 2-2 draw with Tottenham earlier this month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-13T18:42:00.439Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City's%20Rodri%20charged%20over%20'not%20fair'%20referee%20comments%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-citys-rodri-charged-over-not-fair-referee-comments",
    "originalLink": "https://www.bbc.com/sport/football/articles/c2lrdj55zypo?at_medium=RSS&at_campaign=rss"
  }
]