[
  {
    "originalTitle": "Nigeria remembers master wood carver",
    "title": "Remembering a Super Wood Artist from Nigeria!",
    "content": "Hello there, awesome kids! Your friendly news reporter from Africa is here! Today, we have a special story about a wonderful man from Nigeria.\n\n<h3>Meet Mr. Kasali Akangbe Ogun</h3>\nImagine someone who can take a plain piece of wood and turn it into something amazing! That's what Mr. Kasali Akangbe Ogun did. He was a very, very talented artist, but instead of using paints or crayons, he used wood! Sadly, Mr. Kasali is no longer with us. He was a little bit sick for a short time, and now he has passed away. But guess what? People all over Nigeria and beyond are remembering his incredible work and the special things he taught us.\n\n<h3>What is Wood Carving?</h3>\nHave you ever seen a beautiful statue made of wood? Or perhaps a special mask? That's wood carving! It's like magic. A wood carver uses special tools to cut, shape, and smooth wood into wonderful forms. They can make animals, people, bowls, or even tell stories through their wooden art. It takes a lot of time, patience, and practice to become good at it. It's a very old art, and people in Africa have been carving wood for many, many years, even before your grandparents were born!\n\nDid you know? Wood carving is an ancient art form that has been part of African culture for thousands of years! People used to carve things like tools, furniture, and beautiful decorations.\n\n<h3>A Master of His Craft</h3>\nMr. Kasali wasn't just any wood carver; he was a *master* carver. This means he was one of the very best! His hands knew just what to do with the wood. He could see the beautiful art hidden inside a log and bring it to life. He made things that were not just pretty, but also very important to his community and culture. His carvings were special because they often showed characters from old stories or represented important ideas.\n\nMr. Kasali learned this amazing skill from his family. Can you imagine? His father was a carver, and his grandfather was a carver, and even his great-grandfather was a carver! It was like a special family tradition passed down from one generation to the next. He grew up watching and learning, and then he became a master himself.\n\nDid you know? When a skill is passed down through a family for many generations, it's called a family legacy! It's like a special gift from older family members to younger ones.\n\n<h3>Keeping Old Traditions Alive</h3>\nMr. Kasali loved something very important called 'local traditions'. What are traditions? They are special ways of doing things that people in a specific place or country have done for a very long time. It could be special dances, special songs, special food, or special art forms like wood carving.\n\nMr. Kasali believed it was super important to keep these old traditions alive. He didn't want them to be forgotten. He wanted new generations, like you, to know about the amazing history and culture of Nigeria. So, he didn't just carve wood; he also taught others. He shared his knowledge and his passion with younger people, making sure that this beautiful art would continue for many more years.\n\nDid you know? Many traditional African artworks, including wood carvings, are not just for decoration. They often have deep meanings, tell stories about history, or are used in ceremonies to celebrate important events!\n\n<h3>Remembering a Hero</h3>\nNow that Mr. Kasali has been laid to rest, it means we say goodbye to him. But his spirit and his beautiful art will live on forever. Every time someone sees one of his amazing wood carvings, they will remember him. They will remember the man who loved his culture so much that he spent his life making sure its stories and its art were preserved.\n\nHe was a hero in his own way because he helped keep a very special part of Nigeria's culture from fading away. He showed us that our history is important, our art is beautiful, and our traditions connect us to who we are.\n\nDid you know? In many African cultures, art like wood carving can be used to honor ancestors or important community figures, much like we remember Mr. Kasali today!\n\n<h3>His Wonderful Gift to Us</h3>\nMr. Kasali Akangbe Ogun has left us with a wonderful gift. It's not just the countless beautiful carvings he made with his own hands. It's the important lesson that our old ways, our traditions, are precious treasures. It's the inspiration to learn from our elders and to share our own talents with others. And it's the simple joy of creating something beautiful from nature.\n\nLet's all remember Mr. Kasali, the super wood artist from Nigeria, who taught us that old traditions are not just old, they are incredibly cool and important! Thank you, Mr. Kasali, for your magic hands and your big heart!\n",
    "summary": "Mr. Kasali Akangbe Ogun, a super talented wood carver from Nigeria, has passed away, and we are remembering him for his beautiful art and for keeping old family traditions alive.",
    "whyMatters": "It's important to remember people like Mr. Kasali because they help us learn about our history, keep special family traditions like art from being forgotten, and inspire us to create wonderful things.",
    "category": "world",
    "date": "2026-01-20T01:18:22.335Z",
    "image": "https://image.pollinations.ai/prompt/Remembering%20a%20Super%20Wood%20Artist%20from%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "remembering-a-super-wood-artist-from-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cgqelez1kwwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 160 churchgoers kidnapped in twin Nigeria attacks - clergy",
    "title": "Sad News from Nigeria: People Taken from Churches",
    "content": "<h3>Hello from Your Africa News Reporter!</h3>\nHi everyone! I'm your friendly news reporter for Africa. Today, I have some news from a country called Nigeria. It's important to talk about what's happening so we can understand and help. Sometimes, sad things happen, but we also learn about people helping each other. Let's learn about a recent event together.\n\n<h3>What Happened? The Sad News</h3>\nA few days ago, on a Sunday, something sad happened in Nigeria. Many grown-ups were at two churches. Churches are special places where people go to pray and sing. While they were praying, some bad groups of people came into the churches. These bad people, sometimes called \"gangs,\" took many of the churchgoers away. More than 160 people were taken. This made many families very worried and sad.\n\nDid you know? In Nigeria, Sunday is often a day for families to go to church and spend time together!\n\n<h3>Where in Africa? Nigeria and Kaduna</h3>\nThis sad event happened in a country called Nigeria. Nigeria is a very big and beautiful country in Africa. Africa is our amazing continent, full of diverse cultures and lovely people. The place where the churches are is called Kurmin Wali. It is a town in a part of Nigeria called Kaduna State. Imagine your country has different parts; Kaduna State is like one of those parts in Nigeria.\n\nDid you know? Nigeria is the country with the most people in all of Africa! It has so many amazing languages and cultures.\n\n<h3>Who Are Churchgoers? People Who Pray</h3>\nSo, who are \"churchgoers\"? They are simply people who like to go to church. They go there to pray to God, to sing songs, and to be with their friends and family. Churches are often places where people feel safe and happy. The people who were taken were just going about their normal Sunday, spending time in their special place.\n\nDid you know? People all over the world go to churches, mosques, temples, and other special places to pray and feel close to God.\n\n<h3>Understanding \"Kidnapped\"</h3>\nWhen we say \"kidnapped,\" it means that people were taken away by force. The bad people didn't ask permission from the churchgoers or their families. They just took them. This is very wrong and scary for everyone. It makes people feel unsafe. Imagine someone taking you away from your parents without their permission – that's what kidnapping is like, but for grown-ups.\n\nDid you know? It is against the law to take someone without their permission. Good people and leaders always work to make sure everyone is safe and free.\n\n<h3>Who Did This? Bad Gangs</h3>\nThe police say that \"armed gangs\" did this. What are \"armed gangs\"? They are groups of people who do bad things. \"Armed\" means they might have weapons, which can make people feel scared. These groups sometimes try to get money or cause trouble. Taking people is a very wrong and unkind thing to do. The good news is that many people are working to stop these gangs.\n\nDid you know? Most people in Nigeria, just like everywhere else, are kind, good, and want to live in peace. Only a very small number of people do bad things like this.\n\n<h3>What Are People Doing Now? Finding Help</h3>\nRight now, many people are working very hard to find the churchgoers. The police are searching, and leaders in Nigeria are trying their best to bring everyone home safely. Families and friends are praying for them. It shows how strong communities are when people come together to help each other during hard times. Everyone hopes the people come back very soon.\n\nDid you know? When a community works together, like when people help each other find lost things or fix things, they are much stronger!\n\n<h3>Why is Safety Important?</h3>\nThis news might sound a bit scary, but it's important to remember that many people are working to keep everyone safe. Your parents, teachers, and community leaders always try to protect you. It's important for everyone to feel safe in their homes and communities. When something like this happens, it reminds us to always be aware and to listen to the grown-ups who look after us.\n\nDid you know? Many police officers and good people in Nigeria work every day to help keep children and families safe from harm.\n\n<h3>Working Together for Good</h3>\nThis event is a reminder that we all need to work together. People in Nigeria and all over Africa want peace and safety for everyone. When bad things happen, it's important not to be too scared, but to know that good people are always trying to make things better. We can all help by being kind to each other and by supporting our communities.\n\nDid you know? Africa is known for its strong sense of community, where people often help their neighbours and work together for the good of everyone.\n\n<h3>A Message of Hope for Everyone</h3>\nEven when sad news comes, we must always have hope. People are trying their best to fix things. We hope that all the churchgoers will be back home with their families very soon. Let's send our kind thoughts to everyone in Nigeria. We believe that with teamwork and kindness, we can build a safer and happier Africa for all children, always.",
    "summary": "Some bad people took many churchgoers from two churches in Nigeria, and now many people are working hard to bring them home safely.",
    "whyMatters": "It's important because everyone deserves to feel safe and happy in their community, and we need to understand how communities work together to help each other when bad things happen.",
    "category": "world",
    "date": "2026-01-20T01:18:45.117Z",
    "image": "https://image.pollinations.ai/prompt/Sad%20News%20from%20Nigeria%3A%20People%20Taken%20from%20Churches%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sad-news-from-nigeria-people-taken-from-churches",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "title": "Drums, chants and celebrations as Ethiopians mark the baptism of Jesus",
    "content": "The Ethiopian Orthodox festival of Timket, or Epiphany, commemorates the baptism of Jesus in the Jordan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:18:50.276Z",
    "image": "https://image.pollinations.ai/prompt/Drums%2C%20chants%20and%20celebrations%20as%20Ethiopians%20mark%20the%20baptism%20of%20Jesus%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "drums-chants-and-celebrations-as-ethiopians-mark-the-baptism-of-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cr4k3p6x1q5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Norway PM: Trump ‘preoccupied’ with Nobel Peace Prize on Greenland texts",
    "title": "Norway PM: Trump ‘preoccupied’ with Nobel Peace Prize on Greenland texts",
    "content": "Norway PM Jonas Gahr Store rebuked Donald Trump after after text exchange involving Greenland and the Nobel Peace Prize.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:18:55.673Z",
    "image": "https://image.pollinations.ai/prompt/Norway%20PM%3A%20Trump%20%E2%80%98preoccupied%E2%80%99%20with%20Nobel%20Peace%20Prize%20on%20Greenland%20texts%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "norway-pm-trump-preoccupied-with-nobel-peace-prize-on-greenland-texts",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/19/norway-pm-trump-preoccupied-with-nobel-peace-prize-on-greenland-texts?traffic_source=rss"
  },
  {
    "originalTitle": "Trump’s Gaza ‘Board of Peace’ draws scepticism",
    "title": "Trump’s Gaza ‘Board of Peace’ draws scepticism",
    "content": "US President Donald Trump has unveiled a proposed “Board of Peace” aimed at rebuilding Gaza.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:19:00.812Z",
    "image": "https://image.pollinations.ai/prompt/Trump%E2%80%99s%20Gaza%20%E2%80%98Board%20of%20Peace%E2%80%99%20draws%20scepticism%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-gaza-board-of-peace-draws-scepticism",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/19/trumps-gaza-board-of-peace-draws-scepticism?traffic_source=rss"
  },
  {
    "originalTitle": "US Fed Chair Powell to attend Supreme Court session on Cook case: Report",
    "title": "US Fed Chair Powell to attend Supreme Court session on Cook case: Report",
    "content": "Powell appears to be casting off last year’s more subdued response to Trump’s repeated attacks on the Fed, AP reported.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-20T01:19:05.942Z",
    "image": "https://image.pollinations.ai/prompt/US%20Fed%20Chair%20Powell%20to%20attend%20Supreme%20Court%20session%20on%20Cook%20case%3A%20Report%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-fed-chair-powell-to-attend-supreme-court-session-on-cook-case-report",
    "originalLink": "https://www.aljazeera.com/economy/2026/1/19/us-fed-chair-powell-to-attend-supreme-court-session-on-cook-case-report?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "content": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:19:11.395Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20he%20will%20'100%25'%20carry%20out%20Greenland%20tariffs%20threat%2C%20as%20EU%20vows%20to%20protect%20its%20interests%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-he-will-100percent-carry-out-greenland-tariffs-threat-as-eu-vows-to-protect-its-interests",
    "originalLink": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Europe is at a total loss': Russia gloats over Greenland tensions",
    "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
    "content": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-20T01:19:16.537Z",
    "image": "https://image.pollinations.ai/prompt/'Europe%20is%20at%20a%20total%20loss'%3A%20Russia%20gloats%20over%20Greenland%20tensions%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "europe-is-at-a-total-loss-russia-gloats-over-greenland-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Italian fashion designer Valentino dies aged 93",
    "title": "Italian fashion designer Valentino dies aged 93",
    "content": "One of the giants of 20th century fashion, his creations were worn by celebrities including Elizabeth Taylor, Julia Roberts and Gwyneth Paltrow.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:19:21.692Z",
    "image": "https://image.pollinations.ai/prompt/Italian%20fashion%20designer%20Valentino%20dies%20aged%2093%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "italian-fashion-designer-valentino-dies-aged-93",
    "originalLink": "https://www.bbc.com/news/articles/cdx4rpxxvg7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "title": "Saved by 'special talent' - but did penalty award wrong Brighton?",
    "content": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:19:27.202Z",
    "image": "https://image.pollinations.ai/prompt/Saved%20by%20'special%20talent'%20-%20but%20did%20penalty%20award%20wrong%20Brighton%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "saved-by-special-talent-but-did-penalty-award-wrong-brighton",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Under-pressure Frank 'feeling trust' of Spurs board",
    "title": "Under-pressure Frank 'feeling trust' of Spurs board",
    "content": "Tottenham head coach Thomas Frank says lunch with board members is an \"extremely good sign\" despite pressure mounting on him during an underwhelming season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T01:19:32.331Z",
    "image": "https://image.pollinations.ai/prompt/Under-pressure%20Frank%20'feeling%20trust'%20of%20Spurs%20board%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "under-pressure-frank-feeling-trust-of-spurs-board",
    "originalLink": "https://www.bbc.com/sport/football/articles/czjgp2x072po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City sign Guehi from Palace - what will he bring?",
    "title": "Man City sign Guehi from Palace - what will he bring?",
    "content": "Man City sign Crystal Palace captain Marc Guehi for £20m - but what will the England defender add to Pep Guardiola's side?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-20T01:19:37.475Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City%20sign%20Guehi%20from%20Palace%20-%20what%20will%20he%20bring%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-city-sign-guehi-from-palace-what-will-he-bring",
    "originalLink": "https://www.bbc.com/sport/articles/cwy8lve847eo?at_medium=RSS&at_campaign=rss"
  }
]