[
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Treasures Can Now Be Shared!",
    "content": "Hello, my amazing friends in Africa! I'm your friendly news reporter, ready to tell you an exciting story. It's about a very, very special person from our home, Africa. His name is Nelson Mandela.\n\n<h3>Who Was Nelson Mandela?</h3>\nNelson Mandela was a superhero for peace! He lived in South Africa. He helped to make everyone in his country free and equal. No matter their skin colour. He wanted everyone to be friends and live happily together. He is known all over the world as a champion of freedom.\n\nHe taught us to be kind and fair. He showed us that even if things are hard, we should never give up. He is truly a hero for Africa and the whole world!\n\nDid you know? Nelson Mandela's full name was Rolihlahla Nelson Mandela! That's a long and important name for a very important person.\n\n<h3>Special Things From a Special Man</h3>\nImagine having a key that opened a very important door. Or sunglasses that a hero wore. Or a shirt from a brave leader. Well, Nelson Mandela had all these things! They are very special to many people.\n\nWe are talking about the key to his prison cell. This is where he was kept for a very long time. Also, a pair of cool sunglasses he wore. And a shirt that belonged to him. These are not just any old things. They are treasures that tell a story.\n\n<h3>A Little Problem, Now Solved!</h3>\nFor a little while, there was a small problem. Some people thought these special things should stay only in South Africa. They said these items were part of the country's \"heritage.\"\n\nHeritage means things that are very old and important to a country's history. Like old buildings, songs, or stories. Or even things that belonged to heroes like Mandela! They wanted to keep them in South Africa for everyone to see.\n\nBut Nelson Mandela's daughter, Zenani Mandela-Dlamini, wanted to share them. She wanted them to travel to other places. So more people around the world could learn about her amazing father.\n\n<h3>A Court Decision!</h3>\nSo, what happened? They went to a \"court.\" A court is a place where people talk about problems and a special judge helps decide what is fair. It's like when you and your friend have a disagreement, and an adult helps you solve it.\n\nThe judge listened to everyone. And guess what? The judge said \"Yes!\" Nelson Mandela's daughter can now let these special items travel. This means people from far away can also see them and learn about Mandela.\n\nDid you know? Nelson Mandela spent 27 long years in prison! That's a very, very long time. He was very brave.\n\n<h3>Why Are These Things So Special?</h3>\nThe key is super special because it unlocks the door to his prison cell on Robben Island. Robben Island was an island near South Africa where he was kept. It reminds us of his bravery and how he never gave up. Even when he was locked away.\n\nHis sunglasses show us the cool and calm person he was. And his shirt? It's just a reminder of him, a simple man who did extraordinary things. These items help us remember his amazing journey and how he changed the world.\n\n<h3>What Is \"Heritage\" Anyway?</h3>\nLet's talk more about \"heritage.\" Imagine your grandma's special necklace. Or an old family photo. These things are part of *your* family's heritage. They tell your story.\n\nA country's heritage is the same! It's all the special things that make up its past. And help us understand who we are today. Things like old drawings, special dances, or brave leaders' belongings. Like Nelson Mandela's key!\n\nDid you know? Nelson Mandela became the first black president of South Africa in 1994! He was 75 years old! What an amazing achievement.\n\n<h3>Where Will They Go Now?</h3>\nNow that they can travel, these items might go to an \"auction.\" An auction is like a special sale. People who really want the items will offer money for them. The person who offers the most money gets them!\n\nThe money from selling these items will help share Nelson Mandela's story even more. It can help build special exhibits. Or make museums so more children and adults can learn about his life.\n\nThis way, his message of peace and fairness will reach even more ears and hearts. It's a wonderful way to keep his memory alive and strong.\n\n<h3>More About Nelson Mandela's Big Heart</h3>\nNelson Mandela believed that everyone should be treated fairly. He wanted a \"rainbow nation\" in South Africa. This means people of all different colours and backgrounds living together in peace and happiness. Just like the many colours in a rainbow!\n\nHe won the Nobel Peace Prize because of all his hard work for peace. This is a very important award given to people who do amazing things for peace in the world.\n\n<h3>What Can We Learn?</h3>\nSo, what does this all mean for us, the children of Africa? It means we can learn from Nelson Mandela. We can learn to be brave. We can learn to be kind to everyone, no matter how different they seem.\n\nWe can learn to speak up when something isn't fair. And we can learn to never, ever give up on our dreams. Just like Mandela never gave up on his dream of a free South Africa.\n\nThese items are more than just a key, sunglasses, or a shirt. They are symbols of hope, courage, and a love for justice that still inspires us today. And now, they can inspire even more people around the world!",
    "summary": "Nelson Mandela's daughter can now sell his special prison key, sunglasses, and shirt, so more people around the world can learn about his inspiring story of courage and peace.",
    "whyMatters": "This is important because these special things help us remember Nelson Mandela, a big hero from Africa who taught us all about being fair and kind. Now, his story and lessons can travel and teach even more children and adults across the globe!",
    "category": "world",
    "date": "2026-01-23T16:24:44.938Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Treasures%20Can%20Now%20Be%20Shared!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-treasures-can-now-be-shared",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "title": "South Sudan army chief gives soldiers seven days to crush rebellion",
    "content": "Reinforcements are sent to the town of Bor, a strategic staging post on the way to the capital, Juba.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:24:50.127Z",
    "image": "https://image.pollinations.ai/prompt/South%20Sudan%20army%20chief%20gives%20soldiers%20seven%20days%20to%20crush%20rebellion%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-sudan-army-chief-gives-soldiers-seven-days-to-crush-rebellion",
    "originalLink": "https://www.bbc.com/news/articles/cj0nn0dvg6jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Blood was all over' - victim of Nigeria church abduction describes escape",
    "title": "'Blood was all over' - victim of Nigeria church abduction describes escape",
    "content": "Some 160 people are believed to be missing after attackers raided three churches in a Nigerian village on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:24:55.271Z",
    "image": "https://image.pollinations.ai/prompt/'Blood%20was%20all%20over'%20-%20victim%20of%20Nigeria%20church%20abduction%20describes%20escape%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "blood-was-all-over-victim-of-nigeria-church-abduction-describes-escape",
    "originalLink": "https://www.bbc.com/news/articles/cn422q1py95o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Why Qatar is betting on diplomacy with Iran",
    "title": "Why Qatar is betting on diplomacy with Iran",
    "content": "For Gulf states exposed to the costs of war, diplomacy is not idealism but strategic risk management.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:00.481Z",
    "image": "https://image.pollinations.ai/prompt/Why%20Qatar%20is%20betting%20on%20diplomacy%20with%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "why-qatar-is-betting-on-diplomacy-with-iran",
    "originalLink": "https://www.aljazeera.com/opinions/2026/1/23/why-qatar-is-betting-on-diplomacy-with-iran?traffic_source=rss"
  },
  {
    "originalTitle": "After the US attack on Venezuela, will Cuba’s economy survive?",
    "title": "A Big Story About Friends, Oil, and Islands!",
    "content": "Hello, hello, super explorers! It's your friendly African news reporter here, ready to tell you a very interesting story from far, far away. Today, we're going to talk about some countries, a special liquid called oil, and how they all connect, just like friends playing together.\n\n<h3>Meet Cuba, Our Island Friend!</h3>\nImagine a beautiful island far away, with sunny beaches, lots of music, and happy people. That island is called Cuba! It's in the big ocean, surrounded by sparkling blue water. People in Cuba love to dance, play, and learn, just like you! It's a country, a bit like your own country, but it's an island.\n\nDid you know? Cuba is famous for its old, colourful cars! They look like cars from a very long time ago, and they are still used today!\n\nCuba needs many things to keep its people happy and its country running. One very important thing it needs is oil. Think of oil like the special food that cars, buses, and big machines eat to move. It also helps make electricity so your lights can turn on and your phones can charge.\n\n<h3>Hello Venezuela, the Oil Country!</h3>\nNow, let's fly over to another country called Venezuela. Venezuela is also far away, but it's on a big piece of land, not an island. Venezuela has a lot of something very special hidden deep underground: oil! It's like finding a giant treasure chest filled with this important liquid.\n\nVenezuela has so much oil that it shares some with other countries, like its friend Cuba. It sends big ships, almost like floating towns, filled with oil across the ocean to Cuba. This oil helps Cuba have power, run its vehicles, and keep everything working smoothly.\n\nDid you know? Venezuela has the highest waterfall in the world, called Angel Falls! It's super tall and amazing, like a giant water slide from the sky!\n\nFor a long time, Venezuela has been sending oil to Cuba. It's like sharing your lunch with a friend who forgot theirs. This sharing helps Cuba keep its lights on, its buses running, and its factories making things.\n\n<h3>What's This About \"Oil Trouble\"?</h3>\nNow, here's where our story gets a little bit tricky. There was once a big leader in a country called America. His name was Donald Trump. He was like the president or big chief of America. He said he wanted to stop the oil ships from Venezuela going to Cuba. It's like saying, \"No more sharing!\"\n\nWhy would someone want to stop this important oil? Well, sometimes countries have different ideas about how things should be done. When big leaders don't agree, they might try to make things harder for each other to get them to change their minds.\n\nStopping the oil is a way to put \"pressure\" on Cuba. Imagine someone making it harder for you to get your favourite snack until you do what they ask. It's a bit like that for countries.\n\n<h3>Why Is Oil So Important for Cuba?</h3>\nOil is super, super important for Cuba. If the oil stops coming, it means many things could get difficult. For example, buses might not have fuel to take children to school or people to work. Cars might not be able to drive.\n\nAlso, many homes and schools might have less electricity. Imagine if your lights went out, or you couldn't watch TV, or your fridge stopped working. That's what could happen if there isn't enough oil to make electricity.\n\nDid you know? Oil is made from tiny, tiny plants and animals that lived in the ocean millions and millions of years ago! They got buried deep underground and slowly turned into the oil we use today.\n\nFactories that make important things for people might also slow down or even stop. This could mean fewer toys, less food being made, or fewer clothes. It makes it very hard for the country to take care of its people and make sure everyone has what they need.\n\n<h3>How Does This Make Life Harder?</h3>\nWhen a country like Cuba has less oil, it affects what we call its \"economy.\" The economy is all about how a country makes money, how people get jobs, buy food, and live their lives. If there's no oil, it can make the economy very weak.\n\nPeople might find it harder to get food because shops can't get new supplies. It might be harder to travel to see family or go to the hospital. Things that seem simple, like turning on a light, become very precious.\n\nIt's like if your family's car runs out of petrol, and you can't get to the market for food or school. Life becomes much trickier. Countries try to have enough of everything, but sometimes, big problems happen between them.\n\n<h3>What Happens Next?</h3>\nWhen situations like this happen, countries usually try to talk to each other to find solutions. Cuba would try very hard to find oil from other countries or find new ways to make electricity, like using the sun or wind.\n\nDid you know? Many countries are now trying to use solar power (from the sun) and wind power (from the wind) to make electricity. These are called 'renewable' energy because they never run out, unlike oil!\n\nIt's like when you have a problem, you don't just give up! You think of new ideas and ask for help. The people of Cuba are strong and clever, and they will always look for ways to keep their island bright and happy.\n\n<h3>Let's Hope for Peace!</h3>\nSo, this is a story about how countries are connected, and how one thing, like oil, can be so important for people's lives. We always hope that countries can be good friends, share what they have, and solve their problems by talking, not by making things harder for each other. Because when countries are friends, everyone wins!\n",
    "summary": "A former big leader from America wanted to stop oil from Venezuela going to Cuba, which could make life tricky for the people in Cuba.",
    "whyMatters": "This story is important because it shows how countries help each other and what happens when that help might stop, affecting people's daily lives like getting food, having lights, and going to school.",
    "category": "business",
    "date": "2026-01-23T16:25:21.191Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Story%20About%20Friends%2C%20Oil%2C%20and%20Islands!%20realistic%20news%20photography%20context%20Business%20%26%20Finance%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-story-about-friends-oil-and-islands",
    "originalLink": "https://www.aljazeera.com/features/longform/2026/1/23/after-the-us-attack-on-venezuela-will-cubas-economy-survive?traffic_source=rss"
  },
  {
    "originalTitle": "Ice cloaks Lake Michigan ahead of US polar vortex",
    "title": "Ice cloaks Lake Michigan ahead of US polar vortex",
    "content": "Drone footage shows ice building along the shores of Lake Michigan ahead of a polar vortex sweeping across the US.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:26.518Z",
    "image": "https://image.pollinations.ai/prompt/Ice%20cloaks%20Lake%20Michigan%20ahead%20of%20US%20polar%20vortex%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ice-cloaks-lake-michigan-ahead-of-us-polar-vortex",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/23/ice-cloaks-lake-michigan-ahead-of-us-polar-vortex?traffic_source=rss"
  },
  {
    "originalTitle": "Trump's claim Nato troops avoided Afghanistan front line sparks outrage in UK",
    "title": "Trump's claim Nato troops avoided Afghanistan front line sparks outrage in UK",
    "content": "The US president says Nato troops stayed \"a little off the front lines\" - despite 457 UK military deaths in the conflict.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-23T16:25:32.062Z",
    "image": "https://image.pollinations.ai/prompt/Trump's%20claim%20Nato%20troops%20avoided%20Afghanistan%20front%20line%20sparks%20outrage%20in%20UK%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-claim-nato-troops-avoided-afghanistan-front-line-sparks-outrage-in-uk",
    "originalLink": "https://www.bbc.com/news/articles/czr444j671vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "High stakes but low expectations ahead of Ukraine talks with Russia and US",
    "title": "High stakes but low expectations ahead of Ukraine talks with Russia and US",
    "content": "Donald Trump is pushing hard for a peace deal - but major issues between Russia and Ukraine are still unresolved, writes Sarah Rainsford.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:37.384Z",
    "image": "https://image.pollinations.ai/prompt/High%20stakes%20but%20low%20expectations%20ahead%20of%20Ukraine%20talks%20with%20Russia%20and%20US%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "high-stakes-but-low-expectations-ahead-of-ukraine-talks-with-russia-and-us",
    "originalLink": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
    "title": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
    "content": "The BBC sees sites on former United Arab Emirates bases in Yemen where detainees say they were abused.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:42.515Z",
    "image": "https://image.pollinations.ai/prompt/'I%20didn't%20hear%20from%20my%20son%20for%20seven%20months'%3A%20Inside%20Yemen's%20UAE-run%20secret%20prisons%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-didnt-hear-from-my-son-for-seven-months-inside-yemens-uae-run-secret-prisons",
    "originalLink": "https://www.bbc.com/news/articles/c3r117w55q4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spurs open talks to sign Liverpool's Robertson",
    "title": "Spurs open talks to sign Liverpool's Robertson",
    "content": "Tottenham enter into talks with Liverpool as they look to secure a deal for left-back Andy Robertson.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:48.010Z",
    "image": "https://image.pollinations.ai/prompt/Spurs%20open%20talks%20to%20sign%20Liverpool's%20Robertson%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spurs-open-talks-to-sign-liverpools-robertson",
    "originalLink": "https://www.bbc.com/sport/football/articles/c79rr2440elo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'A big blow' - Grealish has stress fracture",
    "title": "'A big blow' - Grealish has stress fracture",
    "content": "There is no timescale on on-loan Everton winger Jack Grealish's recovery from a stress fracture in his foot, says manager David Moyes.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:53.160Z",
    "image": "https://image.pollinations.ai/prompt/'A%20big%20blow'%20-%20Grealish%20has%20stress%20fracture%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-blow-grealish-has-stress-fracture",
    "originalLink": "https://www.bbc.com/sport/football/articles/c20zzx6xw4vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rodman 'becomes highest-paid women's footballer'",
    "title": "Rodman 'becomes highest-paid women's footballer'",
    "content": "Trinity Rodman signs a new three-year deal with Washington Spirit that will reportedly make her the world's highest-paid female footballer.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-23T16:25:58.303Z",
    "image": "https://image.pollinations.ai/prompt/Rodman%20'becomes%20highest-paid%20women's%20footballer'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rodman-becomes-highest-paid-womens-footballer",
    "originalLink": "https://www.bbc.com/sport/articles/crkrr33yr34o?at_medium=RSS&at_campaign=rss"
  }
]