[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Brave Girls Go Back to School to Learn and Dream!",
    "content": "<h3>Hello, Amazing Friends!</h3>\nHello, amazing kids of Africa and everywhere! Your friendly news reporter is here to share an important story with you. Today, I want to tell you a very special story about two brave girls who love school more than anything. They show us how strong we can be, even when things are tough. Let's learn about their journey back to school, full of hope and big, bright dreams!\n\n<h3>Meet Our Brave Twin Sisters</h3>\nImagine having a best friend who is just like you! That's what these two sisters have. They are twins! They look alike and they love to do things together, just like many of you and your siblings or best friends. Their names are not told to us in the news, but let's call them \"Hope\" and \"Joy\" for now. They live in a beautiful part of Africa, and like many of you, they love going to school to learn new things every day.\n\n<h3>When Going to School Was Hard</h3>\nA little while ago, things were very difficult where Hope and Joy live. There was a lot of trouble, like big fights and loud noises in their town. Sometimes, when there is big trouble like that, it's not safe for anyone to go outside. So, the schools had to close their doors for a long, long time. Hope and Joy, and many other children, could not go to school every day like they used to. It made them and their families very, very sad.\n\n<h3>Brave Hearts, Big Dreams</h3>\nDuring that very sad time, something else also happened that made their hearts heavy. Parts of their school building got broken. And even worse, some of their friends, their classmates, got hurt very badly. Some friends are not there anymore, and everyone misses them so much. Losing friends is a terrible feeling that makes your heart ache. But even with sad hearts, these twin sisters have very, very strong minds. They want to finish school for their friends who cannot be there. Their hearts are full of courage and a promise to learn.\n\n<h3>The Joy of Learning Again!</h3>\nNow, the big trouble is less, and it's much safer in their town. The school doors are finally open again! Can you imagine the big smiles on Hope and Joy's faces? They can go back to their classrooms! They can see their teachers and maybe even make new friends. They can open their books again and learn wonderful new things. School is a place for learning, for laughing with friends, and for making happy memories. It is a happy place once more.\n\n<h3>School is a Superpower!</h3>\nWhy is going to school so, so important? Because school gives you a superpower! It gives you knowledge. With knowledge, you can do anything you dream of! You can read amazing adventure stories. You can learn about all the different animals and plants in Africa and around the world. You can count big numbers and draw beautiful pictures. Every single day at school helps your brain grow bigger and stronger. It helps you understand the world around you better.\n\n<h3>Did You Know? Amazing Facts!</h3>\nDid you know that going to school helps you make new friends from different places and backgrounds? You get to share your ideas and play fun games together, learning about each other!\nDid you know that when girls go to school and learn, it helps their whole family and their whole community become stronger and happier? Smart girls grow up to do amazing things and help everyone!\nDid you know that many schools in Africa are now using computers and tablets to help kids learn even more interesting things? Technology can make learning so exciting and fun!\nDid you know that some children walk very, very far every day, sometimes for hours, just to get to school? They do it because they love learning so much and want to achieve their dreams. That's true dedication and bravery!\n\n<h3>What Hope and Joy Want to Be</h3>\nHope and Joy are not just going to school for today. They are going to school for tomorrow and for their future! They have very big dreams. Maybe one will become a kind doctor to help people who are sick in their village. Maybe the other will become a wonderful teacher to help even more children learn to read and write. Or maybe they will invent something new that helps their country grow and become even better. Their friends who are not there anymore would be very, very proud of them, watching them learn and grow.\n\n<h3>Let's All Learn and Grow!</h3>\nSo, what can we all learn from Hope and Joy? We learn to be brave, even when things are scary. We learn to never give up on our dreams, no matter what happens. And we learn that school is a wonderful, precious gift. If you can go to school, make the most of it every single day! Learn as much as you can, play with your friends, and dream big, big dreams. Let's all work together to make sure every child in Africa has a chance to go to school and shine brightly, just like Hope and Joy!",
    "summary": "Brave twin sisters in Africa are going back to school after a time of trouble, determined to learn and achieve their dreams for themselves and their friends.",
    "whyMatters": "This is important because it shows us that learning is a superpower, and even after sad times, we can be brave, go to school, and build a brighter future for ourselves and for everyone.",
    "category": "world",
    "date": "2026-01-24T12:32:18.088Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Girls%20Go%20Back%20to%20School%20to%20Learn%20and%20Dream!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-girls-go-back-to-school-to-learn-and-dream",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Treasures Can Find New Homes!",
    "content": "Hello, my little friends across Africa! Your kid-friendly news reporter is here with a very exciting story about a super important person from our continent. Are you ready?\n\nToday, we're talking about special things that belonged to a real hero named Nelson Mandela. These items are like clues to his amazing life! And guess what? A court has said that his daughter can now sell some of them. Let's find out more!\n\n<h3>Meet Nelson Mandela!</h3>\n\nNelson Mandela was a very, very special leader from South Africa. He was a brave man who wanted everyone to be treated fairly, no matter their skin color. He believed that all people should live together in peace and kindness.\n\nHe fought against something called apartheid. This was a time when people were treated differently because of their skin color, which was very unfair. Nelson Mandela said this was wrong, and he worked hard to make things right.\n\nBecause he fought for what was fair, some people put him in prison for a very, very long time. Can you imagine being away from your family for so many years? But even in prison, he never gave up hope.\n\nWhen he came out of prison, everyone cheered! He became the first Black President of South Africa! He showed us that peace and forgiveness are stronger than hate. He is like a superhero for fairness and peace for all of Africa and the whole world.\n\nDid you know? Nelson Mandela spent 27 years in prison! That's longer than most of your parents have been alive! But he still came out smiling and ready to make the world a better place.\n\n<h3>Special Items from a Special Man</h3>\n\nNow, let's talk about the special things that belonged to him. Imagine holding something that a great hero touched! These items are:\n\n*   **His prison key**: This key opened the door to his prison cell. It's not just any key; it reminds us that even when he was locked away, his spirit was free. It tells a story of his courage and how he never gave up hope for a better future.\n\n*   **His sunglasses**: Everyone loves sunglasses on a sunny day! These were Nelson Mandela's. They are special because he wore them. They remind us of his bright smile and how he looked at the world, always seeing hope.\n\n*   **One of his shirts**: This was a shirt he wore. It’s not just a piece of cloth; it’s a piece of history. When you see it, you can almost imagine him wearing it, thinking about how he changed the world. It’s a very personal item that tells us about his everyday life.\n\nThese are not just old things. They are like pieces of a puzzle that tell the amazing story of Nelson Mandela's life and his fight for freedom and peace.\n\n<h3>Why Are These Things So Important?</h3>\n\nThese items are very, very important to South Africa and to all of us in Africa. The people who help run South Africa, called 'the authorities,' said these items are part of the country's 'heritage.'\n\nWhat is 'heritage'? It means special treasures from the past that help us remember important stories and lessons for the future. Think of it like your family's old photo album or a special toy your grandpa kept. These things tell your family's story.\n\nNelson Mandela's key, sunglasses, and shirt are like national treasures. They remind everyone in South Africa and across the world about his bravery, his long journey, and the amazing changes he brought about. They are part of what makes South Africa special.\n\n<h3>A Family's Wish</h3>\n\nNelson Mandela's daughter, named Makaziwe Mandela, wanted to sell these special items. She wants to use the money from selling them for good things. She wants to help make sure her father's story and lessons live on.\n\nMaybe the money will help build museums, or start projects that teach children about peace and fairness, just like her dad did. It's a way to keep his memory and his important work alive for many more years.\n\nDid you know? Nelson Mandela won the Nobel Peace Prize! This is a very special award given to people who work hard for peace in the world.\n\n<h3>A Big Talk in Court</h3>\n\nBecause these items are so important, the people who run South Africa did not want them to leave the country. They went to a place called a 'court.' A court is where people go when they can't agree on something, and a special person called a judge helps them decide.\n\nIt was like a big argument, but with talking and rules! The authorities said the items should stay in South Africa because they are part of its history. Nelson Mandela's daughter said she should be able to sell them.\n\nAfter listening to both sides, the judge made a decision. The judge said that Nelson Mandela's daughter *can* sell the key, the sunglasses, and the shirt! This means she won the 'court battle.'\n\nSo now, these items can be sent to other places if someone buys them.\n\n<h3>Where Will They Go?</h3>\n\nWhen something is sold and sent out of a country, it's called 'exporting' it. It means sending something from one country to another. Like sending oranges from Africa to kids in Europe!\n\nThese special items might be bought by a big museum far away, or by someone who wants to keep them safe and show them to others. Imagine if they go to a museum where children all over the world can see them and learn about Nelson Mandela!\n\nThis way, more people can hear his story and remember his fight for freedom and peace. It's a way to spread his important message even further.\n\n<h3>What Does This Mean for Us?</h3>\n\nThis news reminds us how important Nelson Mandela was, and still is, to Africa and the world. Even simple things like a key or a shirt can tell a huge story about bravery, fairness, and hope.\n\nAs kids in Africa, we can look up to Nelson Mandela. We can learn from him to be kind, to stand up for what is right, and to always work for peace. Let's remember his lessons every day!\n\nSo, whether these special items stay in South Africa or travel to another country, their message will always be the same: Nelson Mandela was a hero, and his story will live on forever! Thank you for listening, little friends! See you next time!",
    "summary": "A court has ruled that Nelson Mandela's daughter can sell his prison key, sunglasses, and shirt, even though authorities wanted them to stay in South Africa as national treasures.",
    "whyMatters": "This news is important because it shows how much people value things from our heroes like Nelson Mandela, and it helps us remember his amazing story of fighting for fairness and peace for everyone in Africa and the world.",
    "category": "world",
    "date": "2026-01-24T12:32:38.022Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Treasures%20Can%20Find%20New%20Homes!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-treasures-can-find-new-homes",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T12:32:43.189Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Electoral violence is on the horizon in Kenya",
    "title": "Electoral violence is on the horizon in Kenya",
    "content": "Conditions in Kenya are ripe for the weaponisation of violence in the presidential vote. It is up to Kenyans to stop it.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T12:32:48.564Z",
    "image": "https://image.pollinations.ai/prompt/Electoral%20violence%20is%20on%20the%20horizon%20in%20Kenya%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "electoral-violence-is-on-the-horizon-in-kenya",
    "originalLink": "https://www.aljazeera.com/opinions/2026/1/24/electoral-violence-is-on-the-horizon-in-kenya?traffic_source=rss"
  },
  {
    "originalTitle": "Suicide bombing at wedding in northwest Pakistan kills seven",
    "title": "Suicide bombing at wedding in northwest Pakistan kills seven",
    "content": "Attack comes as Pakistani military readies for its fight against armed groups in areas along border with Afghanistan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-24T12:32:53.740Z",
    "image": "https://image.pollinations.ai/prompt/Suicide%20bombing%20at%20wedding%20in%20northwest%20Pakistan%20kills%20seven%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suicide-bombing-at-wedding-in-northwest-pakistan-kills-seven",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/suicide-bombing-at-wedding-in-northwest-pakistan-kills-seven?traffic_source=rss"
  },
  {
    "originalTitle": "‘Change is inevitable’: What is next for Iran?",
    "title": "‘Change is inevitable’: What is next for Iran?",
    "content": "Without changes and a deal with US to lift sanctions, Iran could be set for further unrest, analysts say.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T12:32:58.909Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Change%20is%20inevitable%E2%80%99%3A%20What%20is%20next%20for%20Iran%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "change-is-inevitable-what-is-next-for-iran",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/change-is-inevitable-what-is-next-for-iran?traffic_source=rss"
  },
  {
    "originalTitle": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks",
    "title": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks",
    "content": "One person died and 23 were injured as trilateral discussions in Abu Dhabi were set to resume.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T12:33:04.860Z",
    "image": "https://image.pollinations.ai/prompt/Ukraine%20condemns%20'brutal'%20Russian%20strikes%20ahead%20of%20second%20day%20of%20peace%20talks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ukraine-condemns-brutal-russian-strikes-ahead-of-second-day-of-peace-talks",
    "originalLink": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
    "title": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
    "content": "The US will also offer “more limited” support to US allies, according to a new national defence strategy document.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T12:33:10.027Z",
    "image": "https://image.pollinations.ai/prompt/Pentagon%20to%20offer%20'more%20limited'%20support%20to%20US%20allies%20in%20defence%20strategy%20shift%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pentagon-to-offer-more-limited-support-to-us-allies-in-defence-strategy-shift",
    "originalLink": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "title": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "content": "The US president's comments have been condemned by international allies, including UK veterans and politicians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T12:33:15.200Z",
    "image": "https://image.pollinations.ai/prompt/Harry%20says%20sacrifices%20by%20Nato%20troops%20in%20Afghanistan%20deserve%20'respect'%20%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "harry-says-sacrifices-by-nato-troops-in-afghanistan-deserve-respect",
    "originalLink": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham, Bayern and a stand made of chairs - Palhinha's story",
    "title": "From Tiny Kicks to Big Dreams: Joao Palhinha's Story!",
    "content": "<h3>Hello, Super Strikers!</h3>\nHello, hello, my amazing friends! Welcome to our super fun news show, right here from sunny Africa! I'm your friendly reporter, and today we have a fantastic story for you about a very special football player. His name is Joao Palhinha! Can you say Pal-hee-nya? That’s right! He’s a wonderful football star who plays in big, big games.\n\nJoao Palhinha is a really good midfielder. A midfielder is a player who runs a lot in the middle of the field! They help their team get the ball from the other team, and they also help pass the ball to their friends to score goals. It's a very important job, like being a bridge between defence and attack!\n\nToday, we are going to learn all about Joao. We'll hear about how he started playing football, what he loved about it, and how he worked really hard to make his dreams come true. Get ready for an inspiring tale!\n\n<h3>A Boy with a Ball</h3>\nJoao grew up in a lovely country called Portugal. When he was a little boy, just like many of you, he loved to play outside. But Joao didn't just play with any toy; he loved to play with a football! He would kick it around everywhere, in his garden, in the park, even in the street with his friends.\n\nHe wasn't born a super-duper football star. No! He started just like everyone else, with lots of energy and a big smile. He spent hours and hours practicing. Kicking the ball, stopping the ball, passing the ball. It was so much fun!\n\nDid you know? Football is the most popular sport in the whole wide world! So many children, just like you, love to play football every single day. It's a game that brings people together and makes everyone happy.\n\n<h3>The \"Chair Stadium\" Dream!</h3>\nWhen Joao was very small, he might not have had a big stadium to play in. But that didn't stop him from dreaming! Sometimes, kids make up their own games with whatever they have around. Imagine Joao, when he was tiny, making a \"stadium\" in his backyard!\n\nMaybe he would line up chairs, pretend they were the stands filled with cheering fans, and then dribble his ball through them! He would imagine all the people shouting his name as he scored a goal. This is how dreams start, with imagination and a simple football.\n\nIt teaches us that you don't need fancy things to start chasing your dreams. You just need a ball, some space, and a lot of heart! Joao definitely had a lot of heart, even when he was just playing with his imaginary chair-fans.\n\n<h3>Learning and Growing</h3>\nAs Joao grew a little older, he joined a small football team. This is where he learned even more about the game. He learned how important it is to work together with his teammates. Football is not just about one person; it's about the whole team!\n\nHis coaches taught him how to pass better, how to tackle the ball safely, and how to run smart. Sometimes it was hard work. Sometimes his legs felt tired after all the running. But Joao never gave up! He knew that practice makes perfect, or at least, makes you much, much better.\n\nDid you know? Playing football is super good for your body! It helps you run faster, jump higher, and makes your heart strong. It also helps you make new friends and learn how to be a good sport, whether you win or lose.\n\n<h3>Playing for Big Teams!</h3>\nBecause Joao worked so hard and loved football so much, he started to get very good. Really big football teams noticed him! He played for some amazing clubs in Portugal, his home country. And then, he got the chance to play for even bigger teams!\n\nOne of the teams he plays for now is called Tottenham. It’s a very famous team in England, with lots of excited fans! He also has a connection to another big team called Bayern, which is in Germany. Imagine playing for teams that so many people around the world watch!\n\nIt must feel so exciting to wear those special jerseys and run onto a huge green field with thousands of people watching. All those years of kicking the ball around, even with imaginary chair-fans, helped him get to these amazing places.\n\n<h3>What Does a Midfielder Do?</h3>\nLet's talk a little more about what a midfielder like Joao does. As we said, they run a lot! They are like the engine of the team, always moving.\n\nThey help to stop the other team from scoring goals. This is called \"defending.\" They try to take the ball away nicely and fairly. And then, when their team has the ball, they help to move it forward, passing it to the attackers who can try to score.\n\nJoao is known for being very strong and brave. He is not afraid to challenge for the ball and protect his goal. He is also very good at passing the ball with precision, which means putting the ball exactly where his teammate needs it. He is a super valuable player!\n\nDid you know? A football match lasts for 90 minutes! That's a very long time to run and play. Midfielders like Joao need to be super fit and have lots of energy for the whole game.\n\n<h3>Never Give Up on Your Dreams!</h3>\nJoao Palhinha's story teaches us something very important. It teaches us that if you have a dream, you should never, ever give up on it! Whether your dream is to be a football player, a teacher, a doctor, or an artist, you can achieve it if you work hard.\n\nHe started with a simple ball and big dreams, just like many of you. He practiced, he learned, he made friends, and he always tried his best. And look where he is now – playing football on big stages, making his family and country proud.\n\nIt shows that every kick, every run, every practice session counts. Even the little games you play with your friends are part of your journey.\n\n<h3>A Message to All Our Young Stars!</h3>\nSo, my amazing young friends, what can we learn from Joao Palhinha? We learn to play with joy, to work hard, to be a good friend and teammate, and to always, always believe in ourselves. Football is not just a game; it teaches us so many good lessons for life!\n\nNext time you see a football game, or when you are playing with your friends, remember Joao. Remember his story of starting with a ball and a big imagination, even with a stand made of chairs! And remember that you, too, can kick your way to your biggest dreams!\n\nThank you for joining me for this wonderful story. Keep playing, keep dreaming, and keep smiling! See you next time, super stars!",
    "summary": "Joao Palhinha, a super football player, started with big dreams and a simple ball, worked very hard, and now plays for famous teams like Tottenham, showing all kids that hard work helps dreams come true.",
    "whyMatters": "This story matters because it teaches us that even if you start small, with lots of practice and never giving up, you can become a big star and achieve your dreams, just like Joao Palhinha did with football!",
    "category": "jobs",
    "date": "2026-01-24T12:33:42.231Z",
    "image": "https://image.pollinations.ai/prompt/From%20Tiny%20Kicks%20to%20Big%20Dreams%3A%20Joao%20Palhinha's%20Story!%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "from-tiny-kicks-to-big-dreams-joao-palhinhas-story",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62ww08l0n6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "German FA official wants World Cup boycott talks",
    "title": "German FA official wants World Cup boycott talks",
    "content": "A German football association official believes it is time to consider a boycott of the 2026 World Cup in the wake of United States President Donald Trump's actions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T12:33:47.412Z",
    "image": "https://image.pollinations.ai/prompt/German%20FA%20official%20wants%20World%20Cup%20boycott%20talks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "german-fa-official-wants-world-cup-boycott-talks",
    "originalLink": "https://www.bbc.com/sport/football/articles/c87r5y70r82o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Euros abuse made me not want to leave hotel - Carter",
    "title": "Euros abuse made me not want to leave hotel - Carter",
    "content": "England defender Jess Carter says abuse of female footballers is getting worse and that she has had to step back from social media after receiving racist messages during Euro 2025.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-24T12:33:52.573Z",
    "image": "https://image.pollinations.ai/prompt/Euros%20abuse%20made%20me%20not%20want%20to%20leave%20hotel%20-%20Carter%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "euros-abuse-made-me-not-want-to-leave-hotel-carter",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd0y353v2x5o?at_medium=RSS&at_campaign=rss"
  }
]