[
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "Cows, Goats, and Sheep Need Our Help in Sunny South Africa!",
    "content": "Hello, friends! I'm your friendly news reporter from beautiful Africa! Today, we have something important to talk about. It's about some of our farm animal friends in a country called South Africa. They need a little help.\n\n<h3>Hello from Africa!</h3>\nGuess what? Animals can get sick too, just like us! There's a sickness that is making some cows, sheep, and goats feel unwell in a sunny country called South Africa. South Africa is a big country in the southern part of Africa, full of amazing animals and kind people.\n\nThis sickness has a long name: Foot-and-Mouth Disease. But we can just call it FMD, or \"the animal sickness.\" It sounds a bit scary, but we will learn all about it together. Don't worry, we're going to explain everything simply.\n\n<h3>What is Foot-and-Mouth?</h3>\nImagine if your feet got little bumps and made it hard to walk. That's a bit like what happens to animals with Foot-and-Mouth Disease. It's a sickness that mostly affects animals with hooves. What are hooves? Hooves are like their strong feet! Cows, goats, sheep, and pigs have hooves.\n\nWhen an animal gets FMD, they might get little bumps or blisters inside their mouth and on their hooves. These can hurt a lot! It makes it hard for them to eat their yummy grass. It also makes it hard for them to walk around. They can feel very tired and not want to play.\n\nDid you know? This sickness usually doesn't make people sick. So, you don't have to worry about catching it from an animal! It mostly stays with our animal friends.\n\n<h3>Who Gets Sick?</h3>\nThe animals who usually get this sickness are farm animals. These are animals like big cows, fluffy sheep, and playful goats. Pigs can also get it. These animals are very important because they help us in many ways.\n\nCows give us milk, which we use for cheese and yogurt. Sheep give us wool to make warm clothes. Goats also give milk and meat. When these animals get sick, it makes it hard for them to do their important jobs.\n\nThis sickness can spread very easily from one animal to another. It's a bit like when you catch a cold from your friend. That's why farmers have to be very careful to keep the sick animals away from the healthy ones.\n\n<h3>Why is This a Big Problem?</h3>\nWhen farm animals get sick, it's a very big problem for the farmers. Farmers are the kind people who look after these animals every day. They work very hard to make sure their animals are healthy and happy.\n\nIf cows are sick, they might not be able to give milk. If sheep are sick, they might not grow good wool. This means farmers might not have enough milk or wool to sell. And when farmers can't sell their products, they don't have money to buy food or send their children to school.\n\nIt can also mean that there might be less food for everyone. We get a lot of our food from these farm animals. So, when they are sick, it affects us all. This is why it's so important to help them get better!\n\nDid you know? Farmers wake up very early every morning to feed their animals and make sure they are well. They are like animal superheroes!\n\n<h3>What Are Farmers Doing?</h3>\nThe farmers in South Africa are working extra hard right now. They are trying their best to protect their animals from this sickness. They are checking their animals every day to see if any are getting sick.\n\nIf an animal looks sick, the farmer makes sure to keep it separate from the others. This helps stop the sickness from spreading. It's like when you stay home from school if you have a cold so your friends don't get sick too.\n\nThey are also cleaning their farms very well. Keeping everything clean helps to stop the tiny germs that cause the sickness from spreading around. Farmers are trying everything they can to keep their animal families safe.\n\n<h3>What is the Government Doing?</h3>\nThe government is like the grown-ups who help run the country. The government in South Africa knows this sickness is a big problem. So, they have started a special plan to help the animals.\n\nThey are giving the animals special medicine called a \"vaccine.\" What is a vaccine? It's like a tiny shield for the animals! When an animal gets a vaccine, it helps their body fight off the sickness if they come across it.\n\nIt's a very important program to help keep all the healthy animals safe. Imagine giving your pet a special shot to stop them from getting ill! That's what a vaccine does for these farm animals.\n\nDid you know? Scientists work very hard to make vaccines to help both people and animals stay healthy!\n\n<h3>How Does a Vaccine Work?</h3>\nA vaccine is a very clever medicine. It helps the animal's body learn how to fight the sickness before it even gets sick. It's like practicing for a game before you play it!\n\nWhen an animal gets a vaccine, their body learns what the sickness looks like. Then, if the real sickness tries to come, their body is ready to fight it off quickly. This helps them not get very sick at all, or just get a little bit sick.\n\nThe government is trying to give these vaccines to as many animals as possible. But sometimes, it takes a little while to get all the vaccines to all the farms. Some people think it took a little too long to start this helping plan. But now, the help is really happening!\n\n<h3>What Can We Do?</h3>\nEven though we are far away, we can still help in our hearts. We can think about the farmers and their animals in South Africa. We can hope they get better soon.\n\nWe can also learn more about how important farm animals are. Remember to be kind to all animals, big and small. Wash your hands often, and if you ever see an animal that looks sick, tell a grown-up right away!\n\nLearning about things happening around the world helps us become smart and caring global citizens. Let's send our best wishes to the farmers and their animal friends in South Africa! They are working hard, and we hope all their animals stay safe and healthy.\n\nDid you know? South Africa is home to amazing animals like lions, elephants, and giraffes! It's a truly special place.",
    "summary": "Farm animals in South Africa are getting a special sickness called Foot-and-Mouth, and farmers and the government are working hard to help them get better with vaccines.",
    "whyMatters": "This is important because when farm animals get sick, farmers can lose money, and there might be less milk and food for everyone, so we need to help them stay healthy.",
    "category": "world",
    "date": "2026-02-20T10:32:31.300Z",
    "image": "https://image.pollinations.ai/prompt/Cows%2C%20Goats%2C%20and%20Sheep%20Need%20Our%20Help%20in%20Sunny%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cows-goats-and-sheep-need-our-help-in-sunny-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tunisian MP jailed for eight months over posts mocking president",
    "title": "A Big Story from Tunisia: Speaking Up Gets Tricky!",
    "content": "<h3>Hello, Super Friends!</h3>\nHello, super friends! It's your kid-friendly news reporter from Africa! Today we have a very important story from a country called Tunisia. Tunisia is a beautiful country in North Africa, with sandy beaches and ancient cities. It's a place where people love to tell stories, just like us!\n\nDid you know? Tunisia has a very long coastline along the Mediterranean Sea! That means it has lots of beautiful beaches.\n\n<h3>When Rivers Get Too Big</h3>\nSometimes, something not so nice happens in countries. It's called a flood. Imagine your bathtub overflowing, but much, much bigger! A flood is when too much rain falls, and rivers or water bodies get very big. The water then spills out and covers roads, houses, and farms.\n\nIt can be very scary and cause a lot of problems for people. When floods happen, people can't go to school or work. Their homes might get wet, and their belongings could get damaged. It's a very sad time for many families. People need help, and they need it quickly.\n\n<h3>Who Helps When There Are Floods?</h3>\nWhen big problems like floods happen, the leaders of the country try to help. The main leader of a country is called a President. Think of a President like the head principal of a very big school – the whole country! They are in charge of making sure everyone is safe and that things run smoothly.\n\nThere are also other important people who help the President. They are called Members of Parliament, or MPs for short. An MP is like a class representative, but for a whole big area of the country. They listen to what the people in their area need and tell the President or other big leaders about it.\n\nThey help make rules and plans to make the country better for everyone.\n\nDid you know? The job of a President is to lead the whole country and make big decisions!\n\n<h3>A Story About an MP</h3>\nNow, let's talk about our story. In Tunisia, there was an MP. Remember, an MP is someone who helps the people and talks to the big leaders. This MP was worried about the people in their area. There had been very bad floods, and many people were sad and struggling.\n\nThe MP felt that the President was not helping enough or fast enough. So, the MP decided to say what they thought. They wrote things on the internet, like on social media. They wrote about the floods and said that the President should do more to help.\n\nThey were trying to speak for the people who were suffering.\n\n<h3>What Does \"Mocking\" Mean?</h3>\nThe news said that the MP was \"mocking\" the President. What does \"mocking\" mean? It means making fun of someone or saying they did a bad job in a way that might not be very polite. It's like when someone laughs at your drawing and says it's not good, even if you tried your best.\n\nThe MP used their internet posts to show that they were unhappy with how the President was handling the flood situation. They were using strong words to make their point. They wanted people to pay attention and for more help to come quickly.\n\nDid you know? In some countries, people can say what they think about their leaders without getting into trouble. This is called \"freedom of speech\"!\n\n<h3>Trouble for Speaking Up</h3>\nBut here's where the story gets a bit tricky. After the MP wrote these things on the internet, something happened. The police came and took the MP away. This is called being \"arrested.\" When someone is arrested, it means the police think they might have broken a rule or a law.\n\nAnd then, a judge said that the MP had to go to jail. Jail is a place where people stay when they have broken a law. The MP was told to stay in jail for eight months. That's a very long time, like waiting for a whole school year to finish!\n\nThis happened because, in Tunisia, there are rules about what you can say about the President and other leaders. Even if you are an MP and want to help your people, there are rules about how you can do it.\n\n<h3>Why This Is Important</h3>\nThis story teaches us something very important about speaking up. It's good to speak up when you see something wrong or when people need help. MPs are supposed to speak for the people! But sometimes, there are rules about how we speak up, especially when talking about big leaders.\n\nIt's like in school: you can tell your teacher if something is unfair, but you can't shout at them or say mean things. There's a right way to talk about problems.\n\nDid you know? When leaders listen to what people say, even if it's criticism, it can help them make better decisions!\n\n<h3>What Does It Mean for Everyone?</h3>\nThis story means that in Tunisia, people have to be very careful about what they say about their leaders. Even if they think the leaders are not doing a good job, they have to find a way to express it that follows the rules.\n\nSome people might think it's not fair. They might think that an MP should be able to say anything to help their people, especially when floods are making everyone sad. Other people might think the rules are important to keep order in the country. It's a tricky situation with different ideas about what is right.\n\n<h3>Be Kind and Speak Gently</h3>\nEven though this is a grown-up story, we can learn from it. It reminds us that our words are powerful. We should always try to use kind words, even when we are upset or want to make a point. And we should always try to listen to each other, even if we don't agree.\n\nThe MP wanted to help people in the floods. That was a kind thing to want. But how they said it caused trouble. So, let's remember to be kind with our words, speak gently, and always try to help others in the best way we can.\n\nDid you know? Tunisia is home to parts of the Sahara Desert! It has huge sand dunes!\n\n<h3>A Hope for the Future</h3>\nThis story helps us remember that countries are always learning and growing, just like us. Sometimes, there are big discussions about how people can speak up and how leaders should listen. We hope that everyone in Tunisia can find ways to work together, help each other, and make their country a wonderful place where everyone feels safe and heard.\n\nThat's all for today, super friends! Remember to be kind, be helpful, and use your words wisely! See you next time!",
    "summary": "In Tunisia, an MP (a person who helps people and talks to leaders) was sent to jail for eight months because they wrote things on the internet that made fun of the President's help during big floods.",
    "whyMatters": "This story is important because it teaches us about how people can speak up for others, but also that there are rules about what we can say about big leaders in some countries. It makes us think about helping people and using our words wisely.",
    "category": "world",
    "date": "2026-02-20T10:32:55.512Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Story%20from%20Tunisia%3A%20Speaking%20Up%20Gets%20Tricky!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-story-from-tunisia-speaking-up-gets-tricky",
    "originalLink": "https://www.bbc.com/news/articles/c3v75lvgy36o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Son of Robert Mugabe arrested in South Africa on suspicion of attempted murder",
    "title": "Son of Robert Mugabe arrested in South Africa on suspicion of attempted murder",
    "content": "Bellarmine Mugabe is in custody after a man who worked at the place where he was staying was shot and injured.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:00.615Z",
    "image": "https://image.pollinations.ai/prompt/Son%20of%20Robert%20Mugabe%20arrested%20in%20South%20Africa%20on%20suspicion%20of%20attempted%20murder%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "son-of-robert-mugabe-arrested-in-south-africa-on-suspicion-of-attempted-murder",
    "originalLink": "https://www.bbc.com/news/articles/c1jkx2pkyyro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israel blocks Palestinians from first Friday prayers of Ramadan at Al-Aqsa",
    "title": "Fewer Friends Can Pray Together at a Special Place",
    "content": "<h3>Hello, Amazing Friends!</h3>\n\nHello, amazing friends from all over Africa and the world! It's your friendly reporter, ready to share some news with you. We always talk about being kind and understanding, right? Well, today we have a story that helps us remember just how important it is to be kind to everyone, everywhere. It’s about people who want to gather for something very special, but not everyone can go. Let's learn about it together in simple words.\n\n<h3>A Special Time Called Ramadan</h3>\n\nRight now, for many people around the world, there is a very special time happening. It's called Ramadan! Can you say Ramadan? It's a holy month for our Muslim friends. During Ramadan, people try their best to be super kind, to help others, and to spend time praying. They also fast, which means they don't eat or drink anything from when the sun comes up until the sun goes down. It helps them feel grateful for what they have and think about people who might not have enough.\n\nDid you know? Fasting during Ramadan is like a big lesson in patience and self-control! It helps people remember to be thankful for their food and water.\n\n<h3>What is Al-Aqsa?</h3>\n\nNow, there is a very, very special building called Al-Aqsa. It is a big, beautiful mosque. A mosque is like a church or a temple, but for Muslim people. Al-Aqsa is in a city far away called Jerusalem. It is one of the most important places for Muslims all over the world. Many, many people dream of visiting Al-Aqsa, especially during Ramadan. They want to pray there, feel close to God, and be together with other people who believe the same things.\n\nDid you know? Al-Aqsa has been around for a very, very long time! It has beautiful domes and intricate designs, making it a wonderful place to see and pray.\n\n<h3>Friday Prayers: A Special Gathering</h3>\n\nEvery week, on a day called Friday, Muslim people have a very special prayer time. It's called Friday prayers. It's like a big gathering, where everyone comes together in the mosque. Imagine all your classmates, teachers, and even your family members coming to school assembly, but instead of singing songs, they all pray together! It makes everyone feel connected and strong. During Ramadan, these Friday prayers are even more special, because it's a holy month.\n\nDuring Ramadan, these Friday prayers at Al-Aqsa are extra important. People want to be there with their families and friends. They want to share the joy and peace of this holy month in their special place.\n\n<h3>The Big News: Fewer Friends Can Go</h3>\n\nNow, here is the news we need to talk about. This past Friday, it was the first Friday prayer of Ramadan. Many, many Muslim friends wanted to go to Al-Aqsa. But something a little bit sad happened. Not everyone who wanted to go was allowed in.\n\nPeople from a place nearby, called the West Bank, often go to Al-Aqsa for these prayers. Usually, lots and lots of people can go. Hundreds of thousands! But this time, some grown-ups made a rule. They said only 10,000 people from the West Bank could come to Al-Aqsa.\n\nDid you know? 10,000 is a very big number! It's like having all the children from many, many schools joining together. But compared to hundreds of thousands, it is a much smaller group.\n\n<h3>Why is This Sad?</h3>\n\nIt makes some people feel sad when they cannot go to their special place of worship, especially during a holy month like Ramadan. Imagine you were really looking forward to a big family party, but then some people couldn't come. Or you wanted to play with all your friends, but only a few could join. It would feel a bit lonely, wouldn't it?\n\nMany people were hoping to pray with their grandmas, grandpas, aunts, uncles, and cousins. They wanted to share this special time together. When only a small number of people are allowed, it means many families cannot be together. This can make them feel a bit disappointed and heartbroken.\n\nPraying together is very important for many people. It helps them feel peaceful and happy. It helps them feel like they are part of a big family. When they can't do this, it can feel like a part of their celebration is missing.\n\n<h3>Being Kind and Understanding</h3>\n\nEven when rules are made, and it makes people sad, it's important to remember to be kind. Ramadan teaches us to be patient and to try to understand others. Even if we don't always agree, we can still show love and respect.\n\nWe can hope that in the future, more people will be able to join their families and friends for special prayers at Al-Aqsa. Everyone deserves to feel welcome and to celebrate their special moments together. We should always wish for peace and togetherness for all people around the world.\n\nDid you know? Being kind means thinking about how others feel and trying to help them, even with small things like a smile or a kind word!\n\n<h3>Wishing for Peace</h3>\n\nSo, my lovely friends, this news reminds us that sometimes things can be tricky. But it also reminds us to always wish for peace. We want everyone to be able to celebrate their special times with their loved ones, in the places that are important to them. Let's send our kind thoughts to all the people who wanted to pray at Al-Aqsa and could not. And let's remember to be kind to everyone we meet, every single day. Sending big hugs and smiles from your friend in Africa!\n",
    "summary": "This news is about how fewer Muslim people than usual were allowed to go to Al-Aqsa, a very special mosque, to pray together for the first Friday of Ramadan, making many feel sad.",
    "whyMatters": "This matters because praying together in a special place, especially during a holy month like Ramadan, is very important to many people, and not being able to join their families and friends can make them feel sad and lonely.",
    "category": "world",
    "date": "2026-02-20T10:33:23.277Z",
    "image": "https://image.pollinations.ai/prompt/Fewer%20Friends%20Can%20Pray%20Together%20at%20a%20Special%20Place%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fewer-friends-can-pray-together-at-a-special-place",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/israel-blocks-palestinians-from-first-friday-prayers-of-ramadan-at-al-aqsa?traffic_source=rss"
  },
  {
    "originalTitle": "Tracking the rapid US military build-up near Iran",
    "title": "Tracking the rapid US military build-up near Iran",
    "content": "As tensions between the US and Iran rise, we examine the military assets Washington has deployed to the Middle East.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:28.384Z",
    "image": "https://image.pollinations.ai/prompt/Tracking%20the%20rapid%20US%20military%20build-up%20near%20Iran%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tracking-the-rapid-us-military-build-up-near-iran",
    "originalLink": "https://www.aljazeera.com/news/2026/2/20/tracking-the-rapid-us-military-build-up-near-iran?traffic_source=rss"
  },
  {
    "originalTitle": "Trump’s Board of Peace faces its first test on Gaza",
    "title": "Trump’s Board of Peace faces its first test on Gaza",
    "content": "Members of Donald Trump’s Board of Peace expressed optimism about peace and rebuilding in Gaza at its inaugural session.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:33.501Z",
    "image": "https://image.pollinations.ai/prompt/Trump%E2%80%99s%20Board%20of%20Peace%20faces%20its%20first%20test%20on%20Gaza%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-board-of-peace-faces-its-first-test-on-gaza",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/20/trumps-board-of-peace-faces-its-first-test-on-gaza?traffic_source=rss"
  },
  {
    "originalTitle": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
    "title": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
    "content": "The US is surging forces to the Middle East amid negotiations with the Islamic Republic over its nuclear programme.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:39.035Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20says%20world%20has%2010%20days%20to%20see%20if%20Iran%20agrees%20deal%20or%20'bad%20things%20happen'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-says-world-has-10-days-to-see-if-iran-agrees-deal-or-bad-things-happen",
    "originalLink": "https://www.bbc.com/news/articles/c86yjnw4x49o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Grey's Anatomy star Eric Dane dies at 53 after ALS diagnosis",
    "title": "Grey's Anatomy star Eric Dane dies at 53 after ALS diagnosis",
    "content": "The actor, who also starred in HBO's Euphoria, battled the most common form of motor neurone disease.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:44.127Z",
    "image": "https://image.pollinations.ai/prompt/Grey's%20Anatomy%20star%20Eric%20Dane%20dies%20at%2053%20after%20ALS%20diagnosis%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "greys-anatomy-star-eric-dane-dies-at-53-after-als-diagnosis",
    "originalLink": "https://www.bbc.com/news/articles/c78j01n775ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Austrian climber found guilty after girlfriend froze to death on mountain",
    "title": "Austrian climber found guilty after girlfriend froze to death on mountain",
    "content": "The woman died of hypothermia during a climbing trip on the Grossglockner mountain in January 2025.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:49.227Z",
    "image": "https://image.pollinations.ai/prompt/Austrian%20climber%20found%20guilty%20after%20girlfriend%20froze%20to%20death%20on%20mountain%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "austrian-climber-found-guilty-after-girlfriend-froze-to-death-on-mountain",
    "originalLink": "https://www.bbc.com/news/articles/c0k1xkllknmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Managing Man Utd the 'ultimate role' - Carrick",
    "title": "Managing Man Utd the 'ultimate role' - Carrick",
    "content": "Manchester United caretaker manager Michael Carrick speaks to BBC Sport about trusting academy graduate and 'huge talent' Kobbie Mainoo.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:54.558Z",
    "image": "https://image.pollinations.ai/prompt/Managing%20Man%20Utd%20the%20'ultimate%20role'%20-%20Carrick%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "managing-man-utd-the-ultimate-role-carrick",
    "originalLink": "https://www.bbc.com/sport/football/articles/ceqvrv29pzvo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Schmeichel in spotlight after night of gloom for Celtic",
    "title": "Schmeichel in spotlight after night of gloom for Celtic",
    "content": "BBC Scotland looks at the fallout from Kasper Schmeichel's performance in Celtic' Stuttgart defeat.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:33:59.662Z",
    "image": "https://image.pollinations.ai/prompt/Schmeichel%20in%20spotlight%20after%20night%20of%20gloom%20for%20Celtic%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "schmeichel-in-spotlight-after-night-of-gloom-for-celtic",
    "originalLink": "https://www.bbc.com/sport/football/articles/clyg5yl9k2yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "How do Brentford keep appointing the right managers?",
    "title": "How do Brentford keep appointing the right managers?",
    "content": "Keith Andrews is impressing at Brentford in his first season as a manager, but how do the Bees keep getting their appointments so right?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-20T10:34:04.770Z",
    "image": "https://image.pollinations.ai/prompt/How%20do%20Brentford%20keep%20appointing%20the%20right%20managers%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "how-do-brentford-keep-appointing-the-right-managers",
    "originalLink": "https://www.bbc.com/sport/football/articles/c15x9nlykg2o?at_medium=RSS&at_campaign=rss"
  }
]