[
  {
    "originalTitle": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers",
    "title": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers",
    "content": "It is the latest twist over the fate of Lungu's body, which remains in a South African morgue since his death.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:30:39.792Z",
    "image": "https://image.pollinations.ai/prompt/Family%20of%20Zambia's%20ex-President%20Lungu%20dismiss%20poisoning%20allegation%20-%20lawyers%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "family-of-zambias-ex-president-lungu-dismiss-poisoning-allegation-lawyers",
    "originalLink": "https://www.bbc.com/news/articles/ckg18yqwlplo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US soldiers arrive in Nigeria to aid its fight against Islamist militants",
    "title": "Friends from Far Away Come to Help Nigeria!",
    "content": "Hello, amazing kids of Africa! It’s your friendly reporter, Kojo, here with some wonderful news from our beautiful continent. Today, we have a very special story from Nigeria!\n\n<h3>Friends from Far Away!</h3>\nGuess what? Some special friends have come to visit our dear country, Nigeria! These friends are brave soldiers, and they are from a country very far away called the United States of America. We often call it the USA! They traveled a very long way, flying over huge oceans and many lands, just to be here. Isn't that super amazing? Imagine how long that journey must have been!\n\n<h3>A Special Landing Spot!</h3>\nOur new friends landed their big, big airplanes at a special place called an airfield. An airfield is like a big parking lot for airplanes, especially for large ones that soldiers use. This airfield is in a lovely part of Nigeria called Bauchi State. Bauchi is one of the many wonderful states that make up the big country of Nigeria.\nDid you know? Nigeria is a very big country in West Africa! It has so many different people, languages, and cultures, like a big, colorful family where everyone is special. Just imagine all the different delicious foods and vibrant clothes!\nEveryone was happy to see our new friends arrive safely and soundly after their long journey. It's always nice to welcome visitors!\n\n<h3>Why Are They Here?</h3>\nNow, you might be wondering, \"Why did these friends come all this way?\" Well, they are here to help Nigeria! Just like when you help your friends with their homework, or share your toys, these soldiers are here to share their super special knowledge and skills.\nNigeria, like many places in the world, sometimes has groups of people who cause trouble. These people are sometimes called \"militants\" by grown-ups. They don't always follow the rules and can make some places feel a little bit scary. But remember, most people in Nigeria are good, kind, and loving! They want peace, just like you and me.\nOur own brave Nigerian soldiers work very hard every single day to keep everyone safe from these troublemakers. They are like superheroes protecting our homes and families.\n\n<h3>How Will They Help?</h3>\nThis is the really important part, my little explorers! The soldiers from the USA will *not* be joining the fighting. No, no! Their job is different and very important. They are like very good teachers and coaches who come to share their wisdom!\nThey will work with our Nigerian soldiers. They will share special ways to be even safer and smarter. They will teach new things about how to find the troublemakers and stop them from causing harm, without having to fight directly.\nImagine playing your favorite game, and a very good player teaches you a new, clever trick to play better and win. That's what these soldiers will do! They will help make Nigeria's own brave soldiers even stronger, smarter, and better prepared.\nDid you know? Soldiers train very hard every day to learn how to protect people and keep them safe. They learn about teamwork, being brave, and clever planning!\n\n<h3>Learning Together</h3>\nThis is all about friendship and learning. The soldiers from the USA and the soldiers from Nigeria will learn from each other. They will talk, share ideas, and practice together. It’s like when you work on a school project with a friend, and you both have wonderful ideas to share, making the project even better!\nThis special kind of help is called \"aid.\" It means one country is helping another country to become stronger and safer. It's a way for countries to be good neighbors and friends, even if they are far apart across the world.\nWhen countries help each other, it makes the whole world a better and happier place for everyone. It shows that we can all work together, no matter where we come from or what language we speak.\n\n<h3>Making Nigeria Stronger and Safer</h3>\nBy sharing their special knowledge and training, the USA soldiers are helping Nigeria to become even better at keeping its people safe. This means fewer troublemakers and more peace for everyone to enjoy.\nImagine a big, strong shield getting stronger and stronger! That’s what this help is doing for Nigeria. It helps build a future where kids like you can play, learn, and grow up without worries or fear. A future filled with laughter and sunshine.\nDid you know? The more people work together, the better they become at solving problems and making things right!\n\n<h3>A Brighter Future for Everyone!</h3>\nSo, the arrival of these friends from the USA is a very good thing for Nigeria. It means more safety, more excellent training, and more hope for a peaceful future for all children and families.\nIt’s a sign that people all around the world care about each other. We are all part of one big global family, and helping each other makes us all stronger.\nAnd that's the wonderful news for today from your friend, Kojo! Stay curious, stay kind, and remember that helping hands make happy lands! Bye for now!",
    "summary": "Brave soldiers from the United States have arrived in Nigeria to help train Nigerian soldiers and share special safety skills, but they will not join any fighting, aiming to make Nigeria safer and stronger.",
    "whyMatters": "This is important because it means Nigeria is getting help from friends far away to keep everyone safe from people who cause trouble, helping build a more peaceful and happy future for all children.",
    "category": "technology",
    "date": "2026-02-17T21:31:01.076Z",
    "image": "https://image.pollinations.ai/prompt/Friends%20from%20Far%20Away%20Come%20to%20Help%20Nigeria!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-from-far-away-come-to-help-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/cj6d79gyrdro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Strike deal reached after two days of chaos at Kenya's main airport",
    "title": "Strike deal reached after two days of chaos at Kenya's main airport",
    "content": "Passengers are still being urged to check their flight status before heading to the crowded airport.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-17T21:31:06.183Z",
    "image": "https://image.pollinations.ai/prompt/Strike%20deal%20reached%20after%20two%20days%20of%20chaos%20at%20Kenya's%20main%20airport%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "strike-deal-reached-after-two-days-of-chaos-at-kenyas-main-airport",
    "originalLink": "https://www.bbc.com/news/articles/c363096kd5po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US and Iran reach ‘guiding principles’ in Geneva nuclear talks",
    "title": "US and Iran reach ‘guiding principles’ in Geneva nuclear talks",
    "content": "The US and Iran reached an understanding on key “guiding principles” at indirect nuclear talks in Geneva.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:11.533Z",
    "image": "https://image.pollinations.ai/prompt/US%20and%20Iran%20reach%20%E2%80%98guiding%20principles%E2%80%99%20in%20Geneva%20nuclear%20talks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-and-iran-reach-guiding-principles-in-geneva-nuclear-talks",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/17/us-and-iran-reach-guiding-principles-in-geneva-nuclear-talks?traffic_source=rss"
  },
  {
    "originalTitle": "Yemeni Americans feel ‘betrayed’ as Trump revokes immigration protections",
    "title": "Yemeni Americans feel ‘betrayed’ as Trump revokes immigration protections",
    "content": "Prominent Trump supporter Amer Ghalib says US decision to nix deportation protection for Yemenis 'very unfortunate'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:16.699Z",
    "image": "https://image.pollinations.ai/prompt/Yemeni%20Americans%20feel%20%E2%80%98betrayed%E2%80%99%20as%20Trump%20revokes%20immigration%20protections%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "yemeni-americans-feel-betrayed-as-trump-revokes-immigration-protections",
    "originalLink": "https://www.aljazeera.com/news/2026/2/17/yemeni-americans-feel-betrayed-as-trump-revokes-immigration-protections?traffic_source=rss"
  },
  {
    "originalTitle": "‘Journey of hell’: Migrants in Libya endure torture, rape, forced labour",
    "title": "‘Journey of hell’: Migrants in Libya endure torture, rape, forced labour",
    "content": "A new UN report says migrants, refugees, and asylum seekers in Libya are being forcibly rounded up and abused.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:21.801Z",
    "image": "https://image.pollinations.ai/prompt/%E2%80%98Journey%20of%20hell%E2%80%99%3A%20Migrants%20in%20Libya%20endure%20torture%2C%20rape%2C%20forced%20labour%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "journey-of-hell-migrants-in-libya-endure-torture-rape-forced-labour",
    "originalLink": "https://www.aljazeera.com/news/2026/2/17/journey-of-hell-migrants-in-libya-endure-torture-rape-forced-labour?traffic_source=rss"
  },
  {
    "originalTitle": "US civil rights leader Jesse Jackson dies aged 84",
    "title": "US civil rights leader Jesse Jackson dies aged 84",
    "content": "Tributes poured in from politicians who described Jackson as an agent of change and transformative leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:27.516Z",
    "image": "https://image.pollinations.ai/prompt/US%20civil%20rights%20leader%20Jesse%20Jackson%20dies%20aged%2084%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-civil-rights-leader-jesse-jackson-dies-aged-84",
    "originalLink": "https://www.bbc.com/news/articles/cp81l0e1eg5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nine arrested in France over death of far-right student",
    "title": "Nine arrested in France over death of far-right student",
    "content": "Quentin Deranque died on Saturday, two days after being beaten in Lyon by masked men believed to be far-left militants.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:32.625Z",
    "image": "https://image.pollinations.ai/prompt/Nine%20arrested%20in%20France%20over%20death%20of%20far-right%20student%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nine-arrested-in-france-over-death-of-far-right-student",
    "originalLink": "https://www.bbc.com/news/articles/cvgj1qrqd47o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "First day of Russia-Ukraine peace talks ends in Geneva",
    "title": "First day of Russia-Ukraine peace talks ends in Geneva",
    "content": "Negotiations will continue on Wednesday, but expectations for a breakthrough on ending the war are low.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-17T21:31:37.728Z",
    "image": "https://image.pollinations.ai/prompt/First%20day%20of%20Russia-Ukraine%20peace%20talks%20ends%20in%20Geneva%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "first-day-of-russia-ukraine-peace-talks-ends-in-geneva",
    "originalLink": "https://www.bbc.com/news/articles/cge812y2549o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal make Saka best-paid player with new five-year deal",
    "title": "Arsenal make Saka best-paid player with new five-year deal",
    "content": "England winger Bukayo Saka commits his future to Premier League leaders Arsenal by signing a new five-year deal.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T21:31:43.075Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20make%20Saka%20best-paid%20player%20with%20new%20five-year%20deal%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-make-saka-best-paid-player-with-new-five-year-deal",
    "originalLink": "https://www.bbc.com/sport/football/articles/c4gje501g51o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Feyenoord training moved to Belgium for Sterling",
    "title": "A Big Football Team Goes on a Special Trip!",
    "content": "Hi everyone! It's your friendly news reporter for Africa! Guess what big news we have today? It's all about football! You know, that game we all love to play and watch. Today we are talking about a team called Feyenoord. They are from a country far, far away called the Netherlands. But they are doing something very special this week!\n\n<h3>Who are Feyenoord?</h3>\nFeyenoord is a super cool football team! They are from a beautiful country called the Netherlands, very far away from us in Africa. Their team colours are red and white. Imagine seeing them run on the green grass! They play amazing football and have many, many fans who love to cheer for them. Their home city is called Rotterdam, a place with big ports and many boats. They work hard to win all their games!\n\n**Did you know?** Football is called soccer in some places like America! But mostly, we say football!\n\n<h3>Meet Raheem Sterling!</h3>\nNow, let's talk about a very special football player! His name is Raheem Sterling. Can you say that name? Raheem Sterling! He is known for being super fast and very clever with the ball. He can run really fast and score fantastic goals! He used to play for other famous teams, but now, he is a brand new player for Feyenoord! He is joining their football family.\n\n**Did you know?** Raheem Sterling was born in a country called Jamaica! But he grew up and played football in England.\n\n<h3>Why Are They Going on a Trip?</h3>\nWhen a new person joins your class or your football team, it's nice to help them feel at home, right? Raheem is new to Feyenoord. He needs to meet all his new teammates. He needs to learn how they play together. So, the team decided to do something very special. Instead of staying in their usual training place, they are going on an adventure! A special trip just for him and the team.\n\n<h3>Where Are They Going?</h3>\nThey are packing their football boots and their jerseys! They are travelling to a country called Belgium. It's right next to the Netherlands, so it's not a super long journey. Imagine going to your friend's house next door, but it's a whole country! The Feyenoord team will stay there for a whole week. This special trip will help everyone get to know each other better.\n\n**Did you know?** Belgium is famous for yummy chocolates and crispy fries!\n\n<h3>What is Training?</h3>\nTraining is super important for football players. It's like going to a special school for athletes! They wake up early, they run, they kick the ball, they practice passing it to each other. They learn new tricks and strategies from their coaches. Training makes them stronger, faster, and helps them play better as a team. It's how they get ready to win big matches!\n\n<h3>Why is This Trip Good for Raheem?</h3>\nThis trip is super, super good for Raheem Sterling. When you are new, it can feel a little strange at first. But by going on this trip, Raheem will spend all his time with his new teammates. They will eat breakfast, lunch, and dinner together. They will laugh and talk. They will train side by side every single day. This helps them become very good friends and a strong team much faster!\n\n**Did you know?** When players train together, it's called 'team bonding'! It helps them trust each other on the field.\n\n<h3>Learning New Tricks Together!</h3>\nFootball is all about teamwork! Everyone on the field needs to know what the other players are going to do. Raheem needs to learn Feyenoord's special plays. And his new teammates need to learn how Raheem likes to play. Training in a new, quiet place helps everyone focus only on football. There are no distractions, just lots of fun learning and playing together.\n\n<h3>A Special Welcome for a Special Player</h3>\nThis trip shows that Feyenoord really wants Raheem Sterling to feel like part of their family. They are making a big, special effort for him. It's like when your family plans a big party for a special guest. They want him to feel happy, loved, and excited to play his very best football for the team. Everyone wants to feel welcome, right?\n\n**Did you know?** Some big football teams travel all over the world for special training camps! Like when they come to Africa to train and play!\n\n<h3>More About Belgium!</h3>\nBelgium is a wonderful country! It has yummy chocolates and delicious crispy fries. The place where the players will train will be beautiful, with green fields and fresh air. It's a good quiet place for them to focus and get ready for very important games. They can enjoy the new surroundings while getting fit and strong.\n\n<h3>What Happens After the Trip?</h3>\nAfter their exciting week in Belgium, the Feyenoord team will travel back home to Rotterdam. But now, Raheem Sterling will feel much more like part of the team! He will know all his teammates better. They will all be stronger, faster, and ready to play amazing football together. They will be a real family on the field! And we will be watching them and cheering for them!\n\n<h3>Why Is This News Important?</h3>\nThis story teaches us many good things! It shows us that teamwork is very, very important. It tells us that being kind and welcoming to new friends makes everyone happy. And it shows us how much hard work and effort football teams put in to be the very best they can be! So, next time you play football with your friends, remember Feyenoord and Raheem Sterling and how they became a super team!",
    "summary": "The Feyenoord football team is taking a special trip to Belgium this week so their new fast player, Raheem Sterling, can meet and train with all his new friends on the team.",
    "whyMatters": "This story matters because it shows how important it is for new friends to feel welcome and how working together helps a team become strong and play their best football!",
    "category": "technology",
    "date": "2026-02-17T21:32:08.879Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20Football%20Team%20Goes%20on%20a%20Special%20Trip!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-football-team-goes-on-a-special-trip",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce948p5gk3no?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'We really messed up' - does European football need more balance?",
    "title": "'We really messed up' - does European football need more balance?",
    "content": "One set of clubs dominate the Champions League, another win their domestic title every year but cannot compete - does European football have a problem?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-17T21:32:13.984Z",
    "image": "https://image.pollinations.ai/prompt/'We%20really%20messed%20up'%20-%20does%20European%20football%20need%20more%20balance%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "we-really-messed-up-does-european-football-need-more-balance",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgmzylx4004o?at_medium=RSS&at_campaign=rss"
  }
]