[
  {
    "originalTitle": "Catch of the day: Pictures from spectacular Nigerian fishing festival",
    "title": "Big Fun and Friendship at Nigeria's Fishing Party!",
    "content": "Hello, amazing friends across Africa and beyond! It's your super excited kid-friendly reporter here, ready to share a fantastic story from our wonderful continent! Today, we're taking a super fun trip to a country called Nigeria. It's a place full of sunshine, smiles, and incredible stories. And guess what? They just had a really special and exciting party called a fishing festival! It's like a big carnival, but with lots and lots of fish!\n\n<h3>A Festival Full of Fun and Friends!</h3>\nImagine a big, sparkling river, with hundreds of people waiting excitedly by its banks. Everyone is happy and chatting. It's not just any day; it's the day for a giant fishing competition! People have been waiting for this special day for a long, long time, like waiting for your birthday party!\n\nThis festival is like a giant family gathering for many villages that live near the river. People come from far and wide, wearing their most colorful clothes and big smiles. It's a day when everyone comes together to celebrate, laugh, and have a wonderful time.\n\n**Did you know?** Nigeria is a very big country in West Africa! It has so many different people and languages, like a giant rainbow of cultures! It's famous for its amazing music, yummy food, and beautiful artwork!\n\n<h3>Let's Go Catch Some Fish!</h3>\nWhen the special signal is given – maybe a drumbeat or a loud whistle – whoosh! All the fishermen and fisherwomen jump into the water! They use their traditional fishing nets and tools. These tools have been passed down from their grandmas and grandpas, so they are very special and old!\n\nIt's not just about catching any fish; everyone wants to catch the biggest fish! Imagine catching a fish that's almost as big as you are! The water splashes, people cheer loudly, and everyone is laughing and having so much fun. It's a very noisy, happy, and exciting sight to see!\n\n**Did you know?** Fish breathe underwater using special parts called gills! Gills help them take oxygen from the water, just like we use our lungs to breathe air! Fish can't breathe out of water for long, so they need to stay in their watery homes.\n\n<h3>More Than Just Fish in the Nets!</h3>\nBut wait, this festival is not *just* about catching fish. Oh no, it's about something even more important than a big catch: it's about friendship and peace! Sometimes, people from different villages might have small disagreements or little arguments, like when friends argue over a toy or who gets to play first.\n\nThis festival is a super special way to help everyone remember that they are all friends and neighbors, no matter what small problems they might have had. It's like when you play a fun game with someone you had a little fight with – you remember that you like playing together much more than arguing!\n\nEveryone comes together, forgetting their little worries. They shake hands, hug, and remember how much they like being together. It's a time for everyone to be kind and remember that working together is always better.\n\n**Did you know?** When people celebrate together, it helps them become better friends! Sharing food, music, and laughter makes everyone feel happy, connected, and part of one big team!\n\n<h3>Days of Joy and Sharing</h3>\nFor days before the big fishing day, there are lots of other wonderful things happening. People sing joyful songs, tell amazing stories about their ancestors, and dance to cheerful music that makes your feet want to move!\n\nThey wear their most beautiful and colorful clothes, looking like bright flowers dancing in a giant garden. Families cook and share lots of delicious food, like yummy jollof rice and tasty stews. Sharing food is a very big way to show love, kindness, and friendship in many parts of Africa!\n\nChildren play games, chase each other, and make new friends from other villages. The air is filled with happy sounds – music, laughter, and the smell of delicious cooking. It truly feels like a huge family reunion, where everyone is welcome.\n\n**Did you know?** Sharing a meal with someone is a very old and special way to become friends and show you care! It makes everyone feel warm and happy inside, and helps build trust between people.\n\n<h3>The Biggest Fish Wins!</h3>\nWhen the exciting fishing time is over, everyone gathers to see who caught the biggest fish. There's a lot of cheering and clapping for the winners! Everyone claps for the person with the biggest fish, and they feel very proud.\n\nBut even if someone doesn't catch the biggest fish, they still feel like a winner! Why? Because they had so much fun, laughed a lot, and spent happy time with all their friends and family. It's not just about winning; it's about being together.\n\nThe fish they catch are shared with everyone in the community. This makes sure that no one goes home without a piece of the festival feast. Sharing the catch is another wonderful way to show community spirit and kindness.\n\n**Did you know?** Some fish can change their colors to hide from other animals or to show off to their friends! It's like they have a magic camouflage cloak that helps them blend in or stand out!\n\n<h3>Making Peace Grow Stronger</h3>\nSo, how does catching fish help with peace? When everyone from different villages comes together, laughing, eating, dancing, and fishing side-by-side, they remember that they are all part of one big, happy family in Nigeria. They learn about each other and remember what makes them special.\n\nThey shake hands, hug, and promise to be kind and helpful to each other. It's like watering a special plant of friendship and peace, making it grow bigger and stronger every year. This festival helps people talk about any small problems they might have had and solve them with smiles.\n\nThey remember that celebrating together is much more fun than arguing. It makes their communities safer and happier for everyone, especially for kids like you!\n\n**Did you know?** When people work together, celebrate together, and help each other, it helps build strong communities! Strong communities are like a super team where everyone helps each other succeed and stay happy!\n\n<h3>A Festival for Everyone, Everywhere!</h3>\nThis amazing festival is not just for the grown-ups. Kids like you also come and enjoy all the fun! You can watch the exciting fishermen, listen to the lively music, and maybe even learn a new dance move or two!\n\nIt teaches everyone, even the littlest ones, how important it is to be kind, to share what you have, and to live in peace with all your neighbors. It shows that even a simple activity like fishing can bring so much joy and make the world a better, friendlier place. It’s a wonderful example for all of us.\n\n**Did you know?** Festivals all around the world are often a time for families and communities to come together, celebrate their culture, remember their history, and share happiness and traditions! They are like giant celebrations of life!\n\n<h3>Until Next Time, My Friends!</h3>\nSo, that's the wonderful story of the amazing fishing festival in Nigeria! It's a beautiful reminder that fun, friendship, and peace can grow anywhere, even by the side of a busy, sparkling river. Keep shining, my friends, and remember to always share kindness like they share fish at this awesome festival! See you on our next exciting African adventure!\n",
    "summary": "People in Nigeria celebrate a big fishing festival by a river, where everyone catches fish, dances, eats yummy food, and makes new friends to help their villages live in peace.",
    "whyMatters": "This festival is important because it brings everyone together to have fun, make friends, and remember to be kind to each other, helping different villages live happily and peacefully like a big family.",
    "category": "world",
    "date": "2026-02-22T04:12:54.837Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Fun%20and%20Friendship%20at%20Nigeria's%20Fishing%20Party!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-fun-and-friendship-at-nigerias-fishing-party",
    "originalLink": "https://www.bbc.com/news/articles/cwy6vdl3pxlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "title": "Rare prison sentences handed to Cameroon soldiers after killing of 21 civilians",
    "content": "In a rare occurence, three soldiers were handed jail terms for killings in the troubled Anglophone region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T04:12:59.942Z",
    "image": "https://image.pollinations.ai/prompt/Rare%20prison%20sentences%20handed%20to%20Cameroon%20soldiers%20after%20killing%20of%2021%20civilians%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rare-prison-sentences-handed-to-cameroon-soldiers-after-killing-of-21-civilians",
    "originalLink": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African farmers fear devastation as foot-and-mouth takes hold",
    "title": "South African farmers fear devastation as foot-and-mouth takes hold",
    "content": "The government has begun a vaccination programme but officials have been blamed for a slow response.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:13:05.053Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20farmers%20fear%20devastation%20as%20foot-and-mouth%20takes%20hold%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-farmers-fear-devastation-as-foot-and-mouth-takes-hold",
    "originalLink": "https://www.bbc.com/news/articles/ceqvjwre8vqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Russia-Ukraine war: List of key events, day 1,459",
    "title": "Russia-Ukraine war: List of key events, day 1,459",
    "content": "These are the key developments from day 1,459 of Russia’s war on Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:13:10.310Z",
    "image": "https://image.pollinations.ai/prompt/Russia-Ukraine%20war%3A%20List%20of%20key%20events%2C%20day%201%2C459%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russia-ukraine-war-list-of-key-events-day-1459",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/russia-ukraine-war-list-of-key-events-day-1459?traffic_source=rss"
  },
  {
    "originalTitle": "Trump to raise US global tariff from 10 to 15% after Supreme Court ruling",
    "title": "Trump to raise US global tariff from 10 to 15% after Supreme Court ruling",
    "content": "Move comes as businesses seek repayment for the estimated $133bn the Trump administration has already collected.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:13:15.408Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20to%20raise%20US%20global%20tariff%20from%2010%20to%2015%25%20after%20Supreme%20Court%20ruling%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-to-raise-us-global-tariff-from-10-to-15percent-after-supreme-court-ruling",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/trump-to-raise-us-global-tariff-from-ten-to-fifteen-percent-after-supreme-court-ruling?traffic_source=rss"
  },
  {
    "originalTitle": "Pakistan carries out strikes in Afghanistan, ‘killing and wounding dozens’",
    "title": "A Story About Neighbours Far Away",
    "content": "<h3>Hello, Wonderful Kids from Africa!</h3>\nHi everyone! It's your friendly news reporter here. I'm so glad to chat with you today. We're going to talk about something that happened very far away from our beautiful homes in Africa. Sometimes, big grown-ups in different countries have important things to talk about. We want to understand what's happening in our big world, even the sad parts, in a way that is easy to understand.\n\nToday, we are talking about two countries that are neighbours. Just like you might have a friend living next door to you, countries also have neighbours. We are going to learn about what happened between them. It’s important to remember that we are thinking of everyone involved. Let's learn together about what happened and why peace is so important everywhere.\n\n<h3>What Happened Far Away?</h3>\nImagine two big countries. These countries are called Pakistan and Afghanistan. They are very, very far from us. They are not in Africa, but in a place called Asia. They share a line between them, like a fence between two yards. This line is called a border.\n\nSomething sad happened near this border. One country, Pakistan, did something called 'strikes' in the other country, Afghanistan. This means they sent things, like from planes or rockets, to parts of Afghanistan. This made big noises and caused a lot of trouble.\n\nIt’s not like playing a game. When strikes happen, things can get broken, and people can get hurt. This is why it’s a very sad story to hear. We wish that all countries could always be friends and play nicely, just like we try to do with our friends and neighbours. Everyone wants to feel safe and happy.\n\n<h3>Who Are Pakistan and Afghanistan?</h3>\nPakistan is a country with many, many people. Afghanistan is also a country with many, many people. Think of them as big, big towns or homes, each with their own families and rules. They have different leaders and different ways of doing things, just like different families might have different ways.\n\nThey are very old countries with lots of history. Their people live, work, and play, just like we do here in Africa. They have schools where children learn, and homes where families live together. Sometimes, even when countries are neighbours, they can have disagreements or not see eye-to-eye on everything. This can sometimes lead to sad events.\n\nDid you know? Africa is a very big continent with 54 countries! Pakistan and Afghanistan are in a different continent called Asia.\n\n<h3>What Are \"Strikes\"?</h3>\nThis is a tricky word, but let's make it simple. When we say 'strikes' in this news, it means that one country sent things like rockets or used planes to hit places in another country. It's like throwing a very big, powerful stone from far away.\n\nThese strikes are not gentle. They can cause a lot of damage. They make loud noises that can scare people, especially children. They can break down buildings and hurt people who are nearby. This is why everyone hopes that strikes never happen, because they bring sadness and danger.\n\nImagine if someone threw stones at your school or your house – it would be very upsetting, right? That’s why strikes are a serious matter. We always hope for peaceful ways to solve problems, where no one gets hurt and nothing gets broken. It's much better to talk and share.\n\n<h3>Who Was Hurt?</h3>\nThis is the saddest part of the story. The strikes hit places where people live and learn. The Afghan defence ministry, which is a group of grown-ups who look after the country's safety, said that the strikes hit a school. Imagine your own school being hit!\n\nThey also said that the strikes hit people's homes. Homes are where families feel safe and warm. Many people were hurt, and some even lost their lives. This means that boys and girls, mothers and fathers, and grandmas and grandpas were affected. It makes us very, very sad to hear this.\n\nWhen people get hurt, they need doctors and nurses to help them get better. They need comfort and care. It is a very difficult time for them. Our hearts go out to all the children and grown-ups who were hurt or scared by these events. Everyone deserves to be safe in their homes and at school.\n\nDid you know? Schools are special places where children learn many new and exciting things every day!\n\n<h3>What is a \"Defence Ministry\"?</h3>\nIn every country, there are important grown-ups who have special jobs. One of these groups is called the 'defence ministry'. Their job is to keep their country and its people safe. They are like a big team of protectors.\n\nThey work hard to make sure that no one comes into their country to cause harm. They also help to protect the country's borders. When something important happens, like these strikes, the defence ministry will tell everyone what happened. They collect information and share it with the world.\n\nThey are like the big brothers or sisters of the country, always looking out for their family. They want their people to be safe from danger. So, when the Afghan defence ministry said that schools and homes were hit, they were telling everyone the important and sad news about what happened in their country.\n\nDid you know? Governments around the world have ministries for many things, like schools, health, and even sports!\n\n<h3>Why is Peace Important?</h3>\nPeace is a wonderful word. It means that everyone is calm, happy, and safe. When there is peace, there is no fighting, no loud bangs, and no one is scared. People can play, learn, and live together without worrying about being hurt.\n\nIn a peaceful world, neighbours get along, and countries talk to each other kindly. Children can go to school without fear, and families can sleep soundly in their homes. When strikes happen, it breaks the peace. It makes people scared and sad.\n\nWe all wish for peace everywhere in the world. Peace is like a warm, sunny day where everyone can smile. It makes our communities strong and happy. Every country, including Pakistan and Afghanistan, deserves to live in peace. When we choose kindness and understanding, we are choosing peace.\n\nDid you know? Many people around the world work very hard every day to try and bring peace to places where there is trouble.\n\n<h3>How Can We Be Good Neighbours?</h3>\nEven though this happened far away, we can still learn something very important from it. We can all be good neighbours right where we are! Being a good neighbour means being kind and helpful to the people around us.\n\nIt means sharing our toys, playing fair, and helping a friend if they fall down. If we have a disagreement, we can talk about it instead of fighting. We can say sorry if we make a mistake. These small things make a very big difference in our own communities and homes.\n\nImagine if everyone in every country tried to be a good neighbour. The world would be a much happier and safer place! We can start by being kind to our own friends and family. Every act of kindness helps build a more peaceful world. Let's spread kindness like sunshine!\n\nDid you know? Being kind to others can make you feel happy too!\n\n<h3>Our Big Wish for Everyone!</h3>\nSo, dear kids, we have learned about a sad event far away. We wish for the people in Pakistan and Afghanistan to find safety and peace very soon. We hope that their homes and schools will be safe again, and that no one else gets hurt.\n\nIt's important to remember that even when sad things happen, there are always people working to help and bring peace. Let's send our good thoughts to everyone affected. And let’s remember to always choose kindness, understanding, and peace in our own lives, every single day.\n\nThank you for listening, my wonderful friends. You are all amazing, and together, we can hope for a brighter, more peaceful world for everyone. Keep shining your beautiful lights!",
    "category": "world",
    "date": "2026-02-22T04:13:37.352Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Neighbours%20Far%20Away%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-neighbours-far-away",
    "originalLink": "https://www.aljazeera.com/news/2026/2/22/pakistan-carries-out-strikes-in-afghanistan-after-islamabad-suicide-attack?traffic_source=rss"
  },
  {
    "originalTitle": "Iran students stage first large anti-government protests since deadly crackdown",
    "title": "Iran students stage first large anti-government protests since deadly crackdown",
    "content": "The student protesters honoured thousands of those killed when nationwide mass protests were put down last month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:13:42.767Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20students%20stage%20first%20large%20anti-government%20protests%20since%20deadly%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-students-stage-first-large-anti-government-protests-since-deadly-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "title": "Killing of nationalist student leaves French far left in deep trouble as elections loom",
    "content": "Far-left militants are suspected of being behind Quentin Deranque's death and the party of Jean-Luc Mélenchon is being widely condemned.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-22T04:13:47.872Z",
    "image": "https://image.pollinations.ai/prompt/Killing%20of%20nationalist%20student%20leaves%20French%20far%20left%20in%20deep%20trouble%20as%20elections%20loom%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "killing-of-nationalist-student-leaves-french-far-left-in-deep-trouble-as-elections-loom",
    "originalLink": "https://www.bbc.com/news/articles/cnv61zv534eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nasa astronauts' moon mission delayed due to rocket issue",
    "title": "Nasa astronauts' moon mission delayed due to rocket issue",
    "content": "The mission to the far side of the Moon and back will be postponed after problems with were spotted with its rocket, a Nasa official said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-22T04:13:52.983Z",
    "image": "https://image.pollinations.ai/prompt/Nasa%20astronauts'%20moon%20mission%20delayed%20due%20to%20rocket%20issue%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nasa-astronauts-moon-mission-delayed-due-to-rocket-issue",
    "originalLink": "https://www.bbc.com/news/articles/c626v265zqlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "O'Reilly scores twice as Man City beat Newcastle",
    "title": "O'Reilly scores twice as Man City beat Newcastle",
    "content": "Manchester City move to within two points of Premier League leaders Arsenal with a tense victory against Newcastle United at Etihad Stadium.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:13:58.396Z",
    "image": "https://image.pollinations.ai/prompt/O'Reilly%20scores%20twice%20as%20Man%20City%20beat%20Newcastle%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "oreilly-scores-twice-as-man-city-beat-newcastle",
    "originalLink": "https://www.bbc.com/sport/football/videos/cre09v8yglqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "title": "Ten-man Chelsea drop points again as Burnley score stoppage-time equaliser",
    "content": "Chelsea make it 17 points dropped from winning positions in the Premier League this season as Zian Flemming's 93rd-minute header gives Burnley a 1-1 draw, after Wesley Fofana is sent off at Stamford Bridge.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-22T04:14:03.509Z",
    "image": "https://image.pollinations.ai/prompt/Ten-man%20Chelsea%20drop%20points%20again%20as%20Burnley%20score%20stoppage-time%20equaliser%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ten-man-chelsea-drop-points-again-as-burnley-score-stoppage-time-equaliser",
    "originalLink": "https://www.bbc.com/sport/football/videos/cedz2v0edpgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Late Abraham goal rescues point for Villa against Leeds",
    "title": "Late Abraham goal rescues point for Villa against Leeds",
    "content": "Tammy Abraham comes off the bench to score an 88th minute equaliser to cancel out Anton Stach's spectacular freekick, as Aston Villa rescue a 1-1 draw against Leeds United at Villa Park in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-22T04:14:08.611Z",
    "image": "https://image.pollinations.ai/prompt/Late%20Abraham%20goal%20rescues%20point%20for%20Villa%20against%20Leeds%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "late-abraham-goal-rescues-point-for-villa-against-leeds",
    "originalLink": "https://www.bbc.com/sport/football/videos/cy8gn54mr0jo?at_medium=RSS&at_campaign=rss"
  }
]