[
  {
    "originalTitle": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "title": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "content": "The president’s son, notorious for explosive remarks on X, has ambitions to  succeed his father.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-31T04:01:37.636Z",
    "image": "https://image.pollinations.ai/prompt/This%20army%20chief%20threatened%20to%20castrate%20opposition%20leader%20and%20claimed%20descent%20from%20Jesus%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "this-army-chief-threatened-to-castrate-opposition-leader-and-claimed-descent-from-jesus",
    "originalLink": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mali lawmaker jailed in Ivory Coast for insulting president",
    "title": "A Story About Words and Getting Along!",
    "content": "Hello, my wonderful friends all across Africa! It's your kid-friendly news reporter here, ready to share a very important story. Today, we're talking about words – and how powerful they can be! \n\nWe have some news from two amazing countries in our big African family: Mali and Ivory Coast. Imagine your house next door to your best friend's house. That's kind of how countries are – they are neighbors! And just like you want to be kind to your neighbors, countries try to be kind to each other too.\n\n<h3>A Story About Words and Countries</h3>\n\nSometimes, things happen that make it a little tricky for countries to always be friends. We have a story about a man named Mamadou Hawa Gassama. He is from the country of Mali. And he said some things about the leader of another country, Ivory Coast, that were not very friendly. Because of these words, he is now in a special place called jail in Ivory Coast.\n\nThis might sound a bit confusing, but don't worry! We will explain everything simply, so you can understand this important news. It's all about how we speak about each other, especially when we are from different places.\n\n<h3>Who is Mamadou Hawa Gassama?</h3>\n\nMamadou Hawa Gassama is what we call a 'lawmaker.' What's a lawmaker? Well, imagine your school has rules, right? And maybe some older students or teachers help make those rules so everyone can get along and learn safely. A lawmaker is like that, but for a whole country! They help make the big rules and laws for all the people in their country.\n\nMr. Gassama is a lawmaker for Mali. Mali is a beautiful country in West Africa, known for its amazing music and friendly people. He was visiting Ivory Coast, which is another beautiful country, also in West Africa, famous for its delicious cocoa and lovely beaches.\n\nDid you know? Mali and Ivory Coast are like brothers and sisters on the map! They share a border, which is like an invisible line on the ground that shows where one country ends and another begins.\n\n<h3>Who is President Alassane Ouattara?</h3>\n\nNow, let's talk about the leader of Ivory Coast. His name is President Alassane Ouattara. What does a 'President' do? A president is like the head teacher of the whole country! They are in charge of making sure everything runs smoothly, that people are safe, and that the country grows and thrives.\n\nIt's a very big and important job! Presidents work hard to help their people, make decisions, and also make sure their country gets along with other countries around the world, especially their neighbors.\n\nDid you know? Presidents in Africa often meet each other to talk about important things, like how to share water, build roads, or even fight diseases. They try to be good friends!\n\n<h3>What Were the Mean Words?</h3>\n\nSo, what did Mamadou Hawa Gassama say? He said some words about President Ouattara that were not kind at all. The people who work to keep the rules, called 'prosecutors,' said that Mr. Gassama called President Ouattara a 'tyrant' and 'an enemy of Mali.'\n\nLet's break those words down. A 'tyrant' is like someone who is a boss but is very mean and unfair. They might make everyone do what they want without listening to others. And 'an enemy of Mali' means someone who is not a friend to Mali, but rather against it.\n\nThese are very strong words, aren't they? Imagine if someone called your best friend a 'bully' and 'your enemy.' How would that make your friend feel? Probably very sad and upset!\n\n<h3>Why Are Words So Important?</h3>\n\nThis story shows us how important our words are. Words can build bridges of friendship, or they can build walls of misunderstanding. When someone from one country says mean things about the leader of another country, it can cause big problems between those two countries.\n\nIt's like if you said mean things about your friend's parents. It might make your friend upset, and they might not want to play with you anymore. Countries are a bit like that. They need to respect each other's leaders and people to stay friendly.\n\nDid you know? In many places, it's a rule that you shouldn't say very mean or false things about a country's leader, especially if you are a leader yourself. This helps keep peace and respect between countries.\n\n<h3>What Happened Next?</h3>\n\nBecause of the strong and unkind words Mr. Gassama used, the authorities in Ivory Coast decided that he had broken a rule. So, they put him in jail. Being 'jailed' means you are put in a special building because you have broken a law or rule. It's a way for countries to make sure everyone follows the rules and treats each other with respect.\n\nThis situation is making many people think about how countries should talk to each other. It reminds us that even though we might not always agree with what other people or leaders do, it's important to talk about it in a kind and respectful way.\n\nSometimes, when people say hurtful things, it can make it harder for countries to work together on important things, like building schools or sharing food. So, keeping kind words is really important for everyone.\n\n<h3>Being Good Neighbors</h3>\n\nThink about your neighborhood. When everyone is kind, respectful, and helps each other, it's a happy place, right? The same is true for countries! When Mali and Ivory Coast, and all the other countries in Africa, are kind and respectful to each other, our whole continent becomes a happier and stronger place.\n\nThis story is a big lesson for all of us, no matter how old we are. It teaches us that words have power. We should always try to use our words to build people up, not to tear them down. We should speak kindly about others, even if they are different from us or come from a different place.\n\nDid you know? Africa has 54 different countries! That's a lot of neighbors, and it's super important for them all to get along and work together.\n\n<h3>Learning from This Story</h3>\n\nSo, what can we learn from this news? We can learn that respect is super important. We should respect other people, their ideas, and especially their leaders, even if we don't always agree with them. We can also learn that sometimes, if you say very strong and unkind things, there can be consequences.\n\nJust like in your school, if you say something mean to a friend, you might have to say sorry or face a small punishment. In the world of countries, saying mean things about leaders can have bigger consequences, like someone going to jail, or countries becoming less friendly with each other.\n\n<h3>Let's Be Friends!</h3>\n\nLet's all remember to use our words wisely. Let's choose words that build bridges and make friends, instead of words that cause trouble. Because when we are all kind and respectful to each other, our whole African family, and the whole world, becomes a better place for everyone!\n\nThat's all for today's news, my amazing friends! Keep being kind, keep learning, and keep shining bright!",
    "summary": "A lawmaker from Mali was jailed in Ivory Coast because he said unkind words about the President of Ivory Coast, teaching us that words are powerful and respect between countries is very important.",
    "whyMatters": "This story matters because it shows us how important it is for people and countries to speak kindly and respectfully to each other. Saying mean things can cause big problems between neighbors and even between whole countries, so we must always try to use our words to build friendship, not cause trouble.",
    "category": "politics",
    "date": "2026-01-31T04:01:56.900Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Words%20and%20Getting%20Along!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-words-and-getting-along",
    "originalLink": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa and Israel expel each other's envoys in diplomatic row",
    "title": "South Africa and Israel expel each other's envoys in diplomatic row",
    "content": "South Africa accuses the Israeli envoy of insulting President Ramaphosa. Israel says the expulsion is \"baseless\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-31T04:02:18.750Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20and%20Israel%20expel%20each%20other's%20envoys%20in%20diplomatic%20row%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-and-israel-expel-each-others-envoys-in-diplomatic-row",
    "originalLink": "https://www.bbc.com/news/articles/cvgn8ejljqwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US approves $6.6bn sale of attack helicopters, assault vehicles to Israel",
    "title": "US approves $6.6bn sale of attack helicopters, assault vehicles to Israel",
    "content": "The approved sale includes 30 Apache helicopters, which Israeli forces have used to attack Palestinians in Gaza.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:02:24.027Z",
    "image": "https://image.pollinations.ai/prompt/US%20approves%20%246.6bn%20sale%20of%20attack%20helicopters%2C%20assault%20vehicles%20to%20Israel%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-approves-dollar66bn-sale-of-attack-helicopters-assault-vehicles-to-israel",
    "originalLink": "https://www.aljazeera.com/news/2026/1/31/us-approves-6-6bn-sale-of-attack-helicopters-assault-vehicles-to-israel?traffic_source=rss"
  },
  {
    "originalTitle": "US Senate approves spending package, but short government shutdown likely",
    "title": "US Senate approves spending package, but short government shutdown likely",
    "content": "US gov't funding impasse driven by Democratic anger over federal agents killing two people during immigration crackdown.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:02:29.192Z",
    "image": "https://image.pollinations.ai/prompt/US%20Senate%20approves%20spending%20package%2C%20but%20short%20government%20shutdown%20likely%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-senate-approves-spending-package-but-short-government-shutdown-likely",
    "originalLink": "https://www.aljazeera.com/news/2026/1/31/us-senate-approves-spending-package-but-short-government-shutdown-likely?traffic_source=rss"
  },
  {
    "originalTitle": "T20 World Cup 2026 stadiums: Where’s India vs Pakistan and the final?",
    "title": "Get Ready for a Big Cricket Party in 2026!",
    "content": "Hello, wonderful friends in Africa! It's your kid-friendly reporter here, ready to share some super exciting news from around the world! Are you ready for some fun? We're going to talk about a really big sports event that's coming up. It's called the T20 Cricket World Cup, and it's happening in 2026! That's just a few years away, but it's never too early to get excited!\n\n<h3>What is the T20 Cricket World Cup?</h3>\nImagine a huge party where teams from different countries come together to play a super fun game called cricket! That's what the T20 Cricket World Cup is all about. It's a special kind of cricket game called 'T20' because each team gets to bat for 20 'overs'. An 'over' is when one bowler throws the ball six times. So, it's a very fast and exciting game, not too long, so it's perfect for watching!\n\n<p><strong>Did you know?</strong> Cricket is played with a bat and a ball, a bit like baseball, but it has different rules and a special field with three sticks called 'wickets' that players try to knock down!</p>\n\n<p>Teams from all over the world, like India, England, Australia, South Africa, and many more, will play against each other. They want to find out which country has the very best cricket team. It's like a big competition to see who can hit the most runs and take the most wickets!</p>\n\n<h3>Where Will This Big Party Be?</h3>\nThis amazing cricket party will take place in two beautiful countries: India and Sri Lanka! These countries are in Asia, and they really love cricket. They have some of the biggest and most colourful cricket stadiums in the world.\n\n<p>Imagine a stadium as a giant, giant playground made just for sports! Thousands and thousands of people can sit inside these stadiums to watch the games live. It's like a huge bowl, and everyone cheers really loudly for their favourite teams. For the T20 World Cup in 2026, there will be eight big stadiums where all the matches will be played. Eight different giant playgrounds!</p>\n\n<p><strong>Did you know?</strong> India has the biggest cricket stadium in the world! It's called the Narendra Modi Stadium, and it can hold more than 130,000 people! That's more people than live in many small towns!</p>\n\n<h3>Super Special Games to Watch Out For</h3>\nWhen you have so many teams playing, some games are extra special. One of the most exciting games that many people look forward to is when India plays against Pakistan. These two countries are neighbours, and when their cricket teams play, it's a huge event! Everyone watches because it's like a friendly rivalry, where both teams try their very best to win.\n\n<p>It's like when two really good friends at school play a game, and they both try super hard to be the winner. Everyone gets excited and cheers loudly for their team! These big games bring lots of smiles and happy moments, even if only one team wins.</p>\n\n<p><strong>Did you know?</strong> India and Pakistan have played cricket against each other for many, many years, and their matches are always full of excitement and big moments!</p>\n\n<h3>The Grand Finale!</h3>\nAfter many games, where teams try to win and move forward, there will be one very, very special game. This game is called the 'Final'! The Final is the last game of the whole tournament. Only the two best teams, the ones who have won almost all their matches, get to play in the Final.\n\n<p>The Final game is super important because the team that wins it will be the champion! They will lift a big, shiny trophy and be known as the best T20 cricket team in the world until the next World Cup. Everyone watches the Final with bated breath, wondering who will win the big prize.</p>\n\n<p><strong>Did you know?</strong> The trophy for the T20 World Cup is a very beautiful silver cup that represents courage, teamwork, and winning!</p>\n\n<h3>Why is This News Important and Fun for Us?</h3>\nEven though the T20 World Cup in 2026 is happening far away in India and Sri Lanka, it's still fun for us to know about it. Watching sports like cricket teaches us about teamwork, fair play, and never giving up. It shows us how people from different countries can come together and play a game respectfully.\n\n<p>Maybe one day, some of you amazing kids from Africa will grow up to be fantastic cricket players and represent your own countries in a big tournament like this! Watching these games can inspire us to play sports, stay healthy, and dream big. So let's all get ready to cheer loudly for our favourite teams when the T20 Cricket World Cup comes around in 2026!</p>\n\n<p>It's going to be a fantastic show, full of amazing catches, big hits, and thrilling moments. Keep an eye out for more news as we get closer to 2026! This is your kid-friendly reporter signing off. Stay curious and keep smiling!</p>",
    "summary": "Get ready for the T20 Cricket World Cup in 2026, a big sports party where teams from many countries, including India and Pakistan, will play exciting, fast-paced cricket games in India and Sri Lanka to find out who is the world champion!",
    "whyMatters": "This is important because it's a big global event that celebrates sportsmanship, teamwork, and brings different countries together through the fun game of cricket, inspiring kids to dream big and play sports.",
    "category": "world",
    "date": "2026-01-31T04:02:46.741Z",
    "image": "https://image.pollinations.ai/prompt/Get%20Ready%20for%20a%20Big%20Cricket%20Party%20in%202026!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "get-ready-for-a-big-cricket-party-in-2026",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/31/icc-t20-world-cup-2026-cricket-stadiums-india-vs-pakistan-final-venue?traffic_source=rss"
  },
  {
    "originalTitle": "Takeaways from the millions of newly released Epstein files ",
    "title": "Takeaways from the millions of newly released Epstein files ",
    "content": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:02:52.394Z",
    "image": "https://image.pollinations.ai/prompt/Takeaways%20from%20the%20millions%20of%20newly%20released%20Epstein%20files%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "takeaways-from-the-millions-of-newly-released-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cevnmxyy4wjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Schitt's Creek and Home Alone star Catherine O'Hara dies aged 71",
    "title": "Schitt's Creek and Home Alone star Catherine O'Hara dies aged 71",
    "content": "The Emmy-winning actress died at her home in Los Angeles on Friday after a brief illness, her agent said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-31T04:02:57.552Z",
    "image": "https://image.pollinations.ai/prompt/Schitt's%20Creek%20and%20Home%20Alone%20star%20Catherine%20O'Hara%20dies%20aged%2071%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "schitts-creek-and-home-alone-star-catherine-ohara-dies-aged-71",
    "originalLink": "https://www.bbc.com/news/articles/czr4jn4621lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UN risks 'imminent financial collapse', secretary general warns",
    "title": "UN risks 'imminent financial collapse', secretary general warns",
    "content": "António Guterres says the international body could run out of money by July due to members' unpaid fees.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:03:02.718Z",
    "image": "https://image.pollinations.ai/prompt/UN%20risks%20'imminent%20financial%20collapse'%2C%20secretary%20general%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "un-risks-imminent-financial-collapse-secretary-general-warns",
    "originalLink": "https://www.bbc.com/news/articles/cr579mdv4m7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Are Arsenal fans making team nervous in title race?",
    "title": "Are Arsenal fans making team nervous in title race?",
    "content": "Is a nervousness among Arsenal fans affecting the players in the Premier League title race? Alex Howell looks at what impact this could have on Mikel Arteta's side as they look to end a run of three second-placed finishes.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:03:08.346Z",
    "image": "https://image.pollinations.ai/prompt/Are%20Arsenal%20fans%20making%20team%20nervous%20in%20title%20race%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "are-arsenal-fans-making-team-nervous-in-title-race",
    "originalLink": "https://www.bbc.com/sport/football/articles/cg4edzx94peo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Carrick not ruling out Man Utd deadline day moves",
    "title": "Carrick not ruling out Man Utd deadline day moves",
    "content": "Manchester United's interim head coach Michael Carrick is not ruling out the possibility of the club doing business on transfer deadline day",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:03:13.511Z",
    "image": "https://image.pollinations.ai/prompt/Carrick%20not%20ruling%20out%20Man%20Utd%20deadline%20day%20moves%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "carrick-not-ruling-out-man-utd-deadline-day-moves",
    "originalLink": "https://www.bbc.com/sport/football/articles/c0mk7z174e9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Benfica meet Real in play-offs after dramatic league phase encounter",
    "title": "Benfica meet Real in play-offs after dramatic league phase encounter",
    "content": "Benfica will face Real Madrid in the Champions League play-offs just three weeks after their dramatic league phase encounter.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T04:03:18.672Z",
    "image": "https://image.pollinations.ai/prompt/Benfica%20meet%20Real%20in%20play-offs%20after%20dramatic%20league%20phase%20encounter%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "benfica-meet-real-in-play-offs-after-dramatic-league-phase-encounter",
    "originalLink": "https://www.bbc.com/sport/football/articles/cgk86k8rllmo?at_medium=RSS&at_campaign=rss"
  }
]