[
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "Helping Babies Stay Healthy and Safe!",
    "content": "Hello, my super friends! Have you ever had a little boo-boo or felt a bit sniffly? Doctors and nurses are amazing people who help us feel better, right? Today, we have an important story from a country far away in Africa called Guinea-Bissau. It's about helping tiny babies stay healthy, and why being fair is super important!\n\n<h3>Tiny Babies and Big Plans</h3>\n\nImagine a brand new baby, just born! Babies are so small and need lots of care. Sometimes, babies can get sick from tiny, tiny germs that we can't even see. These germs can make them feel poorly. Doctors all over the world work very hard to find ways to keep babies healthy and strong.\n\nIn Guinea-Bissau, some doctors and helpers had a big plan. They wanted to try out a way to give special medicine to babies. This medicine helps fight a germ called Hepatitis B. It’s like giving babies a super shield to protect them from getting sick.\n\n<h3>What is Hepatitis B?</h3>\n\nHepatitis B sounds like a big, fancy word, doesn't it? But it's just the name of a tiny germ. This germ can make people, even tiny babies, feel very tired and sick. It can make their tummies hurt and make them not want to play. It's a germ that doctors really want to fight!\n\nLuckily, there's already a good medicine that can help stop this germ. It's like a special shot that makes your body strong to fight it off. So, if you get this medicine, you are much safer from this germ.\n\nDid you know? Your body is amazing at fighting off germs! But sometimes it needs a little help from medicines or vaccines to learn how to fight new or strong germs.\n\n<h3>Testing New Ways to Help</h3>\n\nSometimes, doctors want to find even better ways to give medicine or to make sure it works perfectly for everyone. This is called a 'trial' or a 'study'. It's like when you try a new game to see if it's fun and fair for everyone playing. Doctors might give some people a new kind of medicine, or try giving a known medicine in a new way, to see if it helps even more people.\n\nIn this story, the doctors wanted to try a new way to give the Hepatitis B medicine to babies in Guinea-Bissau. They wanted to see if their new plan worked very well.\n\nDid you know? Doctors and scientists spend many, many years learning and trying new things to help people stay healthy. They are like health superheroes!\n\n<h3>The Problem: Not Fair for All Babies</h3>\n\nHere's where the story gets a little tricky. The plan was to give the special Hepatitis B medicine to *some* of the new babies. But *other* babies in the same place would *not* get the medicine. Even though the doctors knew the medicine could help protect them.\n\nImagine you have a basket of yummy cookies. You give some cookies to your friends, but then you say to others, \"Sorry, no cookies for you!\" even though everyone is hungry. That wouldn't feel fair, would it? It's the same with medicine that helps people stay healthy.\n\nDoctors and helpers want *all* babies to be safe and healthy. So, when some babies would get the super shield, and others wouldn't, it made some important people worried.\n\n<h3>Who Spoke Up? The WHO!</h3>\n\nThere's a very special group of super doctors and health helpers from all over the world. They are called the WHO, which stands for the World Health Organization. Think of them as the biggest team of health experts on the planet! Their job is to make sure people everywhere are healthy and treated fairly.\n\nWhen the WHO heard about the plan for the babies in Guinea-Bissau, they said, \"Wait a minute! This is not fair!\" They said it was 'unethical'. That's a big word that means \"not right\" or \"not kind\" or \"not fair\" in a very important way.\n\nDid you know? The WHO works with countries all around the world, like a giant helping hand, to fight diseases, make sure doctors have good training, and help everyone get good health care.\n\n<h3>Why Fairness is So Important</h3>\n\nThe WHO explained that if there's medicine that we *know* can help babies stay safe from a germ like Hepatitis B, then *all* the babies who need it should get it. It's not fair to say, \"You get the medicine, but you don't,\" especially when it's about staying healthy and safe.\n\nThey said it’s super important that when doctors try new things to help people, they always make sure *everyone* is treated fairly and kindly. No one should be left out, especially little babies who can't speak for themselves.\n\nDid you know? Every child, no matter where they live, deserves a chance to grow up healthy and strong! That's what many helpers around the world believe.\n\n<h3>What Happens Now?</h3>\n\nBecause the WHO spoke up, the doctors and helpers who made the original plan are now going to talk some more. They will work together to find a way to help all the babies in Guinea-Bissau get the medicine they need, in a way that is fair and kind to everyone.\n\nIt shows that even when people have good ideas, it’s important for others to look at the plan and make sure it’s the best and fairest way to help. Everyone wants babies to be healthy and safe!\n\nSo, the story reminds us that doctors are amazing, and they always want to help. But the very best way to help is always with fairness, kindness, and making sure everyone gets a chance to be healthy. Hooray for fairness and healthy babies!",
    "category": "world",
    "date": "2026-02-14T18:28:00.773Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Babies%20Stay%20Healthy%20and%20Safe!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-babies-stay-healthy-and-safe",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Money Flowers are Blooming in Kenya!",
    "content": "Jambo, amazing kids of Africa! It's me, your friendly news reporter, here to tell you a super cool story from our wonderful continent. Today, we're flying over to a beautiful country called Kenya! Have you ever heard of Kenya? It's famous for its amazing wildlife like lions, elephants, and giraffes! But guess what else is making news there? Something shiny and green… and sometimes colourful too! It’s all about special gifts, and it's a bit different from what you might expect!\n\n<h3>What Are Bouquets?</h3>\nOkay, let's start with something you might know. Have you ever seen a beautiful bunch of flowers? Maybe your mom or dad got some for a special day. We call these a 'bouquet' (say it like: boo-KAY). Bouquets are usually made of lovely flowers like roses, lilies, or sunflowers. People give flower bouquets to show love, to say 'thank you,' or to celebrate happy times. They smell nice and look very pretty!\n\nDid you know? The national flower of Kenya is the Orchid! Orchids are very beautiful and come in many different colours.\n\n<h3>Introducing... Cash Bouquets!</h3>\nNow, imagine taking those lovely flowers out of the bouquet. And instead, putting in... MONEY! Yes, you heard me right! In Kenya, many people have started giving 'cash bouquets.' These are bouquets that are not made of flowers, but of real money! Grown-ups take bank notes, fold them up carefully, and arrange them just like a bunch of flowers. They put them on sticks or wires, and sometimes add a few real flowers or ribbons to make them look extra special. It's like a bunch of money flowers!\n\n<h3>Why Are They So Popular?</h3>\nSo, why are these money flowers so popular, especially for big celebrations? Well, think about it! When you get flowers, they are lovely, but they don't last forever. After a few days, they start to wilt. But if you get a cash bouquet? You can use the money for anything you need! You can buy new shoes, school books, yummy food, or save it for something big. Money is very useful, right? People love getting money because it helps them buy things they truly need or want.\n\nDid you know? The money used in Kenya is called the 'Kenyan Shilling'! It has pictures of famous Kenyan leaders and animals on it.\n\n<h3>Who Gives Cash Bouquets and When?</h3>\nThese cash bouquets have become a big hit for many special days. You might see them given for birthdays, graduation parties (when someone finishes school!), or even on Valentine's Day. Valentine's Day is a day when people show love and appreciation to their friends, family, and loved ones. Instead of a bunch of red roses, someone might get a bouquet of crisp, new Kenyan Shillings! It’s a very exciting gift to receive. Friends give them to friends, parents give them to their children, and even husbands give them to their wives. It's a fun and practical way to show someone you care.\n\nDid you know? Nairobi is the capital city of Kenya! It's a very busy and exciting city, with tall buildings and lots of people.\n\n<h3>Uh Oh! A Little Warning Light!</h3>\nNow, here comes a tiny twist in our story. While cash bouquets are super exciting, some grown-ups are starting to give a little warning. It's like when your mom tells you to be careful when crossing the road. It doesn't mean crossing the road is bad, just that you need to be smart and safe! The same goes for these money flowers. Some important people, like those who help manage money in the country, are saying we should be a little careful.\n\n<h3>Why Be Careful with Money Flowers?</h3>\nWhy the warnings? Well, there are a few reasons.\n*   **Missing Money:** Imagine you get a big bouquet of money. If it's not held together very well, some of the money notes could fall out! That would be very sad to lose your gift.\n*   **Dirty Money:** Sometimes, money can get dirty or damaged if it's handled too much or exposed to things like rain. We want our money to stay clean and fresh!\n*   **Safety First:** When a lot of money is given as a gift, especially if it's a very big amount, grown-ups need to be sure where that money came from. It's important to make sure all money is 'good money' and not from bad activities. This helps keep everyone safe and keeps the country's money system healthy.\n*   **For the Banks:** Banks help us keep our money safe. When money is given in a bouquet, it's not usually recorded by a bank. For very big amounts, it's usually better to put money in a bank, where it's safe and easy to keep track of.\n\nDid you know? Kenya is famous for its long-distance runners! Many Olympic champions come from Kenya.\n\n<h3>What Does This Mean for You?</h3>\nSo, does this mean cash bouquets are bad? Not at all! It just means we need to be smart about how we give and receive them. If someone gives you a cash bouquet, make sure the money is real and handled carefully. Maybe count it right away and then ask a grown-up to help you put it in a safe place, like a bank! It's always good to talk to your parents or a trusted grown-up about any big money gifts.\n\nSo, kids, whether it's a beautiful flower bouquet or an exciting cash bouquet, gifts are a wonderful way to show love and appreciation. Just remember to be smart and safe with your special treasures. That's all the news from Kenya for today! This is your African news reporter signing off. Stay curious and keep learning!",
    "summary": "People in Kenya love giving special gifts called 'cash bouquets,' which are money folded like flowers, but grown-ups are now saying we need to be careful with them.",
    "whyMatters": "This is important because it teaches us to be smart and safe when giving or getting money as a gift, so no one loses money and everyone stays honest.",
    "category": "world",
    "date": "2026-02-14T18:28:24.773Z",
    "image": "https://image.pollinations.ai/prompt/Money%20Flowers%20are%20Blooming%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "money-flowers-are-blooming-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:28:29.870Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Iran, US spar as diaspora organises rallies abroad calling for action",
    "title": "Iran, US spar as diaspora organises rallies abroad calling for action",
    "content": "Iranian families release footage online commemorating loved ones shot during nationwide antigovernment protests.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-14T18:28:35.062Z",
    "image": "https://image.pollinations.ai/prompt/Iran%2C%20US%20spar%20as%20diaspora%20organises%20rallies%20abroad%20calling%20for%20action%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-us-spar-as-diaspora-organises-rallies-abroad-calling-for-action",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/iran-us-spar-as-diaspora-organises-rallies-abroad-calling-for-action?traffic_source=rss"
  },
  {
    "originalTitle": "LIVE: Real Madrid vs Real Sociedad – La Liga",
    "title": "LIVE: Real Madrid vs Real Sociedad – La Liga",
    "content": "Follow the build-up, analysis and live text commentary of the game as Madrid have a chance to go top of La Liga.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:28:40.165Z",
    "image": "https://image.pollinations.ai/prompt/LIVE%3A%20Real%20Madrid%20vs%20Real%20Sociedad%20%E2%80%93%20La%20Liga%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "live-real-madrid-vs-real-sociedad-la-liga",
    "originalLink": "https://www.aljazeera.com/sports/liveblog/2026/2/14/live-real-madrid-vs-real-sociedad-la-liga?traffic_source=rss"
  },
  {
    "originalTitle": "India’s Suryakumar shrugs off rain threat to Pakistan T20 World Cup game",
    "title": "India’s Suryakumar shrugs off rain threat to Pakistan T20 World Cup game",
    "content": "Pakistan on Monday reversed their decision to boycott their T20 World Cup match against India, but rain could intervene.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:28:45.272Z",
    "image": "https://image.pollinations.ai/prompt/India%E2%80%99s%20Suryakumar%20shrugs%20off%20rain%20threat%20to%20Pakistan%20T20%20World%20Cup%20game%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "indias-suryakumar-shrugs-off-rain-threat-to-pakistan-t20-world-cup-game",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/indias-suryakumar-shrugs-off-rain-threat-to-pakistan-t20-world-cup-game?traffic_source=rss"
  },
  {
    "originalTitle": "Rubio says US and Europe 'belong together' despite tensions",
    "title": "Rubio says US and Europe 'belong together' despite tensions",
    "content": "The US Secretary of State reassures European leaders that the Trump administration backs the transatlantic alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:28:50.672Z",
    "image": "https://image.pollinations.ai/prompt/Rubio%20says%20US%20and%20Europe%20'belong%20together'%20despite%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rubio-says-us-and-europe-belong-together-despite-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c2lrdq47149o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:28:55.766Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Police activity under way near Nancy Guthrie's home",
    "content": "A search has been carried out in Tuscon, Arizona, close to where the 84-year-old was abducted nearly two weeks ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:29:00.865Z",
    "image": "https://image.pollinations.ai/prompt/Police%20activity%20under%20way%20near%20Nancy%20Guthrie's%20home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-activity-under-way-near-nancy-guthries-home",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mansfield's Reed scores fabulous free-kick to upset Burnley",
    "title": "Mansfield's Reed scores fabulous free-kick to upset Burnley",
    "content": "Watch Mansfield Town's Louis Reed produce \"set-piece sorcery,\" scoring a sensational free kick to stun Premier League side Burnley and reach the FA Cup fifth round.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:29:06.269Z",
    "image": "https://image.pollinations.ai/prompt/Mansfield's%20Reed%20scores%20fabulous%20free-kick%20to%20upset%20Burnley%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mansfields-reed-scores-fabulous-free-kick-to-upset-burnley",
    "originalLink": "https://www.bbc.com/sport/football/videos/cp8rn3v2lmgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Saviour Summerville is West Ham's man of the moment",
    "title": "Saviour Summerville is West Ham's man of the moment",
    "content": "Crysencio Summerville is West Ham's saviour again as the Hammers beat Burton to move into the FA Cup fifth round.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:29:11.361Z",
    "image": "https://image.pollinations.ai/prompt/Saviour%20Summerville%20is%20West%20Ham's%20man%20of%20the%20moment%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "saviour-summerville-is-west-hams-man-of-the-moment",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd03e8xnkypo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Guehi scores as Man City beat spirited Salford",
    "title": "Guehi scores as Man City beat spirited Salford",
    "content": "Marc Guehi scores his first goal for Manchester City to seal a 2-0 win for the Premier League side over League Two Salford City in the fourth round of the FA Cup.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T18:29:16.452Z",
    "image": "https://image.pollinations.ai/prompt/Guehi%20scores%20as%20Man%20City%20beat%20spirited%20Salford%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guehi-scores-as-man-city-beat-spirited-salford",
    "originalLink": "https://www.bbc.com/sport/football/videos/c8xypwr02jyo?at_medium=RSS&at_campaign=rss"
  }
]