[
  {
    "originalTitle": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "title": "A Special Story About a Former Leader and Two Countries!",
    "content": "Hello, amazing children! Welcome to your special news report, coming to you live from our wonderful continent, Africa!\n\nToday, we have an important story to share with you. It might sound a little bit like a grown-up puzzle, but we will explain it in easy words, so everyone can understand. It's about a kind of leader, and two beautiful countries that are neighbours in our big African family!\n\n<h3>Meet Our Countries: Togo and Burkina Faso!</h3>\n\nImagine Africa as a giant, beautiful house with many, many rooms! Each room is a country. Today, our story is happening in two of these rooms: Burkina Faso and Togo.\n\nBurkina Faso is a country right in the middle of West Africa. It's a landlocked country, which means it's surrounded by land and doesn't have a big ocean beach. But it has lots of beautiful land and friendly people!\n\nDid you know? The name 'Burkina Faso' means 'Land of Upright People' or 'Land of Honest People'! Isn't that a lovely name?\n\nRight next door to Burkina Faso is another special country called Togo. Togo is lucky because it has a beautiful beach on the Atlantic Ocean! Imagine playing in the sand and seeing the big, blue waves!\n\nDid you know? In Togo, many people speak French, which is a language spoken in many parts of the world!\n\nThese two countries are like good neighbours, sharing borders and sometimes even stories. They are both part of our big, happy African family.\n\n<h3>Who is Mr. Paul?</h3>\n\nOur story is about a man whose name is Paul-Henri Sandaogo Damiba. That's a long name, so we can call him Mr. Paul for short!\n\nOnce upon a time, not so long ago, Mr. Paul was a very important leader in Burkina Faso. What does a leader do? Think of a leader like the captain of a football team, or the head teacher of your school, but for a whole country!\n\nLeaders have a big job. They help make rules to keep everyone safe, they make sure people have food and schools, and they try to make life better for everyone in their country. It's a very big responsibility!\n\nMr. Paul was in charge of Burkina Faso for a little while. But then, things changed, and other people took over the leadership in Burkina Faso.\n\nAfter he was no longer the leader, Mr. Paul went to live in another country nearby – our neighbour, Togo. He lived there quietly for some time, enjoying the peace.\n\n<h3>What Happened Recently?</h3>\n\nNow, here's the part of the story that's like a big puzzle that needs to be solved.\n\nThe people who are now in charge in Burkina Faso are saying some very serious things about Mr. Paul.\n\nThey are saying that Mr. Paul was planning something very, very serious and not good. They say he was planning a 'bad thing' – something that could hurt people or cause big problems in Burkina Faso. It's called being 'accused' when people say you did something wrong.\n\nBecause these words were so serious, the country of Togo had to do something. They asked Mr. Paul to leave their country. This is like when someone is asked to leave a party if they cause trouble, or if they are no longer welcome.\n\nSo, Mr. Paul was sent back to Burkina Faso, the country where he used to be a leader and where these serious accusations are coming from. It was a very big journey for him.\n\nDid you know? When someone is accused of something very important, they usually have to go back to the place where it happened to talk about it and try to understand everything. This helps to find the truth.\n\n<h3>Listening to Both Sides of the Story</h3>\n\nThis is a very, very important part of our news story, kids!\n\nRight now, Mr. Paul has not said anything about what the people in Burkina Faso are saying. He hasn't told his side of the story yet. We haven't heard his voice or what he thinks about these accusations.\n\nThink about it like this: if two friends are playing, and one friend says the other took their toy, what do you do? You listen to what both friends have to say, right? You don't just believe the first person.\n\nIt's important to hear everyone's story to truly understand what happened. We can't know the full truth if we only hear one side. We need to be fair.\n\nSo, we are all waiting to hear from Mr. Paul. He has a right to tell his story too, just like anyone else.\n\n<h3>Why Is This Important for All of Us?</h3>\n\nThis story might seem like a grown-up thing, but it teaches us important lessons that we can use every day.\n\nFirst, it shows us how countries try to work together, even when there are big problems. Countries are like big families, and they try to help each other, especially when things are difficult.\n\nSecond, it reminds us that when people are leaders, they have a huge job to keep everyone safe and happy. It's a very big responsibility, and they must always try to do what is best for the people.\n\nThird, when someone is accused of something, it's super important to find out the truth. Everyone deserves to be treated fairly, and to have a chance to explain themselves.\n\nDid you know? Leaders of countries often talk to each other to solve problems peacefully. This is called 'diplomacy,' and it means using kind words and discussions instead of fighting! It helps keep the peace.\n\n<h3>Keeping Our Home, Africa, Safe</h3>\n\nAfrica is a beautiful continent, full of sunshine, amazing animals like elephants and giraffes, and wonderful people. It's a place where we want peace, love, and growth for everyone.\n\nSometimes, grown-ups face big challenges, just like sometimes you might have a challenge at school or at home. But people always try their best to work things out fairly and peacefully, so everyone can be safe.\n\nOur biggest wish is for all countries, like Burkina Faso and Togo, to be peaceful and happy places for all the children and grown-ups who live there. We hope that this situation with Mr. Paul will be understood clearly, and that everyone will be safe and sound.\n\nSo, remember, kids: always listen to both sides of a story, and always hope for peace in our wonderful world!\n\nThat's all for your special news report today! Stay curious, stay kind, and keep shining bright!",
    "category": "world",
    "date": "2026-01-20T23:18:17.046Z",
    "image": "https://image.pollinations.ai/prompt/A%20Special%20Story%20About%20a%20Former%20Leader%20and%20Two%20Countries!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-special-story-about-a-former-leader-and-two-countries",
    "originalLink": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Malawi raises fuel prices by more than 40%",
    "title": "Malawi's Fuel Story: Why Things Cost More Now!",
    "content": "<h3>Hello from Sunny Malawi!</h3>\nHello everyone! It’s your kid-friendly news reporter, Jambo, here from the beautiful country of Malawi! Malawi is a wonderful place in Africa, known as the \"Warm Heart of Africa\" because its people are so friendly and welcoming. We have amazing lakes and mountains, and lots of lovely animals. Today, I have some important news to share with you about something called \"fuel\" and how it affects everyone here, especially when we want to travel around.\n\nImagine you're getting ready to go to school, or maybe visit your grandma who lives a little far away. How do you get there? Maybe in a car, a bus, or even a motorbike! Well, for these vehicles to move, they need a special kind of drink – and it’s not juice! It’s called fuel.\n\n<h3>What is Fuel?</h3>\nSo, what exactly is fuel? Think of it like food for cars, buses, and trucks! It’s a liquid, usually petrol or diesel, that they drink to get energy. Just like you eat food to have energy to run and play, vehicles use fuel to move their wheels and take people and things from one place to another. Without fuel, cars just sit still, like a sleepy cat!\n\nFuel is super important because it helps our world go 'round. It helps parents get to work, brings yummy food from farms to our markets, and takes us on fun trips. Imagine if the school bus couldn't move because there was no fuel! That would be a big problem, right?\n\n**Did you know?** Most of the fuel we use comes from deep inside the Earth! It’s called crude oil, and it needs to be made made special before it can go into our cars and buses.\n\n<h3>The Price Tag Just Got Bigger!</h3>\nNow, here’s the news we need to talk about. In Malawi, the grown-ups who run our country, the government, have made a big decision. They have said that fuel will now cost more money. A lot more money! It's like if your favourite candy bar suddenly cost twice as much. This is called \"raising the price.\"\n\nWhen we say the price went up by \"more than 40%\", it means if something used to cost 10 Kwacha (that's our money here), now it might cost 14 Kwacha or even more! That’s a big jump! This means that when your mum or dad goes to fill up the car, they will need to pay much, much more money than before.\n\n<h3>Why Did This Happen? Two Big Reasons!</h3>\nYou might be asking, \"Why would they do that?\" That's a great question! The government made this choice for two very important reasons.\n\n<h4>Reason 1: We Didn't Have Enough Fuel! (Oh no, a Shortage!)</h4>\nImagine going to the shop to buy your favourite snack, but the shelf is empty! That's what was happening with fuel here. Sometimes, there wasn't enough fuel for all the cars and buses. This is called a \"fuel shortage.\" It meant that people had to wait in very long lines at petrol stations, sometimes for many hours, just to get a little bit of fuel. Or even worse, some stations had no fuel at all!\n\nWhen there isn't enough fuel, it causes lots of problems. Buses can't run, taxis can't take people where they need to go, and trucks can't deliver food and other important things to our towns and villages. The government wants to make sure there's always enough fuel for everyone. They hope that by making fuel a bit more expensive, it will help bring more fuel into the country so the shelves (or tanks!) are never empty again.\n\n<h4>Reason 2: Filling the Country's Piggy Bank! (The National Budget)</h4>\nThe second big reason is about something called the \"national budget.\" Imagine your mum or dad has a special piggy bank or a jar where they put money for important things, like buying you new shoes, school books, or delicious snacks. Well, our whole country, Malawi, also has a kind of \"piggy bank\" for its money, and we call it the \"national budget.\"\n\nThe government uses this money to do super important things for all of us! They build new schools so you can learn, they build hospitals to help us when we are sick, they fix roads so we can travel smoothly, and they even pay our teachers and doctors. It costs a lot of money to run a country and make sure everyone is safe and happy. Sometimes, the country’s piggy bank doesn’t have enough money, especially when things are tough. By making fuel cost a bit more, the government hopes to collect more money to help fill up the budget so they can keep doing all these important jobs for Malawi.\n\n**Did you know?** Every country has a budget! It's like a plan for how to spend money to help all the people living there.\n\n<h3>How Does This Affect Everyone?</h3>\nSo, what happens when fuel costs more? Well, it affects almost everyone in Malawi!\n\n*   **Bus rides cost more:** If you usually take a bus to school or to visit family, the bus fare (the money you pay) might go up. The bus driver has to pay more for fuel, so they need to ask passengers for a little more money too.\n*   **Food might cost more:** Remember how trucks bring food from the farms to the markets? Those trucks also need fuel! If the truck driver pays more for fuel, then the food they bring might become a little more expensive at the market. So, your favourite fruits or vegetables might have a slightly higher price tag.\n*   **Parents have to be careful with money:** Families will need to think more carefully about how they spend their money, because more of it will be used for things like transport.\n*   **More walking and cycling:** Some people might choose to walk or cycle more often instead of taking a car or a bus, especially for shorter journeys, to save money.\n\nIt’s a bit tricky, isn’t it? While the government is trying to fix the fuel shortage and get more money for schools and hospitals, it also means that people will have to spend more money every day. Many people are feeling a bit sad or worried about this, because it makes life a little harder right now.\n\n**Did you know?** Walking and cycling are great ways to get around because they are good for your health and good for the environment too! No fuel needed!\n\n<h3>What Happens Next?</h3>\nThe government hopes that these changes will help Malawi in the long run. They hope that very soon, there will be plenty of fuel at all the petrol stations, and that the country's piggy bank will be strong enough to build more schools and fix more roads. It’s a big challenge, but they are working hard to make things better for all Malawians.\n\nWe will keep watching and sharing the news with you, my friends. Remember, even when things are difficult, people in Malawi are strong and always find ways to help each other. We hope that soon, everyone can travel easily and afford all the things they need. That’s all from your reporter, Jambo, today! Stay curious and keep learning!",
    "summary": "The government in Malawi has made fuel much more expensive to solve shortages and get more money for the country, which makes many people unhappy because everything will now cost more.",
    "whyMatters": "This is important because fuel helps cars and buses move, so when it costs more, it makes everything else more expensive too, like bus rides and even food, affecting how families spend their money and how easily people can travel.",
    "category": "government",
    "date": "2026-01-20T23:18:46.243Z",
    "image": "https://image.pollinations.ai/prompt/Malawi's%20Fuel%20Story%3A%20Why%20Things%20Cost%20More%20Now!%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "malawis-fuel-story-why-things-cost-more-now",
    "originalLink": "https://www.bbc.com/news/articles/c5yxdgvd9pwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Jubilant Senegal fans join the Afcon champions parade",
    "title": "Senegal's Football Heroes Get a Giant Welcome Home!",
    "content": "<h3>A Big Win for Senegal!</h3>\nHello, my amazing friends! Guess what? Something super exciting happened in Africa! The country of Senegal won a very, very big football game! All the people in Senegal are so, so happy! They are smiling and cheering very loudly. It was like a dream come true for them. Their football team brought home a special trophy. Everyone wanted to see their heroes.\n\n<h3>What is AFCON?</h3>\nYou might be asking, \"What big game did they win?\" It's called AFCON! AFCON stands for the Africa Cup of Nations. It's like the biggest football party for all the countries in Africa. Every few years, teams from all over Africa play against each other. They want to find out who is the best football team on our continent. Winning AFCON is a really, really huge deal! It means you are the champions of Africa!\n\nDid you know? AFCON is one of the oldest football tournaments in the world, just for countries in Africa!\n\n<h3>The Lions of Teranga Roar!</h3>\nSenegal's football team has a cool nickname. They are called the \"Lions of Teranga.\" Isn't that a super strong name? A lion is brave and powerful. \"Teranga\" means hospitality in their language, which means being very friendly to guests. Their team played so well! They showed everyone how brave and good they are at football. They played with all their hearts and won the final game! It was a very close game, but they tried their best until the very end.\n\n<h3>Coming Home Heroes!</h3>\nAfter winning the big game, the Lions of Teranga came back home to Senegal. Imagine flying back to your country with a shiny gold trophy! They traveled in an airplane. Everyone was waiting for them. The whole country was ready to say \"Welcome Home, Champions!\" It wasn't just a regular day; it was a day for big celebrations. People woke up early, eager to see their beloved team.\n\n<h3>The Most Amazing Parade Ever!</h3>\nWhen the team landed, a huge, huge party started! It was called a parade. Do you know what a parade is? It's when people march or drive slowly in a line, often with music and dancing, to celebrate something special. For the Lions of Teranga, they rode on a special bus. This bus was open so everyone could see them. It moved very, very slowly through the streets of Dakar. Dakar is the capital city of Senegal.\n\nThe streets were full of people! Thousands and thousands of people! They wore green, yellow, and red clothes. These are the colours of Senegal's flag. They waved tiny flags. They sang happy songs. They danced in the street. The air was filled with cheers and joyful shouts! It was the biggest party you can imagine!\n\nDid you know? A parade is a way to show happiness and celebrate important people or events!\n\n<h3>Happy, Happy Fans!</h3>\nThe fans were so, so happy. Their faces were full of big smiles. Some fans even cried happy tears! They had waited for this moment for a very long time. For the first time ever, Senegal won the AFCON trophy! This made everyone feel so proud. They jumped up and down. They blew whistles and horns. Everyone wanted to get a glimpse of their football heroes and the shiny trophy. It was a day they would never, ever forget.\n\nImagine being in such a big crowd, all cheering for the same team! It feels like one big, happy family.\n\n<h3>Meet the Stars!</h3>\nWho are some of these amazing players? One of the most famous players is Sadio Mané. He is a very talented player. He scored important goals and helped his team win. When he waved from the bus, all the fans cheered even louder! All the players on the team worked together like a team should. They showed us that working together can help you win big things. Each player on the team is a hero.\n\nDid you know? Sadio Mané is known all over the world for his amazing football skills!\n\n<h3>A Special Day for Everyone!</h3>\nEven the President of Senegal was there! The President is like the main leader of the country. He welcomed the team back and congratulated them. He was so proud of his country's team. He even gave them special awards! It showed how important this victory was for the whole country. Everyone felt like a winner that day. It was a day of national pride and happiness.\n\n<h3>Why This Win is So Big!</h3>\nThis win is very, very special for Senegal because it is the FIRST time they have ever won the AFCON trophy! They have tried many times before, but this time they did it! It shows that if you keep trying and never give up, you can achieve your dreams. This victory makes all the children in Senegal dream big. Maybe one day, they can also become football heroes! It teaches everyone about teamwork, hard work, and never losing hope.\n\nDid you know? It took Senegal many years and many tournaments to finally win the AFCON trophy!\n\n<h3>What's Next for Senegal?</h3>\nNow that Senegal is the champion of Africa, what happens next? They will keep playing great football! They will try to win even more games. This victory gives them more confidence and makes them even stronger. All the children in Senegal will continue to support their team. Maybe this win will inspire many young boys and girls to play football and chase their own dreams. It's a wonderful time to be a football fan in Senegal!",
    "summary": "Senegal's football team, the Lions of Teranga, won the big AFCON trophy for the first time ever, and thousands of joyful fans joined a huge, colourful parade in Dakar to celebrate their returning heroes.",
    "whyMatters": "This win is important because it made everyone in Senegal feel very proud and happy, showing that working hard and never giving up can help you achieve big dreams, and it inspires young children across Africa to chase their own goals.",
    "category": "world",
    "date": "2026-01-20T23:19:07.708Z",
    "image": "https://image.pollinations.ai/prompt/Senegal's%20Football%20Heroes%20Get%20a%20Giant%20Welcome%20Home!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "senegals-football-heroes-get-a-giant-welcome-home",
    "originalLink": "https://www.bbc.com/news/videos/cgm4nj23jy8o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Jesus brace helps Arsenal down Inter to seal Champions League qualification",
    "title": "Jesus brace helps Arsenal down Inter to seal Champions League qualification",
    "content": "Arsenal win 3-1 at Inter Milan in the league phase of the UEFA Champions League to seal their place in the last 16.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-20T23:19:13.153Z",
    "image": "https://image.pollinations.ai/prompt/Jesus%20brace%20helps%20Arsenal%20down%20Inter%20to%20seal%20Champions%20League%20qualification%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "jesus-brace-helps-arsenal-down-inter-to-seal-champions-league-qualification",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/20/jesus-brace-helps-arsenal-down-inter-to-seal-champions-league-qualification?traffic_source=rss"
  },
  {
    "originalTitle": "Trump made many statements on US economy. Most are untrue",
    "title": "Trump made many statements on US economy. Most are untrue",
    "content": "In address to media on Tuesday, US president made many false claims, including that there was 'no inflation' in the US.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T23:19:18.324Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20made%20many%20statements%20on%20US%20economy.%20Most%20are%20untrue%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-made-many-statements-on-us-economy-most-are-untrue",
    "originalLink": "https://www.aljazeera.com/economy/2026/1/20/trump-made-many-statements-on-us-economy-most-are-untrue?traffic_source=rss"
  },
  {
    "originalTitle": "Syrian government, SDF agree on a four-day ceasefire",
    "title": "Syrian government, SDF agree on a four-day ceasefire",
    "content": "Kurdish-led SDF accepts truce but reports continued attacks by government-allied forces, despite the agreement.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-01-20T23:19:23.491Z",
    "image": "https://image.pollinations.ai/prompt/Syrian%20government%2C%20SDF%20agree%20on%20a%20four-day%20ceasefire%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "syrian-government-sdf-agree-on-a-four-day-ceasefire",
    "originalLink": "https://www.aljazeera.com/news/2026/1/20/syrian-government-sdf-agree-on-a-four-day-ceasefire?traffic_source=rss"
  },
  {
    "originalTitle": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "content": "Trump's demands over Greenland are a rude awakening in a moment fraught with risk.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T23:19:29.459Z",
    "image": "https://image.pollinations.ai/prompt/Lyse%20Doucet%3A%20Trump%20is%20shaking%20the%20world%20order%20more%20than%20any%20president%20since%20WW2%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lyse-doucet-trump-is-shaking-the-world-order-more-than-any-president-since-ww2",
    "originalLink": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Driver killed and several injured after train derails near Barcelona, local media report",
    "title": "Driver killed and several injured after train derails near Barcelona, local media report",
    "content": "At least 14 people are known to have been injured after a commuter train crashed between Gelida and Sant Sadurní.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-20T23:19:34.635Z",
    "image": "https://image.pollinations.ai/prompt/Driver%20killed%20and%20several%20injured%20after%20train%20derails%20near%20Barcelona%2C%20local%20media%20report%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "driver-killed-and-several-injured-after-train-derails-near-barcelona-local-media-report",
    "originalLink": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
    "title": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
    "content": "The US president says it is \"another in a very long line of National Security reasons why Greenland has to be acquired\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-20T23:19:39.804Z",
    "image": "https://image.pollinations.ai/prompt/UK%20defends%20Chagos%20deal%20after%20Trump%20calls%20it%20'act%20of%20great%20stupidity'%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-defends-chagos-deal-after-trump-calls-it-act-of-great-stupidity",
    "originalLink": "https://www.bbc.com/news/articles/c0mkp021rvro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "title": "'Battered in Bodo' - is this more than just a blip for Man City?",
    "content": "Manchester City suffered their very own \"hell of a beating\" moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T23:19:45.396Z",
    "image": "https://image.pollinations.ai/prompt/'Battered%20in%20Bodo'%20-%20is%20this%20more%20than%20just%20a%20blip%20for%20Man%20City%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "battered-in-bodo-is-this-more-than-just-a-blip-for-man-city",
    "originalLink": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Villa interested in Mateta - Wednesday's gossip",
    "title": "Villa interested in Mateta - Wednesday's gossip",
    "content": "Aston Villa explore Jean-Philippe Mateta and Tammy Abraham moves, Manchester United decline Ajax's Manuel Ugarte approach and Bournemouth fight to keep Marcos Senesi.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-20T23:19:50.570Z",
    "image": "https://image.pollinations.ai/prompt/Villa%20interested%20in%20Mateta%20-%20Wednesday's%20gossip%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "villa-interested-in-mateta-wednesdays-gossip",
    "originalLink": "https://www.bbc.com/sport/football/articles/c1m78nynj89o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Slot hints Salah will start for Liverpool in Marseille",
    "title": "Slot hints Salah will start for Liverpool in Marseille",
    "content": "Arne Slot suggests Mohamed Salah will return to the Liverpool starting line-up against Marseille in Wednesday's Champions League tie, insisting his relationship with the forward is \"as normal as it's always been\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-20T23:19:55.737Z",
    "image": "https://image.pollinations.ai/prompt/Slot%20hints%20Salah%20will%20start%20for%20Liverpool%20in%20Marseille%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "slot-hints-salah-will-start-for-liverpool-in-marseille",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9wx7ykl098o?at_medium=RSS&at_campaign=rss"
  }
]