[
  {
    "originalTitle": "'Half of my friends were killed' - the girls returning to a school caught up in war",
    "title": "Brave Sisters Go Back to School!",
    "content": "<h3>Hello, Super Star Listeners!</h3>\n\nHello, amazing friends! It's your kid-friendly news reporter here, bringing you a very important story from our beautiful continent, Africa. Today, we are going to talk about two very brave girls, two sisters who are twins! Do you know what twins are? They are two babies born at the same time to the same mommy. These twins are like two peas in a pod, and they love school very much.\n\n<h3>Meet Our Brave Twins</h3>\n\nOur story is about two special girls. They are sisters, and they are twins. Let's call them Ama and Ada. They live in a place where sometimes, bad things happen. Sometimes, there is fighting, which we call war. War is when people fight and it makes places not safe, especially for schools. Ama and Ada loved going to school every day. They learned about numbers, letters, and made many friends.\n\nDid you know? School is super important! It helps you learn new things so you can grow up and do amazing jobs like being a doctor, a teacher, or even a news reporter like me!\n\n<h3>A Sad Day at School</h3>\n\nOne day, something very, very sad happened. While Ama and Ada were at school, there was a big, scary noise. It was like a very loud bang! This noise came from something called shelling. Shelling is when big, loud bombs fall from the sky. It is very dangerous and makes people scared. Because of this scary shelling, some of Ama and Ada's friends, their classmates, were hurt very badly. Some of them even died. This made Ama and Ada feel very, very sad. Losing a friend is one of the hardest things.\n\nImagine going to school one day, playing with your friends, and the next day, some of them are not there anymore. It’s a very painful feeling. Ama said, \"Half of my friends were killed.\" Can you imagine how that feels? It's like half of your special playground buddies are gone. This was a very dark time for the school and for Ama and Ada.\n\n<h3>Feeling Sad, But Strong</h3>\n\nAfter such a terrible day, many children would be too scared to go back to school. It's normal to feel afraid when something scary happens. Ama and Ada also felt very sad and maybe a little scared. But guess what? These two sisters are incredibly brave! They talked to each other, and they thought about their friends who were no longer there.\n\nThey decided something very important. They decided that they would not let the sadness win. They would not let the bad fighting stop them from learning. They wanted to go back to school. They wanted to finish their studies! This is a very strong and brave choice.\n\nDid you know? Even when you feel sad or scared, you can still find courage inside you. It's like a tiny spark that helps you keep going!\n\n<h3>Why Go Back to School?</h3>\n\nYou might be thinking, \"Why would they go back to a school where such a sad thing happened?\" Well, school is more than just a building. School is a place where you learn, where you laugh, and where you make dreams. For Ama and Ada, going back to school was a way to remember their friends. It was a way to show that even though bad things happen, hope can always stay alive.\n\nThey believe that by learning, they can make their future better. They want to honor their friends who can no longer learn. They want to learn enough to help their communities and make sure that one day, no other children have to go through what they did. Learning is like building a strong bridge to a brighter future.\n\n<h3>Friends Are Like Family</h3>\n\nEven though some friends are gone, Ama and Ada still have other friends. They also have their teachers. Teachers are like super-helpers who guide you and care for you. When they went back to school, their remaining friends and teachers welcomed them. They can support each other through the hard times. Having friends means you are not alone.\n\nDid you know? In many parts of Africa, people believe in 'Ubuntu', which means 'I am because we are'. It's about how we are all connected and help each other. Ama and Ada going back to school shows this spirit of togetherness.\n\n<h3>Never Give Up!</h3>\n\nAma and Ada are very determined. 'Determined' means they really, really want to do something and they won't give up. They want to finish their studies, no matter what. They know that learning helps them understand the world better. It helps them solve problems and think of new ideas. They want to finish their studies to make their parents proud, to make their friends proud, and most importantly, to make themselves proud.\n\nTheir bravery teaches all of us a big lesson: even when things are tough, never, ever give up on your dreams. Especially the dream of learning! Learning is a superpower that nobody can take away from you.\n\n<h3>A Brighter Tomorrow</h3>\n\nAma and Ada's story reminds us that even after very hard times, we can find strength. We can find hope. They are like shining stars, showing everyone that education is important. They are working hard for a brighter tomorrow, not just for themselves, but for everyone around them.\n\nLet's clap for Ama and Ada! They are true heroes. They show us that with courage and determination, we can overcome big challenges and keep reaching for our dreams. And remember, every time you learn something new, you are building a better future for yourself and for our wonderful continent, Africa!\n",
    "summary": "Two brave twin sisters, Ama and Ada, are determined to continue their schooling and studies after a sad event where some of their classmates were killed by shelling, showing great courage and hope for a better future.",
    "whyMatters": "This story matters because it shows us how brave children can be, even after very sad things happen. It teaches us that school and learning are super important, and that we should never give up on our dreams, because learning helps us build a brighter future for ourselves and for everyone.",
    "category": "world",
    "date": "2026-01-24T13:27:58.617Z",
    "image": "https://image.pollinations.ai/prompt/Brave%20Sisters%20Go%20Back%20to%20School!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "brave-sisters-go-back-to-school",
    "originalLink": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
    "title": "Mandela's Special Treasures: A Story for Kids!",
    "content": "Hello, wonderful friends! It's your kid-friendly reporter, live from sunny Africa! Today, we have a very exciting story about a super important hero. His name is Nelson Mandela. Have you heard of him?\n\nNelson Mandela was a very, very special man. He helped make our world a better place. He taught us about kindness and freedom. He was the first black President of South Africa! That means he was the leader of a big country in Africa.\n\nHe fought for everyone to be treated fairly. No matter what colour their skin was. He wanted everyone to be friends and live in peace. He is a true hero for all of us here in Africa and around the whole world.\n\n<h3>A Key to Freedom</h3>\nImagine a key. What does a key do? It opens doors, right? Well, Nelson Mandela had a very special key. It was the key to his prison cell. A prison is a place where people stay when they cannot be free. It is a very sad place.\n\nNelson Mandela was put in prison for a very, very long time. He was there because he wanted freedom for all people. He wanted everyone to have the same rights. He wanted everyone to be happy and equal.\n\nThis key is super important. It reminds us of his long time in prison. It reminds us of all the years he spent locked away. But it also reminds us that he never gave up. He always hoped for freedom, even when it seemed far away.\n\nAnd guess what? After many, many years, he did become free! And he helped everyone else become free too! The key changed from a sad thing to a symbol of hope and freedom.\n\n**Did you know?** Nelson Mandela was in prison for 27 years! That's a super, super long time. Longer than you have been alive, and longer than your mommy and daddy too! He spent all those years fighting for what was right.\n\nThe key to his prison cell is a symbol. It means hope. It means never giving up, even when things are hard. It means fighting for what is right, no matter how long it takes.\n\n<h3>Cool Sunglasses and a Special Shirt</h3>\nNelson Mandela also had some other special things. He had a cool pair of sunglasses. And he had a shirt that he used to wear. These were his everyday items, but they became special because he wore them.\n\nWhy are these important? Well, they were *his* things. They were things he touched and used. They make us remember him even more. When we see them, we can imagine him.\n\nImagine you have a favourite toy or a special blanket. It's special to *you*, right? These items were special to Mandela, and now they are special to us because they remind us of him and his big, kind heart.\n\nWhen we see his sunglasses, we can imagine him wearing them, looking out at the world with hope in his eyes. When we see his shirt, we can imagine him giving a big speech, telling everyone to be kind and fair.\n\nThese items are like little pieces of a very big story. They help us remember the amazing man he was and all the good things he did for Africa and the world. They help his memory stay alive.\n\n**Did you know?** People often called Nelson Mandela by his clan name, Madiba! It's a special, loving way to talk about him, like a grandpa or an elder. So sometimes you might hear people say 'Madiba' instead of Nelson Mandela!\n\n<h3>Sharing Mandela's Treasures</h3>\nSo, what's happening with these special items? Nelson Mandela's daughter, his little girl when he was alive, wants to share them. She wants to sell them.\n\nWhat does 'sell' mean? It means someone can buy them. People who love Nelson Mandela's story might want to buy these things. They want to keep them safe and remember him. They want to own a piece of history.\n\nIt's like when you have a special drawing, and your mommy wants to keep it. Or when a museum keeps old things to show people. These items are like historical drawings, but from a real hero!\n\nSome people might buy them to put them in a museum. A museum is a special building where old and important things are kept. People can go there to learn about history and see wonderful treasures.\n\nThese items are like treasures. They tell a story. They tell us about Nelson Mandela's life and his journey to bring freedom to everyone. They are silent storytellers.\n\nSelling them means they might go to different places. But wherever they go, they will always tell the story of Nelson Mandela. His message of peace and freedom will travel with them.\n\nIt's like sharing a very important book. Even if someone else has it, the story inside is still wonderful and true for everyone who reads it.\n\n<h3>A Friendly Talk in Court</h3>\nNow, this is where it gets a little bit like a friendly argument. Some people, like the leaders of South Africa, didn't want these items to leave the country. They went to a place called a 'court'.\n\nA court is a special room where people talk about rules and laws. If two people or groups don't agree, they go to court. A special judge listens to both sides and helps decide what is fair and right.\n\nThe leaders said, 'These items are part of our country's heritage!' This means they belong to the whole country, not just one family.\n\nWhat does 'heritage' mean? It means all the special things from the past that belong to a country or a group of people. It's like your family's special photos or your grandma's old cooking pot. They are part of your family's story, but for a whole country!\n\nSo, the leaders thought that Mandela's key, sunglasses, and shirt were like big family photos for the whole country of South Africa. They wanted them to stay in South Africa so everyone could see them and remember their hero.\n\nThey wanted to make sure these pieces of history stayed right here, where Mandela lived and worked. They believed these items were important for all children in South Africa to learn from, today and always.\n\n**Did you know?** Heritage is like a big memory box for a whole country! It holds all the special stories, songs, buildings, and things that make a country unique and important. It helps us remember who we are and where we came from!\n\n<h3>What Happened Next?</h3>\nSo, what happened in the court? The judge listened very carefully to everyone. She listened to Nelson Mandela's daughter. And she listened to the leaders of the country. She thought about what was fair.\n\nAnd the judge made a decision. She said that Nelson Mandela's daughter can sell these special items. She won the court battle! This means she has the right to decide what to do with them.\n\nThis means that the key, the sunglasses, and the shirt can now be sold to other people. Maybe they will go to a new museum far away. Or maybe someone special will buy them to keep them safe in their own collection.\n\nIt's a big decision. It means that while these items are very important for South Africa, his daughter also has the right to decide what happens to her father's personal things. It's a balance of family and national treasure.\n\nNo matter where they go, the story of Nelson Mandela will always go with them. These items will always remind us of the great man who loved Africa and fought for freedom for everyone.\n\nWe will always remember his smile, his kindness, and his powerful message of peace. His story is bigger than any one item.\n\n<h3>Why Nelson Mandela is a Hero for Us All</h3>\nNelson Mandela taught us so many important lessons. He taught us to be brave, even when we are scared. He taught us to be kind to everyone, no matter where they come from or what they look like.\n\nHe showed us that even if things are very hard, we should never give up on our dreams of a better world. He kept his dream alive for almost three decades in prison!\n\nThese special items – the key, the sunglasses, the shirt – help us remember his amazing journey. They are tiny pieces of a giant story of courage, hope, and freedom for all people.\n\nWe can all be like Nelson Mandela in our own small ways. We can be kind to our friends. We can share our toys. We can stand up for what is fair when we see something that is not right.\n\nSo, remember Nelson Mandela, our African hero. His story lives on, and even his old things tell us a tale of hope and freedom. He will always be in our hearts.\n\nThank you for listening, wonderful friends! See you next time for more amazing news from Africa!",
    "summary": "Nelson Mandela's daughter won a court case, meaning she can now sell his special prison key, sunglasses, and shirt, even though leaders in South Africa wanted them to stay as part of the country's history.",
    "whyMatters": "This matters because it shows how important Nelson Mandela and his personal belongings are to many people, and it reminds us about how countries decide what is part of their special history for everyone to remember.",
    "category": "world",
    "date": "2026-01-24T13:28:27.402Z",
    "image": "https://image.pollinations.ai/prompt/Mandela's%20Special%20Treasures%3A%20A%20Story%20for%20Kids!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mandelas-special-treasures-a-story-for-kids",
    "originalLink": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Somaliland president pitches business opportunities to Trump's son",
    "title": "Somaliland president pitches business opportunities to Trump's son",
    "content": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T13:28:32.520Z",
    "image": "https://image.pollinations.ai/prompt/Somaliland%20president%20pitches%20business%20opportunities%20to%20Trump's%20son%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "somaliland-president-pitches-business-opportunities-to-trumps-son",
    "originalLink": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump’s imperial tantrum",
    "title": "Trump’s imperial tantrum",
    "content": "Trump’s imperial rampage - the tweets, the rants, the petulance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T13:28:37.793Z",
    "image": "https://image.pollinations.ai/prompt/Trump%E2%80%99s%20imperial%20tantrum%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trumps-imperial-tantrum",
    "originalLink": "https://www.aljazeera.com/video/the-listening-post/2026/1/24/trumps-imperial-tantrum?traffic_source=rss"
  },
  {
    "originalTitle": "Electoral violence is on the horizon in Kenya",
    "title": "Electoral violence is on the horizon in Kenya",
    "content": "Conditions in Kenya are ripe for the weaponisation of violence in the presidential vote. It is up to Kenyans to stop it.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T13:28:42.908Z",
    "image": "https://image.pollinations.ai/prompt/Electoral%20violence%20is%20on%20the%20horizon%20in%20Kenya%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "electoral-violence-is-on-the-horizon-in-kenya",
    "originalLink": "https://www.aljazeera.com/opinions/2026/1/24/electoral-violence-is-on-the-horizon-in-kenya?traffic_source=rss"
  },
  {
    "originalTitle": "Suicide bombing at wedding in northwest Pakistan kills seven",
    "title": "Suicide bombing at wedding in northwest Pakistan kills seven",
    "content": "Attack comes as Pakistani military readies for its fight against armed groups in areas along border with Afghanistan.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-24T13:28:48.029Z",
    "image": "https://image.pollinations.ai/prompt/Suicide%20bombing%20at%20wedding%20in%20northwest%20Pakistan%20kills%20seven%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suicide-bombing-at-wedding-in-northwest-pakistan-kills-seven",
    "originalLink": "https://www.aljazeera.com/news/2026/1/24/suicide-bombing-at-wedding-in-northwest-pakistan-kills-seven?traffic_source=rss"
  },
  {
    "originalTitle": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks",
    "title": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks",
    "content": "One person died and 35 were injured as trilateral discussions in Abu Dhabi were set to resume.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T13:28:54.115Z",
    "image": "https://image.pollinations.ai/prompt/Ukraine%20condemns%20'brutal'%20Russian%20strikes%20ahead%20of%20second%20day%20of%20peace%20talks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ukraine-condemns-brutal-russian-strikes-ahead-of-second-day-of-peace-talks",
    "originalLink": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
    "title": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
    "content": "The US will also offer “more limited” support to US allies, according to a new national defence strategy document.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T13:28:59.236Z",
    "image": "https://image.pollinations.ai/prompt/Pentagon%20to%20offer%20'more%20limited'%20support%20to%20US%20allies%20in%20defence%20strategy%20shift%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pentagon-to-offer-more-limited-support-to-us-allies-in-defence-strategy-shift",
    "originalLink": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "title": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect' ",
    "content": "The US president's comments have been condemned by international allies, including UK veterans and politicians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-24T13:29:04.354Z",
    "image": "https://image.pollinations.ai/prompt/Harry%20says%20sacrifices%20by%20Nato%20troops%20in%20Afghanistan%20deserve%20'respect'%20%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "harry-says-sacrifices-by-nato-troops-in-afghanistan-deserve-respect",
    "originalLink": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tottenham, Bayern and a stand made of chairs - Palhinha's story",
    "title": "Tottenham, Bayern and a stand made of chairs - Palhinha's story",
    "content": "On-loan Tottenham midfielder Joao Palhinha chats to BBC Sport's Kelly Somers about his life and career.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "jobs",
    "date": "2026-01-24T13:29:09.779Z",
    "image": "https://image.pollinations.ai/prompt/Tottenham%2C%20Bayern%20and%20a%20stand%20made%20of%20chairs%20-%20Palhinha's%20story%20realistic%20news%20photography%20context%20Jobs%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tottenham-bayern-and-a-stand-made-of-chairs-palhinhas-story",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62ww08l0n6o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "German FA official wants World Cup boycott talks",
    "title": "German FA official wants World Cup boycott talks",
    "content": "A German football association official believes it is time to consider a boycott of the 2026 World Cup in the wake of United States President Donald Trump's actions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-24T13:29:14.890Z",
    "image": "https://image.pollinations.ai/prompt/German%20FA%20official%20wants%20World%20Cup%20boycott%20talks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "german-fa-official-wants-world-cup-boycott-talks",
    "originalLink": "https://www.bbc.com/sport/football/articles/c87r5y70r82o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Euros abuse made me not want to leave hotel - Carter",
    "title": "Euros abuse made me not want to leave hotel - Carter",
    "content": "England defender Jess Carter says abuse of female footballers is getting worse and that she has had to step back from social media after receiving racist messages during Euro 2025.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-24T13:29:20.007Z",
    "image": "https://image.pollinations.ai/prompt/Euros%20abuse%20made%20me%20not%20want%20to%20leave%20hotel%20-%20Carter%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "euros-abuse-made-me-not-want-to-leave-hotel-carter",
    "originalLink": "https://www.bbc.com/sport/football/articles/cd0y353v2x5o?at_medium=RSS&at_campaign=rss"
  }
]