[
  {
    "originalTitle": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "title": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO",
    "content": "Giving some newborns in Guinea-Bissau an established hepatitis B treatment but not others is \"unethical\", it says.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:20:12.001Z",
    "image": "https://image.pollinations.ai/prompt/Planned%20US-funded%20baby%20vaccine%20trial%20in%20Guinea-Bissau%20blasted%20by%20WHO%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "planned-us-funded-baby-vaccine-trial-in-guinea-bissau-blasted-by-who",
    "originalLink": "https://www.bbc.com/news/articles/c78j5k2gk02o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Big Sparkly Gifts in Kenya!",
    "content": "<h3>Hello, Wonderful Friends!</h3>\nHello, wonderful friends! It's your kid-friendly reporter here, bringing you super exciting news from sunny Africa! We are going to talk about gifts today. Have you ever gotten a special gift? It feels so good to give and receive, doesn't it?\n\n<h3>What is Valentine's Day?</h3>\nFirst, let's talk about a special day called Valentine's Day. It happens once a year. On this day, people show extra love to their family and friends. They often give little gifts to show they care. Common gifts are beautiful flowers or yummy chocolates.\n\n<h3>A New Kind of Gift in Kenya!</h3>\nBut guess what? In a beautiful country called Kenya, people started a new, super special way to give gifts! It's not just flowers anymore. They created something called a \"cash bouquet\"! Can you guess what it is?\n\n<h3>What is a Cash Bouquet?</h3>\nImagine a big, beautiful bunch of flowers. It has lots of pretty shapes and colors. Now, imagine that instead of flower petals, each \"flower\" is made from shiny banknotes! Yes, real money, folded very carefully and made to look like a fantastic flower! It looks so amazing and sparkly. People love to give these money \"flowers\" to show big love.\n\n*Did you know? A \"bouquet\" is just a fancy word for a bunch of flowers that are put together nicely!*\n\n<h3>Why Give Money as a Gift?</h3>\nYou might wonder, why would someone give money instead of real flowers? Well, real flowers are super pretty, but they don't last forever. They wilt after a few days. But money? Money can be used for so many important things!\n\n<h3>Money Helps So Much!</h3>\nWhen you get money, you can use it for what you need most. Maybe you need new school books to learn exciting things. Or perhaps your family needs yummy food for dinner. Or maybe someone is saving up for a special toy they really want! So, money flowers are not just beautiful, they are also super helpful! It's like giving a gift that lets the person choose their own perfect present.\n\n*Did you know? Kenya is a country in East Africa! It has amazing wild animals like towering giraffes and speedy cheetahs!*\n\n<h3>A Little Warning, Friends</h3>\nThese money flowers became super popular in Kenya! Everyone loved getting them and giving them. But then, some grown-ups who help keep our money safe had something important to say. They gave a little warning. They said, \"Be careful with these money flowers!\"\n\n<h3>Why Be Careful?</h3>\nNow, this warning doesn't mean money is bad. Not at all! Money is good when it helps people. But it's important to know where big amounts of money come from. Imagine someone gives you a cool new toy. It's awesome! But what if that toy was not bought honestly? That would not be fair, right? It's the same idea with money.\n\n*Did you know? Every banknote has special secret marks to show it's real and not fake! Try to find them with a grown-up!*\n\n<h3>Keeping Money Safe and Fair</h3>\nOur grown-ups, like the government and banks, have special rules for money. These rules help make sure all money is real and used for good things. They want to make sure money is not from unfair games or from bad people. They call this \"clean money.\" When lots of money is folded into a bouquet, it can be hard to know where it started its journey. It's like a secret!\n\n*Did you know? Banks are super safe places where grown-ups keep their money! They are like giant, strong piggy banks!*\n\n<h3>Why are Rules Important?</h3>\nThese rules help keep everyone safe and fair. They help stop bad things from happening with money. For example, if someone got money by cheating, they shouldn't be able to just give it away easily without anyone knowing. The rules help keep track, so everything is open and honest. It's like playing a game – everyone needs to follow the rules so the game is fair for everyone!\n\n<h3>What Does This Mean for Money Flowers?</h3>\nSo, because of these important rules, we might see fewer money flowers around now. Shops might find it harder to make them. People might choose to give money in other ways, like putting it in a bank account, which is easier to track. This helps everyone follow the rules and makes sure money is always used in a good and honest way. It’s all about keeping things safe and transparent for everyone in Kenya.\n\n*Did you know? In Kenya, the money is called the Kenyan Shilling! It has different pictures of animals and famous places!*\n\n<h3>The Real Treasure: Love!</h3>\nBut my dear friends, remember this: the best gift of all is not something you can buy with money! The most important thing is the love and kindness you share. A big hug from someone you love is a precious gift. A picture you draw for your grandma is super special. Helping your family with chores is an amazing gift!\n\n<h3>Love is the Best Gift!</h3>\nA gift doesn't have to be big or shiny or made of money. It's the thought, the feeling, and the love you put into it that truly matters. Whether it's a real flower, a yummy piece of chocolate, or just a kind smile and a helping hand, showing someone you care is the most wonderful gift. It warms hearts and makes everyone feel special.\n\n*Did you know? Giving a compliment or a kind word to someone can make their whole day brighter! It's a free and powerful gift!*\n\n<h3>Let's Be Kind!</h3>\nSo, while money flowers were a fun and sparkly idea in Kenya, we learned that rules help keep things safe and fair for everyone. And no matter what kind of gift you give or get, always remember the love and kindness behind it. Keep sharing your smiles and helping hands! This is your friendly reporter from Africa, signing off with a big wave! Stay kind, stay happy, and keep shining bright!",
    "summary": "In Kenya, people loved giving special 'cash bouquets' made of real money, but rules about knowing where money comes from mean these shiny gifts might be less common now.",
    "whyMatters": "This matters because it teaches us that even fun gifts need to follow rules to keep money safe and make sure everyone is honest.",
    "category": "world",
    "date": "2026-02-14T19:20:38.989Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Sparkly%20Gifts%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-sparkly-gifts-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:20:44.172Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palestinian protester Leqaa Kordia calls ICE custody ‘dehumanising’",
    "title": "A Story About Being Kind to Everyone, Everywhere!",
    "content": "Jambo, amazing friends! Today, we have a very important story from far, far away. It's a story that teaches us about being kind and treating everyone with respect, no matter where they come from or what they are doing. Our story is about a lady named Leqaa Kordia. Let's listen carefully and learn together!\n\n<h3>Meet Leqaa Kordia</h3>\nLeqaa Kordia is a kind lady. She was at a very big school in a country called America. This school is called Columbia. Leqaa was there to speak up for people. She wanted to help people who live in a place called Palestine. Palestine is a country far away from America and from us.\n\nLeqaa really cared about the people in Palestine. She wanted to make sure their voices were heard. Sometimes, when people want to share important messages, they stand together and speak loudly. This is called a protest.\n\n<h3>What is a Protest?</h3>\nImagine you really want your mum or dad to understand something important. Maybe you want to tell them that you think everyone should get to play with the new ball. You might speak up and say, \"Please, let's all share!\" \n\nA protest is a bit like that. It's when many people come together. They want to tell grown-ups, or people in charge, about something important. They want to make things fair. Leqaa was part of a group of people doing this. They were speaking up for people who needed help.\n\nDid you know? People all over the world sometimes protest. They do it to ask for things like clean water, good schools, or safe homes. It’s a way to use their voices together!\n\n<h3>Speaking Up for People Far Away</h3>\nLeqaa cares a lot about people from Palestine. This is her homeland. She felt it was very important to speak up for them. She wanted everyone to know that these people needed kindness and fairness. She stood with her friends at the big school. They used signs and spoke loudly so people would listen.\n\nIt’s wonderful when people care about others, even if they live far away. Just like we care about our neighbours and friends here, Leqaa cared about her people. She wanted everyone to be treated fairly and kindly.\n\n<h3>When Things Got Tricky</h3>\nOne day, while Leqaa was speaking up, some people came. These people work for the country. They are like special helpers who look after the borders of the country. They help make sure rules are followed. Sometimes, when people protest, these border helpers come to watch. Leqaa was asked to go with them.\n\nSo, Leqaa was held by these border helpers. This is sometimes called being in 'custody.' It means they keep you safe, but you cannot go where you want to go. It's a serious thing for grown-ups.\n\nDid you know? Every country has borders! Borders are like invisible lines that show where one country ends and another begins. There are special helpers who watch these borders.\n\n<h3>Leqaa Got Sick</h3>\nWhile Leqaa was with the border helpers, something very scary happened. She became very, very sick. Her body started to shake a lot. This kind of sickness is called a seizure. When someone has a seizure, their body shakes without them wanting it to. It can be very frightening.\n\nWhen Leqaa got sick, the border helpers had to take her to a hospital. A hospital is a very important place. It's where kind doctors and nurses help people who are not feeling well. They give them medicine and make sure they get better.\n\nDid you know? If someone you know has a seizure, the best thing to do is tell a grown-up right away! Doctors and nurses know just what to do to help.\n\n<h3>At the Hospital, But Not Like We Know It</h3>\nWhen Leqaa was at the hospital, she needed to rest. She needed to feel safe and calm. But Leqaa says that something very sad happened to her there. She says that she was tied to her hospital bed. Imagine not being able to move your arms or legs freely, even when you are sick! She felt like she was held down.\n\nLeqaa said she was tied with chains. This made her feel very, very sad. She felt like she was not being treated like a person who needed help. She felt like she was not treated kindly or fairly, especially because she was sick.\n\nDid you know? Hospitals are usually places where people feel safe and loved. Doctors and nurses work very hard to make sure everyone is comfortable and cared for.\n\n<h3>How Leqaa Felt</h3>\nLeqaa said that being tied down like that was 'dehumanising.' This is a big word, but it means she felt like she was treated like she was not a real person. She felt very sad and not important. She felt like she was not given the kindness and respect everyone deserves.\n\nIt’s important that everyone, no matter who they are or where they come from, is treated with kindness. Especially when they are sick and need help. We all deserve to be treated like wonderful, special people.\n\n<h3>Let's Always Be Kind!</h3>\nThis story from far away teaches us a very big lesson. It teaches us that we should always, always be kind. We should treat everyone with respect. We should help people, especially when they are sick or sad.\n\nWhether someone is speaking up for what they believe in, or whether they are feeling unwell, we must remember to show them love and care. Just like we share our toys and play nicely with our friends, we should also share kindness with everyone in the world.\n\nLet's promise to always remember Leqaa's story and try our best to be the kindest kids we can be! Remember, a little bit of kindness can make a very big difference in someone's life. Thank you for listening, my wonderful friends!",
    "summary": "Leqaa Kordia, a lady who spoke up for people from Palestine at a big school, got sick with a seizure while being held by border helpers and says she was sadly tied to her hospital bed, making her feel like she wasn't treated kindly.",
    "whyMatters": "This story matters because it teaches us how important it is to treat everyone with kindness and respect, even when they are protesting or feeling sick, so that everyone feels cared for and important.",
    "category": "technology",
    "date": "2026-02-14T19:21:05.107Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Being%20Kind%20to%20Everyone%2C%20Everywhere!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-being-kind-to-everyone-everywhere",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/2/14/palestinian-protester-leqaa-kordia-calls-ice-custody?traffic_source=rss"
  },
  {
    "originalTitle": "Cynical Pakistan fans brace for heartbreak in India T20 World Cup match",
    "title": "Cheering for Cricket: Pakistan vs. India!",
    "content": "<h3>Hello, Future Sports Stars!</h3>\nHello everyone! This is your friendly news reporter for Africa. Today, we are going to talk about something super exciting! It’s a big sports game. People all around the world love sports. It makes us happy. It makes us cheer. Sports teach us to play fair. They teach us to work together. And today, we are talking about cricket! It is a very popular game. Many children love to play it. They play with a bat and a ball. Have you ever played cricket? It is a lot of fun!\n\n<h3>What is Cricket?</h3>\nCricket is a game played with a bat and a ball. There are two teams. Each team wants to score more points. We call these points \"runs.\" One team hits the ball. The other team tries to catch it. They try to get the players out. When a player gets out, it's called a \"wicket.\" The team that hits tries to make as many runs as they can. The other team tries to stop them. They throw the ball very fast! It’s exciting to watch. It takes a lot of skill to play cricket. Players practice every day. They want to be the best.\n\n**Did you know?** Cricket is played in many countries! It is very popular in places like India, Pakistan, Australia, England, and many parts of Africa, like South Africa!\n\n<h3>The Big World Cup!</h3>\nRight now, there is a very special cricket tournament. It is called the T20 World Cup. A tournament is like a big contest. Many different teams play against each other. They want to win a big prize. They want to be the champions of the world! This World Cup is happening in a country called India. Many teams from different countries have come to play. They all want to lift the shiny trophy! Every match is important. Every team plays their hardest. They make their country proud.\n\n**Did you know?** T20 cricket is a fast game! It usually lasts for about three hours. Regular cricket can last for many days! Wow, that's a long time!\n\n<h3>Meet the Teams: Pakistan and India!</h3>\nGuess what? Two very famous teams are playing a match. It is Pakistan against India! These two countries are neighbours. They both love cricket very, very much. When Pakistan plays India, it's a huge event! Everyone stops to watch. People get very excited. The players are very good. They practice a lot. They wear special uniforms. They have strong bats. They can hit the ball very far! Both teams want to win. It is a tough game for both.\n\n**Did you know?** The players in cricket are called cricketers! They are heroes in their countries. Children look up to them. They want to play like them one day.\n\n<h3>Fans Are So Excited!</h3>\nOh my goodness, the fans! What are fans? Fans are the people who love the teams. They watch the games. They cheer loudly. They wear their team's colours. For the Pakistan vs. India match, fans are super excited! Pakistani fans want their team to win. They know it might be a challenge. But they still hope! They pray for their team. They wave green and white flags. That's the colour of Pakistan's flag! They shout happy cheers. They make lots of noise. It shows how much they love their team.\n\n**Did you know?** Some fans even paint their faces with their team's colours! It's a way to show big support! Imagine seeing all those colourful faces!\n\n<h3>Hoping for a Fun Game!</h3>\nEvery team plays to win. But the most important thing is to play well. It’s important to have fun too! The Pakistani team will try their very best. They will play with all their heart. They will run fast. They will bat strongly. They will try to catch every ball. The fans know this. They know their team will give it their all. Even if it's a tough match, they will be proud. It's about trying your best. It's about sportsmanship. What is sportsmanship? It means playing fair and being kind, even if you win or lose.\n\n**Did you know?** When players shake hands after a game, it shows good sportsmanship! It means they respect each other, no matter who won.\n\n<h3>Did You Know? Fun Cricket Facts!</h3>\nHere are some more cool facts about cricket! The cricket bat is usually made of wood. It is special wood. The cricket ball is very hard. It is like a small, red ball. It helps the ball go fast when thrown! There are special people called umpires. They make sure everyone follows the rules. They wear special coats. They raise their hands to show when someone is out. Just like a referee in football!\n\n**Did you know?** The field where cricket is played is called a \"pitch\"! It is a very big grass field. It has a special part in the middle.\n\n<h3>What Happens Next?</h3>\nSo, the big game is coming! Everyone is waiting to see who will win. Pakistani fans are full of hope. They believe in their team. They will cheer them on with all their might! No matter what, it will be a wonderful game of cricket. It will bring people together. It will make people happy. And that’s what sports are all about! Hooray for cricket! Hooray for playing fair! And hooray for all the amazing fans! We hope for a super fun match for everyone to enjoy!",
    "summary": "Pakistani cricket fans are very excited and hopeful for their team as they get ready to play a big game against India in the T20 World Cup, hoping for a fun and fair match.",
    "whyMatters": "This game is important because it makes many people happy, brings countries together through sports, and shows how much fans love their teams and cheer for them. It teaches us about teamwork and trying our best.",
    "category": "world",
    "date": "2026-02-14T19:21:28.215Z",
    "image": "https://image.pollinations.ai/prompt/Cheering%20for%20Cricket%3A%20Pakistan%20vs.%20India!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "cheering-for-cricket-pakistan-vs-india",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/cynical-pakistan-fans-brace-for-heartbreak-in-india-t20-world-cup-match?traffic_source=rss"
  },
  {
    "originalTitle": "South Africa’s Markram mauls New Zealand in seven-wicket T20 World Cup win",
    "title": "South Africa’s Markram mauls New Zealand in seven-wicket T20 World Cup win",
    "content": "Captain Aiden Markram hits an unbeaten 86 in seven-wicket defeat of New Zealand in Ahmedabad.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:21:33.385Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%E2%80%99s%20Markram%20mauls%20New%20Zealand%20in%20seven-wicket%20T20%20World%20Cup%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africas-markram-mauls-new-zealand-in-seven-wicket-t20-world-cup-win",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/south-africas-markram-mauls-new-zealand-at-t20-world-cup?traffic_source=rss"
  },
  {
    "originalTitle": "Rubio says US and Europe 'belong together' despite tensions",
    "title": "Rubio says US and Europe 'belong together' despite tensions",
    "content": "The US secretary of state reassures European leaders that the Trump administration backs the transatlantic alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:21:39.347Z",
    "image": "https://image.pollinations.ai/prompt/Rubio%20says%20US%20and%20Europe%20'belong%20together'%20despite%20tensions%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "rubio-says-us-and-europe-belong-together-despite-tensions",
    "originalLink": "https://www.bbc.com/news/articles/c2lrdq47149o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "title": "Gisèle Pelicot tells BBC: I felt crushed by horror - but I don't feel anger",
    "content": "In an extensive interview with Newsnight, the woman at the heart of France's biggest rape trial speaks about betrayal, healing and choosing the right path.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:21:44.529Z",
    "image": "https://image.pollinations.ai/prompt/Gis%C3%A8le%20Pelicot%20tells%20BBC%3A%20I%20felt%20crushed%20by%20horror%20-%20but%20I%20don't%20feel%20anger%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "gisele-pelicot-tells-bbc-i-felt-crushed-by-horror-but-i-dont-feel-anger",
    "originalLink": "https://www.bbc.com/news/articles/c9q5l22ryy4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Police activity under way near Nancy Guthrie's home",
    "title": "Police activity under way near Nancy Guthrie's home",
    "content": "A search has been carried out in Tuscon, Arizona, close to where the 84-year-old was abducted nearly two weeks ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:21:49.698Z",
    "image": "https://image.pollinations.ai/prompt/Police%20activity%20under%20way%20near%20Nancy%20Guthrie's%20home%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "police-activity-under-way-near-nancy-guthries-home",
    "originalLink": "https://www.bbc.com/news/articles/cly8j19rql7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Kane reaches 500 goals - what other records could he break?",
    "title": "Kane reaches 500 goals - what other records could he break?",
    "content": "Bayern Munich striker Harry Kane became the first Englishman to reach 500 career goals on Saturday, but what other records could he break?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:21:55.301Z",
    "image": "https://image.pollinations.ai/prompt/Kane%20reaches%20500%20goals%20-%20what%20other%20records%20could%20he%20break%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kane-reaches-500-goals-what-other-records-could-he-break",
    "originalLink": "https://www.bbc.com/sport/football/articles/c743xp1xw9yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mansfield's Reed scores fabulous free-kick to upset Burnley",
    "title": "Mansfield's Reed scores fabulous free-kick to upset Burnley",
    "content": "Watch Mansfield Town's Louis Reed produce \"set-piece sorcery,\" scoring a sensational free kick to stun Premier League side Burnley and reach the FA Cup fifth round.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:22:00.464Z",
    "image": "https://image.pollinations.ai/prompt/Mansfield's%20Reed%20scores%20fabulous%20free-kick%20to%20upset%20Burnley%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mansfields-reed-scores-fabulous-free-kick-to-upset-burnley",
    "originalLink": "https://www.bbc.com/sport/football/videos/cp8rn3v2lmgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "From 'demoralising' 8-0 defeat to pushing Man City all the way ",
    "title": "From 'demoralising' 8-0 defeat to pushing Man City all the way ",
    "content": "Thirteen months after being embarrassed 8-0 by Manchester City, Salford City produce a performance to make their fans proud.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T19:22:05.663Z",
    "image": "https://image.pollinations.ai/prompt/From%20'demoralising'%208-0%20defeat%20to%20pushing%20Man%20City%20all%20the%20way%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "from-demoralising-8-0-defeat-to-pushing-man-city-all-the-way",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9v0kwpd9z4o?at_medium=RSS&at_campaign=rss"
  }
]