[
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "Super Soldiers and Police Team Up in South Africa!",
    "content": "<h3>Hello from Sunny South Africa!</h3>\nHello everyone! I'm your friendly news reporter, bringing you exciting news from our amazing continent, Africa! Today, we have some very important news from a beautiful country called South Africa.\n\nSouth Africa is a country far, far away, at the very bottom of Africa. It has sunny beaches, big mountains, and many friendly people. It's a special place with lots of wonderful animals and beautiful plants.\n\n*Did you know? South Africa is famous for its 'Big Five' animals: lions, leopards, elephants, rhinos, and buffalo! People travel from all over the world to see them!*\n\nMeet President Cyril Ramaphosa. He is the leader of South Africa. Think of him like the head teacher for the whole country! He works very hard to make sure everyone is safe and happy.\n\n<h3>Soldiers and Police are Teaming Up!</h3>\nPresident Ramaphosa has shared some big news. He says that the brave soldiers in South Africa will now work together with the police. They are going to team up!\n\nThis means they will help each other do an even better job of keeping everyone safe. It's like superheroes joining forces to fight the bad guys!\n\nWhen people \"team up,\" it means they join hands and work together. Just like when you and your friends team up to build a giant sandcastle or clean up your playground.\n\n<h3>Who are the Soldiers?</h3>\nSoldiers are very brave men and women. They wear special uniforms and train very hard. Their job is to protect their country and all the people in it.\n\nSoldiers are also called the army. They often drive big trucks and special vehicles. They are like very strong protectors!\n\nSometimes, soldiers help people when there are big problems, like floods or other disasters. They are always ready to help keep everyone safe from harm.\n\n<h3>Who are the Police?</h3>\nThe police are also very brave people who wear uniforms. You might see them in your town or village. They have cars with flashing lights and loud sirens!\n\nTheir job is to make sure everyone follows the rules, which we call laws. If someone does something wrong, the police help to fix it and make things right.\n\nThey help find lost things, help people who are in trouble, and make sure our streets are safe for us to play and walk. They are our everyday heroes.\n\n*Did you know? Police cars use special lights and sirens to let people know they are coming quickly to help!*\n\n<h3>Why Are They Teaming Up?</h3>\nThe President wants the soldiers and police to work together like a super team! They will help each other stop bad things from happening. This will make South Africa a safer place for everyone.\n\nWorking together means they can be stronger and faster. They can cover more places and help even more people. It's a very clever idea!\n\nTheir big mission is to stop people who do \"organised crime\" and \"illegal mining.\" These are big words, so let's learn what they mean in a simple way!\n\n<h3>What is Organised Crime?</h3>\n\"Crime\" means doing something that is against the rules. For example, taking something that is not yours, or hurting someone. These things make people sad and scared.\n\n\"Organised crime\" is when a *group* of bad people work *together* to do many bad things. They plan it all out, like a secret bad club.\n\nThese groups might try to steal many things, or trick people, or cause trouble in towns. This makes it hard for good people to live peacefully and happily.\n\nIt's like if a whole gang of bullies decided to cause trouble for everyone in the playground. That's why the police and soldiers need to stop them quickly.\n\n*Did you know? When good people work together, amazing things can happen, like building a new school or helping sick animals get better!*\n\n<h3>What is Illegal Mining?</h3>\n\"Mining\" is when people dig deep into the earth to find special, valuable things. These can be shiny gold, sparkling diamonds, or strong metals. These things are very useful for our country.\n\nBut to mine, you need special permission from the government. You need to do it safely and in the right places. It's like needing permission to play in someone else's garden.\n\n\"Illegal mining\" means digging for these valuable things *without* permission. It's like going into someone's garden and digging up their flowers without asking! That's not fair.\n\nThis kind of digging can be very dangerous. The ground can collapse, and people can get hurt. It also damages our beautiful earth and takes away things that belong to everyone in the country.\n\nSometimes, the bad people doing illegal mining also cause other problems in the communities around them. They make noise, create dust, and can make people feel unsafe.\n\nThe soldiers and police will help stop this dangerous and unfair digging. They want to make sure the earth is safe and that valuable resources are used correctly for everyone's benefit.\n\n<h3>Why This Helps You and Your Family</h3>\nWhen soldiers and police work hard to stop bad people, everyone in South Africa can feel safer and happier. It means fewer worries for families.\n\nChildren can play outside more freely without fear. Parents can go to work or the market without worry. Families can live in peace in their homes.\n\nIt means fewer bad things happening in our towns and villages. It means a better, brighter future for every child in South Africa.\n\nThe President wants all children in South Africa to grow up in a safe, healthy, and happy country. This big team-up is helping to make that happen.\n\n*Did you know? Feeling safe means feeling calm and not scared. When we are safe, we can learn better, play more, and grow stronger!*\n\n<h3>A Brighter Future for South Africa</h3>\nSo, the brave soldiers and police in South Africa are becoming a super team! They are working together to make their country a wonderful and safe place for everyone to live.\n\nThey are fighting against bad groups doing crime and stopping dangerous digging that harms the earth and people. This is a very important job!\n\nWe can all cheer for them and hope that South Africa becomes even safer and happier because of their hard work. It shows that when good people work together, they can solve big problems and make the world a better place for all.\n",
    "summary": "South Africa's President Cyril Ramaphosa announced that soldiers will work with the police to stop bad groups doing organised crime and dangerous illegal digging, making the country safer for everyone.",
    "whyMatters": "This is important because it means the brave helpers like soldiers and police are joining forces to protect families and children from bad people, helping everyone in South Africa feel safe and happy to play and learn.",
    "category": "politics",
    "date": "2026-02-13T17:37:14.202Z",
    "image": "https://image.pollinations.ai/prompt/Super%20Soldiers%20and%20Police%20Team%20Up%20in%20South%20Africa!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "super-soldiers-and-police-team-up-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "A seat at the table or on the menu? Africa grapples with the new world order",
    "title": "A seat at the table or on the menu? Africa grapples with the new world order",
    "content": "The US president has shaken up international relations and the continent is working out where it stands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:37:19.379Z",
    "image": "https://image.pollinations.ai/prompt/A%20seat%20at%20the%20table%20or%20on%20the%20menu%3F%20Africa%20grapples%20with%20the%20new%20world%20order%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-seat-at-the-table-or-on-the-menu-africa-grapples-with-the-new-world-order",
    "originalLink": "https://www.bbc.com/news/articles/c2d7wk98xkko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Brilliant Muzarabani helps Zimbabwe stun Australia",
    "title": "WOW! Zimbabwe Cricket Heroes Shine Bright!",
    "content": "<h3>Hello, Amazing Kids of Africa!</h3>\nGet ready for some super exciting news that made everyone in Africa cheer really, really loud! It's about a fantastic game called cricket, and our very own heroes from Zimbabwe did something absolutely incredible! They played against a super strong team called Australia and guess what? Zimbabwe WON! It was like magic!\n\n<h3>What is Cricket, My Friends?</h3>\nFirst, let's talk about cricket! Imagine a game where two teams try to hit a ball with a bat and run to score points, called 'runs'. One team throws the ball (that's called 'bowling'), and the other team tries to hit it really far! If they hit it, they run between two sets of sticks, called 'wickets', to score runs. It's super fun and needs lots of skill, running, and teamwork! Sometimes, the bowler can get a player 'out' by hitting their wicket or catching the ball. Each team tries to score more runs than the other to win.\n\n<h3>Meet Our Brave Teams</h3>\nZimbabwe is a beautiful country right here in Africa, full of amazing people and nature! Australia is a big country far, far away, across the ocean. When it comes to cricket, Australia is famous for having one of the strongest teams in the whole world! They have won many big, big games and trophies. So, playing against Australia is a huge challenge, like trying to beat the champion in a running race. But our Zimbabwe team was brave and ready!\n\n<h3>The Big Game: T20 World Cup!</h3>\nThis was not just any game! It was part of something really special called the T20 World Cup. Imagine it like a huge championship where the very best cricket teams from all over the world come to play and see who is the champion! T20 is a fast and exciting type of cricket game. Each game lasts about three hours, so there's lots of action and excitement in a short time! Winning a game in the T20 World Cup is a very, very big deal, especially against a team like Australia.\n\n<h3>Our African Hero: Blessing Muzarabani!</h3>\nIn this super exciting game, one player from Zimbabwe was like a superhero! His name is Blessing Muzarabani. Blessing is a tall and strong player, and he throws the cricket ball really, really fast! When he throws the ball, it can be very hard for the other team's players to hit it. He was absolutely amazing in this game, and he played a huge part in Zimbabwe's big win!\n\n<h3>Blessing's Magic Bowling!</h3>\nBlessing Muzarabani did something called \"4-17.\" What does that mean in simple words? It means he was so good at throwing the ball that he managed to get *four* of Australia's best players 'out'! And when the Australian players tried to score points against his amazing throws, they only managed to get '17' runs. This is like a goalkeeper in soccer stopping four big shots and only letting the other team score a few goals against them. It takes incredible skill and focus to do something like that!\n\nDid you know? Cricket balls are very hard and usually red or white! Players wear special pads to protect their legs when they are batting.\n\n<h3>Zimbabwe Wins! Hooray! What a Surprise!</h3>\nBecause Blessing Muzarabani and all his teammates played so, so well, Zimbabwe beat Australia! They won by \"23 runs.\" This means Zimbabwe scored 23 more points than Australia did! Imagine if Australia scored 100 points, then Zimbabwe scored 123 points! They won by a good number of points! It was a very big surprise for everyone because most people thought Australia, being the stronger team, would win easily. But Zimbabwe believed in themselves and played with all their heart!\n\n<h3>Holding Their Nerve!</h3>\nThe news said Zimbabwe \"held their nerve.\" What does that mean? It means they stayed calm and brave even when the game was very tense and exciting. They didn't get scared or give up, even when things got tough. They kept trying their best until the very end, and that's why they won! It shows how strong and determined our African players are.\n\nDid you know? Zimbabwe is also home to Victoria Falls, one of the biggest and most beautiful waterfalls in the world! It's a truly special country.\n\n<h3>Teamwork Makes the Dream Work!</h3>\nThis amazing win wasn't just about Blessing Muzarabani, even though he was a superstar. Oh no! It was about *every single player* on the Zimbabwe team working together. They clapped for each other, they helped each other when someone made a mistake, and they never, ever gave up. When you work together as a team, amazing things can happen! Just like when you play games with your friends at school, working together makes you stronger.\n\n<h3>A Happy Day for Africa!</h3>\nThis win made everyone in Zimbabwe and many people across Africa so happy and proud! It showed the whole world that even if a team is not always famous for winning, they can still beat the very best if they try their hardest, work as a team, and believe in themselves. It shows the power and talent that we have right here in Africa!\n\n<h3>What We Learn from Our Heroes</h3>\nThis wonderful story teaches us that it's important to always try your best, even if the challenge seems very big. Believe in yourself and your friends. Never, ever give up, no matter how hard it looks. Our Zimbabwe cricket team showed us all that with hard work and teamwork, anything is possible! Let's give a big cheer for Blessing Muzarabani and the entire Zimbabwe cricket team! They made all of Africa proud!\n",
    "summary": "Zimbabwe's cricket team, led by brilliant bowler Blessing Muzarabani, surprised the world by beating strong team Australia in the T20 World Cup, showing amazing teamwork and skill.",
    "whyMatters": "This is important because it shows that even smaller teams can beat very strong ones if they try their best and work together, making everyone in Africa very proud and inspired.",
    "category": "world",
    "date": "2026-02-13T17:37:41.348Z",
    "image": "https://image.pollinations.ai/prompt/WOW!%20Zimbabwe%20Cricket%20Heroes%20Shine%20Bright!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wow-zimbabwe-cricket-heroes-shine-bright",
    "originalLink": "https://www.bbc.com/sport/cricket/articles/cy4wp31nz19o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Real Madrid vs Real Sociedad: La Liga – teams, start time, lineups",
    "title": "Real Madrid vs Real Sociedad: La Liga – teams, start time, lineups",
    "content": "Real Madrid have the chance to move to the top of La Liga, and silence their own fans, when Sociedad visit Bernabeu.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:37:46.648Z",
    "image": "https://image.pollinations.ai/prompt/Real%20Madrid%20vs%20Real%20Sociedad%3A%20La%20Liga%20%E2%80%93%20teams%2C%20start%20time%2C%20lineups%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "real-madrid-vs-real-sociedad-la-liga-teams-start-time-lineups",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/13/real-madrid-vs-real-sociedad-la-liga-teams-start-time-lineups?traffic_source=rss"
  },
  {
    "originalTitle": "UN accuses paramilitary RSF of committing war crimes in Sudan’s el-Fasher",
    "title": "UN accuses paramilitary RSF of committing war crimes in Sudan’s el-Fasher",
    "content": "UN rights chief urges probe as new report details mass killings, sexual violence and targeted attacks against civilians.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:37:51.814Z",
    "image": "https://image.pollinations.ai/prompt/UN%20accuses%20paramilitary%20RSF%20of%20committing%20war%20crimes%20in%20Sudan%E2%80%99s%20el-Fasher%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "un-accuses-paramilitary-rsf-of-committing-war-crimes-in-sudans-el-fasher",
    "originalLink": "https://www.aljazeera.com/news/2026/2/13/un-accuses-paramilitary-rsf-of-committing-war-crimes-in-sudans-el-fasher?traffic_source=rss"
  },
  {
    "originalTitle": "UK court says Palestine Action ban ‘unlawful’: What does the verdict mean?",
    "title": "UK court says Palestine Action ban ‘unlawful’: What does the verdict mean?",
    "content": "Activists welcome the court ruling but the UK government says it will appeal the verdict.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:37:56.983Z",
    "image": "https://image.pollinations.ai/prompt/UK%20court%20says%20Palestine%20Action%20ban%20%E2%80%98unlawful%E2%80%99%3A%20What%20does%20the%20verdict%20mean%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-court-says-palestine-action-ban-unlawful-what-does-the-verdict-mean",
    "originalLink": "https://www.aljazeera.com/news/2026/2/13/uk-court-says-palestine-action-ban-unlawful-what-does-the-verdict-mean?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "Playing Fair: Why Rules Matter for Our World!",
    "content": "Hello, amazing friends from our beautiful continent of Africa! It's your friendly reporter here, bringing you super important news from around the world. Imagine you are playing a fun game with your friends. What do you need to play nicely and have fun? Rules, right? Like, no pushing, no cheating, and sharing the ball! Well, guess what? Countries all around the world also have rules to play by, so everyone can live in peace and be happy and free.\n\nToday, we're going to talk about why these rules are super, super important. A very smart man from a country called Germany recently spoke about this. He said that sometimes, it feels like these important rules are not always being followed by everyone. Let's find out more!\n\n<h3>What Are These 'World Rules'?</h3>\n\nThink about your classroom or your playground. You have rules, right? You share toys, you take turns, you don't fight, and you help each other. These rules make sure everyone is safe and has a good time. Well, countries have similar rules, but on a much bigger scale!\n\nThese 'world rules' are like promises that countries make to each other. They promise to respect each other's lands, not to hurt other countries, and to talk things out if there's a problem, instead of fighting. They promise to help people who are in need and to work together to make the world a better place for everyone, especially for kids like you!\n\nDid you know? The United Nations is like a very big club where almost all the countries in the world are members! They meet to talk about these rules and make sure everyone tries to follow them. It's like a big school assembly for countries!\n\n<h3>Who is Talking About This?</h3>\n\nAn important person named Mr. Merz from Germany was speaking at a big meeting. Germany is a country very far away from us, in Europe. Mr. Merz is a leader there, someone who helps make important decisions for his country. He was at a special meeting where lots of important people from different countries come together.\n\nThey meet to talk about how to keep everyone safe and how to make sure countries are good neighbours. It's called a 'security summit' – which just means a really big talk about keeping the world secure and peaceful. He wants to make sure everyone understands how important these world rules are.\n\n<h3>What Did Mr. Merz Say?</h3>\n\nMr. Merz said something like, \"Our freedom is not guaranteed.\" Now, that might sound a little scary, but let's understand what he means in a simple way. Imagine you have the freedom to play outside, go to school, and hug your family. These are wonderful freedoms!\n\nMr. Merz is worried that if countries don't follow the 'world rules', then these freedoms for people everywhere might not always be safe. When big countries don't play by the rules, they might try to do things that hurt other, smaller countries, or even their own people.\n\nIt's like if a big bully in the playground decided to ignore all the rules and take everyone's toys. That would make it hard for anyone to play freely or feel safe, right? He wants all countries to remember that playing fair keeps everyone safe and free.\n\nDid you know? Germany is known for its yummy sausages and big, beautiful castles! It's also a country that loves to work with other countries to promote peace.\n\n<h3>Why is Freedom So Important?</h3>\n\nFreedom means you can learn at school, tell your parents what you think, and choose your favourite game to play. It means you can grow up in a safe place, without worrying about wars or unfair treatment. Every child in Africa and all over the world deserves to be free and happy.\n\nWhen countries follow the rules, it helps to keep peace. And when there is peace, children can go to school, families can grow food, and communities can build new things. Everyone gets to live their lives with a lot more joy and less worry. It's a wonderful feeling to be free and safe!\n\nMr. Merz is reminding everyone that we should not take this peace and freedom for granted. We have to work hard to keep it, just like you work hard to be a good friend and follow school rules.\n\n<h3>What Happens When Rules are Broken?</h3>\n\nWhen rules are broken, it can cause problems. If one country doesn't respect another's land, it can lead to sadness and even fighting. This can make people leave their homes, or make it hard for kids to go to school. No one wants that!\n\nThese 'world rules' are there to stop bad things from happening and to help everyone live together without too much fuss. They are like a big safety net for all of us. When countries remember these rules, it's easier to share, help each other, and solve problems without fighting.\n\nDid you know? Our beautiful continent of Africa is home to many different countries, and we all try to work together as good neighbours too! We have our own groups, like the African Union, that help countries in Africa play by the rules and help each other.\n\n<h3>What Can We Learn?</h3>\n\nFrom Mr. Merz's words, we can all remember how important it is to be kind, respectful, and to follow rules. This is true for you at home, at school, and for leaders of countries around the world.\n\nWhen we all play fair and follow the rules, we create a happier, safer world for everyone. It means that children in Africa, Germany, and everywhere else can grow up with the freedom to learn, play, and dream big dreams.\n\nSo, let's keep playing by the rules, sharing with our friends, and being kind. Because when we do that, we are all helping to make the world a much more wonderful and free place for everyone!\n\nThank you for listening, amazing friends! Stay curious and keep smiling!\n",
    "summary": "An important leader from Germany, Mr. Merz, said that world rules are very important for peace and freedom, and he is worried some big countries might not always be following them, which could make it harder for everyone to stay safe and free.",
    "whyMatters": "This is important because when countries follow fair rules, it helps everyone live in peace, go to school, play, and be free, just like following rules in a game makes it fun and fair for all players.",
    "category": "world",
    "date": "2026-02-13T17:38:16.614Z",
    "image": "https://image.pollinations.ai/prompt/Playing%20Fair%3A%20Why%20Rules%20Matter%20for%20Our%20World!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "playing-fair-why-rules-matter-for-our-world",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Bangladesh Nationalist Party sweeps to victory in first election since Gen Z uprising",
    "title": "Bangladesh Nationalist Party sweeps to victory in first election since Gen Z uprising",
    "content": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:38:21.790Z",
    "image": "https://image.pollinations.ai/prompt/Bangladesh%20Nationalist%20Party%20sweeps%20to%20victory%20in%20first%20election%20since%20Gen%20Z%20uprising%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bangladesh-nationalist-party-sweeps-to-victory-in-first-election-since-gen-z-uprising",
    "originalLink": "https://www.bbc.com/news/articles/cgrzwn4yg7jo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six possible effects of Trump's climate policy change ",
    "title": "Six possible effects of Trump's climate policy change ",
    "content": "The announcement on Thursday removes the legal bedrock for much of US environmental legislation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:38:26.948Z",
    "image": "https://image.pollinations.ai/prompt/Six%20possible%20effects%20of%20Trump's%20climate%20policy%20change%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-possible-effects-of-trumps-climate-policy-change",
    "originalLink": "https://www.bbc.com/news/articles/cd03ee39945o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Tudor agrees deal to become Spurs' interim boss",
    "title": "Tudor agrees deal to become Spurs' interim boss",
    "content": "Igor Tudor agrees a deal to become Tottenham interim head coach until the end of the season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:38:32.546Z",
    "image": "https://image.pollinations.ai/prompt/Tudor%20agrees%20deal%20to%20become%20Spurs'%20interim%20boss%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "tudor-agrees-deal-to-become-spurs-interim-boss",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg87wlv7lmo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pereira signs deal as Forest boss until end of next season",
    "title": "Pereira signs deal as Forest boss until end of next season",
    "content": "Vitor Pereira has signed a deal until the end of next season to become Nottingham Forest's fourth manager of the campaign.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-13T17:38:37.721Z",
    "image": "https://image.pollinations.ai/prompt/Pereira%20signs%20deal%20as%20Forest%20boss%20until%20end%20of%20next%20season%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pereira-signs-deal-as-forest-boss-until-end-of-next-season",
    "originalLink": "https://www.bbc.com/sport/football/articles/c9wnrqwzrneo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Man City's Rodri charged over 'not fair' referee comments",
    "title": "Man City's Rodri charged over 'not fair' referee comments",
    "content": "Manchester City midfielder Rodri is charged with misconduct by the Football Association following comments he made about referees following his side's 2-2 draw with Tottenham earlier this month.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-13T17:38:42.888Z",
    "image": "https://image.pollinations.ai/prompt/Man%20City's%20Rodri%20charged%20over%20'not%20fair'%20referee%20comments%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "man-citys-rodri-charged-over-not-fair-referee-comments",
    "originalLink": "https://www.bbc.com/sport/football/articles/c2lrdj55zypo?at_medium=RSS&at_campaign=rss"
  }
]