[
  {
    "originalTitle": "Gold fever hits South Africa after lucky find in cattle pen",
    "title": "Wow! Shiny Gold Found in a Cow Pen in South Africa!",
    "content": "<h3>Hello, Super Friends!</h3>\n\nGuess what? Exciting news is coming all the way from South Africa! We've heard a story that sounds like a real-life treasure hunt. It's about sparkling, shiny gold! Can you believe it? People are super excited.\n\n\nThis amazing thing happened in a place called Springs. Springs is a town in South Africa. It's a busy place. And now, it's even more exciting because of gold!\n\n\n<h3>What Happened? A Lucky Find!</h3>\n\nImagine this: A farmer was just going about his day. He has a cattle pen. That's a special place where cows live and sleep. One day, something very special happened right there.\n\n\nSome children were playing near the cattle pen. They were just having fun. Then, they saw something glinting! Something shiny in the ground. They dug a little bit. And what did they find? Gold!\n\n\nIt was not just a little piece. It was a good amount of gold! It was like finding a secret treasure. This made everyone very happy and very surprised. Who knew gold was hiding there?\n\n\n<h3>What is Gold, Anyway?</h3>\n\nGold is a very special metal. It is yellow and very shiny. It does not rust like some other metals. Gold is also very heavy for its size.\n\n\nPeople love gold because it is beautiful. They make lovely jewelry with it, like rings and necklaces. It also sparkles a lot. That's why it's so pretty.\n\n\n**Did you know?** Gold has been used for thousands of years! Even ancient kings and queens loved gold. They used it to make crowns and statues.\n\n\n<h3>Gold Fever!</h3>\n\nWhen people heard about the gold in Springs, everyone got very excited. This is what we call 'gold fever'. It means lots and lots of people want to find gold too! They hope to get lucky.\n\n\nMany people came to Springs. They came with shovels and picks. They wanted to dig in the ground. They hoped to find more gold near where the first gold was found. It's like a big treasure hunt for everyone!\n\n\nThese people are called 'miners'. Miners are people who dig deep into the earth. They look for precious things like gold or diamonds. It's hard work, but they hope to find something wonderful.\n\n\nOne miner told a reporter, \"This is the only work we know.\" This means that digging for gold is how they try to make money. They work very hard for their families.\n\n\nThey want to find gold to sell it. Then, they can buy food. They can buy clothes. They can help their families have a better life. It is a very important job for them.\n\n\n<h3>Where is Springs?</h3>\n\nSprings is a town in South Africa. South Africa is a big country in Africa. It is known for having lots of natural treasures. One of them is gold!\n\n\n**Did you know?** South Africa is one of the biggest gold producers in the whole world! Many years ago, lots of gold was found there. People came from all over to dig.\n\n\nThis new discovery in Springs makes people hopeful. Maybe there is more gold hiding just under the ground. It is an exciting thought for everyone.\n\n\n<h3>How Do They Dig for Gold?</h3>\n\nThese miners use simple tools. They use shovels to dig. They use picks to break up the hard ground. They dig up soil and rocks.\n\n\nThen, they look very carefully. They watch for anything shiny. Sometimes, they wash the soil. Water helps to separate the heavier gold from the lighter dirt. It's like a scientific experiment!\n\n\nIt takes a lot of patience. You might dig all day and find nothing. But then, you might find a little piece. And that little piece can make someone's day very special.\n\n\n<h3>Why is Gold So Special?</h3>\n\nGold is special because it is rare. That means there is not a lot of it in the world. Things that are rare are usually worth more money.\n\n\nGold is also special because it shines. It does not lose its shine easily. That's why people love to wear gold jewelry. It stays beautiful for a very long time.\n\n\n**Did you know?** Gold is also used in many electronics, like your phone or computer! Just a tiny bit of gold helps them work. Isn't that amazing?\n\n\n<h3>Safety First!</h3>\n\nDigging for gold can be hard. Sometimes, it can be a little bit dangerous. People need to be careful when they dig.\n\n\nThey need to watch out for unstable ground. They should also make sure they have enough water to drink. It's important to be safe while looking for treasure.\n\n\nThe government also has rules about digging for gold. It's important to follow these rules. This helps to keep everyone safe and make sure things are done fairly.\n\n\nSo, the hunt for shiny gold continues in Springs! It's a story of hope and hard work. And maybe, just maybe, more gold will be found. What an adventure!\n\n\nIt shows us that sometimes, amazing things can be found in the most unexpected places. Even in a cow pen! Isn't that just super cool?",
    "summary": "People are very excited after shiny gold was found by children in a farmer's cow pen in Springs, South Africa, making many people eager to dig and search for more treasure.",
    "whyMatters": "This matters because finding gold can help people earn money to feed their families and buy important things, bringing hope and jobs to communities in South Africa.",
    "category": "world",
    "date": "2026-02-18T04:17:43.439Z",
    "image": "https://image.pollinations.ai/prompt/Wow!%20Shiny%20Gold%20Found%20in%20a%20Cow%20Pen%20in%20South%20Africa!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "wow-shiny-gold-found-in-a-cow-pen-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/c9dne6z4p9qo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers",
    "title": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers",
    "content": "It is the latest twist over the fate of Lungu's body, which remains in a South African morgue since his death.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:17:48.575Z",
    "image": "https://image.pollinations.ai/prompt/Family%20of%20Zambia's%20ex-President%20Lungu%20dismiss%20poisoning%20allegation%20-%20lawyers%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "family-of-zambias-ex-president-lungu-dismiss-poisoning-allegation-lawyers",
    "originalLink": "https://www.bbc.com/news/articles/ckg18yqwlplo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "US soldiers arrive in Nigeria to aid its fight against Islamist militants",
    "title": "US soldiers arrive in Nigeria to aid its fight against Islamist militants",
    "content": "The troops, who landed at an airfield in Bauchi state, will not take part in combat operations, officials say.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-18T04:17:53.712Z",
    "image": "https://image.pollinations.ai/prompt/US%20soldiers%20arrive%20in%20Nigeria%20to%20aid%20its%20fight%20against%20Islamist%20militants%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-soldiers-arrive-in-nigeria-to-aid-its-fight-against-islamist-militants",
    "originalLink": "https://www.bbc.com/news/articles/cj6d79gyrdro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Over 80 film workers slam Berlin festival’s silence on Israel’s Gaza war",
    "title": "Over 80 film workers slam Berlin festival’s silence on Israel’s Gaza war",
    "content": "Tilda Swinton and Javier Bardem among actors and directors expressing dismay at Berlinale's 'anti-Palestinian racism'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:17:58.989Z",
    "image": "https://image.pollinations.ai/prompt/Over%2080%20film%20workers%20slam%20Berlin%20festival%E2%80%99s%20silence%20on%20Israel%E2%80%99s%20Gaza%20war%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "over-80-film-workers-slam-berlin-festivals-silence-on-israels-gaza-war",
    "originalLink": "https://www.aljazeera.com/news/2026/2/18/over-80-film-workers-slam-berlin-festivals-silence-on-israels-gaza-war?traffic_source=rss"
  },
  {
    "originalTitle": "Kremlin official says Russian navy to stop West’s seizure of merchant ships",
    "title": "Kremlin official says Russian navy to stop West’s seizure of merchant ships",
    "content": "Russian official says Western powers seizing sanctioned vessels carrying Moscow's oil commit 'piracy-like attacks'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:04.129Z",
    "image": "https://image.pollinations.ai/prompt/Kremlin%20official%20says%20Russian%20navy%20to%20stop%20West%E2%80%99s%20seizure%20of%20merchant%20ships%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "kremlin-official-says-russian-navy-to-stop-wests-seizure-of-merchant-ships",
    "originalLink": "https://www.aljazeera.com/news/2026/2/18/kremlin-official-says-russian-navy-to-stop-wests-seizure-of-merchant-ships?traffic_source=rss"
  },
  {
    "originalTitle": "‘Tug of war’: Democrats push Trump to release New York City tunnel funds",
    "title": "Big Dig, Little Money: News from Far Away!",
    "content": "<p>Hello, my awesome friends in Africa! It’s me, your kid-friendly news reporter, zooming in from far, far away! Today, we have a story from a big city called New York in a country far from us.</p>\n\n<h3>A Super Big Hole Under the Ground!</h3>\n<p>Imagine you are playing in the sand, and you dig a really long tunnel. You push your toy cars through it. That's super fun, right?</p>\n<p>Well, in New York City, grown-ups are building a super, super big tunnel! It's not for toy cars, though. It's for real, giant trains!</p>\n<p>This tunnel goes under a big river. It's a very long and important pathway.</p>\n<p>Did you know? The longest tunnel in the whole world is in Switzerland! It's called the Gotthard Base Tunnel, and it's so long, it takes a train about 20 minutes to go through it!</p>\n\n<h3>Trains Need Tunnels Too!</h3>\n<p>These trains help many, many people every single day. They take people to their jobs, to school, or to visit friends and family.</p>\n<p>Think about how you travel to school. Maybe you walk, or go by car, or a bus. In big cities like New York, many people use trains because there are so many people!</p>\n<p>These trains are very fast and help people move around the busy city quickly.</p>\n<p>Did you know? The first train ever built was a very long time ago, in 1804! It used steam to move, like a big, puffing kettle!</p>\n\n<h3>Building Something Big Costs Lots of Money!</h3>\n<p>Building a super big tunnel for trains is a super big job. It needs lots of clever people called engineers and many strong workers.</p>\n<p>They need giant machines to dig through the earth. They need strong materials like concrete and steel to make sure the tunnel is safe and strong.</p>\n<p>All these things – the people, the machines, the materials – cost a lot, a lot of money! It's like saving up your pocket money for a super big toy that you really, really want.</p>\n<p>This big tunnel project is called the Gateway Project. It’s a very important project for New York City.</p>\n<p>Did you know? Building one kilometer of a big road can cost millions of dollars! Imagine how much a super long tunnel costs!</p>\n\n<h3>Oh No! Not Enough Money!</h3>\n<p>Here's where the news comes in. There's a leader in New York called Governor Kathy Hochul. A governor is like the leader of a big part of a country, kind of like a chief of a very big village or region.</p>\n<p>Governor Kathy said that some money was given for the tunnel, but it's not enough! Imagine you are saving for that super big toy, and you only have half the money you need.</p>\n<p>The grown-ups were expecting more money to help finish the tunnel. They need what they call \"funds,\" which is just a fancy word for money.</p>\n<p>They got 77 million dollars, which sounds like a lot, right? But for this super big tunnel, it's not all of the money they need.</p>\n<p>Did you know? The number 77 million is like counting one dollar every second for over two years! That's a lot of seconds!</p>\n\n<h3>Asking for More Help</h3>\n<p>So, Governor Kathy and other leaders are saying, \"Please, we need more money to finish our important train tunnel!\"</p>\n<p>They are asking other leaders to give the rest of the money that was promised for this big project.</p>\n<p>It's important that they get all the money because if they don't, the tunnel might not get finished on time. And that would be sad for all the people who need to use the trains!</p>\n<p>Think about it like this: if you start building a sandcastle and run out of water, you can't finish your amazing castle!</p>\n\n<h3>Why This Tunnel is So Special</h3>\n<p>This tunnel is not just a hole in the ground. It's a way to connect people, to help them move and grow.</p>\n<p>When the tunnel is finished, trains will run smoothly, helping hundreds of thousands of people every day. It means people can get to where they need to be, faster and safer.</p>\n<p>It helps keep the city working and makes life better for many families.</p>\n<p>Did you know? New York City is one of the biggest cities in the world! Millions of people live and work there every day, just like busy ants!</p>\n\n<h3>Working Together to Build Better Cities</h3>\n<p>Sometimes, leaders might not agree on everything, but it's super important for them to talk and work together.</p>\n<p>When everyone helps, big projects like this tunnel can be finished, and everyone can be happy and benefit.</p>\n<p>We hope the leaders in New York can talk and find a way to get all the money needed so that this amazing train tunnel can be finished for all the people.</p>\n<p>It shows that even in far-away places, leaders work hard to make things better for the people, just like our leaders here in Africa work hard for us.</p>\n<p>That's all the news from far away for today! Keep smiling, and keep learning, my friends!</p>",
    "summary": "Leaders in New York City need more money to finish building a very important train tunnel that helps many people travel every day.",
    "whyMatters": "This is important because without enough money, the big train tunnel might not get finished. If it's not finished, many people won't be able to travel easily to work, school, or visit family, making life harder for them.",
    "category": "world",
    "date": "2026-02-18T04:18:22.031Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Dig%2C%20Little%20Money%3A%20News%20from%20Far%20Away!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-dig-little-money-news-from-far-away",
    "originalLink": "https://www.aljazeera.com/news/2026/2/18/tug-of-war-democrats-push-trump-to-release-new-york-city-tunnel-funds?traffic_source=rss"
  },
  {
    "originalTitle": "US civil rights leader Jesse Jackson dies aged 84",
    "title": "US civil rights leader Jesse Jackson dies aged 84",
    "content": "Tributes poured in from politicians who described Jackson as an agent of change and transformative leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:28.012Z",
    "image": "https://image.pollinations.ai/prompt/US%20civil%20rights%20leader%20Jesse%20Jackson%20dies%20aged%2084%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-civil-rights-leader-jesse-jackson-dies-aged-84",
    "originalLink": "https://www.bbc.com/news/articles/cp81l0e1eg5o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Stephen Colbert says CBS spiked interview with Democrat over FCC fears",
    "title": "Stephen Colbert says CBS spiked interview with Democrat over FCC fears",
    "content": "The network denies it stopped the interview with a Texas Democrat from airing but warned it could run afoul of the US broadcast media watchdog.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:33.138Z",
    "image": "https://image.pollinations.ai/prompt/Stephen%20Colbert%20says%20CBS%20spiked%20interview%20with%20Democrat%20over%20FCC%20fears%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "stephen-colbert-says-cbs-spiked-interview-with-democrat-over-fcc-fears",
    "originalLink": "https://www.bbc.com/news/articles/cze0dk3yd5eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "I would scream in my sleep: Women from Syria's Alawite minority tell of kidnap and rape",
    "title": "I would scream in my sleep: Women from Syria's Alawite minority tell of kidnap and rape",
    "content": "The BBC hears harrowing accounts of assaults appearing to target the sect of former President Assad.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:38.281Z",
    "image": "https://image.pollinations.ai/prompt/I%20would%20scream%20in%20my%20sleep%3A%20Women%20from%20Syria's%20Alawite%20minority%20tell%20of%20kidnap%20and%20rape%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-would-scream-in-my-sleep-women-from-syrias-alawite-minority-tell-of-kidnap-and-rape",
    "originalLink": "https://www.bbc.com/news/articles/cn5g751pl7lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mourinho's 'big mistake' after 'disgusting' Vinicius incident",
    "title": "Mourinho's 'big mistake' after 'disgusting' Vinicius incident",
    "content": "Trent Alexander-Arnold calls the alleged racist abuse of team-mate Vinicius Junior a \"disgrace to football\", while opposition manager Jose Mourinho is criticised for his comments.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:43.831Z",
    "image": "https://image.pollinations.ai/prompt/Mourinho's%20'big%20mistake'%20after%20'disgusting'%20Vinicius%20incident%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mourinhos-big-mistake-after-disgusting-vinicius-incident",
    "originalLink": "https://www.bbc.com/sport/football/articles/cp9myemmg3ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Real Madrid tie at Benfica halted over Vinicius racism allegation",
    "title": "Real Madrid tie at Benfica halted over Vinicius racism allegation",
    "content": "Real Madrid's Champions League knockout phase play-off tie at Benfica is halted for 10 minutes after Vinicius Junior reports alleged racist abuse.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-18T04:18:48.968Z",
    "image": "https://image.pollinations.ai/prompt/Real%20Madrid%20tie%20at%20Benfica%20halted%20over%20Vinicius%20racism%20allegation%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "real-madrid-tie-at-benfica-halted-over-vinicius-racism-allegation",
    "originalLink": "https://www.bbc.com/sport/football/articles/cpv843x1zgzo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Feyenoord training moved to Belgium for Sterling",
    "title": "Feyenoord training moved to Belgium for Sterling",
    "content": "Feyenoord will train in Belgium this week instead of their home in Rotterdam so new signing Raheem Sterling can work with his new team-mates.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-18T04:18:54.096Z",
    "image": "https://image.pollinations.ai/prompt/Feyenoord%20training%20moved%20to%20Belgium%20for%20Sterling%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "feyenoord-training-moved-to-belgium-for-sterling",
    "originalLink": "https://www.bbc.com/sport/football/articles/ce948p5gk3no?at_medium=RSS&at_campaign=rss"
  }
]