[
  {
    "originalTitle": "Slashed incomes and gamers go cold turkey: the fallout from Uganda's internet shutdown",
    "title": "Uganda's Internet Goes 'Bye-Bye!' - What Happened?",
    "content": "Hi there, my super curious friends! It's your special African news reporter, and I'm so excited to tell you about something important that happened in our wonderful continent, in a country called Uganda. Are you ready for a big story? Let's go!\n\n<h3>The Internet Went Away!</h3>\nImagine one morning you wake up, and your favourite cartoon show on the tablet just won't play. Or you can't talk to your grandma on a video call. That's a little bit like what happened in Uganda recently! For many days, the internet, which is like a giant invisible road that connects all our computers and phones, went bye-bye. It just wasn't working for lots of people.\n\nThink about it! No more watching fun videos, no more playing online games, and no more talking to friends and family far away using apps. It was a really big change for everyone.\n\n<h3>Why Did the Internet Go Quiet?</h3>\nThis big change happened because of something called an 'election.' An election is a very important time when grown-ups in a country get to choose their leaders. It's like when you choose your favourite game to play, but much, much bigger for a whole country!\n\nDuring this important time, the internet was turned off in Uganda. It was a decision made by the grown-ups in charge. This meant that for a few days, many people couldn't use the internet at all.\n\n<h3>No Money for Many Grown-ups</h3>\nNow, here's where it got a bit tricky and sad for some people. Do you know how your parents or guardians go to work to earn money so they can buy food, clothes, and toys for you? That money is called 'income.'\n\nMany grown-ups in Uganda use the internet for their jobs! Imagine someone who sells beautiful handmade crafts online. If the internet is gone, they can't show their crafts to people far away, and they can't sell them. No sales, no money. It was very hard for them to earn their income.\n\nAnother example: maybe someone drives a special taxi that you order using an app on your phone. If there's no internet, the app won't work, and they can't get passengers. So, they can't earn money either. Many, many jobs today depend on the internet, and when it's not there, it's a big problem for families.\n\n<h3>No More Fun!</h3>\nOh, and it wasn't just about work! Imagine you love playing a video game on your tablet or phone that needs the internet. Or you love watching funny animal videos. For many kids and grown-ups in Uganda, all that fun just stopped.\n\nGamers, who are people who really love playing video games, suddenly couldn't play their online games anymore. It was like going 'cold turkey' – a funny way to say they had to stop suddenly! They couldn't talk to their game friends or try to win new levels. It was pretty boring for some!\n\nEven grown-ups enjoy watching movies online or talking to their friends far away. When the internet was gone, all those ways to have fun and stay connected also went away. People felt a bit lonely or very bored.\n\n<h3>Did You Know?</h3>\n*   Did you know the internet is like a giant library and playground all in one? You can learn new things and play games! \n*   Did you know that many countries in Africa are getting more and more connected to the internet, helping people learn and work? It's amazing!\n*   Did you know that internet cables often run deep under the ground and even under the ocean to connect different parts of the world?\n\n<h3>How People Felt</h3>\nWith no internet for work and no internet for fun, how do you think people felt? Some grown-ups felt very worried because they couldn't earn money to buy food for their families. That's a very big worry!\n\nSome people felt bored or sad because they couldn't talk to their loved ones or enjoy their favourite online activities. Imagine not being able to see pictures of your cousin who lives far away! It made many people feel a bit disconnected and lonely.\n\n<h3>Learning Together About the Internet</h3>\nThis story from Uganda teaches us something very important: the internet is a very big part of our lives today! It helps grown-ups work, it helps kids learn and play, and it helps everyone stay connected.\n\nWhen something so important goes away, even for a few days, it can make things very difficult for many people. It reminds us how special and useful the internet can be when we use it well.\n\nI hope you learned something new today, my amazing friends! The internet has now come back in Uganda, and people are slowly getting back to their work and their fun. Keep being curious about the world around you! See you next time!",
    "summary": "During an election in Uganda, the internet was turned off, causing many grown-ups to lose money from their jobs and making it impossible for people to have fun with online games or videos.",
    "whyMatters": "This matters because the internet helps grown-ups earn money for their families and helps kids and grown-ups have fun and talk to friends, so when it's not there, life can be very hard.",
    "category": "politics",
    "date": "2026-01-22T10:22:38.534Z",
    "image": "https://image.pollinations.ai/prompt/Uganda's%20Internet%20Goes%20'Bye-Bye!'%20-%20What%20Happened%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ugandas-internet-goes-bye-bye-what-happened",
    "originalLink": "https://www.bbc.com/news/articles/cx2p54rm4k4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South African police not yet able to defeat gangs, minister says",
    "title": "South African police not yet able to defeat gangs, minister says",
    "content": "Police Minister Firoz Cachalia says organised crime is growing more complex, requiring new strategies.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-22T10:22:43.713Z",
    "image": "https://image.pollinations.ai/prompt/South%20African%20police%20not%20yet%20able%20to%20defeat%20gangs%2C%20minister%20says%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-african-police-not-yet-able-to-defeat-gangs-minister-says",
    "originalLink": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Life of veteran Ugandan opposition leader in danger, wife says ",
    "title": "Life of veteran Ugandan opposition leader in danger, wife says ",
    "content": "Kizza Besigye's wife has been to visit him at Luzira Prison and says he is extremely weak.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:22:48.881Z",
    "image": "https://image.pollinations.ai/prompt/Life%20of%20veteran%20Ugandan%20opposition%20leader%20in%20danger%2C%20wife%20says%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "life-of-veteran-ugandan-opposition-leader-in-danger-wife-says",
    "originalLink": "https://www.bbc.com/news/articles/c5y2q5j71pqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Venezuelans share their opinions on US interference",
    "title": "Friends Far Away: Listening to Venezuela",
    "content": "<h3>Hello from Your Friendly Reporter!</h3>\n\nHello everyone! It's your friendly news reporter here, bringing you stories from around our big, beautiful world. Today, we're going on a special trip. We're going to learn about a country called Venezuela. It's very far away from us, across the ocean, but the people there are just like us! They have families, schools, and playgrounds.\n\nSometimes, countries, just like friends, have big talks. They talk about how to live and how to get along. Today, we're going to hear what people in Venezuela are thinking and saying. It's about their country and how other countries, especially a big one called the United States of America (or the USA), get involved.\n\nIt might sound like a grown-up topic, but it's really about being good neighbors and listening to each other. Let's find out more together!\n\n<h3>Where is Venezuela?</h3>\n\nVenezuela is a wonderful country in South America. Imagine a place with amazing beaches, tall mountains, and big rainforests! It's super colourful and full of life. Many animals live there, too, like jaguars and colourful birds. The people of Venezuela are friendly and love music and dancing.\n\nVenezuela has a lot of oil, which is a special liquid found deep in the ground. This oil is used to make fuel for cars and many other things. Because of this oil, Venezuela is a very important country for many others around the world.\n\nDid you know? Venezuela has the highest waterfall in the world! It's called Angel Falls. It's so tall, it's like stacking many, many school buildings on top of each other!\n\n<h3>What Does \"Interference\" Mean?</h3>\n\nThis is a bit of a tricky word, but let's make it simple! Imagine you are building a tall tower with your blocks. You have a great idea for how to make it strong and beautiful. Then, your friend comes along and starts telling you exactly which blocks to use, or even tries to move your blocks for you.\n\nThat's a bit like what \"interference\" means. It's when one country, like the USA, tries to tell another country, like Venezuela, how to run its own house. Or how to choose its leaders, or what rules to have. Sometimes they think they are helping, but sometimes the other country just wants to make its own choices.\n\nCountries like to be in charge of themselves. They want to decide what is best for their own people, just like you like to decide what game to play with your own toys. It's about having your own space and making your own decisions.\n\n<h3>Why Do Countries Talk About This?</h3>\n\nSometimes, big countries think they know what is best for smaller countries. They might see that people in Venezuela are having problems. Maybe they need more food, or better schools, or important medicines. So, the USA might want to step in and help. They might say, \"We can help you fix this!\"\n\nBut the people in Venezuela might have different ideas. Some might say, \"Yes, please help us! We need it!\" Others might say, \"Thank you, but we want to solve our problems our way. We don't want other countries telling us what to do.\"\n\nIt's like when you're trying to tie your shoelaces. Someone might offer to do it for you. You might say yes if you're stuck, or you might say, \"No thank you, I want to try myself!\" Countries are often like that too, they want to try and fix their own shoelaces.\n\nDid you know? Every country has its own government, which is like a big team of people who make rules and help everyone in the country. They try to make things fair and good for everyone.\n\n<h3>What Are Venezuelans Saying?</h3>\n\nNow, let's listen to the people in Venezuela! They have many different thoughts and feelings about this. It's not just one idea, but many different voices. Some Venezuelans are happy when the USA tries to help. They might feel that their country needs help to get important things like food and medicine to everyone.\n\nThey might think that new ideas from other countries could make life better for them and their families. They want peace and a good life, and they hope that help from outside can bring that faster. Their voices are important to hear because they are asking for help.\n\nOn the other hand, many other Venezuelans say, \"No, thank thank you!\" They believe their country should make its own decisions. They want to choose their own leaders and make their own rules without anyone else telling them what to do. They feel proud of Venezuela and want it to be strong and independent.\n\nThey might worry that if other countries get too involved, Venezuela won't be truly free to choose its own path. They want their own ideas and plans to be the most important ones. Both groups of people care deeply about their country, but they have different ideas about the best way forward.\n\n<h3>Why is Everyone's Opinion Important?</h3>\n\nIn our classrooms, our homes, and our communities, everyone's opinion matters, right? When you play a game, it's good to hear everyone's ideas so you can have the most fun. For a whole country, listening to everyone is super important. Every person's voice helps to make the country a better place.\n\nWhen big countries talk about smaller countries, it's very important that they listen to the people who actually live there. It's their home, their families, and their future. They know what it feels like to live there every day. Their opinions are not just ideas; they are about real life.\n\nListening means being kind and respectful. It means trying to understand why someone feels the way they do, even if it's different from your own feelings. That's how we learn to be good friends and good neighbors, whether it's in your school or between countries.\n\nDid you know? In many countries, people vote to choose their leaders. This is how everyone gets a chance to share their opinion and decide who will help run the country!\n\n<h3>Hoping for Peace and Friendship</h3>\n\nSo, what have we learned? We've learned that Venezuela is a wonderful place with wonderful people. We've learned that sometimes countries have big talks about how to work together, and sometimes they disagree. And we've learned that listening to everyone's opinion is super, super important.\n\nEven when countries have different ideas, it's always best to try and be friends. To talk kindly, to understand each other, and to find ways to help each other that make everyone happy and safe. We hope that Venezuela and all countries can find the best path forward, full of peace and friendship.\n\nYour friendly reporter wishes you a day full of kindness and understanding. See you next time for more news from around the world!",
    "summary": "People in Venezuela have different ideas about whether other big countries, like the USA, should help them or if Venezuela should make all its own decisions.",
    "whyMatters": "It's important to listen to what people in different countries want, so everyone can live in peace and make their own choices, just like friends should respect each other.",
    "category": "world",
    "date": "2026-01-22T10:23:20.565Z",
    "image": "https://image.pollinations.ai/prompt/Friends%20Far%20Away%3A%20Listening%20to%20Venezuela%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "friends-far-away-listening-to-venezuela",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/22/venezuelans-share-their-opinions-on-us-interference?traffic_source=rss"
  },
  {
    "originalTitle": "Pro-Palestine activist on hunger strike says he will begin refusing water",
    "title": "Pro-Palestine activist on hunger strike says he will begin refusing water",
    "content": "Palestine Action-linked remand prisoner Umer Khalid calls on the UK to engage with his protest demands.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:23:25.759Z",
    "image": "https://image.pollinations.ai/prompt/Pro-Palestine%20activist%20on%20hunger%20strike%20says%20he%20will%20begin%20refusing%20water%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pro-palestine-activist-on-hunger-strike-says-he-will-begin-refusing-water",
    "originalLink": "https://www.aljazeera.com/news/2026/1/22/pro-palestine-activist-on-hunger-strike-says-he-will-begin-refusing-water?traffic_source=rss"
  },
  {
    "originalTitle": "Guinea-Bissau sets election date following last year’s coup",
    "title": "Guinea-Bissau sets election date following last year’s coup",
    "content": "The West African country is set to hold legislative and presidential elections on December 6.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:23:30.917Z",
    "image": "https://image.pollinations.ai/prompt/Guinea-Bissau%20sets%20election%20date%20following%20last%20year%E2%80%99s%20coup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "guinea-bissau-sets-election-date-following-last-years-coup",
    "originalLink": "https://www.aljazeera.com/news/2026/1/22/guinea-bissau-sets-election-date-following-last-years-coup?traffic_source=rss"
  },
  {
    "originalTitle": "Two dead and several missing in New Zealand landslides",
    "title": "Big Rain Causes Big Trouble Far Away!",
    "content": "<h3>Hello from Africa!</h3>\nHi, my super friends! It's your friendly news reporter here, all the way from our amazing continent, Africa! I hope you are having a wonderful day, full of laughter and learning. Today, I want to tell you about something that happened very far away from us. It happened in a beautiful country called New Zealand. Do you know where New Zealand is? Imagine a big, big map of the world. New Zealand is a long, long way across the big, blue ocean, near Australia. It's a place with green hills and stunning beaches.\n\n<h3>What Happened Far Away?</h3>\nImagine it raining for a very, very long time. Not just a little drizzle, but super-duper heavy rain that seemed to never stop! This kind of rain can cause big problems, even in beautiful places. And that is exactly what happened in New Zealand. It rained so much that some of the land, especially on the hills and mountains, started to slide down. We call these \"landslides.\" It was a bit scary and very messy for the people living there.\n\n<h3>Rain, Rain, Go Away!</h3>\nThe sky cried tears of rain for many, many days without a break. It was like a giant shower that just wouldn't turn off. All this water made the ground incredibly wet and soft. When the ground gets too wet, it can become like a big, squishy sponge. Think of building a tall sandcastle near the water. If you add too much water, the bottom can get weak, and the castle might start to fall down, right? Well, that's kind of like what happened to the earth in New Zealand, but on a much bigger scale. The ground couldn't hold on anymore.\n\n*Did you know?* Sometimes, very heavy rain that lasts for a long time is called a \"tropical storm\" or a \"cyclone\" in some parts of the world. These storms can bring not only lots of rain but also very strong winds!\n\n<h3>What is a Landslide?</h3>\nLet's talk a little more about what a landslide is. Imagine you have a big pile of sand or dirt, maybe in your garden or at a construction site. Now, pour lots and lots of water on it, especially if it's on a slope. What happens? Some of the sand or dirt might start to move and slide down the pile, gathering speed. That's a tiny landslide! In New Zealand, this happened on big hills and mountains, which are much, much bigger than a pile of dirt. The very wet earth, mud, and even big rocks slid down like a giant, unstoppable muddy river. It moved very fast and could push over strong trees and even big houses. It made a huge, terrible mess everywhere it went.\n\n*Did you know?* Landslides can be very big or very small! Some are so small they just move a little bit of dirt, but others can move entire mountainsides, changing the shape of the land!\n\n<h3>Homes and Roads in Trouble</h3>\nBecause of these big, powerful landslides, many homes were badly damaged or even completely destroyed. Imagine your house not being in the same place anymore, or having mud everywhere inside! That would be incredibly scary and sad. Many roads also got completely covered in thick mud, big rocks, and fallen trees. This made it impossible for cars, trucks, and even rescue vehicles to drive. People couldn't get to their schools, their jobs, or even to the shops easily. In many places, the electricity stopped working, which meant no lights, no cooking on electric stoves, and no TV or internet! It was a very difficult and confusing time for many families.\n\n*Did you know?* When roads are blocked and towns are cut off, sometimes people use special boats or even helicopters to deliver food, water, and medicines to those who need help!\n\n<h3>Brave People Helping Each Other</h3>\nEven though it was a very sad and messy time, there were many brave and kind people helping. Police officers, firefighters, and special rescue teams, who are trained for these situations, worked incredibly hard day and night. They looked for people who needed help, sometimes digging through the mud and debris. They helped families move to safe places, like community halls or schools that weren't damaged. Many kind volunteers also came out to help their neighbours. They gave out warm food, cozy blankets, and hugs to people who had lost their homes. It truly shows how strong and kind people can be when they help each other during difficult times.\n\n*Did you know?* Rescue workers sometimes use special equipment like digging machines and even highly trained dogs called \"search and rescue dogs\" to help find people. These dogs have super-sensitive noses!\n\n<h3>Looking for Our Friends</h3>\nIn some areas, the landslides were so massive and the mess was so huge that it was very hard to see everything. The earth moved so much that some people could not be found right away. This made everyone very worried and sad. So, the rescue teams kept looking and looking, tirelessly. They didn't give up for a single moment! They wanted to make absolutely sure everyone was safe and accounted for. It is always very sad when people are missing, but everyone works with all their might to find them and bring them to safety.\n\n*Did you know?* When someone is missing after a big disaster, it means we don't know where they are, and everyone worries about them. People put up signs and tell everyone to look out for them.\n\n<h3>Making Things Better Again</h3>\nThe leaders of New Zealand said that this was one of the biggest challenges their country has faced in a long time. It looked like a very messy and broken place in many areas. But they also said, very strongly, that they would help everyone get back on their feet. They promised to fix the damaged roads and bridges, and help families rebuild their homes and their lives. It will take a lot of time, hard work, and patience, but the people of New Zealand are strong and determined. They will work together, helping each other, to make their beautiful country safe and shining again.\n\n*Did you know?* After a big storm or landslide, people often help clean up for many weeks or even months. It's a huge job, like cleaning up after a gigantic party, but everyone helps!\n\n<h3>More Fun Facts About Nature!</h3>\n*   New Zealand is famous for its stunning natural beauty, including tall mountains, deep lakes, and bubbling geysers!\n*   The famous \"Lord of the Rings\" movies were filmed in New Zealand because of its amazing landscapes!\n*   Plants with long, strong roots can sometimes help hold soil together on slopes, making them less likely to slide.\n*   Water is very powerful! It can carve canyons, make rivers, and even move mountains of mud and rocks.\n*   It's important to always listen to grown-ups during a big storm or any emergency. They know how to keep you safe and sound!\n\n<h3>Staying Safe</h3>\nWhen there are big storms, like the one in New Zealand, it's super important to be safe. Always listen to your parents or teachers. Stay indoors if they tell you to, and try to keep calm. It's always best to be very careful when the weather is wild and stormy. Even though this happened far, far away, it reminds us to be prepared and think about safety, no matter where we are.\n\n<h3>Sending Our Love</h3>\nEven though New Zealand is a very long way from Africa, we care about the people there. We hope with all our hearts that everyone who was missing is found safe and sound. We hope that all the damaged homes and roads are fixed quickly. And we hope the sun shines brightly and brings warmth and comfort again very soon in New Zealand. Let's send our happy thoughts, our kindness, and our good wishes to them! We are all one big family on this amazing planet Earth, and we look out for each other.",
    "summary": "Heavy rains in a far-away country called New Zealand caused big landslides, damaging homes and roads, but many brave people are helping to find those missing and fix everything.",
    "whyMatters": "This matters because it teaches us about powerful nature, how important it is to help people in need, and that we are all connected on Earth, no matter how far apart we are.",
    "category": "world",
    "date": "2026-01-22T10:24:14.554Z",
    "image": "https://image.pollinations.ai/prompt/Big%20Rain%20Causes%20Big%20Trouble%20Far%20Away!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "big-rain-causes-big-trouble-far-away",
    "originalLink": "https://www.bbc.com/news/articles/cje11x527n4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Trump ratcheted up the Greenland rhetoric - but has he been talked down?",
    "title": "Trump ratcheted up the Greenland rhetoric - but has he been talked down?",
    "content": "Despite talk of a deal over Greenland, it will be hard for US allies to return to business as usual, writes the BBC’s diplomatic correspondent.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "business",
    "date": "2026-01-22T10:24:19.719Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20ratcheted%20up%20the%20Greenland%20rhetoric%20-%20but%20has%20he%20been%20talked%20down%3F%20realistic%20news%20photography%20context%20Business%20%26%20Finance%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-ratcheted-up-the-greenland-rhetoric-but-has-he-been-talked-down",
    "originalLink": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "UK holds off joining Trump's Board of Peace over Putin concerns",
    "title": "UK holds off joining Trump's Board of Peace over Putin concerns",
    "content": "Foreign Secretary Yvette Cooper says the Russian president has shown no commitment to peace in Ukraine.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:24:24.903Z",
    "image": "https://image.pollinations.ai/prompt/UK%20holds%20off%20joining%20Trump's%20Board%20of%20Peace%20over%20Putin%20concerns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "uk-holds-off-joining-trumps-board-of-peace-over-putin-concerns",
    "originalLink": "https://www.bbc.com/news/articles/cp9jj1j74ggo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Slot praises Salah return on important night for both",
    "title": "Slot praises Salah return on important night for both",
    "content": "Arne Slot praises the return of Mohamed Salah, with Liverpool's Champions League win in Marseille proving important for both.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-22T10:24:32.892Z",
    "image": "https://image.pollinations.ai/prompt/Slot%20praises%20Salah%20return%20on%20important%20night%20for%20both%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "slot-praises-salah-return-on-important-night-for-both",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn0yyexlvrgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Ridiculous amount of games' - has Haaland played too much football?",
    "title": "'Ridiculous amount of games' - has Haaland played too much football?",
    "content": "Erling Haaland made a blistering start to the season but that prolific run of form has ground to a halt with only one goal in his past eight games.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:24:38.058Z",
    "image": "https://image.pollinations.ai/prompt/'Ridiculous%20amount%20of%20games'%20-%20has%20Haaland%20played%20too%20much%20football%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ridiculous-amount-of-games-has-haaland-played-too-much-football",
    "originalLink": "https://www.bbc.com/sport/football/articles/cy7mv3eg5nlo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Unique' Rogers looks to prove worth for Villa & England",
    "title": "'Unique' Rogers looks to prove worth for Villa & England",
    "content": "Morgan Rogers says he \"can be anything\" - while the Aston Villa star is talking about his positional flexibility, rather than boasting about his quality, his confidence is well-placed.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-22T10:24:43.236Z",
    "image": "https://image.pollinations.ai/prompt/'Unique'%20Rogers%20looks%20to%20prove%20worth%20for%20Villa%20%26%20England%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "unique-rogers-looks-to-prove-worth-for-villa-and-england",
    "originalLink": "https://www.bbc.com/sport/football/articles/cedwx4w43dyo?at_medium=RSS&at_campaign=rss"
  }
]