[
  {
    "originalTitle": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "title": "At least 55 Ghanaians killed in Russia-Ukraine war, minister says",
    "content": "This is the highest number of confirmed casualties from a single African country in the Ukraine-Russia war.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:18:51.371Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%2055%20Ghanaians%20killed%20in%20Russia-Ukraine%20war%2C%20minister%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-55-ghanaians-killed-in-russia-ukraine-war-minister-says",
    "originalLink": "https://www.bbc.com/news/articles/cgl5gxg3zj9o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Former US diplomat sentenced to life for abusing two girls in Burkina Faso",
    "title": "Good News! Children are Safe! Justice for Kids in Burkina Faso!",
    "content": "<h3>Hello, Friends! Your Africa News Reporter is Here!</h3>\nHello, my wonderful friends all across Africa! It's me, your friendly kid news reporter. I am so happy to be here today to share some very important news with you.\n\nWe are going to talk about something very serious, but it has a happy ending. It's about making sure all children everywhere are safe and happy. That's a super important job for all grown-ups.\n\nToday's news comes from a beautiful country called Burkina Faso. It's in West Africa, not too far from many of you! We have some good news about justice there.\n\nJustice means making things right when someone does something wrong. It means making sure good people are protected and bad people learn that they cannot hurt others.\n\n<h3>What is a Diplomat?</h3>\nSometimes, grown-ups work for their country in other countries. They are called diplomats. A diplomat is like a special messenger and helper.\n\nTheir job is to help different countries be friends. They talk about important things and try to make sure everyone gets along. They are supposed to be kind and helpful to everyone.\n\nThis story is about a grown-up who used to be a diplomat. He worked for a country far away, the United States of America, and lived in Burkina Faso.\n\nDid you know? A diplomat's job is to build bridges between countries, not walls! They help people from different places understand each other better and work together for peace.\n\n<h3>Where is Burkina Faso?</h3>\nBurkina Faso is a wonderful country in West Africa. It has sunny skies and lots of friendly people. It's a landlocked country, which means it doesn't have an ocean next to it, but it has many rivers.\n\nThe capital city of Burkina Faso is called Ouagadougou. Can you say that? Oo-wah-gah-doo-goo! It's a fun name! Many people there speak French, as well as many local languages.\n\nJust like in your country, there are many lovely families and children who live in Burkina Faso. Everyone there, especially children, deserves to be safe and protected.\n\nDid you know? Burkina Faso means \"Land of Incorruptible People\"! This name shows how much the people value honesty and doing the right thing. It's a very proud name!\n\n<h3>What Happened? (The Important Part About Safety)</h3>\nNow for the important part of our news today. There was a grown-up who used to be a diplomat in Burkina Faso. He was supposed to be a good helper and friend to the community.\n\nBut this grown-up did some very, very bad things. He hurt two young girls, who were children just like you. This made them feel sad and scared.\n\nHe did this when their mother was very sick and needed help. Instead of helping, he took advantage of them and made them feel unsafe. This is never, ever okay.\n\nNo grown-up should ever make a child feel unsafe, scared, or uncomfortable. Every child has the right to be protected and feel loved by the grown-ups around them.\n\nLuckily, some very brave people found out about what he did. They decided that this grown-up needed to stop doing bad things and face the consequences.\n\nThey knew that children must always be safe. So, they made sure this grown-up could not hurt anyone ever again. This is a very important part of justice.\n\n<h3>How Did People Help? Speaking Up is Brave!</h3>\nIt is super important for everyone to know that if someone, even a grown-up, makes you feel unsafe or does something that makes you unhappy, you must tell another grown-up you trust.\n\nThis could be your mum, dad, grandma, grandpa, a teacher, a big brother or sister, or any grown-up who loves you and will listen. Speaking up is very brave and very strong!\n\nWhen the bad things this grown-up did were found out, important people stepped in to help. They wanted to make sure the girls were safe and that the bad grown-up was stopped.\n\nIt's like when you have a problem, and you ask a grown-up for help. These helpers are there to make sure bad things don't happen to children. They are like superheroes for safety.\n\nDid you know? You have special rights, just because you are a child! One of your most important rights is to be safe from harm and to be protected by grown-ups and laws.\n\n<h3>Justice in Court: What is a Sentence?</h3>\nWhen someone does something very wrong, like this grown-up did, they have to go to a special place called a court. This is where big decisions are made about fairness.\n\nA court is where grown-ups called judges listen to what happened. They listen to everyone and decide if someone broke the rules, called laws. It's like a big game where everyone has to follow the rules.\n\nThe grown-up who hurt the girls went to court. The judges listened very carefully to all the information and the evidence. They found that he did indeed do very bad things.\n\nBecause he hurt the children, the court gave him a \"sentence.\" A sentence means he will have to stay in a special place for a very, very long time. It's like a really long time-out.\n\nHe will stay there for the rest of his life. This means he will never be able to leave and hurt any more children. This is called a \"life sentence,\" and it helps keep everyone safe.\n\nDid you know? Courts are very old! People have had ways of deciding what is fair and right for thousands of years, all over the world. They help keep peace and order.\n\n<h3>Good News! Children are Safe!</h3>\nThis is the good news part! Because of the court's decision, this grown-up will never be able to hurt children again. He is in a place where he cannot cause any more harm.\n\nThe brave girls and other grown-ups who helped them have made sure that justice was served. This means things are being made right, and the bad actions are being fixed.\n\nIt shows that grown-ups around the world care deeply about protecting children. They want you to be safe and happy every single day, no matter where you live.\n\nThis story reminds us all that children are very important. Your safety and happiness matter more than anything! Every child deserves to grow up feeling secure and loved.\n\n<h3>Remember, You Are Important!</h3>\nSo, my dear friends, remember this important lesson. You are precious. You deserve to be safe and happy always, and no one has the right to make you feel otherwise.\n\nIf anyone ever makes you feel scared, unsafe, or does something that feels wrong, please tell a grown-up you trust right away. Don't keep it a secret!\n\nThere are always good people who want to help you and protect you. You are not alone, and your voice is very important.\n\nKeep shining brightly, my little stars across Africa! Stay safe, be kind, and remember that good people are always working hard to protect you and ensure your happiness.\n\nThat's all for today from your friendly Africa news reporter! See you next time for more important news!",
    "summary": "A grown-up who hurt children in Burkina Faso has been stopped forever by the court, making sure kids are safe and justice is served.",
    "whyMatters": "This news is important because it shows that all children deserve to be safe and protected, and that grown-ups will always work hard to make things right when someone does wrong to a child.",
    "category": "world",
    "date": "2026-03-01T22:19:18.084Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Children%20are%20Safe!%20Justice%20for%20Kids%20in%20Burkina%20Faso!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-children-are-safe-justice-for-kids-in-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/c93wx97wl10o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa beat Zimbabwe to set up NZ semi-final",
    "title": "South Africa beat Zimbabwe to set up NZ semi-final",
    "content": "South Africa produce an unconvincing performance with the bat as they beat Zimbabwe by five wickets to set up a semi-final against New Zealand",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:19:23.231Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20beat%20Zimbabwe%20to%20set%20up%20NZ%20semi-final%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-beat-zimbabwe-to-set-up-nz-semi-final",
    "originalLink": "https://www.bbc.com/sport/cricket/articles/cj0d11qrz9eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Huge fire at Bahrain port home to US Navy’s Fifth Fleet",
    "title": "Huge fire at Bahrain port home to US Navy’s Fifth Fleet",
    "content": "Footage shows a huge fire reportedly ignited by an Iranian strike on a US naval facility at Bahrain’s Salman Port.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T22:19:28.465Z",
    "image": "https://image.pollinations.ai/prompt/Huge%20fire%20at%20Bahrain%20port%20home%20to%20US%20Navy%E2%80%99s%20Fifth%20Fleet%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "huge-fire-at-bahrain-port-home-to-us-navys-fifth-fleet",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/huge-fire-at-bahrain-port-home-to-us-navys-fifth-fleet?traffic_source=rss"
  },
  {
    "originalTitle": "Iranian drone strikes US military facility in Kuwait",
    "title": "Iranian drone strikes US military facility in Kuwait",
    "content": "Footage captured the moment an Iranian drone struck the US military’s Camp Buehring in northwestern Kuwait.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T22:19:33.605Z",
    "image": "https://image.pollinations.ai/prompt/Iranian%20drone%20strikes%20US%20military%20facility%20in%20Kuwait%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iranian-drone-strikes-us-military-facility-in-kuwait",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/iranian-drone-strikes-us-military-facility-in-kuwait?traffic_source=rss"
  },
  {
    "originalTitle": "US confirms three soldiers killed in Iran attacks",
    "title": "US confirms three soldiers killed in Iran attacks",
    "content": "The US military has confirmed at least three of its soldiers have been killed in its war with Iran.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:19:38.754Z",
    "image": "https://image.pollinations.ai/prompt/US%20confirms%20three%20soldiers%20killed%20in%20Iran%20attacks%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-confirms-three-soldiers-killed-in-iran-attacks",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/3/1/us-confirms-three-soldiers-killed-in-iran-attacks?traffic_source=rss"
  },
  {
    "originalTitle": "Iran's regime is still intact - the coming days will show if it can hold out",
    "title": "Iran's regime is still intact - the coming days will show if it can hold out",
    "content": "Iran's surviving leaders are in crisis mode, battling to project security as US and Israel strikes continue.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:19:44.217Z",
    "image": "https://image.pollinations.ai/prompt/Iran's%20regime%20is%20still%20intact%20-%20the%20coming%20days%20will%20show%20if%20it%20can%20hold%20out%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "irans-regime-is-still-intact-the-coming-days-will-show-if-it-can-hold-out",
    "originalLink": "https://www.bbc.com/news/articles/cx2lgvg5rl1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "At least 153 dead after reported strike on school, Iran says",
    "title": "At least 153 dead after reported strike on school, Iran says",
    "content": "Iran has blamed the US and Israel for the strike; the US is looking into reports of the incident, while the IDF says it is \"not aware\" of operations in the area.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:19:49.391Z",
    "image": "https://image.pollinations.ai/prompt/At%20least%20153%20dead%20after%20reported%20strike%20on%20school%2C%20Iran%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "at-least-153-dead-after-reported-strike-on-school-iran-says",
    "originalLink": "https://www.bbc.com/news/articles/c1l7rvqq51eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nine dead in missile attack on Israel as Iran strikes region",
    "title": "Nine dead in missile attack on Israel as Iran strikes region",
    "content": "Several deaths are reported across the Middle East as Tehran retaliates for massive strikes by the US and Israel.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:19:54.540Z",
    "image": "https://image.pollinations.ai/prompt/Nine%20dead%20in%20missile%20attack%20on%20Israel%20as%20Iran%20strikes%20region%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nine-dead-in-missile-attack-on-israel-as-iran-strikes-region",
    "originalLink": "https://www.bbc.com/news/articles/c363zkp1pgxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal beat 10-man Chelsea to extend lead",
    "title": "Arsenal beat 10-man Chelsea to extend lead",
    "content": "Arsenal get an important win in the title race against Chelsea, who had Pedro Neto sent off for a second yellow in a game with three goals scored from corners.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-03-01T22:20:00.089Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20beat%2010-man%20Chelsea%20to%20extend%20lead%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-beat-10-man-chelsea-to-extend-lead",
    "originalLink": "https://www.bbc.com/sport/football/videos/cge85r8xl0go?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sesko leads Man Utd to victory against 10-man Crystal Palace",
    "title": "Sesko leads Man Utd to victory against 10-man Crystal Palace",
    "content": "Benjamin Sesko scores his sixth goal in eight games to help Manchester United secure a comeback victory against Crystal Palace and move up to third in the Premier League.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:20:05.240Z",
    "image": "https://image.pollinations.ai/prompt/Sesko%20leads%20Man%20Utd%20to%20victory%20against%2010-man%20Crystal%20Palace%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sesko-leads-man-utd-to-victory-against-10-man-crystal-palace",
    "originalLink": "https://www.bbc.com/sport/football/videos/c78jzmj1xvro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Fulham sink struggling Spurs with incredible Iwobi goal",
    "title": "Fulham sink struggling Spurs with incredible Iwobi goal",
    "content": "Alex Iwobi scores a beautifully-placed goal as Fulham hold off late pressure from Tottenham Hotspur to win 2-1.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-03-01T22:20:10.381Z",
    "image": "https://image.pollinations.ai/prompt/Fulham%20sink%20struggling%20Spurs%20with%20incredible%20Iwobi%20goal%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "fulham-sink-struggling-spurs-with-incredible-iwobi-goal",
    "originalLink": "https://www.bbc.com/sport/football/videos/c5y59325wq9o?at_medium=RSS&at_campaign=rss"
  }
]