[
  {
    "originalTitle": "Kenyans drop flowers for Valentine's bouquets of cash. Not everyone is impressed",
    "title": "Money Flowers: A New Gift in Kenya!",
    "content": "Hello, amazing friends all across Africa! I'm your friendly news reporter, here to share a super interesting story from a lovely country called Kenya. Kenya is in East Africa, and it has beautiful animals and kind people. Today, we are talking about a new kind of gift that many people are giving there. It’s a bit like flowers, but it's made of money!\n\n<h3>What is Valentine's Day?</h3>\nFirst, let's talk about a special day called Valentine's Day. It happens every year on February 14th. On this day, people like to show extra love and kindness to their friends, family, and people they care about. They might give cards, chocolates, or special presents. It’s a day for warm hearts and happy smiles!\n\n<h3>Pretty Flowers!</h3>\nHave you ever seen a beautiful bunch of flowers? We call that a bouquet! Flowers are colorful and smell nice. People often give bouquets of flowers on Valentine’s Day. Red roses are very popular because they mean love. A flower bouquet makes people feel special and loved. It's a very old tradition.\n\nDid you know? There are over 400,000 kinds of flowering plants in the world! That's a lot of beautiful flowers!\n\n<h3>Introducing Money Flowers!</h3>\nNow, imagine a bouquet, but instead of real flowers, it's made of money! Yes, real money, like the notes your parents use to buy things. In Kenya, people have started making these \"money bouquets.\" They fold and arrange the money notes very carefully so they look like big, pretty flowers.\n\nThey can use many notes to make a very big and colorful bouquet! It's a very creative way to give a gift. Instead of petals, you see bright green, yellow, or blue money notes. These money flowers are becoming very, very popular in Kenya. Many people love to receive them!\n\n<h3>Why Do People Love Money Bouquets?</h3>\nSo, why do people choose money flowers instead of real flowers? Well, there's a big reason! When you get money, you can choose exactly what you want or need. If you get a flower bouquet, it's beautiful, but you can't buy something with it.\n\nWith money, you can buy new school books, yummy snacks, or maybe even save up for a new toy! It’s like getting a gift that can turn into many different things. This makes the gift very useful. People feel happy because they can use the money for something important to them. It's a special way to show you care about what they might need.\n\nDid you know? Some people save the money they receive to buy bigger things, like a bicycle or new clothes for school!\n\n<h3>Kenya's Special Gift</h3>\nThis new way of giving gifts is happening a lot in Kenya. People give these money bouquets for many happy occasions, not just Valentine's Day. They give them for birthdays, for good grades, or just to say \"thank you.\"\n\nIt’s a special trend that has grown very fast. Many shops now help people make these beautiful money arrangements. It shows how creative people in Kenya are!\n\n<h3>Hold On, What Are the Warnings?</h3>\nNow, here's the interesting part. Some grown-ups are starting to talk about these money bouquets. They are giving \"warnings.\" A warning means they are saying, \"Be careful!\" They are not saying money bouquets are bad, but they want people to think about a few things.\n\nOne warning is about safety. When you have a lot of money showing, it might not be very safe. It’s like carrying too many sweets in your hand – someone might try to take them! So, it's good to be careful and keep your money safe, no matter how it’s given.\n\nDid you know? It's always a good idea to keep your money in a safe place, like a wallet or a special box at home!\n\n<h3>What Else Are They Thinking About?</h3>\nAnother thing grown-ups are thinking about is how these gifts look. Sometimes, showing off a lot of money might make other people feel a little sad if they don't have much. Gifts are meant to make everyone feel happy and loved.\n\nSo, it’s good to think about being kind and not showing off too much. It's about the feeling of the gift, not just how much money it has. A small, thoughtful gift can be just as special as a big one! The warnings are just reminding people to be thoughtful and safe.\n\n<h3>What Does This Mean for Gifts?</h3>\nSo, what does all this mean? It means we should always think about how we give and receive gifts. Whether it's a real flower bouquet, a yummy chocolate bar, or a creative money bouquet, the most important thing is the love behind it. The warnings are just to help people be smart and kind.\n\nGiving a gift is a wonderful way to show someone you care. It doesn't matter if it's big or small, or if it's money or a toy. What matters is the happy heart that gives it, and the happy heart that receives it.\n\nDid you know? The best gifts are often those given with love and a kind thought, even if they don't cost any money at all! Like a handmade card or a big hug!\n\n<h3>Be Kind and Smart!</h3>\nSo, if you ever see a money bouquet in Kenya, you’ll know all about it! It's a fun and useful way to give a gift, but it's always good to be safe and kind. Let's keep sharing love and happiness across Africa, one thoughtful gift at a time! Bye for now, from your reporter friend!",
    "summary": "In Kenya, people are giving special gifts called 'money bouquets' instead of flower bouquets, but grown-ups are saying to be careful and smart when giving or receiving them.",
    "whyMatters": "This matters because it helps us think about how we give gifts, how to keep our money safe, and how to be kind to everyone, no matter what kind of gift we give or get.",
    "category": "world",
    "date": "2026-02-14T01:42:21.858Z",
    "image": "https://image.pollinations.ai/prompt/Money%20Flowers%3A%20A%20New%20Gift%20in%20Kenya!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "money-flowers-a-new-gift-in-kenya",
    "originalLink": "https://www.bbc.com/news/articles/cn87g2v73jno?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sudanese city had 6,000 killed in three days, UN says",
    "title": "Sudanese city had 6,000 killed in three days, UN says",
    "content": "Paramilitary Rapid Support Forces (RSF) committed the atrocities in el-Fasher, says a UN report.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:42:26.970Z",
    "image": "https://image.pollinations.ai/prompt/Sudanese%20city%20had%206%2C000%20killed%20in%20three%20days%2C%20UN%20says%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sudanese-city-had-6000-killed-in-three-days-un-says",
    "originalLink": "https://www.bbc.com/news/articles/c043753z7w3o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa to deploy troops to tackle crime gangs",
    "title": "Superheroes to the Rescue in South Africa!",
    "content": "<h3>Hello, Friends from Africa!</h3>\n<p>Hello, super friends! It’s your kid-friendly news reporter here, bringing you some important news from our amazing continent, Africa. Today, we have big news from a country called South Africa. It’s a beautiful place with lots of sunshine and friendly people!</p>\n<p>Our President, Mr. Cyril Ramaphosa, has made a special announcement. A president is like the head teacher of a whole country. He helps make sure everyone is safe and happy.</p>\n\n<h3>What's Happening in South Africa?</h3>\n<p>Sometimes, even in good places, there can be problems. In South Africa, there are some people who do bad things. We call these things \"crime.\" Crime means doing something that is against the rules and hurts other people or takes their things.</p>\n<p>These bad people sometimes work in groups. We call these groups \"gangs.\" They cause trouble and make things difficult for others. They might take things that don't belong to them or do other naughty things.</p>\n<p>The President wants to make sure everyone is safe and happy. He wants to stop these gangs and their bad actions.</p>\n<p>Did you know? South Africa is famous for its beautiful wildlife, like lions, elephants, and giraffes! It's also home to Table Mountain, a very flat-topped mountain!</p>\n\n<h3>Who is Helping? The Army and the Police!</h3>\n<p>To help stop the bad guys, President Ramaphosa has asked for extra help. He has asked the \"army\" to come and help. The army is a group of very brave men and women who wear special uniforms. They train very hard to protect their country and its people.</p>\n<p>The army has soldiers, and they are very good at keeping things safe. They often help when there's a really big problem, like a big flood or, in this case, when there's a lot of crime.</p>\n<p>The army will work with the \"police.\" You know the police, right? They wear blue uniforms and drive special cars with flashing lights. The police are our everyday heroes who help us when we are lost, when something is stolen, or when we need help.</p>\n<p>So, imagine the police and the army working together like a super-duper team! They will join forces to make South Africa safer for everyone.</p>\n<p>Did you know? Soldiers in the army learn many important skills, like how to stay safe, how to help others, and how to work as a team!</p>\n\n<h3>Why Are They Helping? Stopping Bad Guys!</h3>\n<p>The army and police are joining hands to fight two main types of big problems. One problem is called \"organised crime.\" This means when groups of bad people plan and work together to do bad things, like stealing many things or tricking many people.</p>\n<p>It's like when a group of friends play a game together, but these groups are playing a very bad game that hurts people. The army and police want to stop these bad games and make sure everyone follows the rules.</p>\n<p>Did you know? Police officers have special dogs, called K9 units, that help them find clues and catch bad guys! These dogs are super smart!</p>\n\n<h3>What is \"Illegal Mining\"?</h3>\n<p>The second big problem they are fighting is called \"illegal mining.\" Let's learn about mining first. Mining is when people dig deep into the earth to find special treasures like gold, diamonds, or other important stones and metals.</p>\n<p>Africa has many wonderful treasures hidden deep underground. When people mine for these treasures, they usually need special permission and have to follow many rules to do it safely and correctly.</p>\n<p>But \"illegal mining\" means digging for these treasures without permission. It's like going into someone's garden and digging up their flowers without asking. It's against the rules, and it can be very dangerous.</p>\n<p>Illegal mining can hurt the land. It can make big holes that are not safe. It can also hurt the people who work there, because they don't follow safety rules. And the treasures they find are taken unfairly.</p>\n<p>The army and police want to stop this illegal mining to protect the land, to keep people safe, and to make sure everyone plays fair.</p>\n<p>Did you know? South Africa is one of the world's biggest producers of gold! Gold is a shiny, yellow metal often used for jewelry or special coins.</p>\n\n<h3>Why is This Important for Everyone?</h3>\n<p>When there is less crime, everyone feels safer. Kids can play outside more freely. Parents don't have to worry as much. Shops can stay open without fear. It makes a whole country happier and healthier.</p>\n<p>When illegal mining stops, our beautiful earth is protected. The land stays safe and clean for animals and for us. The special treasures of the country can be used in a fair way to help everyone in South Africa.</p>\n<p>This big decision by President Ramaphosa is all about making South Africa a better, safer, and fairer place for all its citizens. Citizens are all the people who live in a country.</p>\n<p>Did you know? Protecting the environment, like stopping illegal mining, helps animals keep their homes too! Many animals live underground or rely on the land.</p>\n\n<h3>How Can We All Help? (Kids Too!)</h3>\n<p>Even though you are kids, you can also help make your communities safer!</p>\n<ul>\n    <li>Always tell a trusted adult if you see something that looks unsafe or wrong.</li>\n    <li>Listen to your parents, teachers, and police officers. They are there to help you.</li>\n    <li>Be kind to everyone. When we are kind, we build stronger, happier communities where there is less room for bad things to happen.</li>\n    <li>Learn about your country and its rules. Knowing the rules helps you follow them.</li>\n</ul>\n<p>Every little bit of kindness and good behavior helps to make our world a better place. You are all little superheroes in your own way!</p>\n<p>Did you know? Many schools in South Africa teach children about their culture and history, helping them to be proud citizens!</p>\n\n<h3>A Message of Hope for South Africa!</h3>\n<p>So, the army and police are teaming up like real-life superheroes to fight crime and illegal mining in South Africa. They are working hard to protect the land and keep people safe.</p>\n<p>It shows that the leaders of South Africa really care about their people. With everyone working together, South Africa will become an even brighter and safer place for all its wonderful children and families.</p>\n<p>Let's wish them good luck! And remember to always be a good citizen in your own home and community. See you next time, super friends!</p>",
    "summary": "South Africa's President has asked the army to work with the police to stop bad people who do crimes and illegal mining, making the country safer for everyone.",
    "whyMatters": "This is important because it means less crime, safer homes, protected land, and a fairer country where everyone can live happily and play freely.",
    "category": "politics",
    "date": "2026-02-14T01:42:49.702Z",
    "image": "https://image.pollinations.ai/prompt/Superheroes%20to%20the%20Rescue%20in%20South%20Africa!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "superheroes-to-the-rescue-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/c0q30d20lkqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "India vs Pakistan: Eager fans brave surge in travel costs for T20 World Cup",
    "title": "India vs Pakistan: Eager fans brave surge in travel costs for T20 World Cup",
    "content": "Despite soaring travel costs and ticketing challenges, desperate Indian fans travel to Colombo for the match on Sunday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:42:54.965Z",
    "image": "https://image.pollinations.ai/prompt/India%20vs%20Pakistan%3A%20Eager%20fans%20brave%20surge%20in%20travel%20costs%20for%20T20%20World%20Cup%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "india-vs-pakistan-eager-fans-brave-surge-in-travel-costs-for-t20-world-cup",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/14/icc-t20-world-cup-india-vs-pakistan-cricket-fans-travel-colombo?traffic_source=rss"
  },
  {
    "originalTitle": "US military kills 3 in latest attack on boat in the Caribbean",
    "title": "US military kills 3 in latest attack on boat in the Caribbean",
    "content": "At least 130 people have been killed in US attacks on vessels in the Caribbean Sea and Pacific Ocean since September.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:43:00.071Z",
    "image": "https://image.pollinations.ai/prompt/US%20military%20kills%203%20in%20latest%20attack%20on%20boat%20in%20the%20Caribbean%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "us-military-kills-3-in-latest-attack-on-boat-in-the-caribbean",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/us-military-kills-3-in-latest-attack-on-boat-in-caribbean?traffic_source=rss"
  },
  {
    "originalTitle": "Trump threatens an executive order to mandate voter IDs before elections",
    "title": "Trump threatens an executive order to mandate voter IDs before elections",
    "content": "The US president's message comes as part of a broader push to increase federal control of the election process.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T01:43:05.186Z",
    "image": "https://image.pollinations.ai/prompt/Trump%20threatens%20an%20executive%20order%20to%20mandate%20voter%20IDs%20before%20elections%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-threatens-an-executive-order-to-mandate-voter-ids-before-elections",
    "originalLink": "https://www.aljazeera.com/news/2026/2/14/trump-threatens-an-executive-order-to-mandate-voter-ids-before-elections?traffic_source=rss"
  },
  {
    "originalTitle": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "content": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:43:10.717Z",
    "image": "https://image.pollinations.ai/prompt/World's%20rules-based%20order%20'no%20longer%20exists'%2C%20Germany's%20Merz%20warns%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "worlds-rules-based-order-no-longer-exists-germanys-merz-warns",
    "originalLink": "https://www.bbc.com/news/articles/cy4wpv0wx43o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Bangladesh's new leader bring change after election landslide?",
    "title": "Can Bangladesh's new leader bring change after election landslide?",
    "content": "Tarique Rahman is set to be Bangladesh's next prime minister, 18 months after mass protests ousted its longest-serving leader.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-14T01:43:15.813Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Bangladesh's%20new%20leader%20bring%20change%20after%20election%20landslide%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-bangladeshs-new-leader-bring-change-after-election-landslide",
    "originalLink": "https://www.bbc.com/news/articles/cn0ex5d4g6xo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Six possible effects of Trump's climate policy change ",
    "title": "Six possible effects of Trump's climate policy change ",
    "content": "The announcement on Thursday removes the legal bedrock for much of US environmental legislation.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:43:20.921Z",
    "image": "https://image.pollinations.ai/prompt/Six%20possible%20effects%20of%20Trump's%20climate%20policy%20change%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "six-possible-effects-of-trumps-climate-policy-change",
    "originalLink": "https://www.bbc.com/news/articles/cd03ee39945o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'It was silly from me' - 'brilliant' Delap recovers from error",
    "title": "Liam the Superstar: From a Little Oops to Three High-Fives!",
    "content": "<h3>Hello, Amazing Friends in Africa!</h3>\n\nHello, hello, hello! It’s your favourite kid-friendly news reporter, bringing you exciting stories from around the world! Today, we have a super fun story about a young football player named Liam Delap. He plays for a big team called Chelsea. Liam had a very special day on the football field, full of a tiny mistake and then lots of amazing teamwork! It’s a story about trying your best, even when things don’t go perfectly at first.\n\n<h3>Who is Liam Delap?</h3>\n\nImagine a football player whose main job is to score goals for his team. That’s what Liam Delap does! He is what we call a 'striker.' Strikers are like the goal heroes! They run very fast and try to kick the ball into the net to score points for their team. Liam is a young and strong player, always ready to make things happen on the field.\n\nDid you know? Many children in Africa dream of becoming amazing football strikers just like Liam!\n\n<h3>What is Football?</h3>\n\nBefore we jump into the exciting game, let’s remember what football is all about! It’s a super popular game played with a round ball. Two teams try to kick the ball into each other's goal. The team that scores more goals wins! It's all about running, passing, kicking, and working together as a team. It's a sport that brings joy to so many people, all over the world, including right here in Africa!\n\n<h3>The Big Game: Chelsea vs. Hull City</h3>\n\nOne sunny day, Liam and his team, Chelsea, were playing a very important game against another team called Hull City. All the players were ready to play their best. The fans in the stadium were cheering very loudly! Everyone was excited to see who would win this match. It was a chance for all the players to show their skills and teamwork.\n\nDid you know? Football is often called 'soccer' in some parts of the world, but it's the same wonderful game!\n\n<h3>Oops! A Little Mistake</h3>\n\nNow, here’s where our story gets interesting! During the game, Liam had a super easy chance to score a goal. Imagine the goal net was right in front of him, and the ball was just waiting to be tapped in. This kind of easy chance is called a 'sitter' in football. But guess what? Liam missed it! He kicked the ball, but it didn't go into the net. Oh no!\n\nHe felt a little bit sad, and he even said it was 'silly' of him. Everyone makes mistakes, right? Even super good football players like Liam. It’s okay to feel a bit disappointed when you make a mistake.\n\n<h3>Never Give Up!</h3>\n\nBut here’s the most important part of the story! Even though Liam missed that easy goal, he didn't let it stop him. He didn't put his head down and feel sad for the rest of the game. Oh no! He decided to try even harder. He shook off that little mistake and kept running, kept fighting, and kept working for his team. This is what we call being 'resilient' – bouncing back!\n\nDid you know? Learning from mistakes helps us grow stronger and better at everything we do!\n\n<h3>Helping Hands: What is an Assist?</h3>\n\nLiam showed us that even if you don't score a goal yourself, you can still be a superhero for your team! How? By giving 'assists'! An assist is when you pass the ball to a teammate, and then that teammate scores a goal right after your pass. It's like you're setting up your friend for success! It shows you are a very good team player who thinks about others.\n\nImagine you are playing with your friends, and you pass the ball perfectly to your friend, and they score. You helped them score! That's an assist!\n\n<h3>Three Cheers for Assists! A Hat-Trick!</h3>\n\nGuess what amazing thing Liam did after his little mistake? He didn't just give one assist, or two assists... he gave THREE assists! Wow! When a player does something amazing three times in a game, like scoring three goals or giving three assists, it’s called a 'hat-trick.' So Liam got a 'hat-trick of assists'! He helped three different friends score goals.\n\nThis showed everyone that even if he didn't score a goal himself, he was still playing 'top'! 'Top performance' means he played super, super well, like the best he could be. He was running, passing, and helping his team win in the best way possible.\n\nDid you know? The word 'hat-trick' comes from the game of cricket, where a bowler who took three wickets in three balls would be given a hat as a prize!\n\n<h3>A Big Win for Chelsea!</h3>\n\nThanks to Liam's amazing teamwork and his three assists, his team, Chelsea, scored four goals! And the other team, Hull City, didn't score any goals. So, the final score was 4-0! Chelsea won the game, and everyone was very happy. Liam's assists were a very big part of why his team won. He turned a little 'oops' into a giant 'hooray!'\n\n<h3>What We Learn from Liam</h3>\n\nLiam's story teaches us a very important lesson. Sometimes we make mistakes, and that’s okay. What matters most is how we react to those mistakes. Do we give up? Or do we try even harder and find new ways to help our friends and our team? Liam chose to try harder, and he became a hero by helping his teammates score!\n\nThis is a great lesson for all of us, whether we are playing football, doing our schoolwork, or helping our families. Never give up, keep trying, and always be a good friend and team player! Just like Liam Delap, you can turn a small stumble into a giant leap forward!\n\n<h3>Keep Dreaming, African Stars!</h3>\n\nSo, remember Liam Delap and his amazing story. Keep dreaming big dreams, keep playing football with your friends, and always remember to try your best. You never know, one day you might be the next big football star, making assists or scoring goals! We'll be here to cheer you on!",
    "summary": "Young Chelsea football player Liam Delap made a small mistake but quickly recovered to give three important assists, helping his team win a big game.",
    "whyMatters": "This story teaches us that it's okay to make mistakes, but what truly matters is trying your best, never giving up, and helping your friends to achieve great things, just like Liam did for his football team.",
    "category": "world",
    "date": "2026-02-14T01:43:40.609Z",
    "image": "https://image.pollinations.ai/prompt/Liam%20the%20Superstar%3A%20From%20a%20Little%20Oops%20to%20Three%20High-Fives!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "liam-the-superstar-from-a-little-oops-to-three-high-fives",
    "originalLink": "https://www.bbc.com/sport/football/articles/cvg3pjqk8d1o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "title": "'Intense, aggressive, entertaining' - what will Tudor bring to Spurs?",
    "content": "After Igor Tudor agrees to take charge of Tottenham for the remainder of the season, BBC Sport takes a look at what supporters can expect to see from his side.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-14T01:43:45.714Z",
    "image": "https://image.pollinations.ai/prompt/'Intense%2C%20aggressive%2C%20entertaining'%20-%20what%20will%20Tudor%20bring%20to%20Spurs%3F%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "intense-aggressive-entertaining-what-will-tudor-bring-to-spurs",
    "originalLink": "https://www.bbc.com/sport/football/articles/ckg13nkvd2eo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Marvellous' Man City set WSL standard in rampant win",
    "title": "'Marvellous' Man City set WSL standard in rampant win",
    "content": "'Marvellous' Manchester City set WSL standard in rampant 6-0 win over bottom side Leicester.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-14T01:43:50.816Z",
    "image": "https://image.pollinations.ai/prompt/'Marvellous'%20Man%20City%20set%20WSL%20standard%20in%20rampant%20win%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "marvellous-man-city-set-wsl-standard-in-rampant-win",
    "originalLink": "https://www.bbc.com/sport/football/articles/crrxwjjqrxeo?at_medium=RSS&at_campaign=rss"
  }
]