[
  {
    "originalTitle": "Sudan atrocities are 'hallmarks of genocide', UN says",
    "title": "Helping Friends in Sudan: The UN Wants Peace!",
    "content": "<h3>Hello, My Amazing Friends!</h3>\nHi everyone! I'm your special news reporter, bringing you important stories from our wonderful continent of Africa. Today, we need to talk about some news from a country called Sudan. It's a bit of a sad story, but it's important for us to know so we can hope for peace and help.\n\n<h3>Where is Sudan?</h3>\nSudan is a big country right here in Africa! It's in the northeastern part, with lots of sandy deserts and also green lands near a very long river called the Nile. Many, many friendly people live there. They have homes, schools, and families, just like you and me. Sudan is a place with rich history and beautiful cultures. Did you know Africa is a giant continent with 54 different countries, and Sudan is one of them? It's a place with sunny days and bright smiles, usually!\n\n<h3>What's Happening in Sudan?</h3>\nRight now, some sad things are happening in Sudan. There is fighting. Imagine if two groups of friends couldn't agree, and instead of talking, they started pushing and shoving, but much, much worse. That's a bit like what is happening with two big groups of soldiers in Sudan. This fighting makes many people very, very scared.\n\nIt makes it hard for families to live safely in their homes. Children can't go to school, and sometimes there isn't enough food or water. It's a very big problem. When there is fighting, people can get hurt, and their homes can be broken.\n\n<h3>Who is Helping? Meet the UN!</h3>\nBut guess what? There's a special helper in the world called the UN! The UN stands for the United Nations. Imagine a giant club where almost all the countries in the world are members. Like a super big friendship club!\n\nThe UN's main job is to help countries get along, keep peace, and make sure everyone is safe and treated fairly. They have a special blue flag, and people from all over the world work for them. Did you know the UN tries to help people in many, many places around the globe, from giving food to helping kids go to school?\n\n<h3>Being Detectives for Peace</h3>\nThe UN heard about the sad fighting in Sudan. They wanted to know exactly what was happening, so they sent some special people there. These people are like detectives! They went to Sudan to look, listen, and find out all the facts. This is called a \"fact-finding mission.\"\n\nThey talked to people, saw what was happening, and gathered information. They wanted to understand the full picture, so they could tell the world and try to help. Just like when you try to find out who ate the last cookie – they were trying to find out what was happening to people and why. They wanted to collect all the clues.\n\n<h3>Very Sad News From El-Fasher</h3>\nOur UN detectives visited a city in Sudan called El-Fasher. A city is like a very, very big town with lots of houses, shops, and people. In El-Fasher, the fighting was very, very bad. One of the army groups, called the Rapid Support Forces, took control of the city.\n\nWhen they did this, many, many terrible things happened. People were hurt, homes were destroyed, and families had to run away to find safety. Imagine losing your home and having to leave everything behind with your family. It's a very frightening thought, and it makes many people very sad.\n\n<h3>Why Are People Worried?</h3>\nThe UN detectives saw these terrible things, and they got very, very worried. They said that what was happening in El-Fasher and other places in Sudan looked like \"hallmarks of genocide.\" Now, that's a big, scary word. Let's make it simple.\n\nIt means the UN is worried that one group of people is trying to hurt or kill *many* other people, not just because they are fighting, but because they are *different*. Maybe they come from a different family group, or they speak a different language, or they just look a bit different. The UN is worried that many people are being hurt *just because of who they are*. This is extremely sad and unfair. They want all people to be treated with kindness, no matter who they are or where they come from.\n\n<h3>What Does the UN Want?</h3>\nThe UN wants this fighting and these terrible acts to stop right now. They want peace to come back to Sudan. They want all the people in Sudan to be safe and to live without fear. They want families to have their homes back, children to go back to school, and everyone to have enough food and water.\n\nThe UN is asking all the grown-ups in charge to stop the fighting and to be kind to everyone. They are asking for people to talk to each other instead of fighting. Did you know that talking and sharing is always better than fighting? It helps everyone feel happy and safe. The UN wants fairness for all.\n\n<h3>What Can We Do?</h3>\nEven though we are far away, we can still help in our own special ways. We can learn about Sudan and its people. We can remember that all people, everywhere, deserve to be safe and happy. We can also be extra kind to everyone around us, no matter if they look different or like different things.\n\nWe can wish for peace in Sudan and for all the children and families there to be safe soon. When we are kind and hopeful, we send good energy into the world. Let's hope for a brighter, peaceful day for all our friends in Sudan! Everyone deserves a safe home and a happy life.",
    "summary": "The UN is very worried about terrible things happening to people in Sudan, especially in a city called El-Fasher, and they want the fighting to stop so everyone can be safe.",
    "whyMatters": "It's important because it means many children and families in Sudan are in danger, and we should know when friends in other countries need help and hope for peace for everyone.",
    "category": "world",
    "date": "2026-02-19T10:38:13.872Z",
    "image": "https://image.pollinations.ai/prompt/Helping%20Friends%20in%20Sudan%3A%20The%20UN%20Wants%20Peace!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "helping-friends-in-sudan-the-un-wants-peace",
    "originalLink": "https://www.bbc.com/news/articles/cpqw74d81jqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "The two farms in Senegal that supply many of the UK's vegetables",
    "title": "Yummy Veggies from Sunny Africa!",
    "content": "Hello everyone! I'm your friendly news reporter from amazing Africa!\n\nToday, I have a super cool story for you. It's about farms, sunshine, and yummy vegetables that travel a very long way. Are you ready for an adventure?\n\n<h3>Meet Senegal!</h3>\nImagine a country in Africa where the sun shines warm and bright almost every day. That country is called Senegal! It's in a part of Africa called West Africa.\n\nSenegal is a beautiful place. The people there work very hard. They love to grow delicious food for everyone.\n\nDid you know? Africa is a very, very big continent with many wonderful countries, just like Senegal!\n\n<h3>Two Special Farms</h3>\nIn Senegal, there are two really, really special farms. These farms are like giant, magical gardens!\n\nOn these farms, farmers plant tiny seeds. Then, they watch them grow into big, healthy vegetable plants.\n\nThese farms grow lots and lots of vegetables. They grow so much food that they can share it with people far, far away.\n\nIt's a very big job, but the farmers in Senegal do it with big smiles and happy hearts.\n\n<h3>What Yummy Veggies Do They Grow?</h3>\nWhat kind of yummy vegetables do these special farms grow? Well, imagine crunchy green beans, just waiting to be picked.\n\nOr maybe bright red peppers that are sweet and tasty. They might even grow juicy tomatoes or delicious sweet potatoes.\n\nThese vegetables are super healthy for you! They have lots of good things inside them that help you grow big and strong.\n\nDid you know? Eating colourful vegetables is like giving your body a superpower boost!\n\n<h3>Sunshine and Happy Plants</h3>\nHow do the farms in Senegal grow so many amazing vegetables? It's all thanks to the wonderful sunshine!\n\nSenegal has plenty of sun, which is exactly what plants love. The sun helps the plants grow tall and green and make their yummy fruits.\n\nThe farms also have good, rich soil. This soil is like a comfy bed for the plant roots to grow in.\n\nAnd of course, the farmers give the plants plenty of water. It's like a big, happy party for all the vegetables every single day!\n\n<h3>When It's Cold in Britain</h3>\nNow, let's imagine a country very, very far away from Senegal. This country is called Britain.\n\nWhen it's winter in Britain, it gets very cold. Sometimes there's lots of snow and ice! Brrr, it's chilly!\n\nWhen it's so cold, it's very difficult for farmers in Britain to grow fresh vegetables outside. The plants don't like the cold.\n\nSo, people in Britain need help getting their fresh, healthy food during the cold winter months. And guess who helps them? Senegal!\n\n<h3>A Long Journey for Veggies!</h3>\nWhen the vegetables are ready and perfectly ripe, the farmers carefully pick them. They put them into special boxes.\n\nThen, these boxes of fresh vegetables go on a very big adventure! They are loaded onto a huge boat.\n\nThis boat is not just any boat. It's called a cargo ship. A cargo ship is a giant boat that carries lots and lots of things across the ocean.\n\nDid you know? Some cargo ships are so big they can be as long as many football fields put together!\n\n<h3>Sailing Across the Sea</h3>\nThe cargo ship starts its long journey across the big, blue ocean. It's a very, very long trip, taking many days and nights.\n\nThe ship travels all the way from West Africa, where Senegal is, to Britain.\n\nBut don't worry! The fresh vegetables are kept safe and cool inside the ship, so they stay yummy.\n\nEvery single week, a new cargo ship full of delicious vegetables leaves Senegal. That's a lot of trips and a lot of fresh food!\n\n<h3>Why This Is Super Important!</h3>\nThis story is super important and wonderful because it helps so many people. It's like a big circle of helping.\n\nPeople in Britain get to eat fresh, healthy vegetables even in the middle of winter. They don't have to eat only frozen or tinned food!\n\nAnd the hardworking farmers in Senegal earn money for their amazing efforts. This money helps their families buy food, go to school, and live happy lives.\n\nDid you know? When countries help each other, it makes the whole world a better and happier place for everyone!\n\n<h3>Sharing Goodness</h3>\nSo, these two special farms in sunny Senegal are like superheroes! They use the power of the sun and their hard work to grow food.\n\nThey send delicious, fresh food across the big, wide world. It's a beautiful example of how countries can be friends and help each other.\n\nIt's a story of sharing goodness and making sure everyone has healthy food to eat. Hooray for the farmers of Senegal!",
    "summary": "Two special farms in sunny Senegal grow yummy vegetables and send them all the way to Britain every week, so people can eat fresh food even when it's cold there.",
    "whyMatters": "This matters because it helps people in Britain eat healthy vegetables when they can't grow them due to cold weather, and it helps the hardworking farmers in Senegal earn money for their families and communities.",
    "category": "technology",
    "date": "2026-02-19T10:38:34.678Z",
    "image": "https://image.pollinations.ai/prompt/Yummy%20Veggies%20from%20Sunny%20Africa!%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "yummy-veggies-from-sunny-africa",
    "originalLink": "https://www.bbc.com/news/articles/cwy6171wvppo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria, witnesses say",
    "title": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria, witnesses say",
    "content": "The workers are believed to have collapsed after the gas built up in poorly ventilated tunnels.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:38:39.813Z",
    "image": "https://image.pollinations.ai/prompt/Suspected%20carbon-monoxide%20leak%20kills%20at%20least%2030%20miners%20in%20Nigeria%2C%20witnesses%20say%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "suspected-carbon-monoxide-leak-kills-at-least-30-miners-in-nigeria-witnesses-say",
    "originalLink": "https://www.bbc.com/news/articles/cwyk6nr80kxo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Can Europe reduce its dependence on the US and at what cost?",
    "title": "Can Europe reduce its dependence on the US and at what cost?",
    "content": "Trump's tariffs, Greenland and defence spending are testing US-Europe alliance.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:38:45.055Z",
    "image": "https://image.pollinations.ai/prompt/Can%20Europe%20reduce%20its%20dependence%20on%20the%20US%20and%20at%20what%20cost%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "can-europe-reduce-its-dependence-on-the-us-and-at-what-cost",
    "originalLink": "https://www.aljazeera.com/video/counting-the-cost/2026/2/19/can-europe-reduce-its-dependence-on-the-us-and-at-what-cost?traffic_source=rss"
  },
  {
    "originalTitle": "Visualising AI spending: How does it compare with history’s mega projects?",
    "title": "Visualising AI spending: How does it compare with history’s mega projects?",
    "content": "AI spending is projected to reach $2.5 trillion in 2026, surpassing the largest scientific and infrastructure projects.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-02-19T10:38:50.196Z",
    "image": "https://image.pollinations.ai/prompt/Visualising%20AI%20spending%3A%20How%20does%20it%20compare%20with%20history%E2%80%99s%20mega%20projects%3F%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "visualising-ai-spending-how-does-it-compare-with-historys-mega-projects",
    "originalLink": "https://www.aljazeera.com/news/2026/2/19/visualising-ai-spending-how-does-it-compare-with-historys-mega-projects?traffic_source=rss"
  },
  {
    "originalTitle": "UN mission finds RSF destruction in el-Fasher bears ‘hallmarks of genocide’",
    "title": "UN mission finds RSF destruction in el-Fasher bears ‘hallmarks of genocide’",
    "content": "UN probe documents coordinated ethnic targeting, rape and torture against non-Arab communities in Sudanese city.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:38:55.331Z",
    "image": "https://image.pollinations.ai/prompt/UN%20mission%20finds%20RSF%20destruction%20in%20el-Fasher%20bears%20%E2%80%98hallmarks%20of%20genocide%E2%80%99%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "un-mission-finds-rsf-destruction-in-el-fasher-bears-hallmarks-of-genocide",
    "originalLink": "https://www.aljazeera.com/news/2026/2/19/un-mission-finds-rsf-destruction-in-el-fasher-bears-hallmarks-of-genocide?traffic_source=rss"
  },
  {
    "originalTitle": "South Korea's ex-president jailed for life over martial law attempt",
    "title": "South Korea's ex-president jailed for life over martial law attempt",
    "content": "Yoon Suk Yeol's December 2024 martial law bid fundamentally damaged South Korea's democracy, a judge told the court.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:39:01.008Z",
    "image": "https://image.pollinations.ai/prompt/South%20Korea's%20ex-president%20jailed%20for%20life%20over%20martial%20law%20attempt%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-koreas-ex-president-jailed-for-life-over-martial-law-attempt",
    "originalLink": "https://www.bbc.com/news/articles/cx28y8xd1vjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "White House presses Iran to make deal, while ramping up military presence",
    "title": "White House presses Iran to make deal, while ramping up military presence",
    "content": "US media reports that Trump has discussed attack options with advisers, and a  strike could happen as early as Saturday.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:39:06.144Z",
    "image": "https://image.pollinations.ai/prompt/White%20House%20presses%20Iran%20to%20make%20deal%2C%20while%20ramping%20up%20military%20presence%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "white-house-presses-iran-to-make-deal-while-ramping-up-military-presence",
    "originalLink": "https://www.bbc.com/news/articles/c204zpz0lyro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Martial law, protests and a president tried for insurrection: How did South Korea get here?",
    "title": "Martial law, protests and a president tried for insurrection: How did South Korea get here?",
    "content": "A court is due to deliver its verdict in the insurrection trial of Yoon Suk Yeol.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-02-19T10:39:11.273Z",
    "image": "https://image.pollinations.ai/prompt/Martial%20law%2C%20protests%20and%20a%20president%20tried%20for%20insurrection%3A%20How%20did%20South%20Korea%20get%20here%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "martial-law-protests-and-a-president-tried-for-insurrection-how-did-south-korea-get-here",
    "originalLink": "https://www.bbc.com/news/videos/c70kw0nrxreo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "title": "Arsenal squander two-goal lead as Wolves score late to earn draw",
    "content": "A Ricardo Calafiori own goal in the 94th minute gives Wolves a point. as the Premier League's bottom side come back from two goals down against leaders Arsenal at Molineux.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T10:39:16.788Z",
    "image": "https://image.pollinations.ai/prompt/Arsenal%20squander%20two-goal%20lead%20as%20Wolves%20score%20late%20to%20earn%20draw%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "arsenal-squander-two-goal-lead-as-wolves-score-late-to-earn-draw",
    "originalLink": "https://www.bbc.com/sport/football/videos/cn4gjldn03yo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What Guardiola's old newspaper column reveals about Man City's new tactics",
    "title": "What Guardiola's old newspaper column reveals about Man City's new tactics",
    "content": "Pep Guardiola is using new tactics this season by making Manchester City's attack more narrow, but did he hint at the idea 20 years ago?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-19T10:39:21.925Z",
    "image": "https://image.pollinations.ai/prompt/What%20Guardiola's%20old%20newspaper%20column%20reveals%20about%20Man%20City's%20new%20tactics%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-guardiolas-old-newspaper-column-reveals-about-man-citys-new-tactics",
    "originalLink": "https://www.bbc.com/sport/football/articles/cr7323v131lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'Bottle word will be used' as Arsenal blow title advantage",
    "title": "'Bottle word will be used' as Arsenal blow title advantage",
    "content": "After blowing a two-goal lead to draw against the Premier League's bottom club Wolves, there will be no dodging the questions on whether Arsenal are mentally ready to end their 22-year wait to become champions.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-19T10:39:27.058Z",
    "image": "https://image.pollinations.ai/prompt/'Bottle%20word%20will%20be%20used'%20as%20Arsenal%20blow%20title%20advantage%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "bottle-word-will-be-used-as-arsenal-blow-title-advantage",
    "originalLink": "https://www.bbc.com/sport/football/articles/czj1nm9jdy3o?at_medium=RSS&at_campaign=rss"
  }
]