[
  {
    "originalTitle": "Chad shuts border with Sudan in bid to stop conflict spreading",
    "title": "Chad shuts border with Sudan in bid to stop conflict spreading",
    "content": "A Chadian government spokesperson says the decision is aimed at protecting citizens.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "government",
    "date": "2026-02-24T10:42:37.203Z",
    "image": "https://image.pollinations.ai/prompt/Chad%20shuts%20border%20with%20Sudan%20in%20bid%20to%20stop%20conflict%20spreading%20realistic%20news%20photography%20context%20Government%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "chad-shuts-border-with-sudan-in-bid-to-stop-conflict-spreading",
    "originalLink": "https://www.bbc.com/news/articles/cm2x1n95z5vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Robert Mugabe's son charged with attempted murder in South Africa",
    "title": "Robert Mugabe's son charged with attempted murder in South Africa",
    "content": "Bellarmine Mugabe and one other man have not commented on the charges after a 23-year-old was shot.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:42:42.341Z",
    "image": "https://image.pollinations.ai/prompt/Robert%20Mugabe's%20son%20charged%20with%20attempted%20murder%20in%20South%20Africa%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "robert-mugabes-son-charged-with-attempted-murder-in-south-africa",
    "originalLink": "https://www.bbc.com/news/articles/cz9qk9y4d32o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "'I put my bike up for sale - it went from Fife to Kenya'",
    "title": "'I put my bike up for sale - it went from Fife to Kenya'",
    "content": "Dr Carrie Ruxton was surprised when a Kenyan cyclist got in touch asking if the bike could help her country's paracycling team.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:43:09.346Z",
    "image": "https://image.pollinations.ai/prompt/'I%20put%20my%20bike%20up%20for%20sale%20-%20it%20went%20from%20Fife%20to%20Kenya'%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-put-my-bike-up-for-sale-it-went-from-fife-to-kenya",
    "originalLink": "https://www.bbc.com/news/articles/c795eexrv34o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Floyd Mayweather and Manny Pacquiao agree to fight rematch in September",
    "title": "Floyd Mayweather and Manny Pacquiao agree to fight rematch in September",
    "content": "Rematch of 2015 bout to be streamed on Netflix and will be the first boxing event to be held at the Sphere in Las Vegas.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:43:14.722Z",
    "image": "https://image.pollinations.ai/prompt/Floyd%20Mayweather%20and%20Manny%20Pacquiao%20agree%20to%20fight%20rematch%20in%20September%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "floyd-mayweather-and-manny-pacquiao-agree-to-fight-rematch-in-september",
    "originalLink": "https://www.aljazeera.com/sports/2026/2/24/floyd-mayweather-and-manny-pacquiao-agree-to-fight-rematch-in-september?traffic_source=rss"
  },
  {
    "originalTitle": "Iran army helicopter crashes into market, killing 2 pilots and 2 merchants",
    "title": "Iran army helicopter crashes into market, killing 2 pilots and 2 merchants",
    "content": "The incident in Isfahan province follows crash of fighter jet in Hamadan province less than a week ago.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "business",
    "date": "2026-02-24T10:43:19.852Z",
    "image": "https://image.pollinations.ai/prompt/Iran%20army%20helicopter%20crashes%20into%20market%2C%20killing%202%20pilots%20and%202%20merchants%20realistic%20news%20photography%20context%20Business%20%26%20Finance%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "iran-army-helicopter-crashes-into-market-killing-2-pilots-and-2-merchants",
    "originalLink": "https://www.aljazeera.com/news/2026/2/24/army-helicopter-crashes-into-iran-market-killing-2-pilots-and-2-merchants?traffic_source=rss"
  },
  {
    "originalTitle": "What do four years of war in Ukraine add up to?",
    "title": "What do four years of war in Ukraine add up to?",
    "content": "It's year five of the war in Ukraine. Close to two million casualties, and Russia holds less territory than in 2022.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:43:34.079Z",
    "image": "https://image.pollinations.ai/prompt/What%20do%20four%20years%20of%20war%20in%20Ukraine%20add%20up%20to%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-do-four-years-of-war-in-ukraine-add-up-to",
    "originalLink": "https://www.aljazeera.com/video/by-the-numbers-3/2026/2/24/what-do-four-years-of-war-in-ukraine-add-up-to?traffic_source=rss"
  },
  {
    "originalTitle": "Russian soldiers tell BBC they saw fellow troops executed on commanders' orders",
    "title": "Russian soldiers tell BBC they saw fellow troops executed on commanders' orders",
    "content": "Four men expose the horror and brutality of conditions in the Ukraine war, with two saying they saw soldiers being shot for refusing orders.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:43:39.467Z",
    "image": "https://image.pollinations.ai/prompt/Russian%20soldiers%20tell%20BBC%20they%20saw%20fellow%20troops%20executed%20on%20commanders'%20orders%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "russian-soldiers-tell-bbc-they-saw-fellow-troops-executed-on-commanders-orders",
    "originalLink": "https://www.bbc.com/news/articles/cz7gw3l395ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mexico sends thousands of soldiers to stop violence after death of drug lord",
    "title": "Mexico sends thousands of soldiers to stop violence after death of drug lord",
    "content": "A wave of violence has erupted across Mexico since a powerful drug cartel boss died following his capture by special forces.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:43:44.594Z",
    "image": "https://image.pollinations.ai/prompt/Mexico%20sends%20thousands%20of%20soldiers%20to%20stop%20violence%20after%20death%20of%20drug%20lord%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "mexico-sends-thousands-of-soldiers-to-stop-violence-after-death-of-drug-lord",
    "originalLink": "https://www.bbc.com/news/articles/cx2lp7xwql4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "More than 5,000 flights cancelled as US east coast digs out of record snow",
    "title": "A Big White Blanket: Snowstorm in America!",
    "content": "Jambo, amazing friends! It's your friendly African news reporter here, ready to share a super interesting story from a place far, far away. This story is about something many of us in Africa don't see very often – lots and lots of snow!\n\n<h3>Hello from Far Away!</h3>\nImagine looking outside and seeing everything covered in a thick, white, fluffy blanket. That’s what happened in a big country called America, in a part they call the 'east coast'. It was a giant snowstorm, like a big, cold, white cloud that decided to drop all its white magic down to Earth! \n\n<h3>What is Snow, Anyway?</h3>\nFor many of us, snow is a mystery! We know sand, we know rain, but snow? Well, snow is tiny, tiny pieces of frozen water. When the air gets super, super cold high up in the sky, water turns into beautiful little white crystals. These crystals stick together and fall down as soft, white flakes. When lots and lots of flakes fall, it becomes snow! It's cold and powdery, like very soft, cold sugar, but it's not sweet!\n\nDid you know? Every single snowflake has a unique shape, just like our fingerprints are all different! Isn't that amazing? Scientists have looked at many, many snowflakes and they are all special!\n\n<h3>So Much Snow!</h3>\nThis snowstorm wasn't just a little bit of snow. Oh no! It was a HUGE amount! In some places, the snow piled up higher than a big ruler. We call that 'more than a foot' of snow. Imagine putting your school ruler on the ground, then stacking another one, and another one, maybe even taller than your knee! That's how much snow fell in many places. It was like the whole world turned white and fluffy!\n\nIt was so much snow that people had to use big shovels, and even giant snow-clearing machines, to push it out of the way. Like trying to clear a path through a giant pile of white cotton wool! The roads were covered in a deep, soft carpet of white.\n\n<h3>Planes Can't Fly!</h3>\nWhen there's so much snow on the ground, some very important things get mixed up. One big problem was for airplanes! You know those big birds that fly high in the sky, carrying people and things from one city to another? Those are called flights.\n\nWell, more than 5,000 of these flights had to be stopped! Imagine 5,000 big airplanes, all waiting on the ground, because it was too dangerous to fly. The pilots couldn't see properly, and the big roads where planes take off and land, called runways, were completely covered in thick snow. It's like trying to drive your toy car through a very deep, soft pillow – it just gets stuck! People had to wait a long time for the snow to be cleared.\n\nDid you know? Airplanes need a very long and clear path to take off and land safely. Snow makes that very difficult because the wheels can slip, and pilots can't see the ground!\n\n<h3>Oh No, No Power!</h3>\nAnother big problem when there's a lot of snow is something called 'power cuts.' Do you know how your lights turn on? Or how your television works? Or how the fridge keeps food cold? That's all because of something called electricity!\n\nElectricity travels through special wires, often on tall poles. But when it snows a lot, the snow makes tree branches very heavy. Sometimes, these heavy branches break off and fall onto the electricity wires. When that happens, 'poof!' The electricity stops working in many houses. This is a power cut. It means no lights, no TV, and sometimes no warm food if people can't cook. People had to use candles to see in the dark.\n\nIt can be a bit scary when the lights go out, but brave people called engineers work hard to fix the wires and bring the power back on. They are like heroes, working even in the cold snow to help everyone.\n\n<h3>Things Get Mixed Up!</h3>\nWhen so much snow falls, everything gets a little mixed up. This is what we call 'disruption.' It means things are not working the way they usually do. It makes life difficult for many people.\n\nRoads were covered, so cars couldn't drive easily. Some buses and taxis could not move. This meant people couldn't go to work or visit their families. Some schools had to close, which meant kids got an unexpected holiday! People were told to stay safe and warm inside their homes. It was hard to go to the shops or visit friends because of all the snow.\n\nImagine if your favourite market was covered in a soft, white carpet and you couldn't get your favourite fruits! That's a bit like what it felt like for people trying to buy food or medicine.\n\n<h3>Playing in the White World!</h3>\nEven though the snowstorm caused problems, for some children, it was also a time for fun! When schools close because of snow, kids get to play outside. They build snowmen, which are like big round people made of snow, with carrot noses and stick arms! They also have snowball fights, throwing soft snowballs at each other.\n\nImagine how exciting it would be to play in all that white, fluffy stuff! It's a very different kind of play from building sandcastles or playing soccer in the sun, isn't it? Children wear warm coats, hats, and gloves to play in the snow so they don't get too cold.\n\nDid you know? When it's very, very cold, you can sometimes hear snow 'squeak' under your feet! This happens when tiny ice crystals rub against each other.\n\n<h3>Heroes to the Rescue!</h3>\nWhen there's a big snowstorm, many brave people become heroes. There are people who drive big machines to clear the snow from the roads. These machines are like giant brooms, pushing the snow away so cars can drive again. There are electricity workers who go out in the cold to fix the broken wires.\n\nAnd there are people who help their neighbours shovel snow from their driveways and walkways, so they can get out of their homes. Everyone works together to make things safe and normal again. It shows how people can be kind and helpful when big problems happen.\n\n<h3>A Big Winter Story!</h3>\nSo, my friends, that's the story of the big snowstorm in America. It brought lots of beautiful white snow, but also many problems like planes not flying and lights going out. But with a bit of patience, some hard work, and lots of warm clothes, people are now busy 'digging out' – which means clearing away all that snow to get back to normal life.\n\nIt reminds us that weather can be very powerful, no matter where you live! Stay curious, and I'll see you next time with more news from around our wonderful world!",
    "summary": "A huge snowstorm in America covered many places with a lot of snow, stopping thousands of airplanes from flying and causing lights to go out in many homes.",
    "whyMatters": "This story matters because it shows how powerful weather can be, causing big changes like planes not flying and lights going out, and reminds us that people need to help each other when big problems happen.",
    "category": "world",
    "date": "2026-02-24T10:44:14.002Z",
    "image": "https://image.pollinations.ai/prompt/A%20Big%20White%20Blanket%3A%20Snowstorm%20in%20America!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-big-white-blanket-snowstorm-in-america",
    "originalLink": "https://www.bbc.com/news/articles/cx289g1yw97o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Sesko and Lammens allow Man Utd to dream of Champions League",
    "title": "Sesko and Lammens allow Man Utd to dream of Champions League",
    "content": "Striker Benjamin Sesko and goalkeeper Senne Lammens are the key figures as Manchester United gain a hugely valuable Premier League win at Everton.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:44:19.740Z",
    "image": "https://image.pollinations.ai/prompt/Sesko%20and%20Lammens%20allow%20Man%20Utd%20to%20dream%20of%20Champions%20League%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "sesko-and-lammens-allow-man-utd-to-dream-of-champions-league",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn0zrgkeg1lo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Who has made Troy's Premier League team of the week?",
    "title": "Who has made Troy's Premier League team of the week?",
    "content": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-02-24T10:44:24.878Z",
    "image": "https://image.pollinations.ai/prompt/Who%20has%20made%20Troy's%20Premier%20League%20team%20of%20the%20week%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "who-has-made-troys-premier-league-team-of-the-week",
    "originalLink": "https://www.bbc.com/sport/football/articles/c99jmn9mmljo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Quiz - name every Englishman to score a Champions League hat-trick",
    "title": "Quiz - name every Englishman to score a Champions League hat-trick",
    "content": "In Newcastle's match with Qarabag, a certain winger became the 11th Englishmen to score a Champions League treble.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-02-24T10:44:30.010Z",
    "image": "https://image.pollinations.ai/prompt/Quiz%20-%20name%20every%20Englishman%20to%20score%20a%20Champions%20League%20hat-trick%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "quiz-name-every-englishman-to-score-a-champions-league-hat-trick",
    "originalLink": "https://www.bbc.com/sport/football/articles/cn5gkzqlpdyo?at_medium=RSS&at_campaign=rss"
  }
]