[
  {
    "originalTitle": "Nigeria police confirm mass church abductions after previous denial",
    "title": "Good News! Grown-Ups Are Helping Friends in Nigeria!",
    "content": "<h3>Hello from Africa, My Friends!</h3>\n\nHi everyone! It's your friendly news reporter here, coming to you from our amazing continent of Africa! Today, we're going to talk about something important happening in a country called Nigeria. Nigeria is a very big and beautiful country, just like a giant playground with lots of people, yummy food, and lovely music. It's one of our neighbours here in Africa!\n\nDid you know? Nigeria has more people living in it than any other country in Africa! Imagine a country with so many friendly faces!\n\n<h3>What Happened in Kaduna?</h3>\n\nSometimes, things happen that make us feel a little bit worried, but it's important to know that grown-ups are always working hard to help. In a place in Nigeria called Kaduna State, something like this happened. A 'state' is like a big area or region inside a country, a bit like your neighbourhood, but much, much bigger!\n\nIn Kaduna, some people went missing. These people were in special buildings called churches. A church is a place where people go to pray, sing happy songs, and be together with their friends and family. It's a peaceful place where people share stories and learn.\n\nMore than 160 people, which is a lot of people – imagine everyone in your school and more! – were not there anymore after visiting these churches. This made many people feel sad and worried for their friends and family.\n\n<h3>Our Super Helpers: The Police!</h3>\n\nWhen people go missing, we have special helpers who jump into action! These helpers are called the police. The police are like superheroes in uniforms! Their job is to keep everyone safe and to find people who are lost. They work very hard day and night to help.\n\nAt first, it was a bit confusing for everyone. But now, the police in Nigeria have said very clearly: \"Yes, we know these people are missing, and we are doing everything we can to find them!\" This is good news because it means everyone knows what's happening, and the helpers are focused on bringing people back home.\n\nThey are looking everywhere, asking questions, and putting all their energy into helping. Just like when you lose your favourite toy, you look under the bed, behind the sofa, everywhere! The police are doing that, but for people!\n\n<h3>Everyone is Helping!</h3>\n\nIt's not just the police helping! The people in Kaduna State are also helping each other. This is called 'community spirit'. When everyone in a community works together, they are much stronger. They are praying for the missing people and supporting each other.\n\nFamilies and friends are holding hands and hoping for their loved ones to return safely. It shows how much they care for each other. When we help each other, we make our world a better place.\n\nDid you know? Helping others makes us feel happy too! It's like giving a warm hug to someone who needs it.\n\n<h3>Sending Our Love to Nigeria</h3>\n\nNigeria is a country full of strong and kind people. They have faced challenges before, and they always come together to help one another. The grown-ups, the police, and all the people are working as a big team to make sure everyone is safe.\n\nWe are all sending our love, our good thoughts, and our hopes to the people of Kaduna State. We hope that all the missing people will be found soon and reunited with their families. It's so important that everyone feels safe in their homes and communities.\n\nRemember, it's always good to stay close to your grown-ups. And if you ever need help, look for a friendly police officer or another trusted adult. They are there to keep you safe!\n\nLet's keep hoping and sending our good wishes to Nigeria. We are all one big family here in Africa, and we look out for each other. See you next time, and remember to always be kind and helpful!",
    "summary": "Police in Nigeria are working hard to find over 160 people who went missing from churches in Kaduna State, with everyone hoping for their safe return.",
    "whyMatters": "This is important because everyone deserves to feel safe and happy in their community, and grown-ups are working together to help find missing people and keep everyone secure.",
    "category": "world",
    "date": "2026-01-21T16:38:13.865Z",
    "image": "https://image.pollinations.ai/prompt/Good%20News!%20Grown-Ups%20Are%20Helping%20Friends%20in%20Nigeria!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "good-news-grown-ups-are-helping-friends-in-nigeria",
    "originalLink": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
    "title": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
    "content": "Kizza Besigye’s party says his condition is critical, but authorities say he was taken to hospital for a routine check-up.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T16:38:18.998Z",
    "image": "https://image.pollinations.ai/prompt/Detained%20veteran%20Ugandan%20opposition%20figure%20critically%20ill%20in%20hospital%2C%20his%20party%20says%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "detained-veteran-ugandan-opposition-figure-critically-ill-in-hospital-his-party-says",
    "originalLink": "https://www.bbc.com/news/articles/c5y2q5j71pqo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "title": "Ex-president accused of murder plot expelled from Togo to Burkina Faso",
    "content": "Paul-Henri Sandaogo Damiba has not commented on the accusations from Burkina Faso.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:38:24.122Z",
    "image": "https://image.pollinations.ai/prompt/Ex-president%20accused%20of%20murder%20plot%20expelled%20from%20Togo%20to%20Burkina%20Faso%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "ex-president-accused-of-murder-plot-expelled-from-togo-to-burkina-faso",
    "originalLink": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palestinians react to Netanyahu joining Gaza ‘Board of Peace’",
    "title": "Palestinians react to Netanyahu joining Gaza ‘Board of Peace’",
    "content": "Palestinians in Gaza have expressed disbelief at the prospect of Benjamin Netanyahu joining the Board of Peace.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:38:29.381Z",
    "image": "https://image.pollinations.ai/prompt/Palestinians%20react%20to%20Netanyahu%20joining%20Gaza%20%E2%80%98Board%20of%20Peace%E2%80%99%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palestinians-react-to-netanyahu-joining-gaza-board-of-peace",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/21/palestinians-react-to-netanyahu-joining-gaza-board-of-peace?traffic_source=rss"
  },
  {
    "originalTitle": "Trump: Hamas will be ‘blown away’ if they don’t give up their weapons",
    "title": "Trump: Hamas will be ‘blown away’ if they don’t give up their weapons",
    "content": "Hamas has agreed to “give up their weapons” and will be \"blown away\" if they do not follow through, Donald Trump said.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T16:38:34.495Z",
    "image": "https://image.pollinations.ai/prompt/Trump%3A%20Hamas%20will%20be%20%E2%80%98blown%20away%E2%80%99%20if%20they%20don%E2%80%99t%20give%20up%20their%20weapons%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "trump-hamas-will-be-blown-away-if-they-dont-give-up-their-weapons",
    "originalLink": "https://www.aljazeera.com/video/newsfeed/2026/1/21/trump-hamas-will-be-blown-away-if-they-dont-give-up-their-weapons?traffic_source=rss"
  },
  {
    "originalTitle": "Trump’s ‘board of peace’: Who has joined, who hasn’t – and why",
    "title": "Let's Talk About a Big Peace Team!",
    "content": "<p>Hello, my wonderful friends from across Africa! It's your kid-friendly news reporter here, ready to share some exciting news. Today, we're going to talk about something super important: peace! Peace is like a warm, sunny day where everyone is happy and safe. It means no fighting, only smiling and playing.</p>\n\n<h3>What is Peace?</h3>\n<p>Imagine a playground where all the children share their toys, play together nicely, and help each other up if someone falls. That's what peace feels like! Peace means people can live, learn, and grow up without being scared. It means everyone can be friends, even if they are different.</p>\n<p>When there is peace, schools stay open, and you can learn amazing new things every day. Families can be together, and you can play with your friends outside. Isn't that wonderful?</p>\n<p>Did you know? The word \"peace\" is used in many different languages all over Africa! For example, in Swahili, you say \"amani,\" and in Yoruba, you say \"alafia.\" They all mean the same beautiful thing!</p>\n\n<h3>What is a Country and a Leader?</h3>\n<p>Now, let's think about countries. Africa has so many amazing countries, like Kenya, Nigeria, South Africa, and Egypt! Each country is like a very big home for many, many people. And each country has a special person called a leader.</p>\n<p>A leader is like the head of a very big family. They help make rules, keep everyone safe, and try to make sure everyone in their country is happy and has what they need. They work hard to solve problems and make life better for everyone.</p>\n<p>Did you know? Africa has 54 different countries! Each one is special and beautiful in its own way, with unique cultures and amazing animals.</p>\n\n<h3>A Special Idea for Peace</h3>\n<p>A very important leader from far away had a big, big idea. He wanted to start a special \"team for peace.\" Think of it like a club where leaders from different countries can come together. They would talk about how to make sure their countries and the world stay peaceful. They would share ideas on how to stop fighting and help people live better.</p>\n<p>This team for peace is like a special meeting place. At this meeting, leaders can talk, listen, and plan how to make the world a safer and happier place for all children and adults. It's like having a big table where everyone can share their thoughts.</p>\n\n<h3>Who Wants to Join the Peace Team?</h3>\n<p>So, the big leader asked many countries if they wanted to join this special peace team. And guess what? Some countries said, \"Yes! We want to be a part of this amazing idea!\"</p>\n<p>These countries believe that working together is the best way to keep peace. They want to sit at the big table and share their ideas. They think that by talking and planning together, they can solve problems and help make the world a better place for everyone, everywhere.</p>\n<p>Did you know? When countries work together, they can do big things, like build new roads, share medicines, or even send food to places that need help!</p>\n\n<h3>Why Some Countries Say Yes</h3>\n<p>Countries that said \"yes\" to joining the peace team often want to help their people live without fear. They want children to go to school every day and play freely.</p>\n<p>They might also have friends in other countries and want to make sure everyone can be friends. Joining the team shows that they care a lot about peace and want to make a big difference.</p>\n<p>It's like when you join a sports team. You join because you want to play with your friends, learn new skills, and work together to win. Countries join the peace team to work together for peace!</p>\n\n<h3>Who Doesn't Want to Join (Yet)?</h3>\n<p>But then, some other countries said, \"No, thank you,\" or \"Not right now.\" This doesn't mean they don't like peace! It just means they have different ideas, or maybe they need more time to think about it.</p>\n<p>Sometimes, countries might have their own plans for peace. Or maybe they want to talk a little more before they decide to join. It's okay to have different ideas, just like you and your friends might want to play different games sometimes.</p>\n<p>It's important to remember that everyone wants peace, even if they choose different ways to get there. It's like everyone wants to reach the top of the hill, but some might choose a different path.</p>\n\n<h3>Why Some Countries Say No (or Not Yet)</h3>\n<p>There are many reasons why a country might say \"not yet.\" Maybe they are very busy with things happening inside their own country. Or perhaps they want to make sure the peace team's plan is the very best plan for everyone.</p>\n<p>Some countries might also feel that they need to talk to other countries first, their neighbours and friends, before making such a big decision. They want to make sure their choice helps their people the most.</p>\n<p>Did you know? Just like people, countries can be friends, neighbours, and even have disagreements. But the most important thing is to keep talking and try to understand each other.</p>\n\n<h3>What Does This Mean for Africa?</h3>\n<p>For us in Africa, peace is incredibly important. When there is peace, more children can go to school and learn. More families can grow food and build happy homes. When countries work together for peace, it means a brighter future for all of us.</p>\n<p>Imagine all the children in Africa growing up happy and safe, able to chase their dreams! That's what peace helps us achieve. This big peace team, whether countries join or not, reminds us that talking and trying to be friends is always a good idea.</p>\n\n<h3>Working Together is Important</h3>\n<p>So, what can we learn from this big idea? We learn that working together is super important. Whether it's playing with your friends, helping your family, or countries talking to each other, sharing ideas and being kind makes everything better.</p>\n<p>Even if not all countries join the same team, just the idea of trying to make peace is a wonderful step. Every little bit of kindness and friendship helps our world become a happier, more peaceful place.</p>\n\n<h3>Let's Keep Dreaming of Peace!</h3>\n<p>So, let's keep hoping for a world where all countries are friends, and all children can live in peace. Let's remember to be kind to each other every day, just like countries are trying to be kind to each other. Together, we can make our world a truly peaceful home for everyone!</p>",
    "summary": "A big leader had an idea for a special peace team where countries could work together, and while some countries said yes to joining, others needed more time or had different ideas about how to achieve peace.",
    "whyMatters": "It's important because when countries talk and work together for peace, everyone, especially children, can live safely, go to school, and play without worries, helping to make the world a happier place for all.",
    "category": "world",
    "date": "2026-01-21T16:38:57.242Z",
    "image": "https://image.pollinations.ai/prompt/Let's%20Talk%20About%20a%20Big%20Peace%20Team!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "lets-talk-about-a-big-peace-team",
    "originalLink": "https://www.aljazeera.com/news/2026/1/21/trumps-board-of-peace-who-has-joined-who-hasnt-and-why?traffic_source=rss"
  },
  {
    "originalTitle": "Could US Congress stop Trump from taking over Greenland?",
    "title": "Could US Congress stop Trump from taking over Greenland?",
    "content": "Some of the president's fellow Republicans oppose him - but it's not clear if they would join Democrats to block a takeover of the island.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-21T16:39:02.969Z",
    "image": "https://image.pollinations.ai/prompt/Could%20US%20Congress%20stop%20Trump%20from%20taking%20over%20Greenland%3F%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "could-us-congress-stop-trump-from-taking-over-greenland",
    "originalLink": "https://www.bbc.com/news/articles/c701rvrpjwko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Israeli PM Netanyahu agrees to join Trump's Board of Peace",
    "title": "Israeli PM Netanyahu agrees to join Trump's Board of Peace",
    "content": "Israel is the latest country to publicly accept an invitation to Trump's new organisation, joining Albania, Bahran, Hungary, Morocco and the UAE.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:39:08.090Z",
    "image": "https://image.pollinations.ai/prompt/Israeli%20PM%20Netanyahu%20agrees%20to%20join%20Trump's%20Board%20of%20Peace%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "israeli-pm-netanyahu-agrees-to-join-trumps-board-of-peace",
    "originalLink": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
    "title": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
    "content": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:39:13.224Z",
    "image": "https://image.pollinations.ai/prompt/Photos%20leaked%20to%20BBC%20show%20faces%20of%20hundreds%20killed%20in%20Iran's%20brutal%20protest%20crackdown%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "photos-leaked-to-bbc-show-faces-of-hundreds-killed-in-irans-brutal-protest-crackdown",
    "originalLink": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Palace striker Mateta tells club he wants to leave",
    "title": "Palace striker Mateta tells club he wants to leave",
    "content": "France striker Jean-Philippe Mateta has 18 months remaining on his current deal at Selhurst Park and as things stand he will not be signing an extension.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "technology",
    "date": "2026-01-21T16:39:18.510Z",
    "image": "https://image.pollinations.ai/prompt/Palace%20striker%20Mateta%20tells%20club%20he%20wants%20to%20leave%20realistic%20news%20photography%20context%20Technology%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "palace-striker-mateta-tells-club-he-wants-to-leave",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62wn91w5geo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Women's Club World Cup schedule could be 'catastrophic' for WSL",
    "title": "Women's Club World Cup schedule could be 'catastrophic' for WSL",
    "content": "English players and officials are shocked by the current scheduling for the inaugural Women's Club World Cup because of the impact it could have on the WSL.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:39:23.631Z",
    "image": "https://image.pollinations.ai/prompt/Women's%20Club%20World%20Cup%20schedule%20could%20be%20'catastrophic'%20for%20WSL%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "womens-club-world-cup-schedule-could-be-catastrophic-for-wsl",
    "originalLink": "https://www.bbc.com/sport/football/articles/czx1p5pvnxro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Spurs, Arsenal or Newcastle - which teams have had most injuries?",
    "title": "Spurs, Arsenal or Newcastle - which teams have had most injuries?",
    "content": "BBC Sport crunches the numbers to assess which Premier League teams have been hit hardest by injuries this season.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-21T16:39:28.749Z",
    "image": "https://image.pollinations.ai/prompt/Spurs%2C%20Arsenal%20or%20Newcastle%20-%20which%20teams%20have%20had%20most%20injuries%3F%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "spurs-arsenal-or-newcastle-which-teams-have-had-most-injuries",
    "originalLink": "https://www.bbc.com/sport/football/articles/c70l9y3p893o?at_medium=RSS&at_campaign=rss"
  }
]