[
  {
    "originalTitle": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
    "title": "A President's Son in Uganda Has Big Dreams!",
    "content": "<h3>Hello from Africa!</h3>\nHi, my super awesome friends! It's me, your kid-friendly news reporter, here to tell you something interesting happening in our wonderful continent of Africa. Are you ready for a story? Let's go! Today, we're going to fly over to a special country and learn about a person who has big dreams. It's going to be fun! We'll talk about leaders, dreams, and even how people share their thoughts on the internet. Get ready to learn and imagine!\n\n<h3>Meet Uganda!</h3>\nOur story takes us to a beautiful country in Africa called Uganda. Can you say Uganda? It's a landlocked country, which means it doesn't have a coast on the big ocean. But it has lots of other amazing things! Uganda is famous for its green hills, big lakes, and super friendly people. It's home to amazing animals too, like mountain gorillas, elephants, and hippos! Imagine seeing all those wonderful creatures!\nDid you know? Uganda is sometimes called the \"Pearl of Africa\" because it is so beautiful and has so much natural wonder! Lake Victoria, the biggest lake in Africa, is partly in Uganda. It's bigger than many countries!\n\n<h3>What Does a President Do?</h3>\nIn every country, there's a very important person called the President. The President is like the main leader, the head of the whole country. They have a very big job! They help make sure everyone is safe, that there are schools for children like you, and that there are hospitals when people get sick. They also help their country work well with other countries. It's a bit like being the captain of a very big team, where the team is the whole country! They work very hard every day to make things better for everyone living there.\nDid you know? Presidents are usually chosen by the people of the country. People vote to pick who they think will be the best leader. It's a very important choice!\n\n<h3>A President's Son with Big Dreams</h3>\nNow, in Uganda, the country has a President. And this President has a son. His name is Muhoozi. Muhoozi grew up seeing his dad do this very important job every day. Imagine your mom or dad having a super important job like that! Sometimes, when children see what their parents do, they start to have dreams of doing something similar when they grow up. Muhoozi has some very big dreams too. He dreams of becoming a leader in his country, just like his father. He wants to help his country and its people.\nDid you know? Many children look up to their parents and want to follow in their footsteps, whether it's being a teacher, a doctor, or even a leader! It's a natural way we learn about jobs.\n\n<h3>Sharing Ideas Online</h3>\nNow, Muhoozi likes to share his thoughts and ideas with the world. He does this on a special place on the internet called 'X'. You might know it by its old name, 'Twitter'. It's like a big worldwide playground where people can write short messages and share pictures or videos with many, many other people at the same time. You can type something on your phone or computer, and suddenly, people all over the world can read what you wrote! Muhoozi uses X to talk about his country, his dreams, and sometimes he says very surprising things!\nDid you know? The internet is like a giant library and a giant post office all rolled into one! You can find information and send messages to people far away, super fast! But remember, it's always good to be kind and thoughtful when you share things online.\n\n<h3>Talking About Special Things</h3>\nSometimes, when Muhoozi shares his ideas on X, he says things that make people talk a lot. He might say things that are very strong or unexpected. For example, he has said some very special things about himself and his future. It’s like when you have a big secret dream, and you share it, and everyone goes, \"Wow!\" He once said some things that made people wonder if he thinks he has a very special destiny, almost like someone from a storybook. People have different ideas about what he means, but he definitely gets everyone's attention when he writes!\nDid you know? People communicate in many ways! We use our voices, our hands to write, and now we use the internet to share our thoughts quickly. Sometimes, when people say big or unusual things, it makes everyone pay attention and talk about it.\n\n<h3>What Does it Mean to Be a Leader?</h3>\nBeing a leader, whether it's a president or a captain of a sports team, means a lot of things. It means being responsible, listening to people, and trying to make good choices for everyone. Good leaders try to unite people and help them work together. It's not just about having big dreams, but also about working very hard to make those dreams come true in a way that helps many people. It means being strong but also kind, and always thinking about what is best for the community.\nDid you know? Leaders are not just presidents! Your teacher is a leader in your classroom, guiding you to learn. Your parents are leaders in your family, helping you grow up strong and happy! Everyone can be a leader in some way, by setting a good example.\n\n<h3>Why Dreams Are Important</h3>\nMuhoozi has big dreams of leadership. And it's good to have dreams! Dreams help us imagine a future and give us something to work towards. Whether you dream of becoming a doctor, an artist, a pilot, or even a president, having a dream is the first step. It shows you what you care about and what you want to achieve. It takes a lot of hard work, learning, and kindness to reach big dreams, especially when those dreams involve helping many people in a whole country. So, keep dreaming big, my friends! Who knows what amazing things you will do one day?\nDid you know? Many famous leaders throughout history started with a big dream! They worked hard, learned from their mistakes, and never gave up on trying to make the world a better place.",
    "summary": "A President's son in Uganda uses the internet to share his big dreams of becoming a leader like his dad, sometimes saying surprising things that get everyone talking.",
    "whyMatters": "It matters because everyone has dreams, and learning about leaders and how people share ideas helps us understand the world around us and how important it is to be thoughtful when we communicate.",
    "category": "politics",
    "date": "2026-01-31T12:36:48.815Z",
    "image": "https://image.pollinations.ai/prompt/A%20President's%20Son%20in%20Uganda%20Has%20Big%20Dreams!%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-presidents-son-in-uganda-has-big-dreams",
    "originalLink": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Mali lawmaker jailed in Ivory Coast for insulting president",
    "title": "A Story About Words and Rules: Mali Man in Trouble in Ivory Coast",
    "content": "<h3>Hello Friends, Your Africa News Reporter is Here!</h3>\nHello, my super curious friends! I'm your friendly news reporter for Africa, ready to share an interesting story with you today. We're going to talk about something that happened between two countries that are neighbors. It's like when kids from two different schools have something happen between them. Let's find out what happened!\n\n<h3>What Happened?</h3>\nImagine a man named Mr. Mamadou Hawa Gassama. He is from a country called Mali. He was visiting another country, Ivory Coast. While he was there, he said some things that were not very nice about their leader, President Alassane Ouattara. Saying mean things about a leader is a very serious matter in many places.\n\nBecause of what he said, Mr. Gassama has been put in jail in Ivory Coast. This means he is in a special place where people go if they break important rules or laws. It is a big lesson about how important it is to use our words wisely.\n\n<h3>Who Are the Important People?</h3>\nFirst, let's meet Mr. Mamadou Hawa Gassama. He is a special person in Mali called a \"lawmaker.\" What's a lawmaker? It's like someone who helps make rules for a country. Think of it like a big brother or sister who helps make rules for your house, but for a whole country! He works for the people of Mali to help them live well.\n\nThen there's President Alassane Ouattara. He is the leader of Ivory Coast. He is like the head teacher of a very big school, but for a whole country! His big job is to help his country and all its people. He has to make many important decisions every day.\n\n<h3>What Are Mali and Ivory Coast?</h3>\nMali and Ivory Coast are two beautiful countries in Africa. They are neighbors, which means they are right next to each other on the map. Imagine two houses next door to each other; that's how these countries are!\n\nMali is a very big country, and it's famous for its rich history and amazing music. It has lots of sand and deserts in some parts, and a big river called the Niger River flows through it. People in Mali are very proud of their ancient cities and traditions.\n\nIvory Coast is known for its beautiful beaches and for growing lots of cocoa beans. Cocoa beans are what we use to make yummy chocolate! Many families in Ivory Coast work very hard growing these beans. Their capital city is Yamoussoukro, and it has a very big church.\n\n**Did you know?** Ivory Coast is the world's biggest producer of cocoa! So, next time you eat chocolate, you might be tasting something from Ivory Coast! Yum!\n\n<h3>Why Did This Happen? The Power of Words</h3>\nSo, what exactly did Mr. Gassama say? Prosecutors, who are like special lawyers who work for the government, said he called President Ouattara some names. He called him a \"tyrant\" and \"an enemy of Mali.\" These are very strong words.\n\nLet's think about what those words mean. Calling someone a \"tyrant\" means you think they are a very bossy leader who doesn't listen to anyone. It means you think they are not fair and only do what they want. That's not a nice thing to say about a leader.\n\nCalling someone \"an enemy\" means you think they are against your country. It suggests they want to hurt your country, which can make people very upset. These are very strong and not-nice words to say about any leader, especially when you are a guest in their country.\n\nImagine if you said very mean things about your head teacher or a leader in your community. People might get very upset, right? It's the same in countries. Words have great power, and sometimes they can cause big problems.\n\n<h3>What Happens Next? Jail and Rules</h3>\nBecause Mr. Gassama said these things, he was put in jail. Jail is a place where people go if they break important rules or laws. It's like being sent to your room for a very long time if you do something very wrong, but much more serious and often for much longer.\n\nCountries have laws about what you can say, especially about their leaders. These laws are there to keep peace and order. They help make sure everyone feels safe and respected. If people could just say anything they wanted, it might cause fights and unhappiness.\n\nWhen you are a guest in someone else's house or country, it's important to be respectful. It's like when you visit your auntie's house; you follow her rules, right? You try to be polite and thankful. Being a guest means you have to be extra careful with your words and actions.\n\n**Did you know?** In many countries, there are laws that protect leaders from people saying things that might cause big trouble or unrest. These laws are often called \"defamation\" laws.\n\n<h3>Why Is This Important for Us?</h3>\nThis story might seem far away, but it teaches us something very important about words. Words are very, very powerful! They can build people up or pull them down. They can make friends or start arguments.\n\nWe learn in school to use kind words, right? And to think before we speak. When we say things, especially about people who lead, our words can have big effects. Sometimes, they can make people sad or even angry.\n\nIt's important to be able to say what you think, but it's also important to be respectful. There's a big difference between politely disagreeing with someone and saying very hurtful things. We can have different ideas without being mean.\n\nThis situation reminds us that what we say can have consequences. Sometimes, those consequences can be very serious, like going to jail. It also shows us that different countries have different rules about what you can say. What might be okay in one place might not be okay in another.\n\n**Did you know?** Every country has its own special rules, called laws! These laws help everyone live together safely and happily, just like the rules in your classroom help everyone learn and play together.\n\n<h3>Let's Learn More About Africa!</h3>\nEven though this story is a bit serious, let's remember the wonderful things about Mali and Ivory Coast and all of Africa! Africa is a continent full of amazing people, beautiful animals, and diverse cultures.\n\nIn Mali, people love to tell stories and play beautiful music with instruments like the kora, which is a bit like a harp. Their ancient city of Timbuktu was once a very famous place for learning and trading. They also have wonderful traditional clothes!\n\nIn Ivory Coast, you can find elephants and monkeys in their beautiful forests. They also have lovely markets with colorful crafts and delicious foods. The people are known for their hospitality, which means being very welcoming to guests.\n\nThis story is just one small part of life in these big, important countries. It reminds us to always be kind and thoughtful in our words, no matter where we are or who we are talking about. Being a good citizen means understanding and respecting the rules, even when you are a visitor.\n\n<h3>Goodbye!</h3>\nThat's all for our news story today, my friends! I hope you learned something new and interesting. Remember to use your words wisely and always be kind. See you next time with more news from our amazing continent, Africa! Stay curious!",
    "summary": "A man from Mali who helps make rules for his country said not-nice things about the leader of Ivory Coast, his neighboring country, and because of this, he is now in jail in Ivory Coast.",
    "whyMatters": "This story is important because it teaches us that words are powerful, and saying very mean things about leaders, especially in another country, can have serious consequences like going to jail, reminding us to always be thoughtful and respectful with our words.",
    "category": "politics",
    "date": "2026-01-31T12:37:11.001Z",
    "image": "https://image.pollinations.ai/prompt/A%20Story%20About%20Words%20and%20Rules%3A%20Mali%20Man%20in%20Trouble%20in%20Ivory%20Coast%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "a-story-about-words-and-rules-mali-man-in-trouble-in-ivory-coast",
    "originalLink": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "South Africa and Israel expel each other's envoys in diplomatic row",
    "title": "South Africa and Israel expel each other's envoys in diplomatic row",
    "content": "South Africa accuses the Israeli envoy of insulting President Ramaphosa. Israel says the expulsion is \"baseless\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "politics",
    "date": "2026-01-31T12:37:16.129Z",
    "image": "https://image.pollinations.ai/prompt/South%20Africa%20and%20Israel%20expel%20each%20other's%20envoys%20in%20diplomatic%20row%20realistic%20news%20photography%20context%20Politics%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "south-africa-and-israel-expel-each-others-envoys-in-diplomatic-row",
    "originalLink": "https://www.bbc.com/news/articles/cvgn8ejljqwo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Rybakina shocks Sabalenka to win Australian Open tennis final",
    "title": "Elena Rybakina: Our New Tennis Champion!",
    "content": "<h3>Hello, Super Friends!</h3>\nHello, my amazing friends! It's your friendly news reporter from Africa, ready to share some super exciting news from far, far away! Imagine a huge stadium, filled with cheering people, where two fantastic athletes are running and hitting a yellow ball with rackets. This is the wonderful world of tennis! And guess what? A super strong and kind player named Elena Rybakina just won a very, very special tennis game. It was in a sunny country called Australia, and it was a really big deal!\n\n<h3>What is Tennis, Anyway?</h3>\nHave you ever seen a tennis game? It's a lot of fun! Two people, or sometimes two teams of two people, stand on a special court. This court is like a big rectangle on the ground. They use a racket, which looks like a big paddle with strings, to hit a fuzzy yellow ball over a net in the middle. The big goal is to hit the ball so well that the other player can't hit it back. When that happens, you get a point! It's like playing 'catch' but with rackets and a net, and you have to be super quick!\n\nDid you know? A tennis match can sometimes last for many hours! Players have to be very fit and strong!\n\n<h3>The Big Game in Australia</h3>\nThis super big game was called the Australian Open. It's one of the four most important tennis tournaments in the entire world! Imagine all the best tennis players from different countries coming together in one place to play. They travel all the way to Australia, which is a country known for its unique animals like kangaroos and koalas! The tournament happens every year when it's summer there, so the sun shines brightly, and it's super warm. Everyone dreams of winning the shiny, beautiful trophy at the end!\n\nDid you know? The Australian Open courts are a special blue color, which helps people see the yellow ball better on TV!\n\n<h3>Meet the Players: Elena and Aryna</h3>\nIn the very last game, the big final, Elena Rybakina played against another truly amazing player named Aryna Sabalenka. Aryna is also super strong and plays tennis incredibly well. Before this match, many people thought Aryna was the best player in the whole wide world, which is why they called her 'world number one'! Both Elena and Aryna worked so hard for many years, training every single day, to reach this very special moment.\n\nDid you know? Tennis players often travel to many different countries around the world to play in tournaments! It's like a big adventure!\n\n<h3>How the Game Was Played</h3>\nThe game was incredibly exciting! Elena and Aryna hit the ball with all their strength and skill. *Thwack! Whizz!* The ball flew back and forth over the net. They ran so fast across the court, trying to get to every ball. Sometimes they had to jump high to hit it! It was a very, very close game, like a friendly race where both runners are almost equal.\n\nBoth players showed great sportsmanship, which means they were kind, respectful, and fair to each other, even when they both wanted to win so much. They shook hands at the end, showing true friendship through sport!\n\nDid you know? Players often wear special tennis shoes that help them stop and start quickly on the court!\n\n<h3>Elena's Big Win!</h3>\nAfter playing for a long, long time, showing great courage and determination, Elena Rybakina won the championship! When the last point was played, everyone in the stadium cheered very, very loudly for her. She had a big smile and looked so happy! She showed everyone that if you work incredibly hard, if you practice every day, and if you truly believe in yourself, you can achieve amazing and wonderful things.\n\nShe lifted the beautiful trophy high up, and it shined brightly! It was a moment she will never forget, and neither will her fans.\n\nDid you know? The trophy for winning the Australian Open is called the Daphne Akhurst Memorial Cup for women! It's very old and special.\n\n<h3>What Does This Mean for Elena and You?</h3>\nWinning this huge game means Elena is now one of the very best tennis players in the whole wide world. It proves how much she loves tennis and how much effort she puts in every day. Her victory inspires many young boys and girls, maybe even you, to pick up a racket, try a new sport, and dream big! She shows us that with dedication, anything is possible, even if you are from a small town or a far-off country.\n\nDid you know? Some of the best tennis players from Africa, like Kevin Anderson from South Africa, have also played in Grand Slam finals! They make us proud!\n\n<h3>Dreams Come True</h3>\nElena's story is a wonderful reminder that no matter where you are from, or how small you start, big dreams can absolutely come true. Elena started just like any kid, learning to hit a ball in her hometown. Now, she is a world champion! What big dreams do you have? Maybe you want to be a great athlete, or a super scientist, or an amazing artist! Remember Elena's hard work and never give up on your dreams!\n\nDid you know? Many children in Africa love playing sports like football, netball, and running, and some also play tennis! It's great to be active!\n\n<h3>Let's Celebrate!</h3>\nSo, let's all give a super big cheer for Elena Rybakina! She is a wonderful example for all of us. Keep dreaming big, keep working hard at what you love, and maybe one day, we'll be cheering for you in a big game or for your big achievement too! That's all the exciting news from your friendly African news reporter for today. Stay happy, keep playing, and never stop dreaming!",
    "summary": "Elena Rybakina, a super strong tennis player, worked very hard and won a very big game called the Australian Open in Australia, becoming a champion!",
    "whyMatters": "This is important because Elena's win shows all kids that if you work hard, practice, and believe in yourself, you can achieve your biggest dreams, just like she did in tennis!",
    "category": "world",
    "date": "2026-01-31T12:37:42.722Z",
    "image": "https://image.pollinations.ai/prompt/Elena%20Rybakina%3A%20Our%20New%20Tennis%20Champion!%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "elena-rybakina-our-new-tennis-champion",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/31/rybakina-shocks-sabalenka-to-win-australian-open-tennis-final?traffic_source=rss"
  },
  {
    "originalTitle": "President Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy",
    "title": "President Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy",
    "content": "Cuba's leader says US president's threat to impose tariffs on countries providing oil is 'fascist, criminal, genocidal'.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:37:47.854Z",
    "image": "https://image.pollinations.ai/prompt/President%20Diaz-Canel%20slams%20Trump%E2%80%99s%20bid%20to%20%E2%80%98suffocate%E2%80%99%20Cuba%E2%80%99s%20economy%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "president-diaz-canel-slams-trumps-bid-to-suffocate-cubas-economy",
    "originalLink": "https://www.aljazeera.com/news/2026/1/31/president-diaz-canel-slams-trumps-bid-to-suffocate-cuba-economy?traffic_source=rss"
  },
  {
    "originalTitle": "Djokovic vs Alcaraz – Australian Open final: Start time, head-to-head",
    "title": "Djokovic vs Alcaraz – Australian Open final: Start time, head-to-head",
    "content": "The veteran icon faces the young champion as their inter-generational tennis rivalry sets up a blockbuster showdown.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:37:52.967Z",
    "image": "https://image.pollinations.ai/prompt/Djokovic%20vs%20Alcaraz%20%E2%80%93%20Australian%20Open%20final%3A%20Start%20time%2C%20head-to-head%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "djokovic-vs-alcaraz-australian-open-final-start-time-head-to-head",
    "originalLink": "https://www.aljazeera.com/sports/2026/1/31/djokovic-vs-alcaraz-australian-open-final-start-time-head-to-head?traffic_source=rss"
  },
  {
    "originalTitle": "Takeaways from the millions of newly released Epstein files ",
    "title": "Takeaways from the millions of newly released Epstein files ",
    "content": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:37:58.523Z",
    "image": "https://image.pollinations.ai/prompt/Takeaways%20from%20the%20millions%20of%20newly%20released%20Epstein%20files%20%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "takeaways-from-the-millions-of-newly-released-epstein-files",
    "originalLink": "https://www.bbc.com/news/articles/cevnmxyy4wjo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Pedro Pascal and Meryl Streep lead tributes to Catherine O'Hara",
    "title": "Pedro Pascal and Meryl Streep lead tributes to Catherine O'Hara",
    "content": "The Canadian comedic actress died in Los Angeles on Friday at the age of 71 following a brief illness.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:38:03.642Z",
    "image": "https://image.pollinations.ai/prompt/Pedro%20Pascal%20and%20Meryl%20Streep%20lead%20tributes%20to%20Catherine%20O'Hara%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "pedro-pascal-and-meryl-streep-lead-tributes-to-catherine-ohara",
    "originalLink": "https://www.bbc.com/news/articles/czejk8pnk82o?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "What we learned - and didn't - from the Melania documentary",
    "title": "What we learned - and didn't - from the Melania documentary",
    "content": "Melania, directed by Brett Ratner, provides a fleeting glimpse into the life of the enigmatic first lady.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:38:08.758Z",
    "image": "https://image.pollinations.ai/prompt/What%20we%20learned%20-%20and%20didn't%20-%20from%20the%20Melania%20documentary%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "what-we-learned-and-didnt-from-the-melania-documentary",
    "originalLink": "https://www.bbc.com/news/articles/cwy1ed1vgxro?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Football Focus",
    "title": "Football Focus",
    "content": "Focusing on Leeds v Arsenal, Spurs v Manchester City, and an interview with Florian Wirtz.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-31T12:38:14.831Z",
    "image": "https://image.pollinations.ai/prompt/Football%20Focus%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "football-focus",
    "originalLink": "https://www.bbc.co.uk/iplayer/live/bbcone?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "I never stopped believing - Calvert-Lewin ",
    "title": "I never stopped believing - Calvert-Lewin ",
    "content": "Leeds striker Dominic Calvert-Lewin sits down with BBC Sport's Betty Glover to talk about his return to goalscoring form, being a free agent and his England chances.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "sports",
    "date": "2026-01-31T12:38:19.947Z",
    "image": "https://image.pollinations.ai/prompt/I%20never%20stopped%20believing%20-%20Calvert-Lewin%20%20realistic%20news%20photography%20context%20Sports%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "i-never-stopped-believing-calvert-lewin",
    "originalLink": "https://www.bbc.com/sport/football/articles/c62n1n9x95vo?at_medium=RSS&at_campaign=rss"
  },
  {
    "originalTitle": "Nine siblings and a dog called Zoomer - Wirtz in his own words",
    "title": "Nine siblings and a dog called Zoomer - Wirtz in his own words",
    "content": "Florian Wirtz sits down with Kelly Somers to talk about his slow start at Anfield, playing padel and making Bundesliga history.",
    "summary": "Error rewriting content.",
    "whyMatters": "Unknown",
    "category": "world",
    "date": "2026-01-31T12:38:25.066Z",
    "image": "https://image.pollinations.ai/prompt/Nine%20siblings%20and%20a%20dog%20called%20Zoomer%20-%20Wirtz%20in%20his%20own%20words%20realistic%20news%20photography%20context%20World%20News%20high%20quality?width=800&height=400&nologo=true",
    "urlSlug": "nine-siblings-and-a-dog-called-zoomer-wirtz-in-his-own-words",
    "originalLink": "https://www.bbc.com/sport/football/articles/c98prz4296vo?at_medium=RSS&at_campaign=rss"
  }
]